; ModuleID = './build/i2c_control_EEPROM_with_dma.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_i2c_context_t = type { [2 x %struct.hal_i2c_current_user_t], [2 x %struct.hal_i2c_inner_config_t] }
%struct.hal_i2c_current_user_t = type { i8, i8, i32 }
%struct.hal_i2c_inner_config_t = type { i8, %struct.hal_i2c_config_t, i8, void (i8, i32, i8*)*, i8* }
%struct.hal_i2c_config_t = type { i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.DMA_INPUT = type { i32, i32, i32, i8*, void ()* }
%struct.DMA_FULLSIZE_HWMENU = type { %struct.DMA_TMODE, i32, i32, i32 }
%struct.DMA_TMODE = type { i8, i8 }
%struct.DMA_HWMENU = type { %struct.DMA_TMODE, i32, i32 }
%struct.DMA_SWCOPYMENU = type { i32, i32 }
%struct.DMA_FULLSIZE_HWRINGBUFF_MENU = type { %struct.DMA_TMODE, i32, i32, i32, i8*, i8* }
%struct.DMA_HWRINGBUFF_MENU = type { %struct.DMA_TMODE, i32, i32, i8*, i8* }

!38 = !DIEnumerator(name: "DMA_SWCOPY", value: 2)
!39 = !DIEnumerator(name: "DMA_HWTX_RINGBUFF", value: 3)
!40 = !DIEnumerator(name: "DMA_HWRX_RINGBUFF", value: 4)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 110, baseType: !7, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DMA_BYTE", value: 0)
!44 = !DIEnumerator(name: "DMA_SHORT", value: 1)
!45 = !DIEnumerator(name: "DMA_LONG", value: 2)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 121, baseType: !7, size: 32, elements: !48)
!47 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!50 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !52, line: 47, baseType: !53, size: 32, elements: !54)
!52 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!55 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!56 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!57 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!58 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!59 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!60 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!61 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!62 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!63 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!64 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!65 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!66 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!67 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!68 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!69 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!70 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!71 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!72 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!73 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!74 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!75 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!76 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!77 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!78 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!79 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!80 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!81 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!82 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!83 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!84 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!85 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!86 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!87 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!88 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!89 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!90 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!91 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!92 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!93 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!94 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!95 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!96 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 129, baseType: !7, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!99 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!100 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!101 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!102 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!103 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!104 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!105 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!106 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!107 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!108 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!109 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!110 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!111 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!112 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!113 = !{!114, !115, !117, !139, !146, !152, !163, !172, !161, !173, !174}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !47, line: 116, baseType: !7)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWMENU", file: !6, line: 174, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 128, elements: !120)
!120 = !{!121, !133, !135, !138}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !119, file: !6, line: 170, baseType: !122, size: 16)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_TMODE", file: !6, line: 127, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 124, size: 16, elements: !124)
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "burst_mode", scope: !123, file: !6, line: 125, baseType: !126, size: 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !123, file: !6, line: 126, baseType: !128, size: 8, offset: 8)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !129, line: 24, baseType: !130)
!129 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !131, line: 43, baseType: !132)
!131 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !119, file: !6, line: 171, baseType: !134, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_Master", file: !6, line: 108, baseType: !5)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !119, file: !6, line: 172, baseType: !136, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !129, line: 48, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !131, line: 79, baseType: !7)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !119, file: !6, line: 173, baseType: !136, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWMENU", file: !6, line: 158, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 154, size: 96, elements: !142)
!142 = !{!143, !144, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !141, file: !6, line: 155, baseType: !122, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !141, file: !6, line: 156, baseType: !134, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !141, file: !6, line: 157, baseType: !136, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_SWCOPYMENU", file: !6, line: 179, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 176, size: 64, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "srcaddr", scope: !148, file: !6, line: 177, baseType: !136, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dstaddr", scope: !148, file: !6, line: 178, baseType: !136, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWRINGBUFF_MENU", file: !6, line: 167, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 160, size: 192, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !162}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !154, file: !6, line: 161, baseType: !122, size: 16)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !154, file: !6, line: 162, baseType: !134, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !154, file: !6, line: 163, baseType: !136, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !154, file: !6, line: 164, baseType: !136, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !154, file: !6, line: 165, baseType: !161, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !154, file: !6, line: 166, baseType: !161, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWRINGBUFF_MENU", file: !6, line: 152, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 146, size: 160, elements: !166)
!166 = !{!167, !168, !169, !170, !171}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !165, file: !6, line: 147, baseType: !122, size: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !165, file: !6, line: 148, baseType: !134, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !165, file: !6, line: 149, baseType: !136, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !165, file: !6, line: 150, baseType: !161, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !165, file: !6, line: 151, baseType: !161, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !52, line: 95, baseType: !51)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint8", file: !47, line: 108, baseType: !132)
!175 = !{!0, !176, !185, !187, !192, !194}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "DMA_VFIFO_LISR_FUNC", scope: !2, file: !3, line: 60, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 448, elements: !183)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !6, line: 197, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{null}
!183 = !{!184}
!184 = !DISubrange(count: 14)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "DMA_VFIFO_TO_LISR_FUNC", scope: !2, file: !3, line: 64, type: !178, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "DMA_Owner", scope: !2, file: !3, line: 71, type: !189, isLocal: false, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 352, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 11)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "DMA_Channel_Status", scope: !2, file: !3, line: 68, type: !114, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "DMA_used_channel", scope: !2, file: !3, line: 69, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 88, elements: !190)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 352, elements: !190)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !200, file: !201, line: 71, type: !218, isLocal: false, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !202, retainedTypes: !203, globals: !204, splitDebugInlining: false, nameTableKind: None)
!201 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!202 = !{!46, !51}
!203 = !{!115, !173}
!204 = !{!198, !205}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !200, file: !201, line: 67, type: !207, isLocal: true, isDefinition: true)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !208, line: 111, baseType: !209)
!208 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !208, line: 109, size: 96, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !209, file: !208, line: 110, baseType: !212, size: 96)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !208, line: 106, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !208, line: 102, size: 96, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !213, file: !208, line: 103, baseType: !180, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !213, file: !208, line: 104, baseType: !180, size: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !213, file: !208, line: 105, baseType: !180, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !47, line: 62, baseType: !7)
!220 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!221 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "gucI2C1TxGDMAIdx", scope: !224, file: !225, line: 60, type: !245, isLocal: true, isDefinition: true)
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !225, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !226, retainedTypes: !240, globals: !242, splitDebugInlining: false, nameTableKind: None)
!225 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/i2c.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!226 = !{!227, !232, !5}
!227 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_HAL_RET_T", file: !228, line: 365, baseType: !132, size: 8, elements: !229)
!228 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687_cm4_hw_memmap.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!229 = !{!230, !231}
!230 = !DIEnumerator(name: "HAL_RET_SUCCESS", value: 0)
!231 = !DIEnumerator(name: "HAL_RET_FAIL", value: 1)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_I2C_CLK_T", file: !228, line: 385, baseType: !132, size: 8, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239}
!234 = !DIEnumerator(name: "I2C_CLK_50K", value: 0)
!235 = !DIEnumerator(name: "I2C_CLK_100K", value: 1)
!236 = !DIEnumerator(name: "I2C_CLK_200K", value: 2)
!237 = !DIEnumerator(name: "I2C_CLK_300K", value: 3)
!238 = !DIEnumerator(name: "I2C_CLK_400K", value: 4)
!239 = !DIEnumerator(name: "I2C_CLK_NUM", value: 5)
!240 = !{!219, !241}
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_I2C_CLK_T", file: !228, line: 392, baseType: !232)
!242 = !{!222, !243, !246, !248, !250, !252}
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "gucI2C2TxGDMAIdx", scope: !224, file: !225, line: 62, type: !245, isLocal: true, isDefinition: true)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !47, line: 59, baseType: !132)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "gucI2C1RxGDMAIdx", scope: !224, file: !225, line: 59, type: !245, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "gucI2C2RxGDMAIdx", scope: !224, file: !225, line: 61, type: !245, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "gucI2C1Enable", scope: !224, file: !225, line: 57, type: !245, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "gucI2C2Enable", scope: !224, file: !225, line: 58, type: !245, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!255 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !258, file: !259, line: 43, type: !136, isLocal: true, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !260, globals: !266, splitDebugInlining: false, nameTableKind: None)
!259 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!260 = !{!261, !219, !263, !265}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !136)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!266 = !{!256, !267}
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !258, file: !259, line: 44, type: !136, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !271, file: !272, line: 54, type: !136, isLocal: false, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !273, retainedTypes: !280, globals: !287, splitDebugInlining: false, nameTableKind: None)
!272 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!273 = !{!274, !97}
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !275, line: 71, baseType: !7, size: 32, elements: !276)
!275 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!276 = !{!277, !278, !279}
!277 = !DIEnumerator(name: "UART_PORT0", value: 0)
!278 = !DIEnumerator(name: "UART_PORT1", value: 1)
!279 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!280 = !{!261, !136, !281, !283, !245, !285, !219}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !47, line: 113, baseType: !284)
!284 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !245)
!287 = !{!269}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !290, file: !291, line: 53, type: !379, isLocal: false, isDefinition: true)
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !292, retainedTypes: !301, globals: !378, splitDebugInlining: false, nameTableKind: None)
!291 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!292 = !{!293, !51}
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !294, line: 152, baseType: !53, size: 32, elements: !295)
!294 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!295 = !{!296, !297, !298, !299, !300}
!296 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!297 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!298 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!299 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!300 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!301 = !{!302, !161, !136, !303, !305, !339}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !52, line: 97, baseType: !173)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !129, line: 44, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !131, line: 77, baseType: !53)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !307, line: 378, baseType: !308)
!307 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 363, size: 28704, elements: !309)
!309 = !{!310, !314, !318, !319, !320, !321, !322, !323, !324, !325, !329, !334, !338}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !308, file: !307, line: 365, baseType: !311, size: 256)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 256, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 8)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !308, file: !307, line: 366, baseType: !315, size: 768, offset: 256)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 768, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 24)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !308, file: !307, line: 367, baseType: !311, size: 256, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !308, file: !307, line: 368, baseType: !315, size: 768, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !308, file: !307, line: 369, baseType: !311, size: 256, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !308, file: !307, line: 370, baseType: !315, size: 768, offset: 2304)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !308, file: !307, line: 371, baseType: !311, size: 256, offset: 3072)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !308, file: !307, line: 372, baseType: !315, size: 768, offset: 3328)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !308, file: !307, line: 373, baseType: !311, size: 256, offset: 4096)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !308, file: !307, line: 374, baseType: !326, size: 1792, offset: 4352)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1792, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 56)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !308, file: !307, line: 375, baseType: !330, size: 1920, offset: 6144)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 1920, elements: !332)
!331 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !128)
!332 = !{!333}
!333 = !DISubrange(count: 240)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !308, file: !307, line: 376, baseType: !335, size: 20608, offset: 8064)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 20608, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 644)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !308, file: !307, line: 377, baseType: !264, size: 32, offset: 28672)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !307, line: 418, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 395, size: 1120, elements: !342)
!342 = !{!343, !345, !346, !347, !348, !349, !350, !354, !355, !356, !357, !358, !359, !360, !361, !365, !366, !367, !371, !375, !377}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !341, file: !307, line: 397, baseType: !344, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !341, file: !307, line: 398, baseType: !264, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !341, file: !307, line: 399, baseType: !264, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !341, file: !307, line: 400, baseType: !264, size: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !341, file: !307, line: 401, baseType: !264, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !341, file: !307, line: 402, baseType: !264, size: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !341, file: !307, line: 403, baseType: !351, size: 96, offset: 192)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 96, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 12)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !341, file: !307, line: 404, baseType: !264, size: 32, offset: 288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !341, file: !307, line: 405, baseType: !264, size: 32, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !341, file: !307, line: 406, baseType: !264, size: 32, offset: 352)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !341, file: !307, line: 407, baseType: !264, size: 32, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !341, file: !307, line: 408, baseType: !264, size: 32, offset: 416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !341, file: !307, line: 409, baseType: !264, size: 32, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !341, file: !307, line: 410, baseType: !264, size: 32, offset: 480)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !341, file: !307, line: 411, baseType: !362, size: 64, offset: 512)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 64, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 2)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !341, file: !307, line: 412, baseType: !344, size: 32, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !341, file: !307, line: 413, baseType: !344, size: 32, offset: 608)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !341, file: !307, line: 414, baseType: !368, size: 128, offset: 640)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 128, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 4)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !341, file: !307, line: 415, baseType: !372, size: 160, offset: 768)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 160, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 5)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !341, file: !307, line: 416, baseType: !376, size: 160, offset: 928)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 160, elements: !373)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !341, file: !307, line: 417, baseType: !264, size: 32, offset: 1088)
!378 = !{!288}
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 6144, elements: !388)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !291, line: 50, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !291, line: 47, size: 64, elements: !382)
!382 = !{!383, !387}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !381, file: !291, line: 48, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !302}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !381, file: !291, line: 49, baseType: !136, size: 32, offset: 32)
!388 = !{!389}
!389 = !DISubrange(count: 96)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "s_i2c_master_status", scope: !392, file: !393, line: 108, type: !467, isLocal: true, isDefinition: true)
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !394, retainedTypes: !428, globals: !433, splitDebugInlining: false, nameTableKind: None)
!393 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_i2c_master.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!394 = !{!395, !403, !409, !418, !51, !424}
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !396, line: 455, baseType: !53, size: 32, elements: !397)
!396 = !DIFile(filename: "../../../../../driver/chip/inc/hal_i2c_master.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!397 = !{!398, !399, !400, !401, !402}
!398 = !DIEnumerator(name: "HAL_I2C_STATUS_ERROR", value: -4)
!399 = !DIEnumerator(name: "HAL_I2C_STATUS_ERROR_BUSY", value: -3)
!400 = !DIEnumerator(name: "HAL_I2C_STATUS_INVALID_PORT_NUMBER", value: -2)
!401 = !DIEnumerator(name: "HAL_I2C_STATUS_INVALID_PARAMETER", value: -1)
!402 = !DIEnumerator(name: "HAL_I2C_STATUS_OK", value: 0)
!403 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 214, baseType: !7, size: 32, elements: !405)
!404 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!405 = !{!406, !407, !408}
!406 = !DIEnumerator(name: "HAL_I2C_MASTER_0", value: 0)
!407 = !DIEnumerator(name: "HAL_I2C_MASTER_1", value: 1)
!408 = !DIEnumerator(name: "HAL_I2C_MASTER_MAX", value: 2)
!409 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !396, line: 470, baseType: !7, size: 32, elements: !410)
!410 = !{!411, !412, !413, !414, !415, !416, !417}
!411 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_50K", value: 0)
!412 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_100K", value: 1)
!413 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_200K", value: 2)
!414 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_300K", value: 3)
!415 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_400K", value: 4)
!416 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_1M", value: 5)
!417 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_MAX", value: 6)
!418 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !396, line: 446, baseType: !53, size: 32, elements: !419)
!419 = !{!420, !421, !422, !423}
!420 = !DIEnumerator(name: "HAL_I2C_EVENT_ACK_ERROR", value: -3)
!421 = !DIEnumerator(name: "HAL_I2C_EVENT_NACK_ERROR", value: -2)
!422 = !DIEnumerator(name: "HAL_I2C_EVENT_TIMEOUT_ERROR", value: -1)
!423 = !DIEnumerator(name: "HAL_I2C_EVENT_SUCCESS", value: 0)
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !396, line: 464, baseType: !7, size: 32, elements: !425)
!425 = !{!426, !427}
!426 = !DIEnumerator(name: "HAL_I2C_STATUS_IDLE", value: 0)
!427 = !DIEnumerator(name: "HAL_I2C_STATUS_BUS_BUSY", value: 1)
!428 = !{!302, !173, !136, !429, !431, !432, !161, !128}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !129, line: 36, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !131, line: 57, baseType: !284)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2c_running_type_t", file: !396, line: 467, baseType: !424)
!433 = !{!434, !390}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "g_i2c_context", scope: !392, file: !393, line: 107, type: !436, isLocal: true, isDefinition: true)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2c_context_t", file: !393, line: 105, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 102, size: 448, elements: !438)
!438 = !{!439, !447}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "current_user", scope: !437, file: !393, line: 103, baseType: !440, size: 128)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 128, elements: !363)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2c_current_user_t", file: !393, line: 100, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 96, size: 64, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "slave_address", scope: !442, file: !393, line: 97, baseType: !128, size: 8)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "is_send", scope: !442, file: !393, line: 98, baseType: !126, size: 8, offset: 8)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !442, file: !393, line: 99, baseType: !136, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !437, file: !393, line: 104, baseType: !448, size: 320, offset: 128)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 320, elements: !363)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2c_inner_config_t", file: !393, line: 94, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 87, size: 160, elements: !451)
!451 = !{!452, !453, !459, !460, !466}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !450, file: !393, line: 88, baseType: !126, size: 8)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !450, file: !393, line: 89, baseType: !454, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2c_config_t", file: !396, line: 496, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 494, size: 32, elements: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !455, file: !396, line: 495, baseType: !458, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2c_frequency_t", file: !396, line: 478, baseType: !409)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !450, file: !393, line: 91, baseType: !126, size: 8, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !450, file: !393, line: 92, baseType: !461, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2c_callback_t", file: !396, line: 571, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !128, !465, !161}
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_i2c_callback_event_t", file: !396, line: 451, baseType: !418)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !450, file: !393, line: 93, baseType: !161, size: 32, offset: 128)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 16, elements: !363)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !470, file: !471, line: 61, type: !503, isLocal: true, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !472, retainedTypes: !501, globals: !502, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!472 = !{!473, !481, !488, !492, !497}
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !474, line: 387, baseType: !53, size: 32, elements: !475)
!474 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!475 = !{!476, !477, !478, !479, !480}
!476 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!477 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!478 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!479 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!480 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 657, baseType: !7, size: 32, elements: !482)
!482 = !{!483, !484, !485, !486, !487}
!483 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!484 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!485 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!486 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!487 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !474, line: 397, baseType: !7, size: 32, elements: !489)
!489 = !{!490, !491}
!490 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!491 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!492 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 666, baseType: !7, size: 32, elements: !493)
!493 = !{!494, !495, !496}
!494 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!495 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!496 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_BUS", value: 2)
!497 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !474, line: 380, baseType: !7, size: 32, elements: !498)
!498 = !{!499, !500}
!499 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!500 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!501 = !{!161, !136}
!502 = !{!468}
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 640, elements: !373)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !471, line: 55, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 51, size: 128, elements: !506)
!506 = !{!507, !509, !519}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !505, file: !471, line: 52, baseType: !508, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !474, line: 400, baseType: !488)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !505, file: !471, line: 53, baseType: !510, size: 64, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !471, line: 49, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 46, size: 64, elements: !512)
!512 = !{!513, !518}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !511, file: !471, line: 47, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !474, line: 371, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !161}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !511, file: !471, line: 48, baseType: !161, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !505, file: !471, line: 54, baseType: !126, size: 8, offset: 96)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !522, file: !523, line: 77, type: !587, isLocal: true, isDefinition: true)
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !524, retainedTypes: !574, globals: !576, splitDebugInlining: false, nameTableKind: None)
!523 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!524 = !{!525, !533, !538, !554, !560, !564, !274, !97, !569}
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 345, baseType: !53, size: 32, elements: !527)
!526 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!527 = !{!528, !529, !530, !531, !532}
!528 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!529 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!530 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!531 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!532 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 109, baseType: !7, size: 32, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!536 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!537 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 302, baseType: !7, size: 32, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!540 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!541 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!542 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!543 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!544 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!545 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!546 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!547 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!548 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!549 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!550 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!551 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!552 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!553 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!554 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 321, baseType: !7, size: 32, elements: !555)
!555 = !{!556, !557, !558, !559}
!556 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!557 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!558 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!559 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!560 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 330, baseType: !7, size: 32, elements: !561)
!561 = !{!562, !563}
!562 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!563 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!564 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 337, baseType: !7, size: 32, elements: !565)
!565 = !{!566, !567, !568}
!566 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!567 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!568 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!569 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 355, baseType: !53, size: 32, elements: !570)
!570 = !{!571, !572, !573}
!571 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!572 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!573 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!574 = !{!7, !161, !132, !575, !128}
!575 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!576 = !{!520, !577}
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "func_tbl", scope: !579, file: !523, line: 536, type: !585, isLocal: true, isDefinition: true)
!579 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !523, file: !523, line: 534, type: !580, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !522, retainedNodes: !583)
!580 = !DISubroutineType(types: !581)
!581 = !{!179, !582}
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !404, line: 113, baseType: !533)
!583 = !{!584}
!584 = !DILocalVariable(name: "uart_port", arg: 1, scope: !579, file: !523, line: 534, type: !582)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 64, elements: !363)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1024, elements: !363)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !523, line: 75, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 68, size: 512, elements: !590)
!590 = !{!591, !592, !604, !605, !616, !617}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !589, file: !523, line: 69, baseType: !126, size: 8)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !589, file: !523, line: 70, baseType: !593, size: 128, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !526, line: 378, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 373, size: 128, elements: !595)
!595 = !{!596, !598, !600, !602}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !594, file: !526, line: 374, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !526, line: 317, baseType: !538)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !594, file: !526, line: 375, baseType: !599, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !526, line: 326, baseType: !554)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !594, file: !526, line: 376, baseType: !601, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !526, line: 333, baseType: !560)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !594, file: !526, line: 377, baseType: !603, size: 32, offset: 96)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !526, line: 341, baseType: !564)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !589, file: !523, line: 71, baseType: !126, size: 8, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !589, file: !523, line: 72, baseType: !606, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !523, line: 66, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 63, size: 64, elements: !608)
!608 = !{!609, !615}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !607, file: !523, line: 64, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !526, line: 410, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !614, !161}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !526, line: 359, baseType: !569)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !607, file: !523, line: 65, baseType: !161, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !589, file: !523, line: 73, baseType: !126, size: 8, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !589, file: !523, line: 74, baseType: !618, size: 224, offset: 288)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !526, line: 390, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 382, size: 224, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !619, file: !526, line: 383, baseType: !431, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !619, file: !526, line: 384, baseType: !136, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !619, file: !526, line: 385, baseType: !136, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !619, file: !526, line: 386, baseType: !431, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !619, file: !526, line: 387, baseType: !136, size: 32, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !619, file: !526, line: 388, baseType: !136, size: 32, offset: 160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !619, file: !526, line: 389, baseType: !136, size: 32, offset: 192)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "test_length", scope: !630, file: !631, line: 52, type: !264, isLocal: false, isDefinition: true)
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !632, retainedTypes: !664, globals: !665, splitDebugInlining: false, nameTableKind: None)
!631 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!632 = !{!533, !538, !554, !560, !564, !633, !409, !403, !395, !418}
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 249, baseType: !7, size: 32, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!635 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!636 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!637 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!638 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!639 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!640 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!641 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!642 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!643 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!644 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!645 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!646 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!647 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!648 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!649 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!650 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!651 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!652 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!653 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!654 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!655 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!656 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!657 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!658 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!659 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!660 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!661 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!662 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!663 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!664 = !{!161}
!665 = !{!628, !666, !668, !673}
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "i2c_finish_flag", scope: !630, file: !631, line: 53, type: !264, isLocal: false, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "i2c_send_data", scope: !630, file: !631, line: 54, type: !670, isLocal: false, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 256, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 32)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "i2c_receive_data", scope: !630, file: !631, line: 57, type: !670, isLocal: false, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !677, file: !678, line: 59, type: !136, isLocal: false, isDefinition: true)
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !679, globals: !742, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!679 = !{!680, !688, !713}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !307, line: 656, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 650, size: 128, elements: !683)
!683 = !{!684, !685, !686, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !682, file: !307, line: 652, baseType: !264, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !682, file: !307, line: 653, baseType: !264, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !682, file: !307, line: 654, baseType: !264, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !682, file: !307, line: 655, baseType: !344, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !307, line: 418, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 395, size: 1120, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !690, file: !307, line: 397, baseType: !344, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !690, file: !307, line: 398, baseType: !264, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !690, file: !307, line: 399, baseType: !264, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !690, file: !307, line: 400, baseType: !264, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !690, file: !307, line: 401, baseType: !264, size: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !690, file: !307, line: 402, baseType: !264, size: 32, offset: 160)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !690, file: !307, line: 403, baseType: !351, size: 96, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !690, file: !307, line: 404, baseType: !264, size: 32, offset: 288)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !690, file: !307, line: 405, baseType: !264, size: 32, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !690, file: !307, line: 406, baseType: !264, size: 32, offset: 352)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !690, file: !307, line: 407, baseType: !264, size: 32, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !690, file: !307, line: 408, baseType: !264, size: 32, offset: 416)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !690, file: !307, line: 409, baseType: !264, size: 32, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !690, file: !307, line: 410, baseType: !264, size: 32, offset: 480)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !690, file: !307, line: 411, baseType: !362, size: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !690, file: !307, line: 412, baseType: !344, size: 32, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !690, file: !307, line: 413, baseType: !344, size: 32, offset: 608)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !690, file: !307, line: 414, baseType: !368, size: 128, offset: 640)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !690, file: !307, line: 415, baseType: !372, size: 160, offset: 768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !690, file: !307, line: 416, baseType: !376, size: 160, offset: 928)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !690, file: !307, line: 417, baseType: !264, size: 32, offset: 1088)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !715, line: 72, baseType: !716)
!715 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !715, line: 56, size: 525312, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !732, !733, !737, !741}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !716, file: !715, line: 57, baseType: !264, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !716, file: !715, line: 58, baseType: !264, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !716, file: !715, line: 59, baseType: !264, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !716, file: !715, line: 60, baseType: !264, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !716, file: !715, line: 61, baseType: !264, size: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !716, file: !715, line: 62, baseType: !264, size: 32, offset: 160)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !716, file: !715, line: 63, baseType: !264, size: 32, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !716, file: !715, line: 64, baseType: !264, size: 32, offset: 224)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !716, file: !715, line: 65, baseType: !264, size: 32, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !716, file: !715, line: 66, baseType: !264, size: 32, offset: 288)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !716, file: !715, line: 67, baseType: !729, size: 32, offset: 320)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 1)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !716, file: !715, line: 68, baseType: !264, size: 32, offset: 352)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !716, file: !715, line: 69, baseType: !734, size: 523904, offset: 384)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 523904, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 16372)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !716, file: !715, line: 70, baseType: !738, size: 512, offset: 524288)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 512, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 16)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !716, file: !715, line: 71, baseType: !738, size: 512, offset: 524800)
!742 = !{!675, !743}
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !677, file: !678, line: 61, type: !264, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "heap_end", scope: !747, file: !748, line: 66, type: !753, isLocal: true, isDefinition: true)
!747 = distinct !DISubprogram(name: "_sbrk_r", scope: !748, file: !748, line: 63, type: !749, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !943, retainedNodes: !947)
!748 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!749 = !DISubroutineType(types: !750)
!750 = !{!751, !754, !942}
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !752, line: 123, baseType: !753)
!752 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !756, line: 377, size: 1920, elements: !757)
!756 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!757 = !{!758, !759, !833, !834, !835, !836, !837, !838, !839, !842, !863, !867, !868, !869, !870, !880, !893, !894, !899, !916, !917, !924, !925, !941}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !755, file: !756, line: 381, baseType: !53, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !755, file: !756, line: 386, baseType: !760, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !756, line: 292, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !756, line: 186, size: 832, elements: !763)
!763 = !{!764, !766, !767, !768, !770, !771, !776, !777, !778, !779, !783, !789, !796, !800, !801, !802, !803, !807, !809, !810, !811, !813, !819, !832}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !762, file: !756, line: 187, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !762, file: !756, line: 188, baseType: !53, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !762, file: !756, line: 189, baseType: !53, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !762, file: !756, line: 190, baseType: !769, size: 16, offset: 96)
!769 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !762, file: !756, line: 191, baseType: !769, size: 16, offset: 112)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !762, file: !756, line: 192, baseType: !772, size: 64, offset: 128)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !756, line: 122, size: 64, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !772, file: !756, line: 123, baseType: !765, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !772, file: !756, line: 124, baseType: !53, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !762, file: !756, line: 193, baseType: !53, size: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !762, file: !756, line: 196, baseType: !754, size: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !762, file: !756, line: 200, baseType: !161, size: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !762, file: !756, line: 202, baseType: !780, size: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DISubroutineType(types: !782)
!782 = !{!53, !754, !161, !753, !53}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !762, file: !756, line: 204, baseType: !784, size: 32, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DISubroutineType(types: !786)
!786 = !{!53, !754, !161, !787, !53}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !762, file: !756, line: 207, baseType: !790, size: 32, offset: 352)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = !DISubroutineType(types: !792)
!792 = !{!793, !754, !161, !793, !53}
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !794, line: 116, baseType: !795)
!794 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!795 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !762, file: !756, line: 208, baseType: !797, size: 32, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DISubroutineType(types: !799)
!799 = !{!53, !754, !161}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !762, file: !756, line: 211, baseType: !772, size: 64, offset: 416)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !762, file: !756, line: 212, baseType: !765, size: 32, offset: 480)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !762, file: !756, line: 213, baseType: !53, size: 32, offset: 512)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !762, file: !756, line: 216, baseType: !804, size: 24, offset: 544)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 24, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 3)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !762, file: !756, line: 217, baseType: !808, size: 8, offset: 568)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8, elements: !730)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !762, file: !756, line: 220, baseType: !772, size: 64, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !762, file: !756, line: 223, baseType: !53, size: 32, offset: 640)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !762, file: !756, line: 224, baseType: !812, size: 32, offset: 672)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !794, line: 46, baseType: !795)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !762, file: !756, line: 231, baseType: !814, size: 32, offset: 704)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !756, line: 35, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !816, line: 34, baseType: !817)
!816 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !816, line: 33, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !762, file: !756, line: 233, baseType: !820, size: 64, offset: 736)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !794, line: 170, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !794, line: 162, size: 64, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !821, file: !794, line: 164, baseType: !53, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !821, file: !794, line: 169, baseType: !825, size: 32, offset: 32)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !821, file: !794, line: 165, size: 32, elements: !826)
!826 = !{!827, !830}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !825, file: !794, line: 167, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !829, line: 116, baseType: !53)
!829 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !825, file: !794, line: 168, baseType: !831, size: 32)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 32, elements: !369)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !762, file: !756, line: 234, baseType: !53, size: 32, offset: 800)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !755, file: !756, line: 386, baseType: !760, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !755, file: !756, line: 386, baseType: !760, size: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !755, file: !756, line: 388, baseType: !53, size: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !755, file: !756, line: 390, baseType: !753, size: 32, offset: 160)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !755, file: !756, line: 392, baseType: !53, size: 32, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !755, file: !756, line: 394, baseType: !53, size: 32, offset: 224)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !755, file: !756, line: 395, baseType: !840, size: 32, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !756, line: 45, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !755, file: !756, line: 397, baseType: !843, size: 32, offset: 288)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !756, line: 349, size: 128, elements: !845)
!845 = !{!846, !859, !860, !861}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !844, file: !756, line: 352, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !756, line: 52, size: 192, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !848, file: !756, line: 54, baseType: !847, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !848, file: !756, line: 55, baseType: !53, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !848, file: !756, line: 55, baseType: !53, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !848, file: !756, line: 55, baseType: !53, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !848, file: !756, line: 55, baseType: !53, size: 32, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !848, file: !756, line: 56, baseType: !856, size: 32, offset: 160)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !857, size: 32, elements: !730)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !756, line: 22, baseType: !858)
!858 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !844, file: !756, line: 353, baseType: !53, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !844, file: !756, line: 354, baseType: !847, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !844, file: !756, line: 355, baseType: !862, size: 32, offset: 96)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !755, file: !756, line: 399, baseType: !864, size: 32, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !754}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !755, file: !756, line: 401, baseType: !53, size: 32, offset: 352)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !755, file: !756, line: 404, baseType: !53, size: 32, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !755, file: !756, line: 405, baseType: !753, size: 32, offset: 416)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !755, file: !756, line: 407, baseType: !871, size: 32, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !756, line: 324, size: 192, elements: !873)
!873 = !{!874, !876, !877, !878}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !872, file: !756, line: 325, baseType: !875, size: 48)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 48, elements: !805)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !872, file: !756, line: 326, baseType: !875, size: 48, offset: 48)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !872, file: !756, line: 327, baseType: !284, size: 16, offset: 96)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !872, file: !756, line: 330, baseType: !879, size: 64, offset: 128)
!879 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !755, file: !756, line: 408, baseType: !881, size: 32, offset: 480)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !756, line: 60, size: 288, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !882, file: !756, line: 62, baseType: !53, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !882, file: !756, line: 63, baseType: !53, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !882, file: !756, line: 64, baseType: !53, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !882, file: !756, line: 65, baseType: !53, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !882, file: !756, line: 66, baseType: !53, size: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !882, file: !756, line: 67, baseType: !53, size: 32, offset: 160)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !882, file: !756, line: 68, baseType: !53, size: 32, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !882, file: !756, line: 69, baseType: !53, size: 32, offset: 224)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !882, file: !756, line: 70, baseType: !53, size: 32, offset: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !755, file: !756, line: 409, baseType: !753, size: 32, offset: 512)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !755, file: !756, line: 412, baseType: !895, size: 32, offset: 544)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !53}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !755, file: !756, line: 416, baseType: !900, size: 32, offset: 576)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !756, line: 90, size: 1120, elements: !902)
!902 = !{!903, !904, !905, !907}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !901, file: !756, line: 91, baseType: !900, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !901, file: !756, line: 92, baseType: !53, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !901, file: !756, line: 93, baseType: !906, size: 1024, offset: 64)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 1024, elements: !671)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !901, file: !756, line: 94, baseType: !908, size: 32, offset: 1088)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !756, line: 79, size: 2112, elements: !910)
!910 = !{!911, !913, !914, !915}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !909, file: !756, line: 80, baseType: !912, size: 1024)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1024, elements: !671)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !909, file: !756, line: 81, baseType: !912, size: 1024, offset: 1024)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !909, file: !756, line: 83, baseType: !857, size: 32, offset: 2048)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !909, file: !756, line: 86, baseType: !857, size: 32, offset: 2080)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !755, file: !756, line: 417, baseType: !901, size: 1120, offset: 608)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !755, file: !756, line: 420, baseType: !918, size: 96, offset: 1728)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !756, line: 296, size: 96, elements: !919)
!919 = !{!920, !922, !923}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !918, file: !756, line: 298, baseType: !921, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !918, file: !756, line: 299, baseType: !53, size: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !918, file: !756, line: 300, baseType: !760, size: 32, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !755, file: !756, line: 421, baseType: !760, size: 32, offset: 1824)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !755, file: !756, line: 422, baseType: !926, size: 32, offset: 1856)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !756, line: 359, size: 640, elements: !928)
!928 = !{!929, !930, !931, !932, !933, !935, !936, !937, !938, !939, !940}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !927, file: !756, line: 362, baseType: !753, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !927, file: !756, line: 363, baseType: !820, size: 64, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !927, file: !756, line: 364, baseType: !820, size: 64, offset: 96)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !927, file: !756, line: 365, baseType: !820, size: 64, offset: 160)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !927, file: !756, line: 366, baseType: !934, size: 64, offset: 224)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 64, elements: !312)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !927, file: !756, line: 367, baseType: !53, size: 32, offset: 288)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !927, file: !756, line: 368, baseType: !820, size: 64, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !927, file: !756, line: 369, baseType: !820, size: 64, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !927, file: !756, line: 370, baseType: !820, size: 64, offset: 448)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !927, file: !756, line: 371, baseType: !820, size: 64, offset: 512)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !927, file: !756, line: 372, baseType: !820, size: 64, offset: 576)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !755, file: !756, line: 423, baseType: !753, size: 32, offset: 1888)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !829, line: 46, baseType: !7)
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !945, globals: !946, splitDebugInlining: false, nameTableKind: None)
!944 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!945 = !{!753, !751}
!946 = !{!745}
!947 = !{!948, !949, !950, !951}
!948 = !DILocalVariable(name: "r", arg: 1, scope: !747, file: !748, line: 63, type: !754)
!949 = !DILocalVariable(name: "nbytes", arg: 2, scope: !747, file: !748, line: 63, type: !942)
!950 = !DILocalVariable(name: "prev_heap_end", scope: !747, file: !748, line: 67, type: !753)
!951 = !DILocalVariable(name: "stack", scope: !747, file: !748, line: 68, type: !753)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !954, file: !959, line: 4, type: !963, isLocal: false, isDefinition: true)
!954 = distinct !DICompileUnit(language: DW_LANG_C99, file: !955, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !956, splitDebugInlining: false, nameTableKind: None)
!955 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!956 = !{!952, !957, !961}
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !954, file: !959, line: 5, type: !960, isLocal: false, isDefinition: true)
!959 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 88, elements: !190)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !954, file: !959, line: 6, type: !960, isLocal: false, isDefinition: true)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 248, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 31)
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !968, retainedTypes: !977, splitDebugInlining: false, nameTableKind: None)
!967 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_I2C.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!968 = !{!227, !232, !969, !492}
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_I2C_TRANS_STATUS_T", file: !228, line: 394, baseType: !132, size: 8, elements: !970)
!970 = !{!971, !972, !973, !974, !975, !976}
!971 = !DIEnumerator(name: "I2C_TRANS_STATUS_SLAVE_NOT_EXIST", value: 0)
!972 = !DIEnumerator(name: "I2C_TRANS_STATUS_NACK", value: 1)
!973 = !DIEnumerator(name: "I2C_TRANS_STATUS_ARBITRATE", value: 2)
!974 = !DIEnumerator(name: "I2C_TRANS_STATUS_FIFO_FLOW", value: 3)
!975 = !DIEnumerator(name: "I2C_TRANS_STATUS_FAIL", value: 4)
!976 = !DIEnumerator(name: "I2C_TRANS_STATUS_OK", value: 5)
!977 = !{!978, !219, !161, !1000, !1001}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOT_I2C_TypeDef", file: !228, line: 233, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IOT_I2C_TypeDef", file: !228, line: 214, size: 576, elements: !981)
!981 = !{!982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "MM_PAD_CON0", scope: !980, file: !228, line: 215, baseType: !218, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "MM_CNT_VAL_PHL", scope: !980, file: !228, line: 216, baseType: !218, size: 32, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "MM_CNT_VAL_PHH", scope: !980, file: !228, line: 217, baseType: !218, size: 32, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "MM_CNT_VAL_HS_PHL", scope: !980, file: !228, line: 218, baseType: !218, size: 32, offset: 96)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "MM_CNT_VAL_HS_PHH", scope: !980, file: !228, line: 219, baseType: !218, size: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "MM_CNT_BYTE_VAL_PK0", scope: !980, file: !228, line: 220, baseType: !218, size: 32, offset: 160)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "MM_CNT_BYTE_VAL_PK1", scope: !980, file: !228, line: 221, baseType: !218, size: 32, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "MM_CNT_BYTE_VAL_PK2", scope: !980, file: !228, line: 222, baseType: !218, size: 32, offset: 224)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "MM_ID_CON0", scope: !980, file: !228, line: 223, baseType: !218, size: 32, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "MM_ID_CON1", scope: !980, file: !228, line: 224, baseType: !218, size: 32, offset: 288)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "MM_PACK_CON0", scope: !980, file: !228, line: 225, baseType: !218, size: 32, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "MM_ACK_VAL", scope: !980, file: !228, line: 226, baseType: !218, size: 32, offset: 352)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "MM_CON0", scope: !980, file: !228, line: 227, baseType: !218, size: 32, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "MM_STATUS", scope: !980, file: !228, line: 228, baseType: !218, size: 32, offset: 416)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "MM_FIFO_CON0", scope: !980, file: !228, line: 229, baseType: !218, size: 32, offset: 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "MM_FIFO_DATA", scope: !980, file: !228, line: 230, baseType: !218, size: 32, offset: 480)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "MM_FIFO_STATUS", scope: !980, file: !228, line: 231, baseType: !218, size: 32, offset: 512)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "MM_FIFO_PTR", scope: !980, file: !228, line: 232, baseType: !218, size: 32, offset: 544)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_I2C_TRANS_STATUS_T", file: !228, line: 401, baseType: !969)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "IOT_I2C_HALF_GDMA_TypeDef", file: !228, line: 418, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IOT_I2C_HALF_GDMA_TypeDef", file: !228, line: 406, size: 320, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "DMAn_WPPT", scope: !1003, file: !228, line: 408, baseType: !218, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "DMAn_WPTO", scope: !1003, file: !228, line: 409, baseType: !218, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "DMAn_COUNT", scope: !1003, file: !228, line: 410, baseType: !218, size: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "DMAn_CON", scope: !1003, file: !228, line: 411, baseType: !218, size: 32, offset: 96)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "DMAn_START", scope: !1003, file: !228, line: 412, baseType: !218, size: 32, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "DMAn_INTSTA", scope: !1003, file: !228, line: 413, baseType: !218, size: 32, offset: 160)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "DMAn_ACKINT", scope: !1003, file: !228, line: 414, baseType: !218, size: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "DMAn_RLCT", scope: !1003, file: !228, line: 415, baseType: !218, size: 32, offset: 224)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "DMAn_LIMITER", scope: !1003, file: !228, line: 416, baseType: !218, size: 32, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "DMAn_PGMADDR", scope: !1003, file: !228, line: 417, baseType: !218, size: 32, offset: 288)
!1015 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1016, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1017, retainedTypes: !1023, splitDebugInlining: false, nameTableKind: None)
!1016 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!1017 = !{!1018}
!1018 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1019, line: 1209, baseType: !7, size: 32, elements: !1020)
!1019 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!1020 = !{!1021, !1022}
!1021 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!1022 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!1023 = !{!115, !114}
!1024 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1025, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1026, retainedTypes: !1104, splitDebugInlining: false, nameTableKind: None)
!1025 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!1026 = !{!1027}
!1027 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1028, line: 150, baseType: !7, size: 32, elements: !1029)
!1028 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/i2c_control_EEPROM_with_dma/GCC")
!1029 = !{!1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103}
!1030 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!1031 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!1032 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!1033 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!1034 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!1035 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!1036 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!1037 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!1038 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!1039 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!1040 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!1041 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!1042 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!1043 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!1044 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!1045 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!1046 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!1047 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!1048 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!1049 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!1050 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!1051 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!1052 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!1053 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!1054 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!1055 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!1056 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!1057 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!1058 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!1059 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!1060 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!1061 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!1062 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!1063 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!1064 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!1065 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!1066 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!1067 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!1068 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!1069 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
