; ModuleID = 'build/actinius_icarus_bee/out_of_tree_driver/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "dev", scope: !27, file: !106, line: 11, type: !107, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !105, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_HELLO_WORLD", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_LAST", value: 67)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !{!25}
!106 = !DIFile(filename: "zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112, !116, !117, !118, !127, !128}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !110, line: 380, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !109, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !109, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !110, line: 386, baseType: !119, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !121)
!121 = !{!122, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !120, file: !110, line: 359, baseType: !123, size: 8)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !124)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !120, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !109, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !110, line: 43, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !133)
!133 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "_char_out", scope: !136, file: !139, line: 54, type: !140, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !138, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!138 = !{!134}
!139 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DISubroutineType(types: !142)
!142 = !{!104, !104}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !145, file: !207, line: 65, type: !208, isLocal: true, isDefinition: true, align: 32)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !147, globals: !200, splitDebugInlining: false, nameTableKind: None)
!146 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!147 = !{!103, !104, !148, !153, !160}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !150, file: !149, line: 167, baseType: !159)
!149 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!150 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !149, file: !149, line: 134, type: !151, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !145, retainedNodes: !154)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !153}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!154 = !{!155, !156, !158}
!155 = !DILocalVariable(name: "time_us", arg: 1, scope: !150, file: !149, line: 134, type: !153)
!156 = !DILocalVariable(name: "delay_cycles", scope: !150, file: !149, line: 168, type: !157)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!158 = !DILocalVariable(name: "cycles", scope: !150, file: !149, line: 171, type: !153)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !162, line: 1928, baseType: !163)
!162 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 1909, size: 11360, elements: !164)
!164 = !{!165, !171, !172, !173, !174, !178, !179, !180, !181, !185, !186, !190, !191, !192, !193, !194, !198, !199}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !163, file: !162, line: 1910, baseType: !166, size: 8192)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 8192, elements: !169)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !153)
!169 = !{!170}
!170 = !DISubrange(count: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !163, file: !162, line: 1911, baseType: !167, size: 32, offset: 8192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !163, file: !162, line: 1912, baseType: !167, size: 32, offset: 8224)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !163, file: !162, line: 1913, baseType: !167, size: 32, offset: 8256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !163, file: !162, line: 1914, baseType: !175, size: 1984, offset: 8288)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 1984, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 62)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !163, file: !162, line: 1915, baseType: !168, size: 32, offset: 10272)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !163, file: !162, line: 1916, baseType: !167, size: 32, offset: 10304)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !163, file: !162, line: 1917, baseType: !168, size: 32, offset: 10336)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !163, file: !162, line: 1918, baseType: !182, size: 96, offset: 10368)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 96, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 3)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !163, file: !162, line: 1919, baseType: !168, size: 32, offset: 10464)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !163, file: !162, line: 1920, baseType: !187, size: 256, offset: 10496)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 256, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !163, file: !162, line: 1921, baseType: !168, size: 32, offset: 10752)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !163, file: !162, line: 1922, baseType: !167, size: 32, offset: 10784)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !163, file: !162, line: 1923, baseType: !168, size: 32, offset: 10816)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !163, file: !162, line: 1924, baseType: !168, size: 32, offset: 10848)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !163, file: !162, line: 1925, baseType: !195, size: 416, offset: 10880)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 416, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 13)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !163, file: !162, line: 1926, baseType: !168, size: 32, offset: 11296)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !163, file: !162, line: 1927, baseType: !168, size: 32, offset: 11328)
!200 = !{!143, !201}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !150, file: !149, line: 161, type: !203, isLocal: true, isDefinition: true, align: 128)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 48, elements: !183)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !206)
!206 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!207 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !210, line: 51, size: 64, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !209, file: !210, line: 60, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!104, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !210, line: 48, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !209, file: !210, line: 65, baseType: !216, size: 32, offset: 32)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !222, file: !263, line: 27, type: !290, isLocal: true, isDefinition: true)
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !224, retainedTypes: !236, globals: !260, splitDebugInlining: false, nameTableKind: None)
!223 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!224 = !{!225, !30}
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !226, line: 27, baseType: !32, size: 32, elements: !227)
!226 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235}
!228 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!229 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!230 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!231 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!232 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!233 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!234 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!235 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!236 = !{!103, !237, !104, !24, !241, !257, !153, !258}
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !238, line: 46, baseType: !239)
!238 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !240)
!240 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !243, line: 54, size: 96, elements: !244)
!243 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = !{!245, !252, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !242, file: !243, line: 55, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !247, line: 33, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !247, line: 29, size: 32, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !247, line: 30, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !242, file: !243, line: 60, baseType: !253, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !225}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !242, file: !243, line: 65, baseType: !253, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !259)
!259 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!260 = !{!220, !261, !267, !269, !280, !282}
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !222, file: !263, line: 44, type: !264, isLocal: true, isDefinition: true)
!263 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !265, line: 43, elements: !266)
!265 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = !{}
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !222, file: !263, line: 49, type: !264, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !222, file: !263, line: 36, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 128, elements: !278)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !226, line: 114, size: 128, elements: !273)
!273 = !{!274, !275, !276, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !272, file: !226, line: 115, baseType: !225, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !272, file: !226, line: 141, baseType: !123, size: 8, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !272, file: !226, line: 149, baseType: !153, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !272, file: !226, line: 156, baseType: !153, size: 32, offset: 96)
!278 = !{!279}
!279 = !DISubrange(count: 1)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !222, file: !263, line: 40, type: !271, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !222, file: !263, line: 28, type: !284, isLocal: true, isDefinition: true)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !247, line: 40, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !247, line: 35, size: 64, elements: !286)
!286 = !{!287, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !285, file: !247, line: 36, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !285, file: !247, line: 37, baseType: !288, size: 32, offset: 32)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 32, elements: !278)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !292, line: 22, baseType: !293)
!292 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!293 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!294 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!295 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !298, file: !327, line: 50, type: !314, isLocal: true, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !224, retainedTypes: !300, globals: !324, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!300 = !{!132, !237, !301, !104, !103, !153, !258, !303, !257, !314, !315}
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !302, line: 214, baseType: !32)
!302 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !305, line: 45, size: 64, elements: !306)
!305 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!306 = !{!307, !313}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !304, file: !305, line: 46, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !247, line: 33, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !247, line: 29, size: 32, elements: !310)
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !247, line: 30, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !304, file: !305, line: 48, baseType: !153, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !104)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !305, line: 38, size: 64, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !316, file: !305, line: 39, baseType: !308, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !316, file: !305, line: 41, baseType: !320, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !305, line: 35, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !314}
!324 = !{!325, !329, !337, !296, !339, !349}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "latency_lock", scope: !298, file: !327, line: 44, type: !328, isLocal: true, isDefinition: true)
!327 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !265, line: 43, elements: !266)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !298, file: !327, line: 46, type: !331, isLocal: true, isDefinition: true)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !247, line: 40, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !247, line: 35, size: 64, elements: !333)
!333 = !{!334, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !332, file: !247, line: 36, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !332, file: !247, line: 37, baseType: !335, size: 32, offset: 32)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "latency_subs", scope: !298, file: !327, line: 52, type: !331, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !298, file: !327, line: 39, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, elements: !347)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 35, size: 96, elements: !343)
!343 = !{!344, !345, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !342, file: !327, line: 36, baseType: !225, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !342, file: !327, line: 37, baseType: !123, size: 8, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !342, file: !327, line: 38, baseType: !291, size: 32, offset: 64)
!347 = !{!348}
!348 = !DISubrange(count: 0)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !298, file: !327, line: 48, type: !314, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !353, file: !360, line: 47, type: !374, isLocal: true, isDefinition: true)
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !355, retainedTypes: !356, globals: !357, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!355 = !{!225}
!356 = !{!301, !104}
!357 = !{!358, !351, !370}
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "cpus_states", scope: !353, file: !360, line: 50, type: !361, isLocal: true, isDefinition: true)
!360 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 32, elements: !278)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !226, line: 114, size: 128, elements: !365)
!365 = !{!366, !367, !368, !369}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !364, file: !226, line: 115, baseType: !225, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !364, file: !226, line: 141, baseType: !123, size: 8, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !364, file: !226, line: 149, baseType: !153, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !364, file: !226, line: 156, baseType: !153, size: 32, offset: 96)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !353, file: !360, line: 55, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 8, elements: !278)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, elements: !347)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "static_regions", scope: !377, file: !384, line: 62, type: !516, isLocal: true, isDefinition: true)
!377 = distinct !DICompileUnit(language: DW_LANG_C99, file: !378, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !379, globals: !380, splitDebugInlining: false, nameTableKind: None)
!378 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!379 = !{!301, !104, !153, !103}
!380 = !{!381, !375}
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !383, file: !384, line: 198, type: !503, isLocal: true, isDefinition: true)
!383 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !384, file: !384, line: 175, type: !385, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !377, retainedNodes: !500)
!384 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !DISubroutineType(types: !386)
!386 = !{null, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !389, line: 245, size: 1024, elements: !390)
!389 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = !{!391, !456, !469, !470, !471, !472, !478, !495}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !388, file: !389, line: 247, baseType: !392, size: 384)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !389, line: 57, size: 384, elements: !393)
!393 = !{!394, !422, !430, !431, !432, !443, !444, !445}
!394 = !DIDerivedType(tag: DW_TAG_member, scope: !392, file: !389, line: 60, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !392, file: !389, line: 60, size: 64, elements: !396)
!396 = !{!397, !413}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !395, file: !389, line: 61, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !399, line: 49, baseType: !400)
!399 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !399, line: 37, size: 64, elements: !401)
!401 = !{!402, !408}
!402 = !DIDerivedType(tag: DW_TAG_member, scope: !400, file: !399, line: 38, baseType: !403, size: 32)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !400, file: !399, line: 38, size: 32, elements: !404)
!404 = !{!405, !407}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !403, file: !399, line: 39, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !403, file: !399, line: 40, baseType: !406, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, scope: !400, file: !399, line: 42, baseType: !409, size: 32, offset: 32)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !400, file: !399, line: 42, size: 32, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !409, file: !399, line: 43, baseType: !406, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !409, file: !399, line: 44, baseType: !406, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !395, file: !389, line: 62, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !415, line: 49, size: 64, elements: !416)
!415 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !414, file: !415, line: 50, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 64, elements: !420)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!420 = !{!421}
!421 = !DISubrange(count: 2)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !392, file: !389, line: 68, baseType: !423, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !425, line: 233, baseType: !426)
!425 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !425, line: 231, size: 64, elements: !427)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !426, file: !425, line: 232, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !399, line: 48, baseType: !400)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !392, file: !389, line: 71, baseType: !123, size: 8, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !392, file: !389, line: 74, baseType: !123, size: 8, offset: 104)
!432 = !DIDerivedType(tag: DW_TAG_member, scope: !392, file: !389, line: 90, baseType: !433, size: 16, offset: 112)
!433 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !392, file: !389, line: 90, size: 16, elements: !434)
!434 = !{!435, !442}
!435 = !DIDerivedType(tag: DW_TAG_member, scope: !433, file: !389, line: 91, baseType: !436, size: 16)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !433, file: !389, line: 91, size: 16, elements: !437)
!437 = !{!438, !441}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !436, file: !389, line: 96, baseType: !439, size: 8)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !440)
!440 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !436, file: !389, line: 97, baseType: !123, size: 8, offset: 8)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !433, file: !389, line: 100, baseType: !205, size: 16)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !392, file: !389, line: 107, baseType: !153, size: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !392, file: !389, line: 127, baseType: !103, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !392, file: !389, line: 131, baseType: !446, size: 192, offset: 192)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !425, line: 244, size: 192, elements: !447)
!447 = !{!448, !449, !455}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !446, file: !425, line: 245, baseType: !398, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !446, file: !425, line: 246, baseType: !450, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !425, line: 242, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !454}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !446, file: !425, line: 249, baseType: !239, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !388, file: !389, line: 250, baseType: !457, size: 288, offset: 384)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !458, line: 25, size: 288, elements: !459)
!458 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !457, file: !458, line: 26, baseType: !153, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !457, file: !458, line: 27, baseType: !153, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !457, file: !458, line: 28, baseType: !153, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !457, file: !458, line: 29, baseType: !153, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !457, file: !458, line: 30, baseType: !153, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !457, file: !458, line: 31, baseType: !153, size: 32, offset: 160)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !457, file: !458, line: 32, baseType: !153, size: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !457, file: !458, line: 33, baseType: !153, size: 32, offset: 224)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !457, file: !458, line: 34, baseType: !153, size: 32, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !388, file: !389, line: 253, baseType: !103, size: 32, offset: 672)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !388, file: !389, line: 256, baseType: !424, size: 64, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !388, file: !389, line: 294, baseType: !104, size: 32, offset: 768)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !388, file: !389, line: 300, baseType: !473, size: 96, offset: 800)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !389, line: 149, size: 96, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !473, file: !389, line: 153, baseType: !22, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !473, file: !389, line: 162, baseType: !301, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !473, file: !389, line: 168, baseType: !301, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !388, file: !389, line: 325, baseType: !479, size: 32, offset: 896)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !481, line: 5073, size: 160, elements: !482)
!481 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!482 = !{!483, !492, !493}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !480, file: !481, line: 5074, baseType: !484, size: 96)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !485, line: 56, size: 96, elements: !486)
!485 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!486 = !{!487, !490, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !484, file: !485, line: 57, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !485, line: 57, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !484, file: !485, line: 58, baseType: !103, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !484, file: !485, line: 59, baseType: !301, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !480, file: !481, line: 5075, baseType: !424, size: 64, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !480, file: !481, line: 5076, baseType: !494, offset: 160)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !265, line: 43, elements: !266)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !388, file: !389, line: 343, baseType: !496, size: 64, offset: 928)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !458, line: 60, size: 64, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !496, file: !458, line: 63, baseType: !153, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !496, file: !458, line: 66, baseType: !153, size: 32, offset: 32)
!500 = !{!501, !502}
!501 = !DILocalVariable(name: "thread", arg: 1, scope: !383, file: !384, line: 175, type: !387)
!502 = !DILocalVariable(name: "region_num", scope: !383, file: !384, line: 200, type: !123)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, elements: !347)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !505, line: 52, size: 96, elements: !506)
!505 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!506 = !{!507, !508, !509}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !504, file: !505, line: 53, baseType: !22, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !504, file: !505, line: 54, baseType: !301, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !504, file: !505, line: 55, baseType: !510, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !511, line: 304, baseType: !512)
!511 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 301, size: 32, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !512, file: !511, line: 302, baseType: !205, size: 16)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !512, file: !511, line: 303, baseType: !205, size: 16, offset: 16)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 96, elements: !278)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !520, file: !574, line: 39, type: !123, isLocal: true, isDefinition: true)
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !522, globals: !565, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!522 = !{!523, !103, !104, !551}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !525, line: 1495, baseType: !526)
!525 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !525, line: 1474, size: 448, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !541}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !526, file: !525, line: 1476, baseType: !167, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !526, file: !525, line: 1477, baseType: !168, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !526, file: !525, line: 1478, baseType: !168, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !526, file: !525, line: 1479, baseType: !168, size: 32, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !526, file: !525, line: 1480, baseType: !168, size: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !526, file: !525, line: 1481, baseType: !168, size: 32, offset: 160)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !526, file: !525, line: 1482, baseType: !168, size: 32, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !526, file: !525, line: 1483, baseType: !168, size: 32, offset: 224)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !526, file: !525, line: 1484, baseType: !168, size: 32, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !526, file: !525, line: 1485, baseType: !168, size: 32, offset: 288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !526, file: !525, line: 1486, baseType: !168, size: 32, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !526, file: !525, line: 1487, baseType: !540, size: 32, offset: 352)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 32, elements: !278)
!541 = !DIDerivedType(tag: DW_TAG_member, scope: !526, file: !525, line: 1488, baseType: !542, size: 64, offset: 384)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !526, file: !525, line: 1488, size: 64, elements: !543)
!543 = !{!544, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !542, file: !525, line: 1489, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !420)
!546 = !DIDerivedType(tag: DW_TAG_member, scope: !542, file: !525, line: 1490, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !542, file: !525, line: 1490, size: 64, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !547, file: !525, line: 1491, baseType: !168, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !547, file: !525, line: 1492, baseType: !168, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !554, line: 27, size: 128, elements: !555)
!554 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !553, file: !554, line: 29, baseType: !153, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !553, file: !554, line: 31, baseType: !113, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !553, file: !554, line: 37, baseType: !559, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !511, line: 298, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !511, line: 289, size: 64, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !560, file: !511, line: 291, baseType: !123, size: 5, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !560, file: !511, line: 293, baseType: !123, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !560, file: !511, line: 295, baseType: !153, size: 32, offset: 32)
!565 = !{!518, !566}
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !520, file: !568, line: 31, type: !569, isLocal: true, isDefinition: true)
!568 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 160, elements: !278)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !568, line: 21, size: 160, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !570, file: !568, line: 22, baseType: !104, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !570, file: !568, line: 23, baseType: !553, size: 128, offset: 32)
!574 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !577, file: !584, line: 21, type: !140, isLocal: true, isDefinition: true)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !579, globals: !583, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!579 = !{!580, !104, !103}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !582, line: 22, baseType: !104)
!582 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!583 = !{!575}
!584 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !587, file: !592, line: 13, type: !611, isLocal: true, isDefinition: true)
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !589, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!589 = !{!590, !585}
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "mpu_config", scope: !587, file: !592, line: 37, type: !593, isLocal: false, isDefinition: true)
!592 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !554, line: 41, size: 64, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !594, file: !554, line: 43, baseType: !153, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !594, file: !554, line: 45, baseType: !598, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !554, line: 27, size: 128, elements: !601)
!601 = !{!602, !603, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !600, file: !554, line: 29, baseType: !153, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !600, file: !554, line: 31, baseType: !113, size: 32, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !600, file: !554, line: 37, baseType: !605, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !511, line: 298, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !511, line: 289, size: 64, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !606, file: !511, line: 291, baseType: !123, size: 5, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !606, file: !511, line: 293, baseType: !123, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !606, file: !511, line: 295, baseType: !153, size: 32, offset: 32)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 256, elements: !420)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "__device_dts_ord_54", scope: !614, file: !818, line: 733, type: !921, isLocal: false, isDefinition: true, align: 32)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !616, retainedTypes: !734, globals: !814, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/out_of_tree_driver")
!616 = !{!617, !623, !30, !628, !633, !637, !641, !645, !651, !655, !699, !706, !725}
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !618, line: 23, baseType: !32, size: 32, elements: !619)
!618 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!619 = !{!620, !621, !622}
!620 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!621 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!622 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!623 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !618, line: 48, baseType: !32, size: 32, elements: !624)
!624 = !{!625, !626, !627}
!625 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!626 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!627 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!628 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !629, line: 167, baseType: !32, size: 32, elements: !630)
!629 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!630 = !{!631, !632}
!631 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!632 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !629, line: 107, baseType: !32, size: 32, elements: !634)
!634 = !{!635, !636}
!635 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!636 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !629, line: 208, baseType: !32, size: 32, elements: !638)
!638 = !{!639, !640}
!639 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!640 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !629, line: 261, baseType: !32, size: 32, elements: !642)
!642 = !{!643, !644}
!643 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!644 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !629, line: 237, baseType: !32, size: 32, elements: !646)
!646 = !{!647, !648, !649, !650}
!647 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!648 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!649 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!650 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !629, line: 152, baseType: !32, size: 32, elements: !652)
!652 = !{!653, !654}
!653 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!654 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!655 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !162, line: 71, baseType: !104, size: 32, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!657 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!658 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!659 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!660 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!661 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!662 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!663 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!664 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!665 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!666 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!667 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!668 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!669 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!670 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!671 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!672 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!673 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!674 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!675 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!676 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!677 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!678 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!679 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!680 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!681 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!682 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!683 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!684 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!685 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!686 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!687 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!688 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!689 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!690 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!691 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!692 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!693 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!694 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!695 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!696 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!697 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!698 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !700, line: 44, baseType: !32, size: 32, elements: !701)
!700 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!701 = !{!702, !703, !704, !705}
!702 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!703 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!704 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!705 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !707, line: 54, baseType: !32, size: 32, elements: !708)
!707 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724}
!709 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!710 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!711 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!712 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!713 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!714 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!715 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!716 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!717 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!718 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!719 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!720 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!721 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!722 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!723 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!724 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !726, line: 53, baseType: !32, size: 32, elements: !727)
!726 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = !{!728, !729, !730, !731, !732, !733}
!728 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!729 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!730 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!731 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!732 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!733 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!734 = !{!617, !103, !104, !735, !777, !778, !779, !780, !237, !153, !258, !126, !781, !782, !314, !783, !813, !301}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !162, line: 923, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 883, size: 10464, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !747, !748, !749, !750, !751, !752, !753, !754, !758, !759, !760, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !737, file: !162, line: 884, baseType: !168, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !737, file: !162, line: 885, baseType: !168, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !737, file: !162, line: 886, baseType: !168, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !737, file: !162, line: 887, baseType: !168, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !737, file: !162, line: 888, baseType: !744, size: 896, offset: 128)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 896, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 28)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !737, file: !162, line: 889, baseType: !168, size: 32, offset: 1024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !737, file: !162, line: 890, baseType: !168, size: 32, offset: 1056)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !737, file: !162, line: 891, baseType: !168, size: 32, offset: 1088)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !737, file: !162, line: 892, baseType: !168, size: 32, offset: 1120)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !737, file: !162, line: 893, baseType: !744, size: 896, offset: 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !737, file: !162, line: 894, baseType: !168, size: 32, offset: 2048)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !737, file: !162, line: 895, baseType: !168, size: 32, offset: 2080)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !737, file: !162, line: 896, baseType: !755, size: 960, offset: 2112)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 960, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 30)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !737, file: !162, line: 897, baseType: !168, size: 32, offset: 3072)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !737, file: !162, line: 898, baseType: !168, size: 32, offset: 3104)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !737, file: !162, line: 899, baseType: !761, size: 3008, offset: 3136)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 3008, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 94)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !737, file: !162, line: 900, baseType: !168, size: 32, offset: 6144)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !737, file: !162, line: 901, baseType: !168, size: 32, offset: 6176)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !737, file: !162, line: 902, baseType: !168, size: 32, offset: 6208)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !737, file: !162, line: 903, baseType: !167, size: 32, offset: 6240)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !737, file: !162, line: 904, baseType: !175, size: 1984, offset: 6272)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !737, file: !162, line: 905, baseType: !167, size: 32, offset: 8256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !737, file: !162, line: 907, baseType: !167, size: 32, offset: 8288)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !737, file: !162, line: 910, baseType: !167, size: 32, offset: 8320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !737, file: !162, line: 911, baseType: !167, size: 32, offset: 8352)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !737, file: !162, line: 913, baseType: !167, size: 32, offset: 8384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !737, file: !162, line: 917, baseType: !167, size: 32, offset: 8416)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !737, file: !162, line: 919, baseType: !175, size: 1984, offset: 8448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !737, file: !162, line: 920, baseType: !168, size: 32, offset: 10432)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !629, line: 146, baseType: !633)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !629, line: 164, baseType: !651)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !525, line: 485, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !525, line: 468, size: 28704, elements: !786)
!786 = !{!787, !791, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !808, !812}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !785, file: !525, line: 470, baseType: !788, size: 512)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 512, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 16)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !785, file: !525, line: 471, baseType: !792, size: 512, offset: 512)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 512, elements: !789)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !785, file: !525, line: 472, baseType: !788, size: 512, offset: 1024)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !785, file: !525, line: 473, baseType: !792, size: 512, offset: 1536)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !785, file: !525, line: 474, baseType: !788, size: 512, offset: 2048)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !785, file: !525, line: 475, baseType: !792, size: 512, offset: 2560)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !785, file: !525, line: 476, baseType: !788, size: 512, offset: 3072)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !785, file: !525, line: 477, baseType: !792, size: 512, offset: 3584)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !785, file: !525, line: 478, baseType: !788, size: 512, offset: 4096)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !785, file: !525, line: 479, baseType: !792, size: 512, offset: 4608)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !785, file: !525, line: 480, baseType: !788, size: 512, offset: 5120)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !785, file: !525, line: 481, baseType: !792, size: 512, offset: 5632)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !785, file: !525, line: 482, baseType: !804, size: 3968, offset: 6144)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !805, size: 3968, elements: !806)
!805 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !123)
!806 = !{!807}
!807 = !DISubrange(count: 496)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !785, file: !525, line: 483, baseType: !809, size: 18560, offset: 10112)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 18560, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 580)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !785, file: !525, line: 484, baseType: !168, size: 32, offset: 28672)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !700, line: 56, baseType: !103)
!814 = !{!815, !865, !906, !612, !911, !936, !938, !955, !957, !967, !970, !985, !1023, !1037}
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "on", scope: !817, file: !818, line: 549, type: !291, isLocal: true, isDefinition: true)
!817 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !818, file: !818, line: 547, type: !819, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !614, retainedNodes: !821)
!818 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!819 = !DISubroutineType(types: !820)
!820 = !{null, !623}
!821 = !{!822, !823, !826}
!822 = !DILocalVariable(name: "start_mode", arg: 1, scope: !817, file: !818, line: 547, type: !623)
!823 = !DILocalVariable(name: "err", scope: !824, file: !818, line: 553, type: !104)
!824 = distinct !DILexicalBlock(scope: !825, file: !818, line: 552, column: 31)
!825 = distinct !DILexicalBlock(scope: !817, file: !818, line: 552, column: 6)
!826 = !DILocalVariable(name: "mgr", scope: !824, file: !818, line: 554, type: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !829, line: 154, size: 224, elements: !830)
!829 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!830 = !{!831, !843, !844, !860, !862, !863, !864}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !828, file: !829, line: 158, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !247, line: 40, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !247, line: 35, size: 64, elements: !834)
!834 = !{!835, !842}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !833, file: !247, line: 36, baseType: !836, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !247, line: 33, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !247, line: 29, size: 32, elements: !839)
!839 = !{!840}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !838, file: !247, line: 30, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !833, file: !247, line: 37, baseType: !836, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !828, file: !829, line: 163, baseType: !832, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !828, file: !829, line: 166, baseType: !845, size: 32, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !829, line: 133, size: 96, elements: !848)
!848 = !{!849, !858, !859}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !847, file: !829, line: 135, baseType: !850, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !829, line: 129, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !827, !854}
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !829, line: 101, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !827, !104}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !847, file: !829, line: 138, baseType: !850, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !847, file: !829, line: 143, baseType: !850, size: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !828, file: !829, line: 169, baseType: !861, offset: 160)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !265, line: 43, elements: !266)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !828, file: !829, line: 172, baseType: !104, size: 32, offset: 160)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !828, file: !829, line: 175, baseType: !205, size: 16, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !828, file: !829, line: 178, baseType: !205, size: 16, offset: 208)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "cli", scope: !817, file: !818, line: 550, type: !867, isLocal: true, isDefinition: true)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !829, line: 273, size: 128, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !867, file: !829, line: 280, baseType: !837, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !867, file: !829, line: 283, baseType: !871, size: 96, offset: 32)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !872, line: 138, size: 96, elements: !873)
!872 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!873 = !{!874, !903, !904}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !871, file: !872, line: 149, baseType: !875, size: 32)
!875 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !872, line: 139, size: 32, elements: !876)
!876 = !{!877, !898}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !875, file: !872, line: 145, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !481, line: 5397, size: 128, elements: !880)
!880 = !{!881, !896, !897}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !879, file: !481, line: 5399, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !399, line: 48, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !399, line: 37, size: 64, elements: !884)
!884 = !{!885, !891}
!885 = !DIDerivedType(tag: DW_TAG_member, scope: !883, file: !399, line: 38, baseType: !886, size: 32)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !883, file: !399, line: 38, size: 32, elements: !887)
!887 = !{!888, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !886, file: !399, line: 39, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !886, file: !399, line: 40, baseType: !889, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, scope: !883, file: !399, line: 42, baseType: !892, size: 32, offset: 32)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !883, file: !399, line: 42, size: 32, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !892, file: !399, line: 43, baseType: !889, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !892, file: !399, line: 44, baseType: !889, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !879, file: !481, line: 5405, baseType: !32, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !879, file: !481, line: 5408, baseType: !104, size: 32, offset: 96)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !875, file: !872, line: 148, baseType: !899, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !872, line: 98, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DISubroutineType(types: !902)
!902 = !{null, null}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !871, file: !872, line: 165, baseType: !168, size: 32, offset: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !871, file: !872, line: 174, baseType: !905, size: 32, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !614, file: !818, line: 733, type: !908, isLocal: false, isDefinition: true, align: 16)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 80, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 5)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_54", scope: !614, file: !818, line: 733, type: !913, isLocal: true, isDefinition: true, align: 32)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !210, line: 51, size: 64, elements: !915)
!915 = !{!916, !935}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !914, file: !210, line: 60, baseType: !917, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DISubroutineType(types: !919)
!919 = !{!104, !920}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !923)
!923 = !{!924, !925, !926, !927, !933, !934}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !922, file: !110, line: 380, baseType: !113, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !922, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !922, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !922, file: !110, line: 386, baseType: !928, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !929, file: !110, line: 359, baseType: !123, size: 8)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !929, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !922, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !922, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !914, file: !210, line: 65, baseType: !920, size: 32, offset: 32)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !614, file: !818, line: 79, type: !291, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "data", scope: !614, file: !818, line: 702, type: !940, isLocal: true, isDefinition: true)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !818, line: 69, size: 640, elements: !941)
!941 = !{!942, !944}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !940, file: !818, line: 70, baseType: !943, size: 448)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 448, elements: !420)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !940, file: !818, line: 71, baseType: !945, size: 192, offset: 448)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 192, elements: !420)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !818, line: 52, size: 96, elements: !947)
!947 = !{!948, !953, !954}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !946, file: !818, line: 53, baseType: !949, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !700, line: 72, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !920, !813, !103}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !946, file: !818, line: 54, baseType: !103, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !946, file: !818, line: 55, baseType: !153, size: 32, offset: 64)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_54", scope: !614, file: !818, line: 733, type: !929, isLocal: true, isDefinition: true, align: 8)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "d", scope: !959, file: !818, line: 476, type: !965, isLocal: true, isDefinition: true)
!959 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !818, file: !818, line: 474, type: !819, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !614, retainedNodes: !960)
!960 = !{!961, !962, !963, !964}
!961 = !DILocalVariable(name: "mode", arg: 1, scope: !959, file: !818, line: 474, type: !623)
!962 = !DILocalVariable(name: "type", scope: !959, file: !818, line: 486, type: !777)
!963 = !DILocalVariable(name: "isr_mode", scope: !959, file: !818, line: 500, type: !126)
!964 = !DILocalVariable(name: "key", scope: !959, file: !818, line: 501, type: !104)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !629, line: 177, baseType: !628)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "target_type", scope: !959, file: !818, line: 477, type: !969, isLocal: true, isDefinition: true)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "config", scope: !614, file: !818, line: 704, type: !972, isLocal: true, isDefinition: true)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !818, line: 74, size: 128, elements: !974)
!974 = !{!975}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !973, file: !818, line: 76, baseType: !976, size: 128)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 128, elements: !420)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !818, line: 61, size: 64, elements: !978)
!978 = !{!979, !984}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !977, file: !818, line: 62, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !818, line: 58, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DISubroutineType(types: !983)
!983 = !{null}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !977, file: !818, line: 63, baseType: !980, size: 32, offset: 32)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !614, file: !818, line: 695, type: !987, isLocal: true, isDefinition: true)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !700, line: 100, size: 224, elements: !989)
!989 = !{!990, !995, !996, !1001, !1007, !1012, !1018}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !988, file: !700, line: 101, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !700, line: 76, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DISubroutineType(types: !994)
!994 = !{!104, !920, !813}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !988, file: !700, line: 102, baseType: !991, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !988, file: !700, line: 103, baseType: !997, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !700, line: 83, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!104, !920, !813, !949, !103}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !988, file: !700, line: 104, baseType: !1002, size: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !700, line: 79, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!104, !920, !813, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !988, file: !700, line: 105, baseType: !1008, size: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !700, line: 88, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!699, !920, !813}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !988, file: !700, line: 106, baseType: !1013, size: 32, offset: 160)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !700, line: 92, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!104, !920, !813, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !700, line: 64, baseType: !103)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !988, file: !700, line: 107, baseType: !1019, size: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !700, line: 96, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!104, !920, !813, !103}
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "transitions", scope: !1025, file: !818, line: 655, type: !846, isLocal: true, isDefinition: true)
!1025 = distinct !DISubprogram(name: "clk_init", scope: !818, file: !818, line: 651, type: !918, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !614, retainedNodes: !1026)
!1026 = !{!1027, !1028, !1030, !1031, !1033}
!1027 = !DILocalVariable(name: "dev", arg: 1, scope: !1025, file: !818, line: 651, type: !920)
!1028 = !DILocalVariable(name: "nrfx_err", scope: !1025, file: !818, line: 653, type: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !707, line: 72, baseType: !706)
!1030 = !DILocalVariable(name: "err", scope: !1025, file: !818, line: 654, type: !104)
!1031 = !DILocalVariable(name: "i", scope: !1032, file: !818, line: 678, type: !617)
!1032 = distinct !DILexicalBlock(scope: !1025, file: !818, line: 678, column: 2)
!1033 = !DILocalVariable(name: "subdata", scope: !1034, file: !818, line: 680, type: !1036)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !818, line: 679, column: 42)
!1035 = distinct !DILexicalBlock(scope: !1032, file: !818, line: 678, column: 2)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "__isr_nrfx_isr_irq_0", scope: !1025, file: !818, line: 660, type: !1039, isLocal: true, isDefinition: true, align: 32)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1039, file: !10, line: 55, baseType: !314, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1039, file: !10, line: 57, baseType: !314, size: 32, offset: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1039, file: !10, line: 59, baseType: !103, size: 32, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1039, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
