; ModuleID = 'build/adafruit_feather_stm32f405/subsys/usb/console/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.common_descriptor = type <{ %struct.usb_device_descriptor, %struct.usb_cfg_descriptor }>
%struct.usb_device_descriptor = type { i8, i8, i16, i8, i8, i8, i8, i16, i16, i16, i8, i8, i8, i8 }
%struct.usb_cfg_descriptor = type <{ i8, i8, i16, i8, i8, i8, i8, i8 }>
%struct.usb_string_desription = type { %struct.usb_string_descriptor, %struct.usb_mfr_descriptor, %struct.usb_product_descriptor, %struct.usb_sn_descriptor }
%struct.usb_string_descriptor = type { i8, i8, i16 }
%struct.usb_mfr_descriptor = type { i8, i8, [12 x i8] }
%struct.usb_product_descriptor = type { i8, i8, [50 x i8] }
%struct.usb_sn_descriptor = type { i8, i8, [32 x i8] }
%struct.device_state = type { i8, i8 }
%struct.usb_cdc_acm_config = type { %struct.usb_association_descriptor, %struct.usb_if_descriptor, %struct.cdc_header_descriptor, %struct.cdc_cm_descriptor, %struct.cdc_acm_descriptor, %struct.cdc_cm_descriptor, %struct.usb_ep_descriptor, %struct.usb_if_descriptor, %struct.usb_ep_descriptor, %struct.usb_ep_descriptor }
%struct.usb_association_descriptor = type { i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.cdc_header_descriptor = type <{ i8, i8, i8, i16 }>
%struct.cdc_acm_descriptor = type { i8, i8, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/usb/console/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/usb/console")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 94, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/usb/console")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5248, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 82)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2624, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/usb/console")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/usb/console")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 369, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f405xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 360, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 362, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 363, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 364, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 365, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 366, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 367, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 368, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/usb/console")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "usb_enable_lock", scope: !197, file: !353, line: 102, type: !423, isLocal: false, isDefinition: true, align: 32)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !199, retainedTypes: !237, globals: !350, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/usb/device/usb_device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/usb/console")
!199 = !{!200, !215, !221, !226, !232, !30}
!200 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_dc_status_code", file: !201, line: 63, baseType: !32, size: 32, elements: !202)
!201 = !DIFile(filename: "zephyr/include/zephyr/drivers/usb/usb_dc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214}
!203 = !DIEnumerator(name: "USB_DC_ERROR", value: 0)
!204 = !DIEnumerator(name: "USB_DC_RESET", value: 1)
!205 = !DIEnumerator(name: "USB_DC_CONNECTED", value: 2)
!206 = !DIEnumerator(name: "USB_DC_CONFIGURED", value: 3)
!207 = !DIEnumerator(name: "USB_DC_DISCONNECTED", value: 4)
!208 = !DIEnumerator(name: "USB_DC_SUSPEND", value: 5)
!209 = !DIEnumerator(name: "USB_DC_RESUME", value: 6)
!210 = !DIEnumerator(name: "USB_DC_INTERFACE", value: 7)
!211 = !DIEnumerator(name: "USB_DC_SET_HALT", value: 8)
!212 = !DIEnumerator(name: "USB_DC_CLEAR_HALT", value: 9)
!213 = !DIEnumerator(name: "USB_DC_SOF", value: 10)
!214 = !DIEnumerator(name: "USB_DC_UNKNOWN", value: 11)
!215 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_dc_ep_transfer_type", file: !201, line: 107, baseType: !32, size: 32, elements: !216)
!216 = !{!217, !218, !219, !220}
!217 = !DIEnumerator(name: "USB_DC_EP_CONTROL", value: 0)
!218 = !DIEnumerator(name: "USB_DC_EP_ISOCHRONOUS", value: 1)
!219 = !DIEnumerator(name: "USB_DC_EP_BULK", value: 2)
!220 = !DIEnumerator(name: "USB_DC_EP_INTERRUPT", value: 3)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_dc_ep_cb_status_code", file: !201, line: 95, baseType: !32, size: 32, elements: !222)
!222 = !{!223, !224, !225}
!223 = !DIEnumerator(name: "USB_DC_EP_SETUP", value: 0)
!224 = !DIEnumerator(name: "USB_DC_EP_DATA_OUT", value: 1)
!225 = !DIEnumerator(name: "USB_DC_EP_DATA_IN", value: 2)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !227, line: 506, baseType: !32, size: 32, elements: !228)
!227 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!228 = !{!229, !230, !231}
!229 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!230 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!231 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !227, line: 512, baseType: !32, size: 32, elements: !233)
!233 = !{!234, !235, !236}
!234 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!235 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!236 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!237 = !{!238, !242, !312, !317, !277, !232, !226, !322, !102, !103, !154, !323, !324, !336, !338}
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !239, line: 46, baseType: !240)
!239 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !241)
!241 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !227, line: 523, size: 288, elements: !245)
!245 = !{!246, !267, !273, !278, !282, !283, !284, !288, !308}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !244, file: !227, line: 524, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DISubroutineType(types: !249)
!249 = !{!103, !250, !265, !266}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !253)
!253 = !{!254, !255, !256, !257, !263, !264}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !141, line: 380, baseType: !144, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !252, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !252, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !252, file: !141, line: 386, baseType: !258, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !259, file: !141, line: 359, baseType: !154, size: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !259, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !252, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !252, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !227, line: 237, baseType: !154)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !227, line: 257, baseType: !121)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !244, file: !227, line: 530, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{!103, !250, !271}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !227, line: 229, baseType: !121)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !244, file: !227, line: 532, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DISubroutineType(types: !276)
!276 = !{!103, !250, !277, !272}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !227, line: 216, baseType: !121)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !244, file: !227, line: 535, baseType: !279, size: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{!103, !250, !277}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !244, file: !227, line: 537, baseType: !279, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !244, file: !227, line: 539, baseType: !279, size: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !244, file: !227, line: 541, baseType: !285, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{!103, !250, !265, !226, !232}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !244, file: !227, line: 544, baseType: !289, size: 32, offset: 224)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{!103, !250, !292, !157}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !227, line: 478, size: 96, elements: !294)
!294 = !{!295, !302, !307}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !293, file: !227, line: 482, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !297, line: 33, baseType: !298)
!297 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !297, line: 29, size: 32, elements: !299)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !297, line: 30, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !293, file: !227, line: 485, baseType: !303, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !227, line: 464, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !250, !292, !277}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !293, file: !227, line: 493, baseType: !277, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !244, file: !227, line: 547, baseType: !309, size: 32, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DISubroutineType(types: !311)
!311 = !{!121, !250}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !227, line: 428, size: 32, elements: !315)
!315 = !{!316}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !314, file: !227, line: 434, baseType: !277, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !227, line: 441, size: 32, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !319, file: !227, line: 447, baseType: !277, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_ep_descriptor", file: !326, line: 191, size: 56, elements: !327)
!326 = !DIFile(filename: "zephyr/include/zephyr/usb/usb_ch9.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !{!328, !329, !330, !331, !332, !335}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !325, file: !326, line: 192, baseType: !154, size: 8)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !325, file: !326, line: 193, baseType: !154, size: 8, offset: 8)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bEndpointAddress", scope: !325, file: !326, line: 194, baseType: !154, size: 8, offset: 16)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "bmAttributes", scope: !325, file: !326, line: 195, baseType: !154, size: 8, offset: 24)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "wMaxPacketSize", scope: !325, file: !326, line: 196, baseType: !333, size: 16, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !334)
!334 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bInterval", scope: !325, file: !326, line: 197, baseType: !154, size: 8, offset: 48)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !337, line: 214, baseType: !32)
!337 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_cfg_descriptor", file: !326, line: 166, size: 72, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !340, file: !326, line: 167, baseType: !154, size: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !340, file: !326, line: 168, baseType: !154, size: 8, offset: 8)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "wTotalLength", scope: !340, file: !326, line: 169, baseType: !333, size: 16, offset: 16)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bNumInterfaces", scope: !340, file: !326, line: 170, baseType: !154, size: 8, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "bConfigurationValue", scope: !340, file: !326, line: 171, baseType: !154, size: 8, offset: 40)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "iConfiguration", scope: !340, file: !326, line: 172, baseType: !154, size: 8, offset: 48)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "bmAttributes", scope: !340, file: !326, line: 173, baseType: !154, size: 8, offset: 56)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "bMaxPower", scope: !340, file: !326, line: 174, baseType: !154, size: 8, offset: 64)
!350 = !{!195, !351, !362}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "__init_usb_device_init", scope: !197, file: !353, line: 1714, type: !354, isLocal: true, isDefinition: true, align: 32)
!353 = !DIFile(filename: "zephyr/subsys/usb/device/usb_device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !356)
!356 = !{!357, !361}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !355, file: !132, line: 60, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DISubroutineType(types: !360)
!360 = !{!103, !250}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !355, file: !132, line: 65, baseType: !250, size: 32, offset: 32)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "usb_dev", scope: !197, file: !353, line: 140, type: !364, isLocal: true, isDefinition: true)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_dev_priv", file: !353, line: 104, size: 1600, elements: !365)
!365 = !{!366, !383, !384, !386, !387, !388, !397, !404, !405, !406, !410, !414, !415, !416, !417, !421, !422}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !364, file: !353, line: 106, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_setup_packet", file: !326, line: 38, size: 64, elements: !368)
!368 = !{!369, !379, !380, !381, !382}
!369 = !DIDerivedType(tag: DW_TAG_member, scope: !367, file: !326, line: 39, baseType: !370, size: 8)
!370 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !367, file: !326, line: 39, size: 8, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "bmRequestType", scope: !370, file: !326, line: 40, baseType: !154, size: 8)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "RequestType", scope: !370, file: !326, line: 41, baseType: !374, size: 8)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_req_type_field", file: !326, line: 25, size: 8, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "recipient", scope: !374, file: !326, line: 27, baseType: !154, size: 5, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !374, file: !326, line: 28, baseType: !154, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !374, file: !326, line: 29, baseType: !154, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bRequest", scope: !367, file: !326, line: 43, baseType: !154, size: 8, offset: 8)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "wValue", scope: !367, file: !326, line: 44, baseType: !333, size: 16, offset: 16)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "wIndex", scope: !367, file: !326, line: 45, baseType: !333, size: 16, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "wLength", scope: !367, file: !326, line: 46, baseType: !333, size: 16, offset: 48)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "data_buf", scope: !364, file: !353, line: 108, baseType: !323, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "data_buf_residue", scope: !364, file: !353, line: 110, baseType: !385, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data_buf_len", scope: !364, file: !353, line: 112, baseType: !385, size: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "zlp_flag", scope: !364, file: !353, line: 114, baseType: !157, size: 8, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "custom_req_handler", scope: !364, file: !353, line: 116, baseType: !389, size: 32, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "usb_request_handler", file: !390, line: 114, baseType: !391)
!390 = !DIFile(filename: "zephyr/include/zephyr/usb/usb_device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DISubroutineType(types: !393)
!393 = !{!103, !394, !395, !396}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "status_callback", scope: !364, file: !353, line: 118, baseType: !398, size: 32, offset: 224)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "usb_dc_status_callback", file: !201, line: 163, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !200, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "user_status_callback", scope: !364, file: !353, line: 120, baseType: !398, size: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "descriptors", scope: !364, file: !353, line: 122, baseType: !402, size: 32, offset: 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "req_handlers", scope: !364, file: !353, line: 124, baseType: !407, size: 128, offset: 320)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 128, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 4)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "req_data", scope: !364, file: !353, line: 126, baseType: !411, size: 1024, offset: 448)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 1024, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !364, file: !353, line: 129, baseType: !157, size: 8, offset: 1472)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "configured", scope: !364, file: !353, line: 131, baseType: !157, size: 8, offset: 1480)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "configuration", scope: !364, file: !353, line: 133, baseType: !154, size: 8, offset: 1488)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "alt_setting", scope: !364, file: !353, line: 135, baseType: !418, size: 64, offset: 1496)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 64, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "remote_wakeup", scope: !364, file: !353, line: 137, baseType: !157, size: 8, offset: 1560)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ep_bm", scope: !364, file: !353, line: 139, baseType: !121, size: 32, offset: 1568)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !424, line: 2720, size: 160, elements: !425)
!424 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!425 = !{!426, !447, !542, !543}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !423, file: !424, line: 2722, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !428, line: 233, baseType: !429)
!428 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 231, size: 64, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !429, file: !428, line: 232, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !433, line: 48, baseType: !434)
!433 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !433, line: 37, size: 64, elements: !435)
!435 = !{!436, !442}
!436 = !DIDerivedType(tag: DW_TAG_member, scope: !434, file: !433, line: 38, baseType: !437, size: 32)
!437 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !434, file: !433, line: 38, size: 32, elements: !438)
!438 = !{!439, !441}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !437, file: !433, line: 39, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !433, line: 40, baseType: !440, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, scope: !434, file: !433, line: 42, baseType: !443, size: 32, offset: 32)
!443 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !434, file: !433, line: 42, size: 32, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !443, file: !433, line: 43, baseType: !440, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !443, file: !433, line: 44, baseType: !440, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !423, file: !424, line: 2724, baseType: !448, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !450, line: 245, size: 1024, elements: !451)
!450 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!451 = !{!452, !497, !510, !511, !512, !513, !519, !537}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !449, file: !450, line: 247, baseType: !453, size: 384)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !450, line: 57, size: 384, elements: !454)
!454 = !{!455, !469, !471, !472, !473, !484, !485, !486}
!455 = !DIDerivedType(tag: DW_TAG_member, scope: !453, file: !450, line: 60, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !450, line: 60, size: 64, elements: !457)
!457 = !{!458, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !456, file: !450, line: 61, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !433, line: 49, baseType: !434)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !456, file: !450, line: 62, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !462, line: 49, size: 64, elements: !463)
!462 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !461, file: !462, line: 50, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 64, elements: !467)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!467 = !{!468}
!468 = !DISubrange(count: 2)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !453, file: !450, line: 68, baseType: !470, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !453, file: !450, line: 71, baseType: !154, size: 8, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !453, file: !450, line: 74, baseType: !154, size: 8, offset: 104)
!473 = !DIDerivedType(tag: DW_TAG_member, scope: !453, file: !450, line: 90, baseType: !474, size: 16, offset: 112)
!474 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !450, line: 90, size: 16, elements: !475)
!475 = !{!476, !483}
!476 = !DIDerivedType(tag: DW_TAG_member, scope: !474, file: !450, line: 91, baseType: !477, size: 16)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !450, line: 91, size: 16, elements: !478)
!478 = !{!479, !482}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !477, file: !450, line: 96, baseType: !480, size: 8)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !481)
!481 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !477, file: !450, line: 97, baseType: !154, size: 8, offset: 8)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !474, file: !450, line: 100, baseType: !333, size: 16)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !453, file: !450, line: 107, baseType: !121, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !453, file: !450, line: 127, baseType: !102, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !453, file: !450, line: 131, baseType: !487, size: 192, offset: 192)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !428, line: 244, size: 192, elements: !488)
!488 = !{!489, !490, !496}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !487, file: !428, line: 245, baseType: !459, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !487, file: !428, line: 246, baseType: !491, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !428, line: 242, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !487, file: !428, line: 249, baseType: !240, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !449, file: !450, line: 250, baseType: !498, size: 288, offset: 384)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !499, line: 25, size: 288, elements: !500)
!499 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !498, file: !499, line: 26, baseType: !121, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !498, file: !499, line: 27, baseType: !121, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !498, file: !499, line: 28, baseType: !121, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !498, file: !499, line: 29, baseType: !121, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !498, file: !499, line: 30, baseType: !121, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !498, file: !499, line: 31, baseType: !121, size: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !498, file: !499, line: 32, baseType: !121, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !498, file: !499, line: 33, baseType: !121, size: 32, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !498, file: !499, line: 34, baseType: !121, size: 32, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !449, file: !450, line: 253, baseType: !102, size: 32, offset: 672)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !449, file: !450, line: 256, baseType: !427, size: 64, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !449, file: !450, line: 294, baseType: !103, size: 32, offset: 768)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !449, file: !450, line: 300, baseType: !514, size: 96, offset: 800)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !450, line: 149, size: 96, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !514, file: !450, line: 153, baseType: !22, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !514, file: !450, line: 162, baseType: !336, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !514, file: !450, line: 168, baseType: !336, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !449, file: !450, line: 325, baseType: !520, size: 32, offset: 896)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !424, line: 5073, size: 160, elements: !522)
!522 = !{!523, !532, !533}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !521, file: !424, line: 5074, baseType: !524, size: 96)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !525, line: 56, size: 96, elements: !526)
!525 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!526 = !{!527, !530, !531}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !524, file: !525, line: 57, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !525, line: 57, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !524, file: !525, line: 58, baseType: !102, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !524, file: !525, line: 59, baseType: !336, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !521, file: !424, line: 5075, baseType: !427, size: 64, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !521, file: !424, line: 5076, baseType: !534, offset: 160)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !535, line: 43, elements: !536)
!535 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!536 = !{}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !449, file: !450, line: 343, baseType: !538, size: 64, offset: 928)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !499, line: 60, size: 64, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !538, file: !499, line: 63, baseType: !121, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !538, file: !499, line: 66, baseType: !121, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !423, file: !424, line: 2727, baseType: !121, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !423, file: !424, line: 2730, baseType: !103, size: 32, offset: 128)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "common_desc", scope: !546, file: !616, line: 54, type: !683, isLocal: true, isDefinition: true, align: 8)
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !549, globals: !624, splitDebugInlining: false, nameTableKind: None)
!547 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/usb/device/usb_descriptor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/usb/console")
!548 = !{!200, !221, !30, !215}
!549 = !{!550, !323, !555, !581, !102, !103, !582, !593, !605, !614}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_desc_header", file: !326, line: 142, size: 16, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !551, file: !326, line: 143, baseType: !154, size: 8)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !551, file: !326, line: 144, baseType: !154, size: 8, offset: 8)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_dev_data", file: !557, line: 43, size: 64, elements: !558)
!557 = !DIFile(filename: "zephyr/subsys/usb/device/usb_descriptor.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!558 = !{!559, !575}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !556, file: !557, line: 44, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !563)
!563 = !{!564, !565, !566, !567, !573, !574}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !141, line: 380, baseType: !144, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !562, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !562, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !562, file: !141, line: 386, baseType: !568, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !569, file: !141, line: 359, baseType: !154, size: 8)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !569, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !562, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !562, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !556, file: !557, line: 45, baseType: !576, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !297, line: 33, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !297, line: 29, size: 32, elements: !578)
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !577, file: !297, line: 30, baseType: !580, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 32)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_cfg_descriptor", file: !326, line: 166, size: 72, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !583, file: !326, line: 167, baseType: !154, size: 8)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !583, file: !326, line: 168, baseType: !154, size: 8, offset: 8)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "wTotalLength", scope: !583, file: !326, line: 169, baseType: !333, size: 16, offset: 16)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bNumInterfaces", scope: !583, file: !326, line: 170, baseType: !154, size: 8, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bConfigurationValue", scope: !583, file: !326, line: 171, baseType: !154, size: 8, offset: 40)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "iConfiguration", scope: !583, file: !326, line: 172, baseType: !154, size: 8, offset: 48)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "bmAttributes", scope: !583, file: !326, line: 173, baseType: !154, size: 8, offset: 56)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "bMaxPower", scope: !583, file: !326, line: 174, baseType: !154, size: 8, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_if_descriptor", file: !326, line: 178, size: 72, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !594, file: !326, line: 179, baseType: !154, size: 8)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !594, file: !326, line: 180, baseType: !154, size: 8, offset: 8)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bInterfaceNumber", scope: !594, file: !326, line: 181, baseType: !154, size: 8, offset: 16)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bAlternateSetting", scope: !594, file: !326, line: 182, baseType: !154, size: 8, offset: 24)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bNumEndpoints", scope: !594, file: !326, line: 183, baseType: !154, size: 8, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "bInterfaceClass", scope: !594, file: !326, line: 184, baseType: !154, size: 8, offset: 40)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "bInterfaceSubClass", scope: !594, file: !326, line: 185, baseType: !154, size: 8, offset: 48)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "bInterfaceProtocol", scope: !594, file: !326, line: 186, baseType: !154, size: 8, offset: 56)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "iInterface", scope: !594, file: !326, line: 187, baseType: !154, size: 8, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_ep_descriptor", file: !326, line: 191, size: 56, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !606, file: !326, line: 192, baseType: !154, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !606, file: !326, line: 193, baseType: !154, size: 8, offset: 8)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bEndpointAddress", scope: !606, file: !326, line: 194, baseType: !154, size: 8, offset: 16)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "bmAttributes", scope: !606, file: !326, line: 195, baseType: !154, size: 8, offset: 24)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "wMaxPacketSize", scope: !606, file: !326, line: 196, baseType: !333, size: 16, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bInterval", scope: !606, file: !326, line: 197, baseType: !154, size: 8, offset: 48)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_sn_descriptor", file: !616, line: 115, size: 272, elements: !617)
!616 = !DIFile(filename: "zephyr/subsys/usb/device/usb_descriptor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !615, file: !616, line: 116, baseType: !154, size: 8)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !615, file: !616, line: 117, baseType: !154, size: 8, offset: 8)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "bString", scope: !615, file: !616, line: 118, baseType: !621, size: 256, offset: 16)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 256, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 32)
!624 = !{!544, !625, !654, !656}
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "string_descr", scope: !546, file: !616, line: 127, type: !627, isLocal: true, isDefinition: true, align: 8)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_string_desription", file: !616, line: 100, size: 832, elements: !628)
!628 = !{!629, !635, !644, !653}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_descr", scope: !627, file: !616, line: 101, baseType: !630, size: 32)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_string_descriptor", file: !326, line: 201, size: 32, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !630, file: !326, line: 202, baseType: !154, size: 8)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !630, file: !326, line: 203, baseType: !154, size: 8, offset: 8)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bString", scope: !630, file: !326, line: 204, baseType: !333, size: 16, offset: 16)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "utf16le_mfr", scope: !627, file: !616, line: 107, baseType: !636, size: 112, offset: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_mfr_descriptor", file: !616, line: 102, size: 112, elements: !637)
!637 = !{!638, !639, !640}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !636, file: !616, line: 103, baseType: !154, size: 8)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !636, file: !616, line: 104, baseType: !154, size: 8, offset: 8)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "bString", scope: !636, file: !616, line: 105, baseType: !641, size: 96, offset: 16)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 96, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 12)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "utf16le_product", scope: !627, file: !616, line: 113, baseType: !645, size: 416, offset: 144)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_product_descriptor", file: !616, line: 109, size: 416, elements: !646)
!646 = !{!647, !648, !649}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !645, file: !616, line: 110, baseType: !154, size: 8)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !645, file: !616, line: 111, baseType: !154, size: 8, offset: 8)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bString", scope: !645, file: !616, line: 112, baseType: !650, size: 400, offset: 16)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 400, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 50)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "utf16le_sn", scope: !627, file: !616, line: 119, baseType: !615, size: 272, offset: 560)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "term_descr", scope: !546, file: !616, line: 156, type: !551, isLocal: true, isDefinition: true, align: 8)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "sn", scope: !658, file: !616, line: 314, type: !680, isLocal: true, isDefinition: true)
!658 = distinct !DISubprogram(name: "usb_update_sn_string_descriptor", scope: !616, file: !616, line: 305, type: !659, scopeLine: 306, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !546, retainedNodes: !661)
!659 = !DISubroutineType(types: !660)
!660 = !{!323}
!661 = !{!662, !664, !668, !672, !673, !674, !678}
!662 = !DILocalVariable(name: "usblen", scope: !658, file: !616, line: 312, type: !663)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!664 = !DILocalVariable(name: "hwid", scope: !658, file: !616, line: 313, type: !665)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 128, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 16)
!668 = !DILocalVariable(name: "hex", scope: !658, file: !616, line: 315, type: !669)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 136, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 17)
!672 = !DILocalVariable(name: "hwlen", scope: !658, file: !616, line: 316, type: !103)
!673 = !DILocalVariable(name: "skip", scope: !658, file: !616, line: 316, type: !103)
!674 = !DILocalVariable(name: "_str", scope: !675, file: !616, line: 324, type: !144)
!675 = distinct !DILexicalBlock(scope: !676, file: !616, line: 324, column: 3)
!676 = distinct !DILexicalBlock(scope: !677, file: !616, line: 322, column: 17)
!677 = distinct !DILexicalBlock(scope: !658, file: !616, line: 322, column: 6)
!678 = !DILocalVariable(name: "i", scope: !679, file: !616, line: 325, type: !103)
!679 = distinct !DILexicalBlock(scope: !676, file: !616, line: 325, column: 3)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 144, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 18)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "common_descriptor", file: !616, line: 41, size: 216, elements: !684)
!684 = !{!685, !702}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "device_descriptor", scope: !683, file: !616, line: 42, baseType: !686, size: 144)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_device_descriptor", file: !326, line: 148, size: 144, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !686, file: !326, line: 149, baseType: !154, size: 8)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !686, file: !326, line: 150, baseType: !154, size: 8, offset: 8)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bcdUSB", scope: !686, file: !326, line: 151, baseType: !333, size: 16, offset: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bDeviceClass", scope: !686, file: !326, line: 152, baseType: !154, size: 8, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bDeviceSubClass", scope: !686, file: !326, line: 153, baseType: !154, size: 8, offset: 40)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "bDeviceProtocol", scope: !686, file: !326, line: 154, baseType: !154, size: 8, offset: 48)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bMaxPacketSize0", scope: !686, file: !326, line: 155, baseType: !154, size: 8, offset: 56)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "idVendor", scope: !686, file: !326, line: 156, baseType: !333, size: 16, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "idProduct", scope: !686, file: !326, line: 157, baseType: !333, size: 16, offset: 80)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bcdDevice", scope: !686, file: !326, line: 158, baseType: !333, size: 16, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "iManufacturer", scope: !686, file: !326, line: 159, baseType: !154, size: 8, offset: 112)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "iProduct", scope: !686, file: !326, line: 160, baseType: !154, size: 8, offset: 120)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "iSerialNumber", scope: !686, file: !326, line: 161, baseType: !154, size: 8, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bNumConfigurations", scope: !686, file: !326, line: 162, baseType: !154, size: 8, offset: 136)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cfg_descr", scope: !683, file: !616, line: 43, baseType: !583, size: 72, offset: 144)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "ut_data", scope: !705, file: !711, line: 48, type: !864, isLocal: true, isDefinition: true)
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !707, retainedTypes: !708, globals: !863, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/usb/device/usb_transfer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/usb/console")
!707 = !{!221, !30}
!708 = !{!336, !103, !238, !102, !709, !581, !121, !861}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_transfer_data", file: !711, line: 24, size: 512, elements: !712)
!711 = !DIFile(filename: "zephyr/subsys/usb/device/usb_transfer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !{!713, !714, !715, !716, !717, !718, !723, !724, !748, !860}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !710, file: !711, line: 26, baseType: !154, size: 8)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !710, file: !711, line: 28, baseType: !103, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !710, file: !711, line: 30, baseType: !323, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !710, file: !711, line: 32, baseType: !336, size: 32, offset: 96)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !710, file: !711, line: 34, baseType: !336, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !710, file: !711, line: 36, baseType: !719, size: 32, offset: 160)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "usb_transfer_callback", file: !390, line: 353, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !154, !103, !102}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !710, file: !711, line: 38, baseType: !102, size: 32, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !710, file: !711, line: 40, baseType: !725, size: 128, offset: 224)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !424, line: 2909, size: 128, elements: !726)
!726 = !{!727, !746, !747}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !725, file: !424, line: 2910, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !428, line: 233, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 231, size: 64, elements: !730)
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !729, file: !428, line: 232, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !433, line: 48, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !433, line: 37, size: 64, elements: !734)
!734 = !{!735, !741}
!735 = !DIDerivedType(tag: DW_TAG_member, scope: !733, file: !433, line: 38, baseType: !736, size: 32)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !733, file: !433, line: 38, size: 32, elements: !737)
!737 = !{!738, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !736, file: !433, line: 39, baseType: !739, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !736, file: !433, line: 40, baseType: !739, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, scope: !733, file: !433, line: 42, baseType: !742, size: 32, offset: 32)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !733, file: !433, line: 42, size: 32, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !742, file: !433, line: 43, baseType: !739, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !742, file: !433, line: 44, baseType: !739, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !725, file: !424, line: 2911, baseType: !32, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !725, file: !424, line: 2912, baseType: !32, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !710, file: !711, line: 42, baseType: !749, size: 128, offset: 352)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !424, line: 3663, size: 128, elements: !750)
!750 = !{!751, !757, !763, !859}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !749, file: !424, line: 3669, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !297, line: 33, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !297, line: 29, size: 32, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !753, file: !297, line: 30, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !749, file: !424, line: 3672, baseType: !758, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !424, line: 3071, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !749, file: !424, line: 3675, baseType: !764, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !424, line: 3810, size: 1280, elements: !766)
!766 = !{!767, !849, !856, !857, !858}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !765, file: !424, line: 3812, baseType: !768, size: 1024)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !450, line: 245, size: 1024, elements: !769)
!769 = !{!770, !810, !822, !823, !824, !825, !831, !844}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !768, file: !450, line: 247, baseType: !771, size: 384)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !450, line: 57, size: 384, elements: !772)
!772 = !{!773, !784, !786, !787, !788, !797, !798, !799}
!773 = !DIDerivedType(tag: DW_TAG_member, scope: !771, file: !450, line: 60, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !771, file: !450, line: 60, size: 64, elements: !775)
!775 = !{!776, !778}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !774, file: !450, line: 61, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !433, line: 49, baseType: !733)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !774, file: !450, line: 62, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !462, line: 49, size: 64, elements: !780)
!780 = !{!781}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !779, file: !462, line: 50, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 64, elements: !467)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !771, file: !450, line: 68, baseType: !785, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !771, file: !450, line: 71, baseType: !154, size: 8, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !771, file: !450, line: 74, baseType: !154, size: 8, offset: 104)
!788 = !DIDerivedType(tag: DW_TAG_member, scope: !771, file: !450, line: 90, baseType: !789, size: 16, offset: 112)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !771, file: !450, line: 90, size: 16, elements: !790)
!790 = !{!791, !796}
!791 = !DIDerivedType(tag: DW_TAG_member, scope: !789, file: !450, line: 91, baseType: !792, size: 16)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !789, file: !450, line: 91, size: 16, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !792, file: !450, line: 96, baseType: !480, size: 8)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !792, file: !450, line: 97, baseType: !154, size: 8, offset: 8)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !789, file: !450, line: 100, baseType: !333, size: 16)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !771, file: !450, line: 107, baseType: !121, size: 32, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !771, file: !450, line: 127, baseType: !102, size: 32, offset: 160)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !771, file: !450, line: 131, baseType: !800, size: 192, offset: 192)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !428, line: 244, size: 192, elements: !801)
!801 = !{!802, !803, !809}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !800, file: !428, line: 245, baseType: !777, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !800, file: !428, line: 246, baseType: !804, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !428, line: 242, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !808}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !800, file: !428, line: 249, baseType: !240, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !768, file: !450, line: 250, baseType: !811, size: 288, offset: 384)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !499, line: 25, size: 288, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !811, file: !499, line: 26, baseType: !121, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !811, file: !499, line: 27, baseType: !121, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !811, file: !499, line: 28, baseType: !121, size: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !811, file: !499, line: 29, baseType: !121, size: 32, offset: 96)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !811, file: !499, line: 30, baseType: !121, size: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !811, file: !499, line: 31, baseType: !121, size: 32, offset: 160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !811, file: !499, line: 32, baseType: !121, size: 32, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !811, file: !499, line: 33, baseType: !121, size: 32, offset: 224)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !811, file: !499, line: 34, baseType: !121, size: 32, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !768, file: !450, line: 253, baseType: !102, size: 32, offset: 672)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !768, file: !450, line: 256, baseType: !728, size: 64, offset: 704)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !768, file: !450, line: 294, baseType: !103, size: 32, offset: 768)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !768, file: !450, line: 300, baseType: !826, size: 96, offset: 800)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !450, line: 149, size: 96, elements: !827)
!827 = !{!828, !829, !830}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !826, file: !450, line: 153, baseType: !22, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !826, file: !450, line: 162, baseType: !336, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !826, file: !450, line: 168, baseType: !336, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !768, file: !450, line: 325, baseType: !832, size: 32, offset: 896)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !424, line: 5073, size: 160, elements: !834)
!834 = !{!835, !841, !842}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !833, file: !424, line: 5074, baseType: !836, size: 96)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !525, line: 56, size: 96, elements: !837)
!837 = !{!838, !839, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !836, file: !525, line: 57, baseType: !528, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !836, file: !525, line: 58, baseType: !102, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !836, file: !525, line: 59, baseType: !336, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !833, file: !424, line: 5075, baseType: !728, size: 64, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !833, file: !424, line: 5076, baseType: !843, offset: 160)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !535, line: 43, elements: !536)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !768, file: !450, line: 343, baseType: !845, size: 64, offset: 928)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !499, line: 60, size: 64, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !845, file: !499, line: 63, baseType: !121, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !845, file: !499, line: 66, baseType: !121, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !765, file: !424, line: 3819, baseType: !850, size: 64, offset: 1024)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !297, line: 40, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !297, line: 35, size: 64, elements: !852)
!852 = !{!853, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !851, file: !297, line: 36, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !851, file: !297, line: 37, baseType: !854, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !765, file: !424, line: 3822, baseType: !728, size: 64, offset: 1088)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !765, file: !424, line: 3825, baseType: !728, size: 64, offset: 1152)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !765, file: !424, line: 3828, baseType: !121, size: 32, offset: 1216)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !749, file: !424, line: 3683, baseType: !121, size: 32, offset: 96)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !710, file: !711, line: 44, baseType: !32, size: 32, offset: 480)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !862)
!862 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!863 = !{!703}
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 2048, elements: !408)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "cdc_acm_data_devlist", scope: !867, file: !899, line: 128, type: !1042, isLocal: true, isDefinition: true)
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !869, retainedTypes: !896, globals: !1233, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/usb/device/class/cdc_acm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/usb/console")
!869 = !{!200, !221, !30, !870, !877, !884, !891}
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !871, line: 84, baseType: !32, size: 32, elements: !872)
!871 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!872 = !{!873, !874, !875, !876}
!873 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!874 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!875 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!876 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !871, line: 75, baseType: !32, size: 32, elements: !878)
!878 = !{!879, !880, !881, !882, !883}
!879 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!880 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!881 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!882 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!883 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !871, line: 92, baseType: !32, size: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890}
!886 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!887 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!888 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!889 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!890 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!891 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !871, line: 107, baseType: !32, size: 32, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!894 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!895 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!896 = !{!154, !102, !897, !581, !323, !103, !1094, !1164, !1176, !402}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cdc_acm_dev_data_t", file: !899, line: 92, size: 1120, elements: !900)
!899 = !DIFile(filename: "zephyr/subsys/usb/device/class/cdc_acm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!900 = !{!901, !921, !922, !1052, !1053, !1054, !1055, !1056, !1057, !1061, !1074, !1075, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !898, file: !899, line: 94, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !871, line: 142, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DISubroutineType(types: !905)
!905 = !{null, !906, !102}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !909)
!909 = !{!910, !911, !912, !913, !919, !920}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !141, line: 380, baseType: !144, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !908, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !908, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !908, file: !141, line: 386, baseType: !914, size: 32, offset: 96)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !916)
!916 = !{!917, !918}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !915, file: !141, line: 359, baseType: !154, size: 8)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !915, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !908, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !908, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "cb_data", scope: !898, file: !899, line: 95, baseType: !102, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "cb_work", scope: !898, file: !899, line: 96, baseType: !923, size: 128, offset: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !424, line: 3663, size: 128, elements: !924)
!924 = !{!925, !931, !937, !1051}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !923, file: !424, line: 3669, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !297, line: 33, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !297, line: 29, size: 32, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !927, file: !297, line: 30, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !923, file: !424, line: 3672, baseType: !932, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !424, line: 3071, baseType: !933)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !936}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !923, file: !424, line: 3675, baseType: !938, size: 32, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !424, line: 3810, size: 1280, elements: !940)
!940 = !{!941, !1041, !1048, !1049, !1050}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !939, file: !424, line: 3812, baseType: !942, size: 1024)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !450, line: 245, size: 1024, elements: !943)
!943 = !{!944, !1002, !1014, !1015, !1016, !1017, !1023, !1036}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !942, file: !450, line: 247, baseType: !945, size: 384)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !450, line: 57, size: 384, elements: !946)
!946 = !{!947, !971, !978, !979, !980, !989, !990, !991}
!947 = !DIDerivedType(tag: DW_TAG_member, scope: !945, file: !450, line: 60, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !945, file: !450, line: 60, size: 64, elements: !949)
!949 = !{!950, !965}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !948, file: !450, line: 61, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !433, line: 49, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !433, line: 37, size: 64, elements: !953)
!953 = !{!954, !960}
!954 = !DIDerivedType(tag: DW_TAG_member, scope: !952, file: !433, line: 38, baseType: !955, size: 32)
!955 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !952, file: !433, line: 38, size: 32, elements: !956)
!956 = !{!957, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !955, file: !433, line: 39, baseType: !958, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !955, file: !433, line: 40, baseType: !958, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, scope: !952, file: !433, line: 42, baseType: !961, size: 32, offset: 32)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !952, file: !433, line: 42, size: 32, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !961, file: !433, line: 43, baseType: !958, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !961, file: !433, line: 44, baseType: !958, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !948, file: !450, line: 62, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !462, line: 49, size: 64, elements: !967)
!967 = !{!968}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !966, file: !462, line: 50, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 64, elements: !467)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !945, file: !450, line: 68, baseType: !972, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !428, line: 233, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 231, size: 64, elements: !975)
!975 = !{!976}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !974, file: !428, line: 232, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !433, line: 48, baseType: !952)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !945, file: !450, line: 71, baseType: !154, size: 8, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !945, file: !450, line: 74, baseType: !154, size: 8, offset: 104)
!980 = !DIDerivedType(tag: DW_TAG_member, scope: !945, file: !450, line: 90, baseType: !981, size: 16, offset: 112)
!981 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !945, file: !450, line: 90, size: 16, elements: !982)
!982 = !{!983, !988}
!983 = !DIDerivedType(tag: DW_TAG_member, scope: !981, file: !450, line: 91, baseType: !984, size: 16)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !981, file: !450, line: 91, size: 16, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !984, file: !450, line: 96, baseType: !480, size: 8)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !984, file: !450, line: 97, baseType: !154, size: 8, offset: 8)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !981, file: !450, line: 100, baseType: !333, size: 16)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !945, file: !450, line: 107, baseType: !121, size: 32, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !945, file: !450, line: 127, baseType: !102, size: 32, offset: 160)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !945, file: !450, line: 131, baseType: !992, size: 192, offset: 192)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !428, line: 244, size: 192, elements: !993)
!993 = !{!994, !995, !1001}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !992, file: !428, line: 245, baseType: !951, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !992, file: !428, line: 246, baseType: !996, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !428, line: 242, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !992, file: !428, line: 249, baseType: !240, size: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !942, file: !450, line: 250, baseType: !1003, size: 288, offset: 384)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !499, line: 25, size: 288, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !1003, file: !499, line: 26, baseType: !121, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !1003, file: !499, line: 27, baseType: !121, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !1003, file: !499, line: 28, baseType: !121, size: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !1003, file: !499, line: 29, baseType: !121, size: 32, offset: 96)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !1003, file: !499, line: 30, baseType: !121, size: 32, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !1003, file: !499, line: 31, baseType: !121, size: 32, offset: 160)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !1003, file: !499, line: 32, baseType: !121, size: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !1003, file: !499, line: 33, baseType: !121, size: 32, offset: 224)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !1003, file: !499, line: 34, baseType: !121, size: 32, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !942, file: !450, line: 253, baseType: !102, size: 32, offset: 672)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !942, file: !450, line: 256, baseType: !973, size: 64, offset: 704)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !942, file: !450, line: 294, baseType: !103, size: 32, offset: 768)
