; ModuleID = 'build/96b_carbon_nrf51/led_lp503x/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %struct.z_spinlock_key, i8*, i32 }
%struct.z_spinlock_key = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.21 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %struct.z_spinlock_key }
%struct.mpsc_pbuf_buffer_config.22 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.21*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }
%struct.log_mpsc_pbuf = type { %struct.mpsc_pbuf_buffer.21 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/led_lp503x/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/led_lp503x")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/led_lp503x")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !230, line: 16, type: !232, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !107, globals: !227, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/led_lp503x/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/led_lp503x")
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !38, line: 27, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!40 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!41 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!42 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!43 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!44 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!45 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!46 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!47 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!48 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!49 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!50 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!51 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!52 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!53 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!54 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!55 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!56 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!106 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!107 = !{!108, !109, !123, !124, !117, !125, !135, !154}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !110, file: !111, line: 80, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !115)
!115 = !{!116, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !111, line: 47, baseType: !117, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !114, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !114, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !114, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !110, file: !111, line: 82, baseType: !108, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !127)
!127 = !{!128, !146, !150}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !126, file: !31, line: 89, baseType: !129, size: 96)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !130)
!130 = !{!131, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !129, file: !31, line: 67, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !133)
!133 = !{!134, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !132, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !132, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !132, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !132, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !132, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !129, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !129, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !135)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !126, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !31, line: 94, baseType: !151, offset: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: -1)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_driver_api", file: !157, line: 113, size: 224, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/drivers/led.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159, !189, !191, !196, !212, !217, !222}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !156, file: !157, line: 115, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_on", file: !157, line: 89, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!123, !164, !135}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !167, line: 378, size: 192, elements: !168)
!167 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = !{!169, !173, !174, !175, !182, !183}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !167, line: 380, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !166, file: !167, line: 382, baseType: !13, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !166, file: !167, line: 384, baseType: !13, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !166, file: !167, line: 386, baseType: !176, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !167, line: 351, size: 16, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !177, file: !167, line: 359, baseType: !117, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !177, file: !167, line: 364, baseType: !181, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!181 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !167, line: 388, baseType: !108, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !166, file: !167, line: 396, baseType: !184, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !167, line: 43, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !188)
!188 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !156, file: !157, line: 116, baseType: !190, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_off", file: !157, line: 97, baseType: !161)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "blink", scope: !156, file: !157, line: 118, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_blink", file: !157, line: 54, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!123, !164, !135, !135, !135}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !156, file: !157, line: 119, baseType: !197, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_get_info", file: !157, line: 63, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!123, !164, !135, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_info", file: !157, line: 41, size: 128, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !204, file: !157, line: 42, baseType: !170, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !204, file: !157, line: 43, baseType: !135, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_colors", scope: !204, file: !157, line: 44, baseType: !117, size: 8, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "color_mapping", scope: !204, file: !157, line: 45, baseType: !210, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "set_brightness", scope: !156, file: !157, line: 120, baseType: !213, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_brightness", file: !157, line: 72, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{!123, !164, !135, !117}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "set_color", scope: !156, file: !157, line: 121, baseType: !218, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_color", file: !157, line: 80, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{!123, !164, !135, !117, !210}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "write_channels", scope: !156, file: !157, line: 122, baseType: !223, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_write_channels", file: !157, line: 105, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DISubroutineType(types: !226)
!226 = !{!123, !164, !135, !135, !210}
!227 = !{!25, !228}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !230, line: 16, type: !231, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "zephyr/samples/drivers/led_lp503x/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !234, line: 17, baseType: !170, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !233, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !240, file: !296, line: 18, type: !298, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !243, globals: !293, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/led_lp503x")
!242 = !{!30}
!243 = !{!22, !108, !24, !244, !246, !248, !249, !123, !251, !252, !254, !256, !257, !258, !259, !261, !124, !117, !272, !135, !170}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !250, line: 214, baseType: !32)
!250 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !260)
!260 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !263)
!263 = !{!264, !271}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !262, file: !111, line: 80, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !265, file: !111, line: 47, baseType: !117, size: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !265, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !265, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !265, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !262, file: !111, line: 82, baseType: !108, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !274)
!274 = !{!275, !291, !292}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !273, file: !31, line: 89, baseType: !276, size: 96)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !277)
!277 = !{!278, !289, !290}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !276, file: !31, line: 67, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !279, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !279, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !279, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !279, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !279, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !279, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !279, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !279, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !276, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !276, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !273, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !273, file: !31, line: 94, baseType: !151, offset: 128)
!293 = !{!238, !294}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !240, file: !296, line: 18, type: !297, isLocal: true, isDefinition: true)
!296 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !234, line: 17, baseType: !170, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !299, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "_char_out", scope: !305, file: !310, line: 54, type: !311, isLocal: false, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !307, retainedTypes: !308, globals: !309, splitDebugInlining: false, nameTableKind: None)
!306 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/led_lp503x")
!307 = !{!37}
!308 = !{!108, !123}
!309 = !{!303}
!310 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!123, !123}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "log_const_log", scope: !316, file: !397, line: 25, type: !632, isLocal: false, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !318, retainedTypes: !324, globals: !394, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/led_lp503x")
!318 = !{!319, !30, !37}
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !320, line: 33, baseType: !32, size: 32, elements: !321)
!320 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = !{!322, !323}
!322 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!323 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!324 = !{!249, !123, !108, !325, !124, !336, !117, !337, !135, !358, !22, !24, !385, !388, !390, !392}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !327)
!327 = !{!328, !335}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !326, file: !111, line: 80, baseType: !329, size: 32)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !330)
!330 = !{!331, !332, !333, !334}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !329, file: !111, line: 47, baseType: !117, size: 8)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !329, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !329, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !329, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !326, file: !111, line: 82, baseType: !108, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !339)
!339 = !{!340, !356, !357}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !338, file: !31, line: 89, baseType: !341, size: 96)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !342)
!342 = !{!343, !354, !355}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !341, file: !31, line: 67, baseType: !344, size: 32)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !344, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !344, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !344, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !344, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !344, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !344, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !344, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !344, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !341, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !341, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !338, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !31, line: 94, baseType: !151, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !360)
!360 = !{!361, !378, !384}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !359, file: !31, line: 112, baseType: !362, size: 32)
!362 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !363, line: 49, size: 32, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !371, !377}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !362, file: !363, line: 50, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !363, line: 37, size: 32, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !366, file: !363, line: 38, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !366, file: !363, line: 38, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !366, file: !363, line: 39, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !362, file: !363, line: 51, baseType: !372, size: 32)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !363, line: 43, size: 32, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !372, file: !363, line: 44, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !372, file: !363, line: 44, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !372, file: !363, line: 45, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !362, file: !363, line: 52, baseType: !135, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !359, file: !31, line: 113, baseType: !379, size: 32)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !379, file: !31, line: 108, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !379, file: !31, line: 108, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !379, file: !31, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !359, file: !31, line: 114, baseType: !338, size: 128)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !386, line: 46, baseType: !387)
!386 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !255)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !389)
!389 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!394 = !{!314, !395, !424, !438, !440, !442, !446, !448, !450, !452, !454, !456, !462, !495, !498, !507, !593, !620, !627, !629, !637, !647, !652, !667, !671}
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !316, file: !397, line: 93, type: !398, isLocal: false, isDefinition: true, align: 32)
!397 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !399, line: 2909, size: 128, elements: !400)
!399 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!400 = !{!401, !422, !423}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !398, file: !399, line: 2910, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !403, line: 233, baseType: !404)
!403 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 231, size: 64, elements: !405)
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !404, file: !403, line: 232, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !408, line: 48, baseType: !409)
!408 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !408, line: 37, size: 64, elements: !410)
!410 = !{!411, !417}
!411 = !DIDerivedType(tag: DW_TAG_member, scope: !409, file: !408, line: 38, baseType: !412, size: 32)
!412 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !409, file: !408, line: 38, size: 32, elements: !413)
!413 = !{!414, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !412, file: !408, line: 39, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !412, file: !408, line: 40, baseType: !415, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, scope: !409, file: !408, line: 42, baseType: !418, size: 32, offset: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !409, file: !408, line: 42, size: 32, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !418, file: !408, line: 43, baseType: !415, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !418, file: !408, line: 44, baseType: !415, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !398, file: !399, line: 2911, baseType: !32, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !398, file: !399, line: 2912, baseType: !32, size: 32, offset: 96)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !316, file: !397, line: 910, type: !426, isLocal: true, isDefinition: true, align: 32)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !428, line: 51, size: 64, elements: !429)
!428 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!429 = !{!430, !437}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !427, file: !428, line: 60, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DISubroutineType(types: !433)
!433 = !{!123, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !428, line: 48, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !427, file: !428, line: 65, baseType: !434, size: 32, offset: 32)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "panic_mode", scope: !316, file: !397, line: 96, type: !181, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "backend_attached", scope: !316, file: !397, line: 97, type: !181, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !316, file: !397, line: 98, type: !444, isLocal: true, isDefinition: true)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !445, line: 22, baseType: !253)
!445 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !316, file: !397, line: 99, type: !444, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !316, file: !397, line: 105, type: !135, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !316, file: !397, line: 107, type: !145, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !316, file: !397, line: 108, type: !444, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "last_failure_report", scope: !316, file: !397, line: 109, type: !388, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !316, file: !397, line: 111, type: !458, isLocal: true, isDefinition: true, align: 32)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !459, line: 29, size: 32, elements: !460)
!459 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !458, file: !459, line: 30, baseType: !358, size: 32)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "log_buffer", scope: !316, file: !397, line: 112, type: !464, isLocal: true, isDefinition: true, align: 32)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !465, line: 87, size: 448, elements: !466)
!465 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = !{!467, !468, !469, !470, !471, !472, !476, !485, !490, !492, !493, !494}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !464, file: !465, line: 89, baseType: !135, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !464, file: !465, line: 92, baseType: !135, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !464, file: !465, line: 95, baseType: !135, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !464, file: !465, line: 98, baseType: !135, size: 32, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !464, file: !465, line: 101, baseType: !135, size: 32, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !464, file: !465, line: 104, baseType: !473, offset: 160)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !474, line: 43, elements: !475)
!474 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!475 = !{}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !464, file: !465, line: 110, baseType: !477, size: 32, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !465, line: 83, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !481, !483}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !464, file: !465, line: 113, baseType: !486, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !465, line: 75, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = !DISubroutineType(types: !489)
!489 = !{!135, !483}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !464, file: !465, line: 116, baseType: !491, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !464, file: !465, line: 119, baseType: !135, size: 32, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !464, file: !465, line: 122, baseType: !135, size: 32, offset: 288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !464, file: !465, line: 124, baseType: !398, size: 128, offset: 320)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !316, file: !397, line: 113, type: !497, isLocal: true, isDefinition: true)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "logging_stack", scope: !316, file: !397, line: 884, type: !500, isLocal: false, isDefinition: true, align: 64)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 6144, elements: !505)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !502, line: 47, size: 8, elements: !503)
!502 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !501, file: !502, line: 48, baseType: !172, size: 8)
!505 = !{!506}
!506 = !DISubrange(count: 768)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "logging_thread", scope: !316, file: !397, line: 885, type: !509, isLocal: false, isDefinition: true)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !510, line: 245, size: 896, elements: !511)
!510 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!511 = !{!512, !557, !570, !571, !572, !573, !588}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !509, file: !510, line: 247, baseType: !513, size: 384)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !510, line: 57, size: 384, elements: !514)
!514 = !{!515, !529, !531, !532, !533, !544, !545, !546}
!515 = !DIDerivedType(tag: DW_TAG_member, scope: !513, file: !510, line: 60, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !513, file: !510, line: 60, size: 64, elements: !517)
!517 = !{!518, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !516, file: !510, line: 61, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !408, line: 49, baseType: !409)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !516, file: !510, line: 62, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !522, line: 49, size: 64, elements: !523)
!522 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !521, file: !522, line: 50, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 64, elements: !527)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!527 = !{!528}
!528 = !DISubrange(count: 2)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !513, file: !510, line: 68, baseType: !530, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !513, file: !510, line: 71, baseType: !117, size: 8, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !513, file: !510, line: 74, baseType: !117, size: 8, offset: 104)
!533 = !DIDerivedType(tag: DW_TAG_member, scope: !513, file: !510, line: 90, baseType: !534, size: 16, offset: 112)
!534 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !513, file: !510, line: 90, size: 16, elements: !535)
!535 = !{!536, !543}
!536 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !510, line: 91, baseType: !537, size: 16)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !534, file: !510, line: 91, size: 16, elements: !538)
!538 = !{!539, !542}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !537, file: !510, line: 96, baseType: !540, size: 8)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !541)
!541 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !537, file: !510, line: 97, baseType: !117, size: 8, offset: 8)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !534, file: !510, line: 100, baseType: !259, size: 16)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !513, file: !510, line: 107, baseType: !135, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !513, file: !510, line: 127, baseType: !108, size: 32, offset: 160)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !513, file: !510, line: 131, baseType: !547, size: 192, offset: 192)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !403, line: 244, size: 192, elements: !548)
!548 = !{!549, !550, !556}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !547, file: !403, line: 245, baseType: !519, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !547, file: !403, line: 246, baseType: !551, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !403, line: 242, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !555}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !547, file: !403, line: 249, baseType: !387, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !509, file: !510, line: 250, baseType: !558, size: 288, offset: 384)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !559, line: 25, size: 288, elements: !560)
!559 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568, !569}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !558, file: !559, line: 26, baseType: !135, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !558, file: !559, line: 27, baseType: !135, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !558, file: !559, line: 28, baseType: !135, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !558, file: !559, line: 29, baseType: !135, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !558, file: !559, line: 30, baseType: !135, size: 32, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !558, file: !559, line: 31, baseType: !135, size: 32, offset: 160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !558, file: !559, line: 32, baseType: !135, size: 32, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !558, file: !559, line: 33, baseType: !135, size: 32, offset: 224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !558, file: !559, line: 34, baseType: !135, size: 32, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !509, file: !510, line: 253, baseType: !108, size: 32, offset: 672)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !509, file: !510, line: 256, baseType: !402, size: 64, offset: 704)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !509, file: !510, line: 294, baseType: !123, size: 32, offset: 768)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !509, file: !510, line: 325, baseType: !574, size: 32, offset: 800)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !399, line: 5073, size: 160, elements: !576)
!576 = !{!577, !586, !587}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !575, file: !399, line: 5074, baseType: !578, size: 96)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !579, line: 56, size: 96, elements: !580)
!579 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!580 = !{!581, !584, !585}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !578, file: !579, line: 57, baseType: !582, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 32)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !579, line: 57, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !578, file: !579, line: 58, baseType: !108, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !578, file: !579, line: 59, baseType: !249, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !575, file: !399, line: 5075, baseType: !402, size: 64, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !575, file: !399, line: 5076, baseType: !473, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !509, file: !510, line: 343, baseType: !589, size: 64, offset: 832)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !559, line: 60, size: 64, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !589, file: !559, line: 63, baseType: !135, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !589, file: !559, line: 66, baseType: !135, size: 32, offset: 32)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "format_table", scope: !316, file: !397, line: 72, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 128, elements: !148)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !598, line: 105, baseType: !599)
!598 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !602, !337, !135}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !598, line: 89, size: 128, elements: !605)
!605 = !{!606, !611, !618, !619}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !604, file: !598, line: 90, baseType: !607, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !598, line: 79, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DISubroutineType(types: !610)
!610 = !{!123, !258, !249, !108}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !604, file: !598, line: 91, baseType: !612, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !598, line: 82, size: 96, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !613, file: !598, line: 83, baseType: !444, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !613, file: !598, line: 84, baseType: !108, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !613, file: !598, line: 85, baseType: !170, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !604, file: !598, line: 92, baseType: !258, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !604, file: !598, line: 93, baseType: !249, size: 32, offset: 96)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !316, file: !397, line: 104, type: !622, isLocal: true, isDefinition: true)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !623, line: 33, baseType: !624)
!623 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = !DISubroutineType(types: !626)
!626 = !{!145}
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "initialized", scope: !316, file: !397, line: 95, type: !444, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !316, file: !397, line: 25, type: !631, isLocal: true, isDefinition: true)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !633, file: !234, line: 17, baseType: !170, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !633, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !316, file: !397, line: 121, type: !639, isLocal: true, isDefinition: true)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !465, line: 128, size: 160, elements: !641)
!641 = !{!642, !643, !644, !645, !646}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !640, file: !465, line: 130, baseType: !491, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !640, file: !465, line: 133, baseType: !135, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !640, file: !465, line: 136, baseType: !477, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !640, file: !465, line: 137, baseType: !486, size: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !640, file: !465, line: 140, baseType: !135, size: 32, offset: 128)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "buf32", scope: !316, file: !397, line: 116, type: !649, isLocal: true, isDefinition: true, align: 64)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8192, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 256)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "process_lock", scope: !654, file: !397, line: 157, type: !473, isLocal: true, isDefinition: true)
!654 = distinct !DISubprogram(name: "z_log_msg_post_finalize", scope: !397, file: !397, line: 152, type: !655, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !316, retainedNodes: !657)
!655 = !DISubroutineType(types: !656)
!656 = !{null}
!657 = !{!658, !660}
!658 = !DILocalVariable(name: "cnt", scope: !654, file: !397, line: 154, type: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_val_t", file: !445, line: 23, baseType: !444)
!660 = !DILocalVariable(name: "key", scope: !661, file: !397, line: 158, type: !663)
!661 = distinct !DILexicalBlock(scope: !662, file: !397, line: 156, column: 18)
!662 = distinct !DILexicalBlock(scope: !654, file: !397, line: 156, column: 6)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !474, line: 106, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !474, line: 32, size: 32, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !664, file: !474, line: 33, baseType: !123, size: 32)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "proc_tid", scope: !316, file: !397, line: 100, type: !669, isLocal: true, isDefinition: true)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !510, line: 347, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "log_process_thread_timer", scope: !316, file: !397, line: 101, type: !673, isLocal: true, isDefinition: true)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !399, line: 1318, size: 448, elements: !674)
!674 = !{!675, !676, !677, !682, !683, !688, !689}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !673, file: !399, line: 1324, baseType: !547, size: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !673, file: !399, line: 1327, baseType: !402, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !673, file: !399, line: 1330, baseType: !678, size: 32, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !681}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !673, file: !399, line: 1333, baseType: !678, size: 32, offset: 288)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !673, file: !399, line: 1336, baseType: !684, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !386, line: 67, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 65, size: 64, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !685, file: !386, line: 66, baseType: !385, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !673, file: !399, line: 1339, baseType: !135, size: 32, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !673, file: !399, line: 1342, baseType: !108, size: 32, offset: 416)
!690 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!691 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !694, file: !701, line: 14, type: !934, isLocal: false, isDefinition: true)
!694 = distinct !DICompileUnit(language: DW_LANG_C99, file: !695, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !696, retainedTypes: !697, globals: !698, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/led_lp503x")
!696 = !{!319, !37}
!697 = !{!108, !123, !210, !258, !170, !22}
!698 = !{!692, !699, !727, !911, !913, !925, !927, !932}
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "sname_cache", scope: !694, file: !701, line: 44, type: !702, isLocal: true, isDefinition: true)
!701 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !703, line: 30, size: 256, elements: !704)
!703 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!704 = !{!705, !718, !719, !724, !725, !726}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !702, file: !703, line: 31, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !707, line: 40, baseType: !708)
!707 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !707, line: 35, size: 64, elements: !709)
!709 = !{!710, !717}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !708, file: !707, line: 36, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !707, line: 33, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !707, line: 29, size: 32, elements: !714)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !713, file: !707, line: 30, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !708, file: !707, line: 37, baseType: !711, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !702, file: !703, line: 32, baseType: !706, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !702, file: !703, line: 33, baseType: !720, size: 32, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !703, line: 21, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DISubroutineType(types: !723)
!723 = !{!181, !22, !22}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !702, file: !703, line: 34, baseType: !135, size: 32, offset: 160)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !702, file: !703, line: 35, baseType: !135, size: 32, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !702, file: !703, line: 36, baseType: !249, size: 32, offset: 224)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !729, file: !701, line: 261, type: !170, isLocal: true, isDefinition: true)
!729 = distinct !DISubprogram(name: "link_domain_name_get", scope: !701, file: !701, line: 256, type: !730, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !694, retainedNodes: !732)
!730 = !DISubroutineType(types: !731)
!731 = !{!170, !117}
!732 = !{!733, !734, !735, !736, !737, !740, !910}
!733 = !DILocalVariable(name: "domain_id", arg: 1, scope: !729, file: !701, line: 256, type: !117)
!734 = !DILocalVariable(name: "cached", scope: !729, file: !701, line: 258, type: !258)
!735 = !DILocalVariable(name: "cache_size", scope: !729, file: !701, line: 259, type: !249)
!736 = !DILocalVariable(name: "id", scope: !729, file: !701, line: 260, type: !22)
!737 = !DILocalVariable(name: "rel_domain_id", scope: !738, file: !701, line: 265, type: !117)
!738 = distinct !DILexicalBlock(scope: !739, file: !701, line: 264, column: 49)
!739 = distinct !DILexicalBlock(scope: !729, file: !701, line: 264, column: 6)
!740 = !DILocalVariable(name: "link", scope: !738, file: !701, line: 266, type: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !744, line: 61, size: 192, elements: !745)
!744 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!745 = !{!746, !835, !836, !847, !848, !900}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !743, file: !744, line: 62, baseType: !747, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !744, line: 38, size: 192, elements: !750)
!750 = !{!751, !814, !818, !823, !827, !831}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !749, file: !744, line: 39, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DISubroutineType(types: !754)
!754 = !{!123, !741, !755}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !744, line: 33, size: 64, elements: !757)
!757 = !{!758, !809}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !756, file: !744, line: 34, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !744, line: 27, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !741, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !765)
!765 = !{!766, !782, !788}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !764, file: !31, line: 112, baseType: !767, size: 32)
!767 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !363, line: 49, size: 32, elements: !768)
!768 = !{!769, !775, !781}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !767, file: !363, line: 50, baseType: !770, size: 32)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !363, line: 37, size: 32, elements: !771)
!771 = !{!772, !773, !774}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !770, file: !363, line: 38, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !770, file: !363, line: 38, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !770, file: !363, line: 39, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !767, file: !363, line: 51, baseType: !776, size: 32)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !363, line: 43, size: 32, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !776, file: !363, line: 44, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !776, file: !363, line: 44, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !776, file: !363, line: 45, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !767, file: !363, line: 52, baseType: !135, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !764, file: !31, line: 113, baseType: !783, size: 32)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !783, file: !31, line: 108, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !783, file: !31, line: 108, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !783, file: !31, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !764, file: !31, line: 114, baseType: !789, size: 128)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !790)
!790 = !{!791, !807, !808}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !789, file: !31, line: 89, baseType: !792, size: 96)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !793)
!793 = !{!794, !805, !806}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !792, file: !31, line: 67, baseType: !795, size: 32)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !795, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !795, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !795, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !795, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !795, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !795, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !795, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !795, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !792, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !792, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !789, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !789, file: !31, line: 94, baseType: !151, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "dropped_cb", scope: !756, file: !744, line: 35, baseType: !810, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_dropped_cb_t", file: !744, line: 30, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !741, !135}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !749, file: !744, line: 40, baseType: !815, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DISubroutineType(types: !817)
!817 = !{!123, !741}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "get_domain_name", scope: !749, file: !744, line: 41, baseType: !819, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DISubroutineType(types: !821)
!821 = !{!123, !741, !135, !257, !822}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "get_source_name", scope: !749, file: !744, line: 43, baseType: !824, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = !DISubroutineType(types: !826)
!826 = !{!123, !741, !135, !259, !257, !822}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "get_levels", scope: !749, file: !744, line: 45, baseType: !828, size: 32, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DISubroutineType(types: !830)
!830 = !{!123, !741, !135, !259, !258, !258}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "set_runtime_level", scope: !749, file: !744, line: 48, baseType: !832, size: 32, offset: 160)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DISubroutineType(types: !834)
!834 = !{!123, !741, !135, !259, !117}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !743, file: !744, line: 63, baseType: !170, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_blk", scope: !743, file: !744, line: 64, baseType: !837, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_ctrl_blk", file: !744, line: 52, size: 128, elements: !839)
!839 = !{!840, !841, !845, !846}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "domain_cnt", scope: !838, file: !744, line: 53, baseType: !135, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "source_cnt", scope: !838, file: !744, line: 54, baseType: !842, size: 16, offset: 32)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 16, elements: !843)
!843 = !{!844}
!844 = !DISubrange(count: 1)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "domain_offset", scope: !838, file: !744, line: 57, baseType: !135, size: 32, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !838, file: !744, line: 58, baseType: !491, size: 32, offset: 96)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !743, file: !744, line: 65, baseType: !108, size: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf", scope: !743, file: !744, line: 66, baseType: !849, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !465, line: 87, size: 448, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !859, !868, !873, !874, !875, !876}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !850, file: !465, line: 89, baseType: !135, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !850, file: !465, line: 92, baseType: !135, size: 32, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !850, file: !465, line: 95, baseType: !135, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !850, file: !465, line: 98, baseType: !135, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !850, file: !465, line: 101, baseType: !135, size: 32, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !850, file: !465, line: 104, baseType: !858, offset: 160)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !474, line: 43, elements: !475)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !850, file: !465, line: 110, baseType: !860, size: 32, offset: 160)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !465, line: 83, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !864, !866}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !850, file: !465, line: 113, baseType: !869, size: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !465, line: 75, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DISubroutineType(types: !872)
!872 = !{!135, !866}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !850, file: !465, line: 116, baseType: !491, size: 32, offset: 224)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !850, file: !465, line: 119, baseType: !135, size: 32, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !850, file: !465, line: 122, baseType: !135, size: 32, offset: 288)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !850, file: !465, line: 124, baseType: !877, size: 128, offset: 320)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !399, line: 2909, size: 128, elements: !878)
!878 = !{!879, !898, !899}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !877, file: !399, line: 2910, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !403, line: 233, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 231, size: 64, elements: !882)
!882 = !{!883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !881, file: !403, line: 232, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !408, line: 48, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !408, line: 37, size: 64, elements: !886)
!886 = !{!887, !893}
!887 = !DIDerivedType(tag: DW_TAG_member, scope: !885, file: !408, line: 38, baseType: !888, size: 32)
!888 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !885, file: !408, line: 38, size: 32, elements: !889)
!889 = !{!890, !892}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !888, file: !408, line: 39, baseType: !891, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !888, file: !408, line: 40, baseType: !891, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, scope: !885, file: !408, line: 42, baseType: !894, size: 32, offset: 32)
!894 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !885, file: !408, line: 42, size: 32, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !894, file: !408, line: 43, baseType: !891, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !894, file: !408, line: 44, baseType: !891, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !877, file: !399, line: 2911, baseType: !32, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !877, file: !399, line: 2912, baseType: !32, size: 32, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf_config", scope: !743, file: !744, line: 67, baseType: !901, size: 32, offset: 160)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !465, line: 128, size: 160, elements: !904)
!904 = !{!905, !906, !907, !908, !909}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !903, file: !465, line: 130, baseType: !491, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !903, file: !465, line: 133, baseType: !135, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !903, file: !465, line: 136, baseType: !860, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !903, file: !465, line: 137, baseType: !869, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !903, file: !465, line: 140, baseType: !135, size: 32, offset: 128)
!910 = !DILocalVariable(name: "err", scope: !738, file: !701, line: 267, type: !123)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "dname_cache", scope: !694, file: !701, line: 43, type: !702, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "dname_cache_config", scope: !915, file: !701, line: 152, type: !918, isLocal: true, isDefinition: true)
!915 = distinct !DISubprogram(name: "cache_init", scope: !701, file: !701, line: 149, type: !655, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !694, retainedNodes: !916)
!916 = !{!917}
!917 = !DILocalVariable(name: "err", scope: !915, file: !701, line: 151, type: !123)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache_config", file: !703, line: 23, size: 128, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !919, file: !703, line: 24, baseType: !108, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !919, file: !703, line: 25, baseType: !249, size: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !919, file: !703, line: 26, baseType: !249, size: 32, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !919, file: !703, line: 27, baseType: !720, size: 32, offset: 96)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "sname_cache_config", scope: !915, file: !701, line: 158, type: !918, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "dname_cache_buffer", scope: !694, file: !701, line: 40, type: !929, isLocal: true, isDefinition: true, align: 32)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 72, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 9)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "sname_cache_buffer", scope: !694, file: !701, line: 41, type: !929, isLocal: true, isDefinition: true, align: 32)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !234, line: 17, baseType: !170, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !935, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "prefix", scope: !941, file: !942, line: 562, type: !987, isLocal: true, isDefinition: true)
!941 = distinct !DISubprogram(name: "log_output_dropped_process", scope: !942, file: !942, line: 558, type: !943, scopeLine: 559, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !959, retainedNodes: !980)
!942 = !DIFile(filename: "zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!943 = !DISubroutineType(types: !944)
!944 = !{null, !945, !135}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !598, line: 89, size: 128, elements: !948)
!948 = !{!949, !950, !957, !958}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !947, file: !598, line: 90, baseType: !607, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !947, file: !598, line: 91, baseType: !951, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !598, line: 82, size: 96, elements: !953)
!953 = !{!954, !955, !956}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !952, file: !598, line: 83, baseType: !444, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !952, file: !598, line: 84, baseType: !108, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !952, file: !598, line: 85, baseType: !170, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !947, file: !598, line: 92, baseType: !258, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !947, file: !598, line: 93, baseType: !249, size: 32, offset: 96)
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !307, retainedTypes: !961, globals: !962, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/led_lp503x")
!961 = !{!22, !108, !258, !388, !123, !135, !945, !117, !118, !32, !210}
!962 = !{!939, !963, !968, !970, !972, !978}
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "postfix", scope: !941, file: !942, line: 563, type: !965, isLocal: true, isDefinition: true)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 224, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 28)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "freq", scope: !959, file: !942, line: 46, type: !135, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "timestamp_div", scope: !959, file: !942, line: 47, type: !145, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "colors", scope: !959, file: !942, line: 38, type: !974, isLocal: true, isDefinition: true)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 160, elements: !976)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!976 = !{!977}
!977 = !DISubrange(count: 5)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "severity", scope: !959, file: !942, line: 30, type: !974, isLocal: true, isDefinition: true)
!980 = !{!981, !982, !983, !985, !986}
!981 = !DILocalVariable(name: "output", arg: 1, scope: !941, file: !942, line: 558, type: !945)
!982 = !DILocalVariable(name: "cnt", arg: 2, scope: !941, file: !942, line: 558, type: !135)
!983 = !DILocalVariable(name: "buf", scope: !941, file: !942, line: 560, type: !984)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 40, elements: !976)
!985 = !DILocalVariable(name: "len", scope: !941, file: !942, line: 561, type: !123)
!986 = !DILocalVariable(name: "outf", scope: !941, file: !942, line: 565, type: !607)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 96, elements: !988)
!988 = !{!989}
!989 = !DISubrange(count: 12)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "log_const_log_uart", scope: !992, file: !1049, line: 16, type: !1177, isLocal: false, isDefinition: true)
!992 = distinct !DICompileUnit(language: DW_LANG_C99, file: !993, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !696, retainedTypes: !994, globals: !1046, splitDebugInlining: false, nameTableKind: None)
!993 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/led_lp503x")
!994 = !{!108, !123, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !998, line: 336, size: 160, elements: !999)
!998 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!999 = !{!1000, !1020, !1024, !1028, !1041}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !997, file: !998, line: 365, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!123, !1004, !1019}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !167, line: 378, size: 192, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1017, !1018}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1006, file: !167, line: 380, baseType: !170, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1006, file: !167, line: 382, baseType: !13, size: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1006, file: !167, line: 384, baseType: !13, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1006, file: !167, line: 386, baseType: !1012, size: 32, offset: 96)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !167, line: 351, size: 16, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1013, file: !167, line: 359, baseType: !117, size: 8)
