; ModuleID = 'build/96b_carbon_nrf51/subsys/zbus/hello_world/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.version_msg = type { i8, i8, i16 }
%struct.zbus_observer = type { i8*, i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !27, file: !114, line: 25, type: !141, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !289, !291, !293, !295, !297, !299, !301, !303, !334, !338, !343, !348, !350, !352, !359, !364, !371, !376, !378}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "version_chan", scope: !27, file: !114, line: 25, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 224, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !124, !128, !130, !131, !139, !258}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !117, line: 32, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !125, size: 16, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !127)
!127 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !129, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !129, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !132, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !13, !137}
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 214, baseType: !32)
!138 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !142, line: 2720, size: 160, elements: !143)
!142 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !165, !256, !257}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !141, file: !142, line: 2722, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !147, file: !146, line: 232, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !153)
!153 = !{!154, !160}
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 38, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 38, size: 32, elements: !156)
!156 = !{!157, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !155, file: !151, line: 39, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !151, line: 40, baseType: !158, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 42, baseType: !161, size: 32, offset: 32)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 42, size: 32, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !161, file: !151, line: 43, baseType: !158, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !151, line: 44, baseType: !158, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !141, file: !142, line: 2724, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 896, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170, !217, !230, !231, !232, !233, !251}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !167, file: !168, line: 247, baseType: !171, size: 384)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !172)
!172 = !{!173, !187, !189, !192, !193, !204, !205, !206}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 60, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 60, size: 64, elements: !175)
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !174, file: !168, line: 61, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !174, file: !168, line: 62, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !179, file: !180, line: 50, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !185)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!185 = !{!186}
!186 = !DISubrange(count: 2)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !171, file: !168, line: 68, baseType: !188, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !171, file: !168, line: 71, baseType: !190, size: 8, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !191)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !171, file: !168, line: 74, baseType: !190, size: 8, offset: 104)
!193 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 90, baseType: !194, size: 16, offset: 112)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 90, size: 16, elements: !195)
!195 = !{!196, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, scope: !194, file: !168, line: 91, baseType: !197, size: 16)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !194, file: !168, line: 91, size: 16, elements: !198)
!198 = !{!199, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !197, file: !168, line: 96, baseType: !200, size: 8)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !201)
!201 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !197, file: !168, line: 97, baseType: !190, size: 8, offset: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !194, file: !168, line: 100, baseType: !126, size: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !171, file: !168, line: 107, baseType: !108, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !171, file: !168, line: 127, baseType: !106, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !171, file: !168, line: 131, baseType: !207, size: 192, offset: 192)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !208)
!208 = !{!209, !210, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !207, file: !146, line: 245, baseType: !177, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !207, file: !146, line: 246, baseType: !211, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !207, file: !146, line: 249, baseType: !104, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !167, file: !168, line: 250, baseType: !218, size: 288, offset: 384)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !219, line: 25, size: 288, elements: !220)
!219 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !218, file: !219, line: 26, baseType: !108, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !218, file: !219, line: 27, baseType: !108, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !218, file: !219, line: 28, baseType: !108, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !218, file: !219, line: 29, baseType: !108, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !218, file: !219, line: 30, baseType: !108, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !218, file: !219, line: 31, baseType: !108, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !218, file: !219, line: 32, baseType: !108, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !218, file: !219, line: 33, baseType: !108, size: 32, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !218, file: !219, line: 34, baseType: !108, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !167, file: !168, line: 253, baseType: !106, size: 32, offset: 672)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !167, file: !168, line: 256, baseType: !145, size: 64, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !167, file: !168, line: 294, baseType: !107, size: 32, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !167, file: !168, line: 325, baseType: !234, size: 32, offset: 800)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 160, elements: !236)
!236 = !{!237, !246, !247}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !235, file: !142, line: 5074, baseType: !238, size: 96)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !239, line: 56, size: 96, elements: !240)
!239 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = !{!241, !244, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !238, file: !239, line: 57, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !239, line: 57, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !238, file: !239, line: 58, baseType: !106, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !238, file: !239, line: 59, baseType: !137, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !235, file: !142, line: 5075, baseType: !145, size: 64, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !235, file: !142, line: 5076, baseType: !248, offset: 160)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !167, file: !168, line: 343, baseType: !252, size: 64, offset: 832)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !219, line: 60, size: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !252, file: !219, line: 63, baseType: !108, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !252, file: !219, line: 66, baseType: !108, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !141, file: !142, line: 2727, baseType: !108, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !141, file: !142, line: 2730, baseType: !107, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !259, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 128, elements: !264)
!264 = !{!265, !266, !267, !283}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !117, line: 88, baseType: !120, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !263, file: !117, line: 91, baseType: !136, size: 8, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !263, file: !117, line: 93, baseType: !268, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !142, line: 4204, size: 320, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !278, !279, !280, !281, !282}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !270, file: !142, line: 4206, baseType: !145, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !270, file: !142, line: 4208, baseType: !248, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !270, file: !142, line: 4210, baseType: !137, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !270, file: !142, line: 4212, baseType: !108, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !270, file: !142, line: 4214, baseType: !277, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !270, file: !142, line: 4216, baseType: !277, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !270, file: !142, line: 4218, baseType: !277, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !270, file: !142, line: 4220, baseType: !277, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !270, file: !142, line: 4222, baseType: !108, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !270, file: !142, line: 4227, baseType: !190, size: 8, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !263, file: !117, line: 96, baseType: !284, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "_zbus_mutex_acc_data_chan", scope: !27, file: !114, line: 35, type: !141, isLocal: true, isDefinition: true, align: 32)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "acc_data_chan", scope: !27, file: !114, line: 35, type: !115, isLocal: false, isDefinition: true, align: 32)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "_zbus_mutex_simple_chan", scope: !27, file: !114, line: 57, type: !141, isLocal: true, isDefinition: true, align: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "simple_chan", scope: !27, file: !114, line: 57, type: !115, isLocal: false, isDefinition: true, align: 32)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "foo_lis", scope: !27, file: !114, line: 73, type: !263, isLocal: false, isDefinition: true, align: 32)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !270, isLocal: false, isDefinition: true, align: 32)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "bar_sub", scope: !27, file: !114, line: 75, type: !263, isLocal: false, isDefinition: true, align: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "_k_thread_data_subscriber_task_id", scope: !27, file: !114, line: 92, type: !305, isLocal: false, isDefinition: true, align: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !142, line: 620, size: 384, elements: !306)
!306 = !{!307, !308, !316, !317, !322, !323, !324, !325, !326, !327, !329, !333}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !305, file: !142, line: 621, baseType: !166, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !305, file: !142, line: 622, baseType: !309, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !311, line: 44, baseType: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !313, line: 47, size: 8, elements: !314)
!313 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !313, line: 48, baseType: !123, size: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !305, file: !142, line: 623, baseType: !32, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !305, file: !142, line: 624, baseType: !318, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !311, line: 46, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !106, !106, !106}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !305, file: !142, line: 625, baseType: !106, size: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !305, file: !142, line: 626, baseType: !106, size: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !305, file: !142, line: 627, baseType: !106, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !305, file: !142, line: 628, baseType: !107, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !305, file: !142, line: 629, baseType: !108, size: 32, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !305, file: !142, line: 630, baseType: !328, size: 32, offset: 288)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !305, file: !142, line: 631, baseType: !330, size: 32, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DISubroutineType(types: !332)
!332 = !{null}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !305, file: !142, line: 632, baseType: !121, size: 32, offset: 352)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "subscriber_task_id", scope: !27, file: !114, line: 92, type: !336, isLocal: false, isDefinition: true)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !168, line: 347, baseType: !166)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !340, isLocal: true, isDefinition: true, align: 32)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 16)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "_k_thread_stack_subscriber_task_id", scope: !27, file: !114, line: 92, type: !345, isLocal: false, isDefinition: true, align: 64)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 4096, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 512)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_k_thread_obj_subscriber_task_id", scope: !27, file: !114, line: 92, type: !167, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 95, type: !107, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !27, file: !114, line: 25, type: !354, isLocal: true, isDefinition: true)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !114, line: 13, size: 32, elements: !355)
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !354, file: !114, line: 14, baseType: !190, size: 8)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !354, file: !114, line: 15, baseType: !190, size: 8, offset: 8)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !354, file: !114, line: 16, baseType: !126, size: 16, offset: 16)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !27, file: !114, line: 25, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 1)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "_zbus_message_acc_data_chan", scope: !27, file: !114, line: 35, type: !366, isLocal: true, isDefinition: true)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acc_msg", file: !114, line: 19, size: 96, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !366, file: !114, line: 20, baseType: !107, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !366, file: !114, line: 21, baseType: !107, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !366, file: !114, line: 22, baseType: !107, size: 32, offset: 64)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "_zbus_observers_acc_data_chan", scope: !27, file: !114, line: 35, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 96, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 3)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "_zbus_message_simple_chan", scope: !27, file: !114, line: 57, type: !107, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "_zbus_observers_simple_chan", scope: !27, file: !114, line: 57, type: !361, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !382, file: !397, line: 18, type: !398, isLocal: false, isDefinition: true)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !384, globals: !396, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!384 = !{!22, !106, !24, !385, !387, !389, !137, !107, !390, !391, !393, !394, !277, !395, !126, !121}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!396 = !{!380}
!397 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !400, line: 16, size: 64, elements: !401)
!400 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !400, line: 17, baseType: !121, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !399, file: !400, line: 18, baseType: !190, size: 8, offset: 32)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "_char_out", scope: !406, file: !410, line: 54, type: !411, isLocal: false, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !408, globals: !409, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!408 = !{!106, !107}
!409 = !{!404}
!410 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DISubroutineType(types: !413)
!413 = !{!107, !107}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !416, file: !450, line: 22, type: !478, isLocal: false, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !418, retainedTypes: !430, globals: !447, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!418 = !{!419, !30}
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !420, line: 27, baseType: !32, size: 32, elements: !421)
!420 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429}
!422 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!423 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!424 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!425 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!426 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!427 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!428 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!429 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!430 = !{!106, !102, !107, !24, !431, !277, !108, !109}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !433, line: 54, size: 96, elements: !434)
!433 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!434 = !{!435, !442, !446}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !432, file: !433, line: 55, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !437, line: 33, baseType: !438)
!437 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !437, line: 29, size: 32, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !438, file: !437, line: 30, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !432, file: !433, line: 60, baseType: !443, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !419}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !432, file: !433, line: 65, baseType: !443, size: 32, offset: 64)
!447 = !{!414, !448, !454, !457, !459, !468, !470}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !416, file: !450, line: 27, type: !451, isLocal: true, isDefinition: true)
!450 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 32, elements: !362)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !453, line: 22, baseType: !392)
!453 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !416, file: !450, line: 44, type: !456, isLocal: true, isDefinition: true)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !416, file: !450, line: 49, type: !456, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !416, file: !450, line: 36, type: !461, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 128, elements: !362)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !420, line: 114, size: 128, elements: !463)
!463 = !{!464, !465, !466, !467}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !462, file: !420, line: 115, baseType: !419, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !462, file: !420, line: 141, baseType: !190, size: 8, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !462, file: !420, line: 149, baseType: !108, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !462, file: !420, line: 156, baseType: !108, size: 32, offset: 96)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !416, file: !450, line: 40, type: !461, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !416, file: !450, line: 28, type: !472, isLocal: true, isDefinition: true)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !437, line: 40, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !437, line: 35, size: 64, elements: !474)
!474 = !{!475, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !473, file: !437, line: 36, baseType: !476, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !473, file: !437, line: 37, baseType: !476, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !400, line: 16, size: 64, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !479, file: !400, line: 17, baseType: !121, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !479, file: !400, line: 18, baseType: !190, size: 8, offset: 32)
!483 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!484 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !487, file: !515, line: 50, type: !328, isLocal: true, isDefinition: true)
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !418, retainedTypes: !489, globals: !512, splitDebugInlining: false, nameTableKind: None)
!488 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!489 = !{!490, !102, !137, !107, !106, !108, !109, !492, !277, !328, !503}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !491)
!491 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !494, line: 45, size: 64, elements: !495)
!494 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!495 = !{!496, !502}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !493, file: !494, line: 46, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !437, line: 33, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !437, line: 29, size: 32, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !498, file: !437, line: 30, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !493, file: !494, line: 48, baseType: !108, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !494, line: 38, size: 64, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !504, file: !494, line: 39, baseType: !497, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !504, file: !494, line: 41, baseType: !508, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !494, line: 35, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !328}
!512 = !{!513, !517, !525, !485, !527, !537}
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "latency_lock", scope: !487, file: !515, line: 44, type: !516, isLocal: true, isDefinition: true)
!515 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !487, file: !515, line: 46, type: !519, isLocal: true, isDefinition: true)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !437, line: 40, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !437, line: 35, size: 64, elements: !521)
!521 = !{!522, !524}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !520, file: !437, line: 36, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !520, file: !437, line: 37, baseType: !523, size: 32, offset: 32)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "latency_subs", scope: !487, file: !515, line: 52, type: !519, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !487, file: !515, line: 39, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, elements: !535)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !515, line: 35, size: 96, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !530, file: !515, line: 36, baseType: !419, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !530, file: !515, line: 37, baseType: !190, size: 8, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !530, file: !515, line: 38, baseType: !452, size: 32, offset: 64)
!535 = !{!536}
!536 = !DISubrange(count: 0)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !487, file: !515, line: 48, type: !328, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !541, file: !548, line: 47, type: !562, isLocal: true, isDefinition: true)
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !543, retainedTypes: !544, globals: !545, splitDebugInlining: false, nameTableKind: None)
!542 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!543 = !{!419}
!544 = !{!137, !107}
!545 = !{!546, !539, !558}
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "cpus_states", scope: !541, file: !548, line: 50, type: !549, isLocal: true, isDefinition: true)
!548 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 32, elements: !362)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !420, line: 114, size: 128, elements: !553)
!553 = !{!554, !555, !556, !557}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !552, file: !420, line: 115, baseType: !419, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !552, file: !420, line: 141, baseType: !190, size: 8, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !552, file: !420, line: 149, baseType: !108, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !552, file: !420, line: 156, baseType: !108, size: 32, offset: 96)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !541, file: !548, line: 55, type: !560, isLocal: true, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 8, elements: !362)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, elements: !535)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !565, file: !572, line: 21, type: !411, isLocal: true, isDefinition: true)
!565 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !567, globals: !571, splitDebugInlining: false, nameTableKind: None)
!566 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!567 = !{!568, !107, !106}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !570, line: 22, baseType: !107)
!570 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!571 = !{!563}
!572 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !575, file: !672, line: 31, type: !688, isLocal: false, isDefinition: true)
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !577, globals: !669, splitDebugInlining: false, nameTableKind: None)
!576 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!577 = !{!578, !190, !106, !107, !642, !643, !658, !108}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !580, line: 247, baseType: !581)
!580 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 216, size: 20576, elements: !582)
!582 = !{!583, !589, !590, !591, !595, !596, !600, !601, !602, !606, !607, !611, !612, !616, !617, !619, !620, !622, !623, !624, !625, !629, !630, !631, !632, !636, !637, !641}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !581, file: !580, line: 217, baseType: !584, size: 960)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 960, elements: !587)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!587 = !{!588}
!588 = !DISubrange(count: 30)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !581, file: !580, line: 218, baseType: !586, size: 32, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !581, file: !580, line: 219, baseType: !586, size: 32, offset: 992)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !581, file: !580, line: 220, baseType: !592, size: 1088, offset: 1024)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 1088, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 34)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !581, file: !580, line: 221, baseType: !586, size: 32, offset: 2112)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !581, file: !580, line: 222, baseType: !597, size: 4032, offset: 2144)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 4032, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 126)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !581, file: !580, line: 223, baseType: !586, size: 32, offset: 6176)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !581, file: !580, line: 224, baseType: !586, size: 32, offset: 6208)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !581, file: !580, line: 225, baseType: !603, size: 1952, offset: 6240)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 1952, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 61)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !581, file: !580, line: 226, baseType: !586, size: 32, offset: 8192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !581, file: !580, line: 227, baseType: !608, size: 288, offset: 8224)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 288, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 9)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !581, file: !580, line: 228, baseType: !585, size: 32, offset: 8512)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !581, file: !580, line: 229, baseType: !613, size: 1696, offset: 8544)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 1696, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 53)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !581, file: !580, line: 230, baseType: !586, size: 32, offset: 10240)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !581, file: !580, line: 231, baseType: !618, size: 96, offset: 10272)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 96, elements: !374)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !581, file: !580, line: 232, baseType: !586, size: 32, offset: 10368)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !581, file: !580, line: 233, baseType: !621, size: 64, offset: 10400)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 64, elements: !185)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !581, file: !580, line: 234, baseType: !586, size: 32, offset: 10464)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !581, file: !580, line: 236, baseType: !585, size: 32, offset: 10496)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !581, file: !580, line: 237, baseType: !586, size: 32, offset: 10528)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !581, file: !580, line: 238, baseType: !626, size: 224, offset: 10560)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 224, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 7)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !581, file: !580, line: 239, baseType: !586, size: 32, offset: 10784)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !581, file: !580, line: 241, baseType: !618, size: 96, offset: 10816)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !581, file: !580, line: 242, baseType: !586, size: 32, offset: 10912)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !581, file: !580, line: 243, baseType: !633, size: 256, offset: 10944)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 256, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 8)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !581, file: !580, line: 244, baseType: !586, size: 32, offset: 11200)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !581, file: !580, line: 245, baseType: !638, size: 9312, offset: 11232)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 9312, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 291)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !581, file: !580, line: 246, baseType: !586, size: 32, offset: 20544)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !645, line: 352, baseType: !646)
!645 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !645, line: 341, size: 320, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !657}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !646, file: !645, line: 343, baseType: !585, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !646, file: !645, line: 344, baseType: !586, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !646, file: !645, line: 345, baseType: !108, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !646, file: !645, line: 346, baseType: !586, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !646, file: !645, line: 347, baseType: !586, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !646, file: !645, line: 348, baseType: !586, size: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !646, file: !645, line: 349, baseType: !108, size: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !646, file: !645, line: 350, baseType: !656, size: 64, offset: 224)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 64, elements: !185)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !646, file: !645, line: 351, baseType: !586, size: 32, offset: 288)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !660, file: !659, line: 167, baseType: !668)
!659 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!660 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !659, file: !659, line: 134, type: !661, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !575, retainedNodes: !663)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !108}
!663 = !{!664, !665, !667}
!664 = !DILocalVariable(name: "time_us", arg: 1, scope: !660, file: !659, line: 134, type: !108)
!665 = !DILocalVariable(name: "delay_cycles", scope: !660, file: !659, line: 168, type: !666)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !658)
!667 = !DILocalVariable(name: "cycles", scope: !660, file: !659, line: 171, type: !108)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!669 = !{!573, !670, !685}
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !575, file: !672, line: 71, type: !673, isLocal: true, isDefinition: true, align: 32)
!672 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !675, line: 51, size: 64, elements: !676)
!675 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!676 = !{!677, !684}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !674, file: !675, line: 60, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DISubroutineType(types: !680)
!680 = !{!107, !681}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !675, line: 48, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !674, file: !675, line: 65, baseType: !681, size: 32, offset: 32)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !660, file: !659, line: 161, type: !687, isLocal: true, isDefinition: true, align: 128)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 48, elements: !374)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !400, line: 16, size: 64, elements: !690)
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !689, file: !400, line: 17, baseType: !121, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !689, file: !400, line: 18, baseType: !190, size: 8, offset: 32)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !695, file: !699, line: 10, type: !700, isLocal: false, isDefinition: true)
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !697, globals: !698, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!697 = !{!102, !106, !107}
!698 = !{!693}
!699 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !400, line: 16, size: 64, elements: !702)
!702 = !{!703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !701, file: !400, line: 17, baseType: !121, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !701, file: !400, line: 18, baseType: !190, size: 8, offset: 32)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !707, file: !904, line: 18, type: !1133, isLocal: false, isDefinition: true)
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !709, retainedTypes: !824, globals: !900, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon_nrf51/subsys/zbus/hello_world")
!709 = !{!710, !716, !30, !721, !726, !731, !737, !743, !752, !756, !789, !796, !815}
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !711, line: 23, baseType: !32, size: 32, elements: !712)
!711 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !{!713, !714, !715}
!713 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!714 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!715 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!716 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !711, line: 48, baseType: !32, size: 32, elements: !717)
!717 = !{!718, !719, !720}
!718 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!719 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!720 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!721 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !722, line: 167, baseType: !32, size: 32, elements: !723)
!722 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!723 = !{!724, !725}
!724 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!725 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !722, line: 107, baseType: !32, size: 32, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!729 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!730 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !722, line: 208, baseType: !32, size: 32, elements: !732)
!732 = !{!733, !734, !735, !736}
!733 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!734 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!735 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!736 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!737 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !722, line: 261, baseType: !32, size: 32, elements: !738)
!738 = !{!739, !740, !741, !742}
!739 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!740 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!741 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!742 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!743 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !722, line: 237, baseType: !32, size: 32, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750, !751}
!745 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!746 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!747 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!748 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!749 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!750 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!751 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !722, line: 152, baseType: !32, size: 32, elements: !753)
!753 = !{!754, !755}
!754 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!755 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!756 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !580, line: 71, baseType: !107, size: 32, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788}
!758 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!759 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!760 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!761 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!762 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!763 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!764 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!765 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!766 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!767 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!768 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!769 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!770 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!771 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!772 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!773 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!774 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!775 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!776 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!777 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!778 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!779 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!780 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!781 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!782 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!783 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!784 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!785 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!786 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!787 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!788 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !790, line: 44, baseType: !32, size: 32, elements: !791)
!790 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!791 = !{!792, !793, !794, !795}
!792 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!793 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!794 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!795 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!796 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !797, line: 54, baseType: !32, size: 32, elements: !798)
!797 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!799 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!800 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!801 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!802 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!803 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!804 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!805 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!806 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!807 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!808 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!809 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!810 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!811 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!812 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!813 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!814 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!815 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !816, line: 53, baseType: !32, size: 32, elements: !817)
!816 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!817 = !{!818, !819, !820, !821, !822, !823}
!818 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!819 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!820 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!821 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!822 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!823 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!824 = !{!710, !106, !107, !825, !873, !874, !875, !876, !102, !108, !109, !136, !642, !395, !328, !877, !899, !137}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !580, line: 291, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 260, size: 10912, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !840, !841, !842, !843, !844, !845, !849, !850, !851, !855, !856, !857, !858, !859, !860, !861, !865, !866, !867, !868, !872}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !827, file: !580, line: 261, baseType: !586, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !827, file: !580, line: 262, baseType: !586, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !827, file: !580, line: 263, baseType: !586, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !827, file: !580, line: 264, baseType: !586, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !827, file: !580, line: 265, baseType: !586, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !827, file: !580, line: 266, baseType: !586, size: 32, offset: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !827, file: !580, line: 267, baseType: !586, size: 32, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !827, file: !580, line: 268, baseType: !837, size: 1824, offset: 224)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 1824, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 57)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !827, file: !580, line: 269, baseType: !586, size: 32, offset: 2048)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !827, file: !580, line: 270, baseType: !586, size: 32, offset: 2080)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !827, file: !580, line: 271, baseType: !585, size: 32, offset: 2112)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !827, file: !580, line: 272, baseType: !586, size: 32, offset: 2144)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !827, file: !580, line: 273, baseType: !586, size: 32, offset: 2176)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !827, file: !580, line: 274, baseType: !846, size: 3968, offset: 2208)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 3968, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 124)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !827, file: !580, line: 275, baseType: !586, size: 32, offset: 6176)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !827, file: !580, line: 276, baseType: !586, size: 32, offset: 6208)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !827, file: !580, line: 277, baseType: !852, size: 2016, offset: 6240)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 2016, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 63)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !827, file: !580, line: 278, baseType: !585, size: 32, offset: 8256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !827, file: !580, line: 279, baseType: !585, size: 32, offset: 8288)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !827, file: !580, line: 280, baseType: !585, size: 32, offset: 8320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !827, file: !580, line: 281, baseType: !585, size: 32, offset: 8352)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !827, file: !580, line: 282, baseType: !585, size: 32, offset: 8384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !827, file: !580, line: 283, baseType: !585, size: 32, offset: 8416)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !827, file: !580, line: 285, baseType: !862, size: 1984, offset: 8448)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 1984, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 62)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !827, file: !580, line: 286, baseType: !586, size: 32, offset: 10432)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !827, file: !580, line: 287, baseType: !626, size: 224, offset: 10464)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !827, file: !580, line: 288, baseType: !586, size: 32, offset: 10688)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !827, file: !580, line: 289, baseType: !869, size: 160, offset: 10720)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 160, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 5)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "XTALFREQ", scope: !827, file: !580, line: 290, baseType: !586, size: 32, offset: 10880)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !722, line: 146, baseType: !726)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !722, line: 164, baseType: !752)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !645, line: 326, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !645, line: 314, size: 6400, elements: !880)
!880 = !{!881, !883, !887, !888, !889, !890, !891, !892, !893, !897}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !879, file: !645, line: 316, baseType: !882, size: 32)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 32, elements: !362)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !879, file: !645, line: 317, baseType: !884, size: 992, offset: 32)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 992, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 31)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !879, file: !645, line: 318, baseType: !882, size: 32, offset: 1024)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !879, file: !645, line: 319, baseType: !884, size: 992, offset: 1056)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !879, file: !645, line: 320, baseType: !882, size: 32, offset: 2048)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !879, file: !645, line: 321, baseType: !884, size: 992, offset: 2080)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !879, file: !645, line: 322, baseType: !882, size: 32, offset: 3072)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !879, file: !645, line: 323, baseType: !884, size: 992, offset: 3104)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !879, file: !645, line: 324, baseType: !894, size: 2048, offset: 4096)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 2048, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !879, file: !645, line: 325, baseType: !898, size: 256, offset: 6144)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 256, elements: !634)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !790, line: 56, baseType: !106)
!900 = !{!705, !901, !951, !992, !998, !1015, !1026, !1028, !1045, !1047, !1057, !1060, !1073, !1111, !1125}
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "on", scope: !903, file: !904, line: 549, type: !452, isLocal: true, isDefinition: true)
!903 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !904, file: !904, line: 547, type: !905, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !707, retainedNodes: !907)
!904 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!905 = !DISubroutineType(types: !906)
!906 = !{null, !716}
!907 = !{!908, !909, !912}
!908 = !DILocalVariable(name: "start_mode", arg: 1, scope: !903, file: !904, line: 547, type: !716)
!909 = !DILocalVariable(name: "err", scope: !910, file: !904, line: 553, type: !107)
!910 = distinct !DILexicalBlock(scope: !911, file: !904, line: 552, column: 31)
!911 = distinct !DILexicalBlock(scope: !903, file: !904, line: 552, column: 6)
!912 = !DILocalVariable(name: "mgr", scope: !910, file: !904, line: 554, type: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !915, line: 154, size: 224, elements: !916)
!915 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!916 = !{!917, !929, !930, !946, !948, !949, !950}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !914, file: !915, line: 158, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !437, line: 40, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !437, line: 35, size: 64, elements: !920)
!920 = !{!921, !928}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !919, file: !437, line: 36, baseType: !922, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !437, line: 33, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !437, line: 29, size: 32, elements: !925)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !924, file: !437, line: 30, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !919, file: !437, line: 37, baseType: !922, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !914, file: !915, line: 163, baseType: !918, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !914, file: !915, line: 166, baseType: !931, size: 32, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !915, line: 133, size: 96, elements: !934)
!934 = !{!935, !944, !945}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !933, file: !915, line: 135, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !915, line: 129, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !913, !940}
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !915, line: 101, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !913, !107}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !933, file: !915, line: 138, baseType: !936, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !933, file: !915, line: 143, baseType: !936, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !914, file: !915, line: 169, baseType: !947, offset: 160)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !914, file: !915, line: 172, baseType: !107, size: 32, offset: 160)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !914, file: !915, line: 175, baseType: !126, size: 16, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !914, file: !915, line: 178, baseType: !126, size: 16, offset: 208)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "cli", scope: !903, file: !904, line: 550, type: !953, isLocal: true, isDefinition: true)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !915, line: 273, size: 128, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !953, file: !915, line: 280, baseType: !923, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !953, file: !915, line: 283, baseType: !957, size: 96, offset: 32)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !958, line: 138, size: 96, elements: !959)
!958 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!959 = !{!960, !989, !990}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !957, file: !958, line: 149, baseType: !961, size: 32)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !958, line: 139, size: 32, elements: !962)
!962 = !{!963, !984}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !961, file: !958, line: 145, baseType: !964, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !142, line: 5397, size: 128, elements: !966)
!966 = !{!967, !982, !983}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !965, file: !142, line: 5399, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !970)
!970 = !{!971, !977}
!971 = !DIDerivedType(tag: DW_TAG_member, scope: !969, file: !151, line: 38, baseType: !972, size: 32)
!972 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !969, file: !151, line: 38, size: 32, elements: !973)
!973 = !{!974, !976}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !972, file: !151, line: 39, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !972, file: !151, line: 40, baseType: !975, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, scope: !969, file: !151, line: 42, baseType: !978, size: 32, offset: 32)
!978 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !969, file: !151, line: 42, size: 32, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !978, file: !151, line: 43, baseType: !975, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !978, file: !151, line: 44, baseType: !975, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !965, file: !142, line: 5405, baseType: !32, size: 32, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !965, file: !142, line: 5408, baseType: !107, size: 32, offset: 96)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !961, file: !958, line: 148, baseType: !985, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !958, line: 98, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{null, null}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !957, file: !958, line: 165, baseType: !586, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !957, file: !958, line: 174, baseType: !991, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !107)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !707, file: !904, line: 733, type: !994, isLocal: false, isDefinition: true, align: 16)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 80, elements: !870)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !997, line: 43, baseType: !490)
!997 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !707, file: !904, line: 733, type: !1000, isLocal: false, isDefinition: true, align: 32)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !997, line: 378, size: 192, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1012, !1013}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1001, file: !997, line: 380, baseType: !121, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1001, file: !997, line: 382, baseType: !13, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1001, file: !997, line: 384, baseType: !13, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1001, file: !997, line: 386, baseType: !1007, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !997, line: 351, size: 16, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1008, file: !997, line: 359, baseType: !190, size: 8)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1008, file: !997, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1001, file: !997, line: 388, baseType: !106, size: 32, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1001, file: !997, line: 396, baseType: !1014, size: 32, offset: 160)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !707, file: !904, line: 733, type: !1017, isLocal: true, isDefinition: true, align: 32)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !675, line: 51, size: 64, elements: !1019)
!1019 = !{!1020, !1025}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1018, file: !675, line: 60, baseType: !1021, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!107, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1018, file: !675, line: 65, baseType: !1024, size: 32, offset: 32)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !707, file: !904, line: 79, type: !452, isLocal: true, isDefinition: true)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(name: "data", scope: !707, file: !904, line: 702, type: !1030, isLocal: true, isDefinition: true)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !904, line: 69, size: 640, elements: !1031)
!1031 = !{!1032, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1030, file: !904, line: 70, baseType: !1033, size: 448)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 448, elements: !185)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1030, file: !904, line: 71, baseType: !1035, size: 192, offset: 448)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1036, size: 192, elements: !185)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !904, line: 52, size: 96, elements: !1037)
!1037 = !{!1038, !1043, !1044}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1036, file: !904, line: 53, baseType: !1039, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !790, line: 72, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !1024, !899, !106}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1036, file: !904, line: 54, baseType: !106, size: 32, offset: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1036, file: !904, line: 55, baseType: !108, size: 32, offset: 64)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_23", scope: !707, file: !904, line: 733, type: !1008, isLocal: true, isDefinition: true, align: 8)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
