; ModuleID = 'build/96b_carbon_nrf51/crypto/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.mode_test = type { i8*, void (%struct.device*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !294, line: 18, type: !371, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !123, globals: !290, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!29 = !{!30, !39, !42, !46, !116}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_mode", file: !31, line: 44, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/crypto/cipher.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38}
!34 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_ECB", value: 1)
!35 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CBC", value: 2)
!36 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CTR", value: 3)
!37 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CCM", value: 4)
!38 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_GCM", value: 5)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_algo", file: !31, line: 29, baseType: !32, size: 32, elements: !40)
!40 = !{!41}
!41 = !DIEnumerator(name: "CRYPTO_CIPHER_ALGO_AES", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_op", file: !31, line: 34, baseType: !32, size: 32, elements: !43)
!43 = !{!44, !45}
!44 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_DECRYPT", value: 0)
!45 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_ENCRYPT", value: 1)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !47, line: 27, baseType: !32, size: 32, elements: !48)
!47 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!49 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!50 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!51 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!52 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!53 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!54 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!55 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!56 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!57 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!58 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!59 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!60 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!61 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!62 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!63 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!64 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!65 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!115 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hash_algo", file: !117, line: 26, baseType: !32, size: 32, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/crypto/hash.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !120, !121, !122}
!119 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA224", value: 1)
!120 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA256", value: 2)
!121 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA384", value: 3)
!122 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA512", value: 4)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_driver_api", file: !128, line: 65, size: 224, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/crypto/crypto.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !161, !241, !245, !253, !278, !282}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "query_hw_caps", scope: !127, file: !128, line: 66, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DISubroutineType(types: !133)
!133 = !{!125, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !143, !144, !145, !154, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !137, line: 380, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !136, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !136, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !136, file: !137, line: 386, baseType: !146, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !148)
!148 = !{!149, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !147, file: !137, line: 359, baseType: !150, size: 8)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !151)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !147, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!153 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !136, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !137, line: 43, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !160)
!160 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_begin_session", scope: !127, file: !128, line: 69, baseType: !162, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!125, !134, !165, !39, !30, !42}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ctx", file: !31, line: 110, size: 256, elements: !167)
!167 = !{!168, !212, !217, !218, !219, !220, !239, !240}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !166, file: !31, line: 116, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ops", file: !31, line: 74, size: 64, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_mode", scope: !169, file: !31, line: 76, baseType: !30, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !31, line: 78, baseType: !173, size: 32, offset: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !31, line: 78, size: 32, elements: !174)
!174 = !{!175, !190, !195, !197, !210}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "block_crypt_hndlr", scope: !173, file: !31, line: 79, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_op_t", file: !31, line: 57, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!125, !165, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_pkt", file: !31, line: 180, size: 192, elements: !182)
!182 = !{!183, !185, !186, !187, !188, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !181, file: !31, line: 183, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !181, file: !31, line: 186, baseType: !125, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !181, file: !31, line: 192, baseType: !184, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf_max", scope: !181, file: !31, line: 197, baseType: !125, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !181, file: !31, line: 202, baseType: !125, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !181, file: !31, line: 208, baseType: !165, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_crypt_hndlr", scope: !173, file: !31, line: 80, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbc_op_t", file: !31, line: 62, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{!125, !165, !180, !184}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_crypt_hndlr", scope: !173, file: !31, line: 81, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctr_op_t", file: !31, line: 65, baseType: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_crypt_hndlr", scope: !173, file: !31, line: 82, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ccm_op_t", file: !31, line: 68, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!125, !165, !202, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_aead_pkt", file: !31, line: 217, size: 128, elements: !204)
!204 = !{!205, !206, !207, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt", scope: !203, file: !31, line: 219, baseType: !180, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !203, file: !31, line: 224, baseType: !184, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ad_len", scope: !203, file: !31, line: 227, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !203, file: !31, line: 233, baseType: !184, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_crypt_hndlr", scope: !173, file: !31, line: 83, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcm_op_t", file: !31, line: 71, baseType: !199)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !166, file: !31, line: 126, baseType: !213, size: 32, offset: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 119, size: 32, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bit_stream", scope: !213, file: !31, line: 121, baseType: !184, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !213, file: !31, line: 125, baseType: !124, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !166, file: !31, line: 131, baseType: !134, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !166, file: !31, line: 140, baseType: !124, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "app_sessn_state", scope: !166, file: !31, line: 146, baseType: !124, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mode_params", scope: !166, file: !31, line: 156, baseType: !221, size: 32, offset: 192)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 152, size: 32, elements: !222)
!222 = !{!223, !230, !234}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_info", scope: !221, file: !31, line: 153, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ccm_params", file: !31, line: 87, size: 32, elements: !225)
!225 = !{!226, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !224, file: !31, line: 88, baseType: !227, size: 16)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !224, file: !31, line: 89, baseType: !227, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_info", scope: !221, file: !31, line: 154, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctr_params", file: !31, line: 92, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_len", scope: !231, file: !31, line: 96, baseType: !208, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_info", scope: !221, file: !31, line: 155, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcm_params", file: !31, line: 99, size: 32, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !235, file: !31, line: 100, baseType: !227, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !235, file: !31, line: 101, baseType: !227, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !166, file: !31, line: 161, baseType: !227, size: 16, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !166, file: !31, line: 169, baseType: !227, size: 16, offset: 240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_free_session", scope: !127, file: !128, line: 74, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{!125, !134, !165}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_async_callback_set", scope: !127, file: !128, line: 77, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!125, !134, !249}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_completion_cb", file: !31, line: 242, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !180, !125}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hash_begin_session", scope: !127, file: !128, line: 81, baseType: !254, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!125, !134, !257, !116}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_ctx", file: !117, line: 47, size: 128, elements: !259)
!259 = !{!260, !261, !262, !276, !277}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !258, file: !117, line: 51, baseType: !134, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !258, file: !117, line: 60, baseType: !124, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hash_hndlr", scope: !258, file: !117, line: 65, baseType: !263, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_op_t", file: !117, line: 38, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{!125, !257, !267, !153}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_pkt", file: !117, line: 88, size: 128, elements: !269)
!269 = !{!270, !271, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !268, file: !117, line: 91, baseType: !184, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !268, file: !117, line: 94, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !268, file: !117, line: 101, baseType: !184, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !268, file: !117, line: 107, baseType: !257, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "started", scope: !258, file: !117, line: 70, baseType: !153, size: 8, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !117, line: 78, baseType: !227, size: 16, offset: 112)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hash_free_session", scope: !127, file: !128, line: 84, baseType: !279, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{!125, !134, !257}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "hash_async_callback_set", scope: !127, file: !128, line: 86, baseType: !283, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!125, !134, !286}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_completion_cb", file: !117, line: 114, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !267, !125}
!290 = !{!25, !291, !314, !316, !318, !320, !324, !327, !329, !334, !339, !344, !349, !351, !356, !361, !366}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "iv", scope: !293, file: !294, line: 227, type: !311, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "cbc_mode", scope: !294, file: !294, line: 205, type: !295, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !297)
!294 = !DIFile(filename: "zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !DISubroutineType(types: !296)
!296 = !{null, !134}
!297 = !{!298, !299, !303, !307, !308, !309, !310}
!298 = !DILocalVariable(name: "dev", arg: 1, scope: !293, file: !294, line: 205, type: !134)
!299 = !DILocalVariable(name: "encrypted", scope: !293, file: !294, line: 207, type: !300)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 640, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 80)
!303 = !DILocalVariable(name: "decrypted", scope: !293, file: !294, line: 208, type: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 64)
!307 = !DILocalVariable(name: "ini", scope: !293, file: !294, line: 209, type: !166)
!308 = !DILocalVariable(name: "encrypt", scope: !293, file: !294, line: 214, type: !181)
!309 = !DILocalVariable(name: "decrypt", scope: !293, file: !294, line: 220, type: !181)
!310 = !DILabel(scope: !293, name: "out", file: !294, line: 279)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 16)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "cap_flags", scope: !27, file: !294, line: 48, type: !208, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "key", scope: !27, file: !294, line: 34, type: !311, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "plaintext", scope: !27, file: !294, line: 39, type: !304, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "cbc_ciphertext", scope: !27, file: !294, line: 195, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 640, elements: !301)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "ctr_ciphertext", scope: !27, file: !294, line: 283, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 512, elements: !305)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "ccm_key", scope: !27, file: !294, line: 373, type: !311, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "ccm_data", scope: !27, file: !294, line: 384, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 184, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 23)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "ccm_hdr", scope: !27, file: !294, line: 381, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 8)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "ccm_nonce", scope: !27, file: !294, line: 377, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 104, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 13)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "ccm_expected", scope: !27, file: !294, line: 388, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 248, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 31)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "gcm_key", scope: !27, file: !294, line: 485, type: !311, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "gcm_data", scope: !27, file: !294, line: 496, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 336, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 42)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "gcm_hdr", scope: !27, file: !294, line: 492, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 160, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 20)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gcm_nonce", scope: !27, file: !294, line: 489, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 12)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "gcm_expected", scope: !27, file: !294, line: 502, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 464, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 58)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !373, line: 17, baseType: !140, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !372, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !379, file: !395, line: 18, type: !396, isLocal: false, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !381, globals: !394, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!381 = !{!22, !124, !24, !382, !384, !386, !272, !125, !387, !388, !390, !392, !393, !184, !227, !140}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!394 = !{!377}
!395 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !373, line: 17, baseType: !140, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !397, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_char_out", scope: !403, file: !408, line: 54, type: !409, isLocal: false, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!405 = !{!46}
!406 = !{!124, !125}
!407 = !{!401}
!408 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{!125, !125}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !414, file: !453, line: 22, type: !485, isLocal: false, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !416, retainedTypes: !428, globals: !450, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!416 = !{!417, !46}
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !418, line: 27, baseType: !32, size: 32, elements: !419)
!418 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427}
!420 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!421 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!422 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!423 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!424 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!425 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!426 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!427 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!428 = !{!124, !429, !125, !24, !432, !393, !208, !448}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !430, line: 46, baseType: !431)
!430 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !391)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !434, line: 54, size: 96, elements: !435)
!434 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!435 = !{!436, !443, !447}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !433, file: !434, line: 55, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !438, line: 33, baseType: !439)
!438 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !438, line: 29, size: 32, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !439, file: !438, line: 30, baseType: !442, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !433, file: !434, line: 60, baseType: !444, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !417}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !433, file: !434, line: 65, baseType: !444, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !449)
!449 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!450 = !{!412, !451, !459, !464, !466, !475, !477}
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !414, file: !453, line: 27, type: !454, isLocal: true, isDefinition: true)
!453 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 32, elements: !457)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !456, line: 22, baseType: !389)
!456 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = !{!458}
!458 = !DISubrange(count: 1)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !414, file: !453, line: 44, type: !461, isLocal: true, isDefinition: true)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !462, line: 43, elements: !463)
!462 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = !{}
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !414, file: !453, line: 49, type: !461, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !414, file: !453, line: 36, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 128, elements: !457)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !418, line: 114, size: 128, elements: !470)
!470 = !{!471, !472, !473, !474}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !469, file: !418, line: 115, baseType: !417, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !469, file: !418, line: 141, baseType: !150, size: 8, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !469, file: !418, line: 149, baseType: !208, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !469, file: !418, line: 156, baseType: !208, size: 32, offset: 96)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !414, file: !453, line: 40, type: !468, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !414, file: !453, line: 28, type: !479, isLocal: true, isDefinition: true)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !438, line: 40, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !438, line: 35, size: 64, elements: !481)
!481 = !{!482, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !480, file: !438, line: 36, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !480, file: !438, line: 37, baseType: !483, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !486, file: !373, line: 17, baseType: !140, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !486, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!490 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!491 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !494, file: !521, line: 50, type: !508, isLocal: true, isDefinition: true)
!494 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !416, retainedTypes: !496, globals: !518, splitDebugInlining: false, nameTableKind: None)
!495 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!496 = !{!159, !429, !272, !125, !124, !208, !448, !497, !393, !508, !509}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !499, line: 45, size: 64, elements: !500)
!499 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!500 = !{!501, !507}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !498, file: !499, line: 46, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !438, line: 33, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !438, line: 29, size: 32, elements: !504)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !503, file: !438, line: 30, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !498, file: !499, line: 48, baseType: !208, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !125)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !499, line: 38, size: 64, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !510, file: !499, line: 39, baseType: !502, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !510, file: !499, line: 41, baseType: !514, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !499, line: 35, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !508}
!518 = !{!519, !523, !531, !492, !533, !543}
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "latency_lock", scope: !494, file: !521, line: 44, type: !522, isLocal: true, isDefinition: true)
!521 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !462, line: 43, elements: !463)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !494, file: !521, line: 46, type: !525, isLocal: true, isDefinition: true)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !438, line: 40, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !438, line: 35, size: 64, elements: !527)
!527 = !{!528, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !526, file: !438, line: 36, baseType: !529, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !526, file: !438, line: 37, baseType: !529, size: 32, offset: 32)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "latency_subs", scope: !494, file: !521, line: 52, type: !525, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !494, file: !521, line: 39, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, elements: !541)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !521, line: 35, size: 96, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !536, file: !521, line: 36, baseType: !417, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !536, file: !521, line: 37, baseType: !150, size: 8, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !536, file: !521, line: 38, baseType: !455, size: 32, offset: 64)
!541 = !{!542}
!542 = !DISubrange(count: 0)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !494, file: !521, line: 48, type: !508, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !547, file: !554, line: 47, type: !567, isLocal: true, isDefinition: true)
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !549, retainedTypes: !550, globals: !551, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!549 = !{!417}
!550 = !{!272, !125}
!551 = !{!552, !545, !564}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "cpus_states", scope: !547, file: !554, line: 50, type: !555, isLocal: true, isDefinition: true)
!554 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 32, elements: !457)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !418, line: 114, size: 128, elements: !559)
!559 = !{!560, !561, !562, !563}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !558, file: !418, line: 115, baseType: !417, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !558, file: !418, line: 141, baseType: !150, size: 8, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !558, file: !418, line: 149, baseType: !208, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !558, file: !418, line: 156, baseType: !208, size: 32, offset: 96)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !547, file: !554, line: 55, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 8, elements: !457)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, elements: !541)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "inv_sbox", scope: !570, file: !584, line: 37, type: !585, isLocal: true, isDefinition: true)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !572, globals: !583, splitDebugInlining: false, nameTableKind: None)
!571 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!572 = !{!184, !573, !574, !150}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !575, line: 66, baseType: !576)
!575 = !DIFile(filename: "modules/crypto/tinycrypt/lib/include/tinycrypt/aes.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !575, line: 64, size: 1408, elements: !578)
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !577, file: !575, line: 65, baseType: !580, size: 1408)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1408, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 44)
!583 = !{!568}
!584 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 2048, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 256)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "sbox", scope: !590, file: !599, line: 37, type: !585, isLocal: true, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !592, globals: !598, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!592 = !{!593, !573, !184, !150}
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !575, line: 66, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !575, line: 64, size: 1408, elements: !596)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !595, file: !575, line: 65, baseType: !580, size: 1408)
!598 = !{!588}
!599 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !602, file: !609, line: 21, type: !409, isLocal: true, isDefinition: true)
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !604, globals: !608, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!604 = !{!605, !125, !124}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !607, line: 22, baseType: !125)
!607 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!608 = !{!600}
!609 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !612, file: !711, line: 31, type: !728, isLocal: false, isDefinition: true)
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !614, globals: !708, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!614 = !{!615, !150, !124, !125, !681, !682, !697, !208}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !617, line: 247, baseType: !618)
!617 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 216, size: 20576, elements: !619)
!619 = !{!620, !626, !627, !628, !632, !633, !637, !638, !639, !643, !644, !648, !649, !653, !654, !658, !659, !663, !664, !665, !666, !670, !671, !672, !673, !675, !676, !680}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !618, file: !617, line: 217, baseType: !621, size: 960)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 960, elements: !624)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !208)
!624 = !{!625}
!625 = !DISubrange(count: 30)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !618, file: !617, line: 218, baseType: !623, size: 32, offset: 960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !618, file: !617, line: 219, baseType: !623, size: 32, offset: 992)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !618, file: !617, line: 220, baseType: !629, size: 1088, offset: 1024)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1088, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 34)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !618, file: !617, line: 221, baseType: !623, size: 32, offset: 2112)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !618, file: !617, line: 222, baseType: !634, size: 4032, offset: 2144)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 4032, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 126)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !618, file: !617, line: 223, baseType: !623, size: 32, offset: 6176)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !618, file: !617, line: 224, baseType: !623, size: 32, offset: 6208)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !618, file: !617, line: 225, baseType: !640, size: 1952, offset: 6240)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1952, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 61)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !618, file: !617, line: 226, baseType: !623, size: 32, offset: 8192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !618, file: !617, line: 227, baseType: !645, size: 288, offset: 8224)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 288, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 9)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !618, file: !617, line: 228, baseType: !622, size: 32, offset: 8512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !618, file: !617, line: 229, baseType: !650, size: 1696, offset: 8544)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1696, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 53)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !618, file: !617, line: 230, baseType: !623, size: 32, offset: 10240)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !618, file: !617, line: 231, baseType: !655, size: 96, offset: 10272)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 96, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 3)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !618, file: !617, line: 232, baseType: !623, size: 32, offset: 10368)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !618, file: !617, line: 233, baseType: !660, size: 64, offset: 10400)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 64, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 2)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !618, file: !617, line: 234, baseType: !623, size: 32, offset: 10464)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !618, file: !617, line: 236, baseType: !622, size: 32, offset: 10496)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !618, file: !617, line: 237, baseType: !623, size: 32, offset: 10528)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !618, file: !617, line: 238, baseType: !667, size: 224, offset: 10560)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 224, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 7)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !618, file: !617, line: 239, baseType: !623, size: 32, offset: 10784)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !618, file: !617, line: 241, baseType: !655, size: 96, offset: 10816)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !618, file: !617, line: 242, baseType: !623, size: 32, offset: 10912)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !618, file: !617, line: 243, baseType: !674, size: 256, offset: 10944)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 256, elements: !337)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !618, file: !617, line: 244, baseType: !623, size: 32, offset: 11200)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !618, file: !617, line: 245, baseType: !677, size: 9312, offset: 11232)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 9312, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 291)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !618, file: !617, line: 246, baseType: !623, size: 32, offset: 20544)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !684, line: 352, baseType: !685)
!684 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 341, size: 320, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !696}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !685, file: !684, line: 343, baseType: !622, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !685, file: !684, line: 344, baseType: !623, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !685, file: !684, line: 345, baseType: !208, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !685, file: !684, line: 346, baseType: !623, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !685, file: !684, line: 347, baseType: !623, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !685, file: !684, line: 348, baseType: !623, size: 32, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !685, file: !684, line: 349, baseType: !208, size: 32, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !685, file: !684, line: 350, baseType: !695, size: 64, offset: 224)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 64, elements: !661)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !685, file: !684, line: 351, baseType: !623, size: 32, offset: 288)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !699, file: !698, line: 167, baseType: !707)
!698 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!699 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !698, file: !698, line: 134, type: !700, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !612, retainedNodes: !702)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !208}
!702 = !{!703, !704, !706}
!703 = !DILocalVariable(name: "time_us", arg: 1, scope: !699, file: !698, line: 134, type: !208)
!704 = !DILocalVariable(name: "delay_cycles", scope: !699, file: !698, line: 168, type: !705)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!706 = !DILocalVariable(name: "cycles", scope: !699, file: !698, line: 171, type: !208)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!708 = !{!610, !709, !724}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !612, file: !711, line: 71, type: !712, isLocal: true, isDefinition: true, align: 32)
!711 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !714, line: 51, size: 64, elements: !715)
!714 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!715 = !{!716, !723}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !713, file: !714, line: 60, baseType: !717, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = !DISubroutineType(types: !719)
!719 = !{!125, !720}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !714, line: 48, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !713, file: !714, line: 65, baseType: !720, size: 32, offset: 32)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !699, file: !698, line: 161, type: !726, isLocal: true, isDefinition: true, align: 128)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 48, elements: !656)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !729, file: !373, line: 17, baseType: !140, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !729, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !735, file: !928, line: 18, type: !1158, isLocal: false, isDefinition: true)
!735 = distinct !DICompileUnit(language: DW_LANG_C99, file: !736, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !737, retainedTypes: !852, globals: !924, splitDebugInlining: false, nameTableKind: None)
!736 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/crypto")
!737 = !{!738, !744, !46, !749, !754, !759, !765, !771, !780, !784, !817, !824, !843}
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !739, line: 23, baseType: !32, size: 32, elements: !740)
!739 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!740 = !{!741, !742, !743}
!741 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!742 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!743 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!744 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !739, line: 48, baseType: !32, size: 32, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!747 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!748 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!749 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !750, line: 167, baseType: !32, size: 32, elements: !751)
!750 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!751 = !{!752, !753}
!752 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!753 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!754 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !750, line: 107, baseType: !32, size: 32, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!757 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!758 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!759 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !750, line: 208, baseType: !32, size: 32, elements: !760)
!760 = !{!761, !762, !763, !764}
!761 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!762 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!763 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!764 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!765 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !750, line: 261, baseType: !32, size: 32, elements: !766)
!766 = !{!767, !768, !769, !770}
!767 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!768 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!769 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!770 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!771 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !750, line: 237, baseType: !32, size: 32, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !779}
!773 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!774 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!775 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!776 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!777 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!778 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!779 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!780 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !750, line: 152, baseType: !32, size: 32, elements: !781)
!781 = !{!782, !783}
!782 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!783 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!784 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !617, line: 71, baseType: !125, size: 32, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816}
!786 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!787 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!788 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!789 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!790 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!791 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!792 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!793 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!794 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!795 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!796 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!797 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!798 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!799 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!800 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!801 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!802 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!803 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!804 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!805 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!806 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!807 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!808 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!809 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!810 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!811 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!812 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!813 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!814 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!815 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!816 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!817 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !818, line: 44, baseType: !32, size: 32, elements: !819)
!818 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!819 = !{!820, !821, !822, !823}
!820 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!821 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!822 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!823 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !825, line: 54, baseType: !32, size: 32, elements: !826)
!825 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842}
!827 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!828 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!829 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!830 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!831 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!832 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!833 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!834 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!835 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!836 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!837 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!838 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!839 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!840 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!841 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!842 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !844, line: 53, baseType: !32, size: 32, elements: !845)
!844 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!845 = !{!846, !847, !848, !849, !850, !851}
!846 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!847 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!848 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!849 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!850 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!851 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!852 = !{!738, !124, !125, !853, !901, !902, !903, !904, !429, !208, !448, !153, !681, !184, !508, !905, !923, !272}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !617, line: 291, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 260, size: 10912, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !868, !869, !870, !871, !872, !873, !877, !878, !879, !883, !884, !885, !886, !887, !888, !889, !893, !894, !895, !896, !900}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !855, file: !617, line: 261, baseType: !623, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !855, file: !617, line: 262, baseType: !623, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !855, file: !617, line: 263, baseType: !623, size: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !855, file: !617, line: 264, baseType: !623, size: 32, offset: 96)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !855, file: !617, line: 265, baseType: !623, size: 32, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !855, file: !617, line: 266, baseType: !623, size: 32, offset: 160)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !855, file: !617, line: 267, baseType: !623, size: 32, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !855, file: !617, line: 268, baseType: !865, size: 1824, offset: 224)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1824, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 57)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !855, file: !617, line: 269, baseType: !623, size: 32, offset: 2048)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !855, file: !617, line: 270, baseType: !623, size: 32, offset: 2080)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !855, file: !617, line: 271, baseType: !622, size: 32, offset: 2112)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !855, file: !617, line: 272, baseType: !623, size: 32, offset: 2144)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !855, file: !617, line: 273, baseType: !623, size: 32, offset: 2176)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !855, file: !617, line: 274, baseType: !874, size: 3968, offset: 2208)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 3968, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 124)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !855, file: !617, line: 275, baseType: !623, size: 32, offset: 6176)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !855, file: !617, line: 276, baseType: !623, size: 32, offset: 6208)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !855, file: !617, line: 277, baseType: !880, size: 2016, offset: 6240)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 2016, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: 63)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !855, file: !617, line: 278, baseType: !622, size: 32, offset: 8256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !855, file: !617, line: 279, baseType: !622, size: 32, offset: 8288)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !855, file: !617, line: 280, baseType: !622, size: 32, offset: 8320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !855, file: !617, line: 281, baseType: !622, size: 32, offset: 8352)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !855, file: !617, line: 282, baseType: !622, size: 32, offset: 8384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !855, file: !617, line: 283, baseType: !622, size: 32, offset: 8416)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !855, file: !617, line: 285, baseType: !890, size: 1984, offset: 8448)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1984, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 62)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !855, file: !617, line: 286, baseType: !623, size: 32, offset: 10432)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !855, file: !617, line: 287, baseType: !667, size: 224, offset: 10464)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !855, file: !617, line: 288, baseType: !623, size: 32, offset: 10688)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !855, file: !617, line: 289, baseType: !897, size: 160, offset: 10720)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 160, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 5)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "XTALFREQ", scope: !855, file: !617, line: 290, baseType: !623, size: 32, offset: 10880)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !750, line: 146, baseType: !754)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !750, line: 164, baseType: !780)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !684, line: 326, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 314, size: 6400, elements: !908)
!908 = !{!909, !911, !913, !914, !915, !916, !917, !918, !919, !921}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !907, file: !684, line: 316, baseType: !910, size: 32)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 32, elements: !457)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !907, file: !684, line: 317, baseType: !912, size: 992, offset: 32)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 992, elements: !347)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !907, file: !684, line: 318, baseType: !910, size: 32, offset: 1024)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !907, file: !684, line: 319, baseType: !912, size: 992, offset: 1056)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !907, file: !684, line: 320, baseType: !910, size: 32, offset: 2048)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !907, file: !684, line: 321, baseType: !912, size: 992, offset: 2080)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !907, file: !684, line: 322, baseType: !910, size: 32, offset: 3072)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !907, file: !684, line: 323, baseType: !912, size: 992, offset: 3104)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !907, file: !684, line: 324, baseType: !920, size: 2048, offset: 4096)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 2048, elements: !305)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !907, file: !684, line: 325, baseType: !922, size: 256, offset: 6144)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 256, elements: !337)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !818, line: 56, baseType: !124)
!924 = !{!733, !925, !975, !1018, !1021, !1037, !1048, !1050, !1067, !1069, !1079, !1082, !1098, !1136, !1150}
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "on", scope: !927, file: !928, line: 549, type: !455, isLocal: true, isDefinition: true)
!927 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !928, file: !928, line: 547, type: !929, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !735, retainedNodes: !931)
!928 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = !DISubroutineType(types: !930)
!930 = !{null, !744}
!931 = !{!932, !933, !936}
!932 = !DILocalVariable(name: "start_mode", arg: 1, scope: !927, file: !928, line: 547, type: !744)
!933 = !DILocalVariable(name: "err", scope: !934, file: !928, line: 553, type: !125)
!934 = distinct !DILexicalBlock(scope: !935, file: !928, line: 552, column: 31)
!935 = distinct !DILexicalBlock(scope: !927, file: !928, line: 552, column: 6)
!936 = !DILocalVariable(name: "mgr", scope: !934, file: !928, line: 554, type: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !939, line: 154, size: 224, elements: !940)
!939 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!940 = !{!941, !953, !954, !970, !972, !973, !974}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !938, file: !939, line: 158, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !438, line: 40, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !438, line: 35, size: 64, elements: !944)
!944 = !{!945, !952}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !943, file: !438, line: 36, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !438, line: 33, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !438, line: 29, size: 32, elements: !949)
!949 = !{!950}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !948, file: !438, line: 30, baseType: !951, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !943, file: !438, line: 37, baseType: !946, size: 32, offset: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !938, file: !939, line: 163, baseType: !942, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !938, file: !939, line: 166, baseType: !955, size: 32, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !939, line: 133, size: 96, elements: !958)
!958 = !{!959, !968, !969}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !957, file: !939, line: 135, baseType: !960, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !939, line: 129, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !937, !964}
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !939, line: 101, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !937, !125}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !957, file: !939, line: 138, baseType: !960, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !957, file: !939, line: 143, baseType: !960, size: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !938, file: !939, line: 169, baseType: !971, offset: 160)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !462, line: 43, elements: !463)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !938, file: !939, line: 172, baseType: !125, size: 32, offset: 160)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !938, file: !939, line: 175, baseType: !227, size: 16, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !938, file: !939, line: 178, baseType: !227, size: 16, offset: 208)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "cli", scope: !927, file: !928, line: 550, type: !977, isLocal: true, isDefinition: true)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !939, line: 273, size: 128, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !977, file: !939, line: 280, baseType: !947, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !977, file: !939, line: 283, baseType: !981, size: 96, offset: 32)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !982, line: 138, size: 96, elements: !983)
!982 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!983 = !{!984, !1015, !1016}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !981, file: !982, line: 149, baseType: !985, size: 32)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !982, line: 139, size: 32, elements: !986)
!986 = !{!987, !1010}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !985, file: !982, line: 145, baseType: !988, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !990, line: 5397, size: 128, elements: !991)
!990 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!991 = !{!992, !1008, !1009}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !989, file: !990, line: 5399, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !994, line: 48, baseType: !995)
!994 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !994, line: 37, size: 64, elements: !996)
!996 = !{!997, !1003}
!997 = !DIDerivedType(tag: DW_TAG_member, scope: !995, file: !994, line: 38, baseType: !998, size: 32)
!998 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !995, file: !994, line: 38, size: 32, elements: !999)
!999 = !{!1000, !1002}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !998, file: !994, line: 39, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !998, file: !994, line: 40, baseType: !1001, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, scope: !995, file: !994, line: 42, baseType: !1004, size: 32, offset: 32)
!1004 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !995, file: !994, line: 42, size: 32, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1004, file: !994, line: 43, baseType: !1001, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1004, file: !994, line: 44, baseType: !1001, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !989, file: !990, line: 5405, baseType: !32, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !989, file: !990, line: 5408, baseType: !125, size: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !985, file: !982, line: 148, baseType: !1011, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !982, line: 98, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, null}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !981, file: !982, line: 165, baseType: !623, size: 32, offset: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !981, file: !982, line: 174, baseType: !1017, size: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !125)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !735, file: !928, line: 733, type: !1020, isLocal: false, isDefinition: true, align: 16)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 80, elements: !898)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !735, file: !928, line: 733, type: !1023, isLocal: false, isDefinition: true, align: 32)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1035, !1036}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1024, file: !137, line: 380, baseType: !140, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1024, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1024, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1024, file: !137, line: 386, baseType: !1030, size: 32, offset: 96)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !1032)
!1032 = !{!1033, !1034}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1031, file: !137, line: 359, baseType: !150, size: 8)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1031, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1024, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1024, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !735, file: !928, line: 733, type: !1039, isLocal: true, isDefinition: true, align: 32)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !714, line: 51, size: 64, elements: !1041)
!1041 = !{!1042, !1047}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1040, file: !714, line: 60, baseType: !1043, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!125, !1046}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1040, file: !714, line: 65, baseType: !1046, size: 32, offset: 32)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !735, file: !928, line: 79, type: !455, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(name: "data", scope: !735, file: !928, line: 702, type: !1052, isLocal: true, isDefinition: true)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !928, line: 69, size: 640, elements: !1053)
!1053 = !{!1054, !1056}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1052, file: !928, line: 70, baseType: !1055, size: 448)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 448, elements: !661)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1052, file: !928, line: 71, baseType: !1057, size: 192, offset: 448)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 192, elements: !661)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !928, line: 52, size: 96, elements: !1059)
!1059 = !{!1060, !1065, !1066}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1058, file: !928, line: 53, baseType: !1061, size: 32)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !818, line: 72, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 32)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{null, !1046, !923, !124}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1058, file: !928, line: 54, baseType: !124, size: 32, offset: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1058, file: !928, line: 55, baseType: !208, size: 32, offset: 64)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_23", scope: !735, file: !928, line: 733, type: !1031, isLocal: true, isDefinition: true, align: 8)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(name: "d", scope: !1071, file: !928, line: 476, type: !1077, isLocal: true, isDefinition: true)
!1071 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !928, file: !928, line: 474, type: !929, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !735, retainedNodes: !1072)
!1072 = !{!1073, !1074, !1075, !1076}
!1073 = !DILocalVariable(name: "mode", arg: 1, scope: !1071, file: !928, line: 474, type: !744)
!1074 = !DILocalVariable(name: "type", scope: !1071, file: !928, line: 486, type: !901)
!1075 = !DILocalVariable(name: "isr_mode", scope: !1071, file: !928, line: 500, type: !153)
!1076 = !DILocalVariable(name: "key", scope: !1071, file: !928, line: 501, type: !125)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !750, line: 177, baseType: !749)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "target_type", scope: !1071, file: !928, line: 477, type: !1081, isLocal: true, isDefinition: true)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(name: "config", scope: !735, file: !928, line: 704, type: !1084, isLocal: true, isDefinition: true)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !928, line: 74, size: 192, elements: !1086)
!1086 = !{!1087}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1085, file: !928, line: 76, baseType: !1088, size: 192)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 192, elements: !661)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !928, line: 61, size: 96, elements: !1090)
!1090 = !{!1091, !1096, !1097}
