; ModuleID = './build/freertos_create_thread.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.flash_info_t = type { i8*, i8, i32, i32, i32, i8, i8, i8 }
%struct.log_control_block_t = type { i8*, i32, i32, void (i8*, i8*, i32, i32, i8*, ...)*, void (i8*, i8*, i32, i32, i8*, i32, i8*, ...)* }
%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.tskTaskControlBlock = type { i32*, %struct.xLIST_ITEM, %struct.xLIST_ITEM, i32, i32*, [6 x i8], i32, i32, i32, i32, i32, i32 }
%struct.xLIST_ITEM = type { i32, %struct.xLIST_ITEM*, %struct.xLIST_ITEM*, i8*, i8* }
%struct.xLIST = type { i32, %struct.xLIST_ITEM*, %struct.xMINI_LIST_ITEM }
%struct.xMINI_LIST_ITEM = type { i32, %struct.xLIST_ITEM*, %struct.xLIST_ITEM* }

!79 = distinct !DIGlobalVariable(name: "sf_Mutex", scope: !2, file: !3, line: 78, type: !7, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !83, file: !84, line: 71, type: !158, isLocal: false, isDefinition: true)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !84, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !85, retainedTypes: !136, globals: !141, splitDebugInlining: false, nameTableKind: None)
!84 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!85 = !{!86, !91}
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 121, baseType: !30, size: 32, elements: !88)
!87 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!90 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !92, line: 47, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!94 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!95 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!96 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!97 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!98 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!99 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!100 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!101 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!102 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!103 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!104 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!105 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!106 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!107 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!108 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!109 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!110 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!111 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!112 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!113 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!114 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!115 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!116 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!117 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!118 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!119 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!120 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!121 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!122 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!123 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!124 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!125 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!126 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!127 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!128 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!129 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!130 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!131 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!132 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!133 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!134 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!135 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!136 = !{!137, !140}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !87, line: 116, baseType: !30)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !92, line: 95, baseType: !91)
!141 = !{!81, !142}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !83, file: !84, line: 67, type: !144, isLocal: true, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !145, line: 111, baseType: !146)
!145 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 109, size: 96, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !146, file: !145, line: 110, baseType: !149, size: 96)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !145, line: 106, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 102, size: 96, elements: !151)
!151 = !{!152, !156, !157}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !150, file: !145, line: 103, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{null}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !150, file: !145, line: 104, baseType: !153, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !150, file: !145, line: 105, baseType: !153, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !87, line: 62, baseType: !30)
!160 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!161 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "g_sfc_security_enable", scope: !164, file: !165, line: 58, type: !30, isLocal: false, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !166, retainedTypes: !173, globals: !180, splitDebugInlining: false, nameTableKind: None)
!165 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/sfc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!166 = !{!167}
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 45, baseType: !30, size: 32, elements: !168)
!168 = !{!169, !170, !171, !172}
!169 = !DIEnumerator(name: "SF_UNDEF", value: 0)
!170 = !DIEnumerator(name: "SPI", value: 1)
!171 = !DIEnumerator(name: "SPIQ", value: 2)
!172 = !DIEnumerator(name: "QPI", value: 3)
!173 = !{!137, !174, !30, !175, !177, !178}
!174 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!180 = !{!162}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "gSFC_max_data_size", scope: !183, file: !184, line: 67, type: !30, isLocal: false, isDefinition: true)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !192, globals: !211, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/spi_flash.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!185 = !{!35, !5, !167, !186}
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 66, baseType: !7, size: 32, elements: !187)
!187 = !{!188, !189, !190, !191}
!188 = !DIEnumerator(name: "FLASH_NOT_READY", value: -1)
!189 = !DIEnumerator(name: "FLASH_READY", value: 0)
!190 = !DIEnumerator(name: "FLASH_PROGRAMMING", value: 1)
!191 = !DIEnumerator(name: "FLASH_ERASING", value: 2)
!192 = !{!193, !195, !196, !30, !51, !210, !61, !139}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!195 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chip_info", file: !6, line: 137, size: 192, elements: !199)
!199 = !{!200, !203, !204, !205, !206, !207, !208, !209}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !6, line: 138, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !6, line: 139, baseType: !58, size: 8, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !198, file: !6, line: 140, baseType: !195, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !198, file: !6, line: 141, baseType: !195, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !198, file: !6, line: 142, baseType: !30, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !198, file: !6, line: 144, baseType: !58, size: 8, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !198, file: !6, line: 145, baseType: !58, size: 8, offset: 168)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !198, file: !6, line: 146, baseType: !58, size: 8, offset: 176)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!211 = !{!181, !212, !217, !222, !227, !230, !232, !237, !239, !241, !243, !245, !247, !249, !251, !253, !255, !257, !259, !264, !266, !268, !270, !273}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_winbond", scope: !183, file: !184, line: 70, type: !214, isLocal: false, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 96, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 12)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_winbond", scope: !183, file: !184, line: 73, type: !219, isLocal: false, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 32, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 4)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_winbond", scope: !183, file: !184, line: 76, type: !224, isLocal: false, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 72, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 9)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "cmdlist_suspend_winbond", scope: !183, file: !184, line: 79, type: !229, isLocal: false, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !220)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "cmdlist_resume_winbond", scope: !183, file: !184, line: 82, type: !229, isLocal: false, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_mxic", scope: !183, file: !184, line: 87, type: !234, isLocal: false, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 64, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 8)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_mxic", scope: !183, file: !184, line: 91, type: !234, isLocal: false, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_mxic", scope: !183, file: !184, line: 95, type: !234, isLocal: false, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd", scope: !183, file: !184, line: 100, type: !224, isLocal: false, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd", scope: !183, file: !184, line: 104, type: !224, isLocal: false, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd", scope: !183, file: !184, line: 108, type: !224, isLocal: false, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd25q32c", scope: !183, file: !184, line: 112, type: !234, isLocal: false, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd25q32c", scope: !183, file: !184, line: 115, type: !234, isLocal: false, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd25q32c", scope: !183, file: !184, line: 119, type: !234, isLocal: false, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_micron", scope: !183, file: !184, line: 123, type: !234, isLocal: false, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_micron", scope: !183, file: !184, line: 126, type: !234, isLocal: false, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_micron", scope: !183, file: !184, line: 130, type: !234, isLocal: false, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_spimode", scope: !183, file: !184, line: 135, type: !261, isLocal: false, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 56, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 7)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_qpimode", scope: !183, file: !184, line: 138, type: !261, isLocal: false, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "spi_chip_info", scope: !183, file: !184, line: 142, type: !196, isLocal: false, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "gd_write_sr2_1", scope: !183, file: !184, line: 161, type: !7, isLocal: false, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "support_flash_id", scope: !183, file: !184, line: 162, type: !272, isLocal: false, isDefinition: true)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_TYPT", file: !6, line: 81, baseType: !35)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "chips_data", scope: !183, file: !184, line: 144, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 2496, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 13)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !280, file: !281, line: 43, type: !61, isLocal: true, isDefinition: true)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !282, globals: !287, splitDebugInlining: false, nameTableKind: None)
!281 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!282 = !{!175, !159, !59, !283, !284, !286}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32", file: !87, line: 133, baseType: !30)
!287 = !{!278, !288}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !280, file: !281, line: 44, type: !61, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !292, file: !293, line: 54, type: !61, isLocal: false, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !294, retainedTypes: !318, globals: !326, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!294 = !{!91, !295, !301}
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !296, line: 71, baseType: !30, size: 32, elements: !297)
!296 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!297 = !{!298, !299, !300}
!298 = !DIEnumerator(name: "UART_PORT0", value: 0)
!299 = !DIEnumerator(name: "UART_PORT1", value: 1)
!300 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !302, line: 129, baseType: !30, size: 32, elements: !303)
!302 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317}
!304 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!305 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!306 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!307 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!308 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!309 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!310 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!311 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!312 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!313 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!314 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!315 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!316 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!317 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!318 = !{!175, !61, !319, !321, !323, !324, !159}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !87, line: 113, baseType: !322)
!322 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !87, line: 59, baseType: !58)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !323)
!326 = !{!327, !335, !290}
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler_name", scope: !292, file: !293, line: 57, type: !329, isLocal: false, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 64, elements: !333)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!333 = !{!334}
!334 = !DISubrange(count: 2)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !292, file: !293, line: 58, type: !337, isLocal: false, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 64, elements: !333)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !92, line: 97, baseType: !140)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "log_control_block_hal", scope: !342, file: !343, line: 127, type: !357, isLocal: false, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !344, globals: !356, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!344 = !{!345, !350}
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !346, line: 65, baseType: !30, size: 32, elements: !347)
!346 = !DIFile(filename: "../../../../../kernel/service/inc/syslog.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!347 = !{!348, !349}
!348 = !DIEnumerator(name: "DEBUG_LOG_ON", value: 0)
!349 = !DIEnumerator(name: "DEBUG_LOG_OFF", value: 1)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !346, line: 74, baseType: !30, size: 32, elements: !351)
!351 = !{!352, !353, !354, !355}
!352 = !DIEnumerator(name: "PRINT_LEVEL_DEBUG", value: 0)
!353 = !DIEnumerator(name: "PRINT_LEVEL_INFO", value: 1)
!354 = !DIEnumerator(name: "PRINT_LEVEL_WARNING", value: 2)
!355 = !DIEnumerator(name: "PRINT_LEVEL_ERROR", value: 3)
!356 = !{!340}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_control_block_t", file: !346, line: 95, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 89, size: 160, elements: !359)
!359 = !{!360, !361, !363, !365, !370}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "module_name", scope: !358, file: !346, line: 90, baseType: !331, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "log_switch", scope: !358, file: !346, line: 91, baseType: !362, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_switch_t", file: !346, line: 68, baseType: !345)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "print_level", scope: !358, file: !346, line: 92, baseType: !364, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "print_level_t", file: !346, line: 79, baseType: !350)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "print_handle", scope: !358, file: !346, line: 93, baseType: !366, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "f_print_t", file: !346, line: 82, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !51, !331, !7, !364, !331, null}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "dump_handle", scope: !358, file: !346, line: 94, baseType: !371, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "f_dump_buffer_t", file: !346, line: 83, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !51, !331, !7, !364, !375, !7, !331, null}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !379, file: !380, line: 51, type: !459, isLocal: false, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !381, retainedTypes: !428, globals: !458, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!381 = !{!382, !393, !412, !419}
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !383, line: 163, baseType: !7, size: 32, elements: !384)
!383 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!384 = !{!385, !386, !387, !388, !389, !390, !391, !392}
!385 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!386 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!387 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!388 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!389 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!390 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!391 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!392 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !383, line: 186, baseType: !30, size: 32, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!395 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!396 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!397 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!398 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!399 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!400 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!401 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!402 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!403 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!404 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!405 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!406 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!407 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!408 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!409 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!410 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!411 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !383, line: 176, baseType: !30, size: 32, elements: !413)
!413 = !{!414, !415, !416, !417, !418}
!414 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!415 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!416 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!417 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!418 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 99, baseType: !30, size: 32, elements: !421)
!420 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!421 = !{!422, !423, !424, !425, !426, !427}
!422 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!423 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!424 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!425 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!426 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!427 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!428 = !{!429, !51}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !431, line: 72, baseType: !432)
!431 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !431, line: 56, size: 525312, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !448, !449, !453, !457}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !432, file: !431, line: 57, baseType: !60, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !432, file: !431, line: 58, baseType: !60, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !432, file: !431, line: 59, baseType: !60, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !432, file: !431, line: 60, baseType: !60, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !432, file: !431, line: 61, baseType: !60, size: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !432, file: !431, line: 62, baseType: !60, size: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !432, file: !431, line: 63, baseType: !60, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !432, file: !431, line: 64, baseType: !60, size: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !432, file: !431, line: 65, baseType: !60, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !432, file: !431, line: 66, baseType: !60, size: 32, offset: 288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !432, file: !431, line: 67, baseType: !445, size: 32, offset: 320)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 1)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !432, file: !431, line: 68, baseType: !60, size: 32, offset: 352)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !432, file: !431, line: 69, baseType: !450, size: 523904, offset: 384)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 16372)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !432, file: !431, line: 70, baseType: !454, size: 512, offset: 524288)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 16)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !432, file: !431, line: 71, baseType: !454, size: 512, offset: 524800)
!458 = !{!377}
!459 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !69)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "g_cache_con", scope: !462, file: !463, line: 48, type: !497, isLocal: false, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !464, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!464 = !{!460, !465, !468}
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "g_cache_region_en", scope: !462, file: !463, line: 49, type: !467, isLocal: false, isDefinition: true)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGION_EN_Type", file: !420, line: 66, baseType: !61)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "g_cache_entry", scope: !462, file: !463, line: 50, type: !470, isLocal: false, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 1024, elements: !455)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_Type", file: !420, line: 90, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 87, size: 64, elements: !473)
!473 = !{!474, !487}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cache_entry_n", scope: !472, file: !420, line: 88, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_N_Type", file: !420, line: 77, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !420, line: 68, size: 32, elements: !477)
!477 = !{!478, !486}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !476, file: !420, line: 75, baseType: !479, size: 32)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !476, file: !420, line: 69, size: 32, elements: !480)
!480 = !{!481, !482, !483, !484, !485}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !479, file: !420, line: 70, baseType: !61, size: 5, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ATTR", scope: !479, file: !420, line: 71, baseType: !61, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !479, file: !420, line: 72, baseType: !61, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !479, file: !420, line: 73, baseType: !61, size: 3, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !479, file: !420, line: 74, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !476, file: !420, line: 76, baseType: !61, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "cache_end_entry_n", scope: !472, file: !420, line: 89, baseType: !488, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_END_ENTRY_N_Type", file: !420, line: 85, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !420, line: 79, size: 32, elements: !490)
!490 = !{!491, !496}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !489, file: !420, line: 83, baseType: !492, size: 32)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !489, file: !420, line: 80, size: 32, elements: !493)
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !492, file: !420, line: 81, baseType: !61, size: 12, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !492, file: !420, line: 82, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !489, file: !420, line: 84, baseType: !61, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_CON_Type", file: !420, line: 64, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !420, line: 51, size: 32, elements: !499)
!499 = !{!500, !512}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !498, file: !420, line: 62, baseType: !501, size: 32)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !498, file: !420, line: 52, size: 32, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "MCEN", scope: !501, file: !420, line: 53, baseType: !61, size: 1, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "MPEN", scope: !501, file: !420, line: 54, baseType: !61, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN0", scope: !501, file: !420, line: 55, baseType: !61, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN1", scope: !501, file: !420, line: 56, baseType: !61, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "MPDEFEN", scope: !501, file: !420, line: 57, baseType: !61, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !501, file: !420, line: 58, baseType: !61, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "MDRF", scope: !501, file: !420, line: 59, baseType: !61, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "CACHESIZE", scope: !501, file: !420, line: 60, baseType: !61, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !501, file: !420, line: 61, baseType: !61, size: 22, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !498, file: !420, line: 63, baseType: !61, size: 32)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !515, file: !516, line: 53, type: !594, isLocal: false, isDefinition: true)
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !517, retainedTypes: !526, globals: !593, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!517 = !{!518, !91}
!518 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !519, line: 152, baseType: !7, size: 32, elements: !520)
!519 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!520 = !{!521, !522, !523, !524, !525}
!521 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!522 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!523 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!524 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!525 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!526 = !{!339, !51, !61, !527, !529, !560}
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !55, line: 44, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !57, line: 77, baseType: !7)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !531, line: 378, baseType: !532)
!531 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 363, size: 28704, elements: !533)
!533 = !{!534, !536, !540, !541, !542, !543, !544, !545, !546, !547, !551, !555, !559}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !532, file: !531, line: 365, baseType: !535, size: 256)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 256, elements: !235)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !532, file: !531, line: 366, baseType: !537, size: 768, offset: 256)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 768, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 24)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !532, file: !531, line: 367, baseType: !535, size: 256, offset: 1024)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !532, file: !531, line: 368, baseType: !537, size: 768, offset: 1280)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !532, file: !531, line: 369, baseType: !535, size: 256, offset: 2048)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !532, file: !531, line: 370, baseType: !537, size: 768, offset: 2304)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !532, file: !531, line: 371, baseType: !535, size: 256, offset: 3072)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !532, file: !531, line: 372, baseType: !537, size: 768, offset: 3328)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !532, file: !531, line: 373, baseType: !535, size: 256, offset: 4096)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !532, file: !531, line: 374, baseType: !548, size: 1792, offset: 4352)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1792, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 56)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !532, file: !531, line: 375, baseType: !552, size: 1920, offset: 6144)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 1920, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 240)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !532, file: !531, line: 376, baseType: !556, size: 20608, offset: 8064)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 20608, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 644)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !532, file: !531, line: 377, baseType: !60, size: 32, offset: 28672)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !531, line: 418, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 395, size: 1120, elements: !563)
!563 = !{!564, !566, !567, !568, !569, !570, !571, !573, !574, !575, !576, !577, !578, !579, !580, !582, !583, !584, !586, !590, !592}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !562, file: !531, line: 397, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !562, file: !531, line: 398, baseType: !60, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !562, file: !531, line: 399, baseType: !60, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !562, file: !531, line: 400, baseType: !60, size: 32, offset: 96)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !562, file: !531, line: 401, baseType: !60, size: 32, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !562, file: !531, line: 402, baseType: !60, size: 32, offset: 160)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !562, file: !531, line: 403, baseType: !572, size: 96, offset: 192)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 96, elements: !215)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !562, file: !531, line: 404, baseType: !60, size: 32, offset: 288)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !562, file: !531, line: 405, baseType: !60, size: 32, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !562, file: !531, line: 406, baseType: !60, size: 32, offset: 352)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !562, file: !531, line: 407, baseType: !60, size: 32, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !562, file: !531, line: 408, baseType: !60, size: 32, offset: 416)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !562, file: !531, line: 409, baseType: !60, size: 32, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !562, file: !531, line: 410, baseType: !60, size: 32, offset: 480)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !562, file: !531, line: 411, baseType: !581, size: 64, offset: 512)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 64, elements: !333)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !562, file: !531, line: 412, baseType: !565, size: 32, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !562, file: !531, line: 413, baseType: !565, size: 32, offset: 608)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !562, file: !531, line: 414, baseType: !585, size: 128, offset: 640)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 128, elements: !220)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !562, file: !531, line: 415, baseType: !587, size: 160, offset: 768)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 160, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 5)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !562, file: !531, line: 416, baseType: !591, size: 160, offset: 928)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, elements: !588)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !562, file: !531, line: 417, baseType: !60, size: 32, offset: 1088)
!593 = !{!513}
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 6144, elements: !603)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !516, line: 50, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !516, line: 47, size: 64, elements: !597)
!597 = !{!598, !602}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !596, file: !516, line: 48, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !339}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !596, file: !516, line: 49, baseType: !61, size: 32, offset: 32)
!603 = !{!604}
!604 = !DISubrange(count: 96)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !607, file: !608, line: 61, type: !627, isLocal: true, isDefinition: true)
!607 = distinct !DICompileUnit(language: DW_LANG_C99, file: !608, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !609, retainedTypes: !625, globals: !626, splitDebugInlining: false, nameTableKind: None)
!608 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!609 = !{!20, !610, !617, !28, !621}
!610 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 657, baseType: !30, size: 32, elements: !611)
!611 = !{!612, !613, !614, !615, !616}
!612 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!613 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!614 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!615 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!616 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 397, baseType: !30, size: 32, elements: !618)
!618 = !{!619, !620}
!619 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!620 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!621 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 380, baseType: !30, size: 32, elements: !622)
!622 = !{!623, !624}
!623 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!624 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!625 = !{!51, !61}
!626 = !{!605}
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 640, elements: !588)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !608, line: 55, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !608, line: 51, size: 128, elements: !630)
!630 = !{!631, !633, !643}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !629, file: !608, line: 52, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !21, line: 400, baseType: !617)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !629, file: !608, line: 53, baseType: !634, size: 64, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !608, line: 49, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !608, line: 46, size: 64, elements: !636)
!636 = !{!637, !642}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !635, file: !608, line: 47, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !21, line: 371, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !51}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !635, file: !608, line: 48, baseType: !51, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !629, file: !608, line: 54, baseType: !69, size: 8, offset: 96)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "g_uart_frist_send_complete_interrupt", scope: !646, file: !647, line: 80, type: !748, isLocal: true, isDefinition: true)
!646 = distinct !DICompileUnit(language: DW_LANG_C99, file: !647, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !648, retainedTypes: !698, globals: !699, splitDebugInlining: false, nameTableKind: None)
!647 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!648 = !{!295, !649, !657, !662, !678, !684, !688, !301, !693}
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !650, line: 345, baseType: !7, size: 32, elements: !651)
!650 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!651 = !{!652, !653, !654, !655, !656}
!652 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!653 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!654 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!655 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!656 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 109, baseType: !30, size: 32, elements: !658)
!658 = !{!659, !660, !661}
!659 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!660 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!661 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!662 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !650, line: 302, baseType: !30, size: 32, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!664 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!665 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!666 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!667 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!668 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!669 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!670 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!671 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!672 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!673 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!674 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!675 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!676 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!677 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!678 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !650, line: 321, baseType: !30, size: 32, elements: !679)
!679 = !{!680, !681, !682, !683}
!680 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!681 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!682 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!683 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !650, line: 330, baseType: !30, size: 32, elements: !685)
!685 = !{!686, !687}
!686 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!687 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !650, line: 337, baseType: !30, size: 32, elements: !689)
!689 = !{!690, !691, !692}
!690 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!691 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!692 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!693 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !650, line: 355, baseType: !7, size: 32, elements: !694)
!694 = !{!695, !696, !697}
!695 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!696 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!697 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!698 = !{!201, !30, !51, !58, !202, !54}
!699 = !{!700, !743, !644, !746, !749}
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !646, file: !647, line: 77, type: !702, isLocal: true, isDefinition: true)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 1024, elements: !333)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !647, line: 75, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !647, line: 68, size: 512, elements: !705)
!705 = !{!706, !707, !719, !720, !731, !732}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !704, file: !647, line: 69, baseType: !69, size: 8)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !704, file: !647, line: 70, baseType: !708, size: 128, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !650, line: 378, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 373, size: 128, elements: !710)
!710 = !{!711, !713, !715, !717}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !709, file: !650, line: 374, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !650, line: 317, baseType: !662)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !709, file: !650, line: 375, baseType: !714, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !650, line: 326, baseType: !678)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !709, file: !650, line: 376, baseType: !716, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !650, line: 333, baseType: !684)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !709, file: !650, line: 377, baseType: !718, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !650, line: 341, baseType: !688)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !704, file: !647, line: 71, baseType: !69, size: 8, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !704, file: !647, line: 72, baseType: !721, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !647, line: 66, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !647, line: 63, size: 64, elements: !723)
!723 = !{!724, !730}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !722, file: !647, line: 64, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !650, line: 410, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !729, !51}
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !650, line: 359, baseType: !693)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !722, file: !647, line: 65, baseType: !51, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !704, file: !647, line: 73, baseType: !69, size: 8, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !704, file: !647, line: 74, baseType: !733, size: 224, offset: 288)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !650, line: 390, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 382, size: 224, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !734, file: !650, line: 383, baseType: !210, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !734, file: !650, line: 384, baseType: !61, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !734, file: !650, line: 385, baseType: !61, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !734, file: !650, line: 386, baseType: !210, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !734, file: !650, line: 387, baseType: !61, size: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !734, file: !650, line: 388, baseType: !61, size: 32, offset: 160)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !734, file: !650, line: 389, baseType: !61, size: 32, offset: 192)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler", scope: !646, file: !647, line: 82, type: !745, isLocal: true, isDefinition: true)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 16, elements: !333)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "g_uart_send_lock_status", scope: !646, file: !647, line: 81, type: !748, isLocal: true, isDefinition: true)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 16, elements: !333)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "func_tbl", scope: !751, file: !647, line: 536, type: !758, isLocal: true, isDefinition: true)
!751 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !647, file: !647, line: 534, type: !752, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !756)
!752 = !DISubroutineType(types: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !302, line: 197, baseType: !153)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !29, line: 113, baseType: !657)
!756 = !{!757}
!757 = !DILocalVariable(name: "uart_port", arg: 1, scope: !751, file: !647, line: 534, type: !755)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 64, elements: !333)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "DWT_NUMCOMP", scope: !762, file: !763, line: 44, type: !7, isLocal: true, isDefinition: true)
!762 = distinct !DICompileUnit(language: DW_LANG_C99, file: !763, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !764, retainedTypes: !773, globals: !809, splitDebugInlining: false, nameTableKind: None)
!763 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_dwt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!764 = !{!765}
!765 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !766, line: 42, baseType: !30, size: 32, elements: !767)
!766 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_dwt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!767 = !{!768, !769, !770, !771, !772}
!768 = !DIEnumerator(name: "COMP_DISABLE", value: 0)
!769 = !DIEnumerator(name: "WDE_INST", value: 4)
!770 = !DIEnumerator(name: "WDE_DATA_RO", value: 5)
!771 = !DIEnumerator(name: "WDE_DATA_WO", value: 6)
!772 = !DIEnumerator(name: "WDE_DATA_RW", value: 7)
!773 = !{!774, !801}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "DWT_Type", file: !531, line: 826, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 801, size: 736, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !776, file: !531, line: 803, baseType: !60, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "CYCCNT", scope: !776, file: !531, line: 804, baseType: !60, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "CPICNT", scope: !776, file: !531, line: 805, baseType: !60, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "EXCCNT", scope: !776, file: !531, line: 806, baseType: !60, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPCNT", scope: !776, file: !531, line: 807, baseType: !60, size: 32, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "LSUCNT", scope: !776, file: !531, line: 808, baseType: !60, size: 32, offset: 160)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "FOLDCNT", scope: !776, file: !531, line: 809, baseType: !60, size: 32, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "PCSR", scope: !776, file: !531, line: 810, baseType: !565, size: 32, offset: 224)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "COMP0", scope: !776, file: !531, line: 811, baseType: !60, size: 32, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "MASK0", scope: !776, file: !531, line: 812, baseType: !60, size: 32, offset: 288)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION0", scope: !776, file: !531, line: 813, baseType: !60, size: 32, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !776, file: !531, line: 814, baseType: !445, size: 32, offset: 352)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "COMP1", scope: !776, file: !531, line: 815, baseType: !60, size: 32, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "MASK1", scope: !776, file: !531, line: 816, baseType: !60, size: 32, offset: 416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION1", scope: !776, file: !531, line: 817, baseType: !60, size: 32, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !776, file: !531, line: 818, baseType: !445, size: 32, offset: 480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "COMP2", scope: !776, file: !531, line: 819, baseType: !60, size: 32, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "MASK2", scope: !776, file: !531, line: 820, baseType: !60, size: 32, offset: 544)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION2", scope: !776, file: !531, line: 821, baseType: !60, size: 32, offset: 576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !776, file: !531, line: 822, baseType: !445, size: 32, offset: 608)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "COMP3", scope: !776, file: !531, line: 823, baseType: !60, size: 32, offset: 640)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "MASK3", scope: !776, file: !531, line: 824, baseType: !60, size: 32, offset: 672)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION3", scope: !776, file: !531, line: 825, baseType: !60, size: 32, offset: 704)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "CoreDebug_Type", file: !531, line: 1304, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 1298, size: 128, elements: !804)
!804 = !{!805, !806, !807, !808}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "DHCSR", scope: !803, file: !531, line: 1300, baseType: !60, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "DCRSR", scope: !803, file: !531, line: 1301, baseType: !60, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "DCRDR", scope: !803, file: !531, line: 1302, baseType: !60, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "DEMCR", scope: !803, file: !531, line: 1303, baseType: !60, size: 32, offset: 96)
!809 = !{!760}
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_default", scope: !812, file: !813, line: 164, type: !214, isLocal: false, isDefinition: true)
!812 = distinct !DICompileUnit(language: DW_LANG_C99, file: !813, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !814, globals: !829, splitDebugInlining: false, nameTableKind: None)
!813 = !DIFile(filename: "../../../../../driver/board/mt76x7_hdk/external_flash/src/bsp_flash_config.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!814 = !{!815, !51}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_info_t", file: !818, line: 48, baseType: !819)
!818 = !DIFile(filename: "../../../../../driver/board/mt76x7_hdk/external_flash/inc/bsp_flash_config.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !818, line: 38, size: 192, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !819, file: !818, line: 39, baseType: !201, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !819, file: !818, line: 40, baseType: !58, size: 8, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !819, file: !818, line: 41, baseType: !195, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !819, file: !818, line: 42, baseType: !195, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !819, file: !818, line: 43, baseType: !30, size: 32, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !819, file: !818, line: 45, baseType: !58, size: 8, offset: 160)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !819, file: !818, line: 46, baseType: !58, size: 8, offset: 168)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !819, file: !818, line: 47, baseType: !58, size: 8, offset: 176)
!829 = !{!810, !830, !832, !834}
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_default", scope: !812, file: !813, line: 167, type: !219, isLocal: false, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_default", scope: !812, file: !813, line: 170, type: !224, isLocal: false, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "customer_flash_info", scope: !812, file: !813, line: 174, type: !816, isLocal: false, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "log_control_block_freertos", scope: !838, file: !839, line: 59, type: !858, isLocal: false, isDefinition: true)
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !840, retainedTypes: !854, globals: !857, splitDebugInlining: false, nameTableKind: None)
!839 = !DIFile(filename: "../../../../../project/mt7687_hdk/templates/freertos_create_thread/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!840 = !{!345, !350, !841}
!841 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !842, line: 40, baseType: !30, size: 32, elements: !843)
!842 = !DIFile(filename: "../inc/task_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !853}
!844 = !DIEnumerator(name: "TASK_PRIORITY_IDLE", value: 0)
!845 = !DIEnumerator(name: "TASK_PRIORITY_SYSLOG", value: 1)
!846 = !DIEnumerator(name: "TASK_PRIORITY_LOW", value: 2)
!847 = !DIEnumerator(name: "TASK_PRIORITY_BELOW_NORMAL", value: 3)
!848 = !DIEnumerator(name: "TASK_PRIORITY_NORMAL", value: 4)
!849 = !DIEnumerator(name: "TASK_PRIORITY_ABOVE_NORMAL", value: 5)
!850 = !DIEnumerator(name: "TASK_PRIORITY_HIGH", value: 6)
!851 = !DIEnumerator(name: "TASK_PRIORITY_SOFT_REALTIME", value: 7)
!852 = !DIEnumerator(name: "TASK_PRIORITY_HARD_REALTIME", value: 8)
!853 = !DIEnumerator(name: "TASK_PRIORITY_TIMER", value: 19)
!854 = !{!51, !7, !855}
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "TickType_t", file: !856, line: 105, baseType: !61)
!856 = !DIFile(filename: "../../../../../kernel/rtos/FreeRTOS/Source/portable/GCC/ARM_CM4F/portmacro.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!857 = !{!836}
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_control_block_t", file: !346, line: 95, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 89, size: 160, elements: !860)
!860 = !{!861, !862, !863, !864, !865}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "module_name", scope: !859, file: !346, line: 90, baseType: !331, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "log_switch", scope: !859, file: !346, line: 91, baseType: !362, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "print_level", scope: !859, file: !346, line: 92, baseType: !364, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "print_handle", scope: !859, file: !346, line: 93, baseType: !366, size: 32, offset: 96)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "dump_handle", scope: !859, file: !346, line: 94, baseType: !371, size: 32, offset: 128)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !868, file: !869, line: 61, type: !60, isLocal: true, isDefinition: true)
!868 = distinct !DICompileUnit(language: DW_LANG_C99, file: !869, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !870, globals: !923, splitDebugInlining: false, nameTableKind: None)
!869 = !DIFile(filename: "../../../../../project/mt7687_hdk/templates/freertos_create_thread/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!870 = !{!871, !879, !904}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !531, line: 656, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 650, size: 128, elements: !874)
!874 = !{!875, !876, !877, !878}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !873, file: !531, line: 652, baseType: !60, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !873, file: !531, line: 653, baseType: !60, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !873, file: !531, line: 654, baseType: !60, size: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !873, file: !531, line: 655, baseType: !565, size: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !531, line: 418, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 395, size: 1120, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !881, file: !531, line: 397, baseType: !565, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !881, file: !531, line: 398, baseType: !60, size: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !881, file: !531, line: 399, baseType: !60, size: 32, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !881, file: !531, line: 400, baseType: !60, size: 32, offset: 96)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !881, file: !531, line: 401, baseType: !60, size: 32, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !881, file: !531, line: 402, baseType: !60, size: 32, offset: 160)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !881, file: !531, line: 403, baseType: !572, size: 96, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !881, file: !531, line: 404, baseType: !60, size: 32, offset: 288)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !881, file: !531, line: 405, baseType: !60, size: 32, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !881, file: !531, line: 406, baseType: !60, size: 32, offset: 352)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !881, file: !531, line: 407, baseType: !60, size: 32, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !881, file: !531, line: 408, baseType: !60, size: 32, offset: 416)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !881, file: !531, line: 409, baseType: !60, size: 32, offset: 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !881, file: !531, line: 410, baseType: !60, size: 32, offset: 480)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !881, file: !531, line: 411, baseType: !581, size: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !881, file: !531, line: 412, baseType: !565, size: 32, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !881, file: !531, line: 413, baseType: !565, size: 32, offset: 608)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !881, file: !531, line: 414, baseType: !585, size: 128, offset: 640)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !881, file: !531, line: 415, baseType: !587, size: 160, offset: 768)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !881, file: !531, line: 416, baseType: !591, size: 160, offset: 928)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !881, file: !531, line: 417, baseType: !60, size: 32, offset: 1088)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !431, line: 72, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !431, line: 56, size: 525312, elements: !907)
!907 = !{!908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !906, file: !431, line: 57, baseType: !60, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !906, file: !431, line: 58, baseType: !60, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !906, file: !431, line: 59, baseType: !60, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !906, file: !431, line: 60, baseType: !60, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !906, file: !431, line: 61, baseType: !60, size: 32, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !906, file: !431, line: 62, baseType: !60, size: 32, offset: 160)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !906, file: !431, line: 63, baseType: !60, size: 32, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !906, file: !431, line: 64, baseType: !60, size: 32, offset: 224)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !906, file: !431, line: 65, baseType: !60, size: 32, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !906, file: !431, line: 66, baseType: !60, size: 32, offset: 288)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !906, file: !431, line: 67, baseType: !445, size: 32, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !906, file: !431, line: 68, baseType: !60, size: 32, offset: 352)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !906, file: !431, line: 69, baseType: !450, size: 523904, offset: 384)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !906, file: !431, line: 70, baseType: !454, size: 512, offset: 524288)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !906, file: !431, line: 71, baseType: !454, size: 512, offset: 524800)
!923 = !{!924, !866}
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !868, file: !869, line: 59, type: !61, isLocal: false, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "heap_end", scope: !928, file: !929, line: 101, type: !201, isLocal: true, isDefinition: true)
!928 = distinct !DISubprogram(name: "_sbrk_r", scope: !929, file: !929, line: 98, type: !930, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1119, retainedNodes: !1123)
!929 = !DIFile(filename: "../../../../../project/mt7687_hdk/templates/freertos_create_thread/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/freertos_create_thread/GCC")
!930 = !DISubroutineType(types: !931)
!931 = !{!932, !934, !1118}
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !933, line: 123, baseType: !201)
!933 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !936, line: 377, size: 1920, elements: !937)
!936 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!937 = !{!938, !939, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1017, !1037, !1041, !1042, !1043, !1044, !1054, !1067, !1068, !1073, !1092, !1093, !1100, !1101, !1117}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !935, file: !936, line: 381, baseType: !7, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !935, file: !936, line: 386, baseType: !940, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !936, line: 292, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !936, line: 186, size: 832, elements: !943)
!943 = !{!944, !945, !946, !947, !949, !950, !955, !956, !957, !958, !962, !966, !972, !976, !977, !978, !979, !983, !985, !986, !987, !989, !995, !1007}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !942, file: !936, line: 187, baseType: !177, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !942, file: !936, line: 188, baseType: !7, size: 32, offset: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !942, file: !936, line: 189, baseType: !7, size: 32, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !942, file: !936, line: 190, baseType: !948, size: 16, offset: 96)
!948 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !942, file: !936, line: 191, baseType: !948, size: 16, offset: 112)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !942, file: !936, line: 192, baseType: !951, size: 64, offset: 128)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !936, line: 122, size: 64, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !951, file: !936, line: 123, baseType: !177, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !951, file: !936, line: 124, baseType: !7, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !942, file: !936, line: 193, baseType: !7, size: 32, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !942, file: !936, line: 196, baseType: !934, size: 32, offset: 224)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !942, file: !936, line: 200, baseType: !51, size: 32, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !942, file: !936, line: 202, baseType: !959, size: 32, offset: 288)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DISubroutineType(types: !961)
!961 = !{!7, !934, !51, !201, !7}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !942, file: !936, line: 204, baseType: !963, size: 32, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = !DISubroutineType(types: !965)
!965 = !{!7, !934, !51, !331, !7}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !942, file: !936, line: 207, baseType: !967, size: 32, offset: 352)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{!970, !934, !51, !970, !7}
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !971, line: 116, baseType: !174)
!971 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !942, file: !936, line: 208, baseType: !973, size: 32, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(types: !975)
!975 = !{!7, !934, !51}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !942, file: !936, line: 211, baseType: !951, size: 64, offset: 416)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !942, file: !936, line: 212, baseType: !177, size: 32, offset: 480)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !942, file: !936, line: 213, baseType: !7, size: 32, offset: 512)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !942, file: !936, line: 216, baseType: !980, size: 24, offset: 544)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 24, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 3)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !942, file: !936, line: 217, baseType: !984, size: 8, offset: 568)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, elements: !446)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !942, file: !936, line: 220, baseType: !951, size: 64, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !942, file: !936, line: 223, baseType: !7, size: 32, offset: 640)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !942, file: !936, line: 224, baseType: !988, size: 32, offset: 672)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !971, line: 46, baseType: !174)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !942, file: !936, line: 231, baseType: !990, size: 32, offset: 704)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !936, line: 35, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !992, line: 34, baseType: !993)
!992 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !992, line: 33, flags: DIFlagFwdDecl)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !942, file: !936, line: 233, baseType: !996, size: 64, offset: 736)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !971, line: 170, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !971, line: 162, size: 64, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !997, file: !971, line: 164, baseType: !7, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !997, file: !971, line: 169, baseType: !1001, size: 32, offset: 32)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !997, file: !971, line: 165, size: 32, elements: !1002)
!1002 = !{!1003, !1006}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1001, file: !971, line: 167, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1005, line: 116, baseType: !7)
!1005 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1001, file: !971, line: 168, baseType: !229, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !942, file: !936, line: 234, baseType: !7, size: 32, offset: 800)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !935, file: !936, line: 386, baseType: !940, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !935, file: !936, line: 386, baseType: !940, size: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !935, file: !936, line: 388, baseType: !7, size: 32, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !935, file: !936, line: 390, baseType: !201, size: 32, offset: 160)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !935, file: !936, line: 392, baseType: !7, size: 32, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !935, file: !936, line: 394, baseType: !7, size: 32, offset: 224)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !935, file: !936, line: 395, baseType: !1015, size: 32, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !936, line: 45, flags: DIFlagFwdDecl)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !935, file: !936, line: 397, baseType: !1018, size: 32, offset: 288)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !936, line: 349, size: 128, elements: !1020)
!1020 = !{!1021, !1033, !1034, !1035}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !1019, file: !936, line: 352, baseType: !1022, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !936, line: 52, size: 192, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1023, file: !936, line: 54, baseType: !1022, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !1023, file: !936, line: 55, baseType: !7, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !1023, file: !936, line: 55, baseType: !7, size: 32, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !1023, file: !936, line: 55, baseType: !7, size: 32, offset: 96)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !1023, file: !936, line: 55, baseType: !7, size: 32, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !1023, file: !936, line: 56, baseType: !1031, size: 32, offset: 160)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 32, elements: !446)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !936, line: 22, baseType: !195)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !1019, file: !936, line: 353, baseType: !7, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !1019, file: !936, line: 354, baseType: !1022, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !1019, file: !936, line: 355, baseType: !1036, size: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !935, file: !936, line: 399, baseType: !1038, size: 32, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !934}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !935, file: !936, line: 401, baseType: !7, size: 32, offset: 352)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !935, file: !936, line: 404, baseType: !7, size: 32, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !935, file: !936, line: 405, baseType: !201, size: 32, offset: 416)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !935, file: !936, line: 407, baseType: !1045, size: 32, offset: 448)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !936, line: 324, size: 192, elements: !1047)
!1047 = !{!1048, !1050, !1051, !1052}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !1046, file: !936, line: 325, baseType: !1049, size: 48)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 48, elements: !981)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !1046, file: !936, line: 326, baseType: !1049, size: 48, offset: 48)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !1046, file: !936, line: 327, baseType: !322, size: 16, offset: 96)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !1046, file: !936, line: 330, baseType: !1053, size: 64, offset: 128)
!1053 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !935, file: !936, line: 408, baseType: !1055, size: 32, offset: 480)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 32)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !936, line: 60, size: 288, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !1056, file: !936, line: 62, baseType: !7, size: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !1056, file: !936, line: 63, baseType: !7, size: 32, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !1056, file: !936, line: 64, baseType: !7, size: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !1056, file: !936, line: 65, baseType: !7, size: 32, offset: 96)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !1056, file: !936, line: 66, baseType: !7, size: 32, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !1056, file: !936, line: 67, baseType: !7, size: 32, offset: 160)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !1056, file: !936, line: 68, baseType: !7, size: 32, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !1056, file: !936, line: 69, baseType: !7, size: 32, offset: 224)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !1056, file: !936, line: 70, baseType: !7, size: 32, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !935, file: !936, line: 409, baseType: !201, size: 32, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !935, file: !936, line: 412, baseType: !1069, size: 32, offset: 544)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 32)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !7}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !935, file: !936, line: 416, baseType: !1074, size: 32, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 32)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !936, line: 90, size: 1120, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1083}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1075, file: !936, line: 91, baseType: !1074, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !1075, file: !936, line: 92, baseType: !7, size: 32, offset: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !1075, file: !936, line: 93, baseType: !1080, size: 1024, offset: 64)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 1024, elements: !1081)
!1081 = !{!1082}
