; ModuleID = './build/gpc_capture_pulses_polling.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.gpio_backup_restore_t = type { i32, i32 }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.hal_gpc_config_t = type { i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.__va_list = type { i8* }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (%struct._reent*)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !2, file: !3, line: 71, type: !79, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !57, globals: !62, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 121, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!10 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !12, line: 47, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!15 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!16 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!17 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!18 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!19 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!20 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!21 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!22 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!23 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!24 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!25 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!26 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!27 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!28 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!29 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!30 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!31 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!32 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!33 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!34 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!35 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!36 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!37 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!38 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!39 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!40 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!41 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!42 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!43 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!44 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!45 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!46 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!47 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!48 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!49 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!50 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!51 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!52 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!53 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!54 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!55 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!56 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!57 = !{!58, !61}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !6, line: 116, baseType: !7)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !12, line: 95, baseType: !11)
!62 = !{!0, !63}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !2, file: !3, line: 67, type: !65, isLocal: true, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !66, line: 111, baseType: !67)
!66 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 109, size: 96, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !67, file: !66, line: 110, baseType: !70, size: 96)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !66, line: 106, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 102, size: 96, elements: !72)
!72 = !{!73, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !71, file: !66, line: 103, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{null}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !71, file: !66, line: 104, baseType: !74, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !71, file: !66, line: 105, baseType: !74, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !6, line: 62, baseType: !7)
!81 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!82 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!84 = distinct !DIGlobalVariable(name: "hal_gpc_has_initilized", scope: !85, file: !86, line: 47, type: !119, isLocal: true, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !87, globals: !113, splitDebugInlining: false, nameTableKind: None)
!86 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!87 = !{!88, !95, !100, !104, !109}
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 262, baseType: !13, size: 32, elements: !90)
!89 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpc.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "HAL_GPC_STATUS_ERROR", value: -3)
!92 = !DIEnumerator(name: "HAL_GPC_STATUS_ERROR_PORT", value: -2)
!93 = !DIEnumerator(name: "HAL_GPC_STATUS_INVALID_PARAMETER", value: -1)
!94 = !DIEnumerator(name: "HAL_GPC_STATUS_OK", value: 0)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 847, baseType: !7, size: 32, elements: !97)
!96 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!97 = !{!98, !99}
!98 = !DIEnumerator(name: "HAL_GPC_0", value: 0)
!99 = !DIEnumerator(name: "HAL_GPC_MAX_PORT", value: 1)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 256, baseType: !7, size: 32, elements: !101)
!101 = !{!102, !103}
!102 = !DIEnumerator(name: "HAL_GPC_EDGE_RAISING", value: 0)
!103 = !DIEnumerator(name: "HAL_GPC_EDGE_FALLING", value: 1)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 62, baseType: !7, size: 32, elements: !106)
!105 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pcnt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!106 = !{!107, !108}
!107 = !DIEnumerator(name: "HAL_PCNT_EDGE_FALLING", value: 0)
!108 = !DIEnumerator(name: "HAL_PCNT_EDGE_RAISING", value: 1)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 270, baseType: !7, size: 32, elements: !110)
!110 = !{!111, !112}
!111 = !DIEnumerator(name: "HAL_GPC_STATUS_IDLE", value: 0)
!112 = !DIEnumerator(name: "HAL_GPC_STATUS_BUSY", value: 1)
!113 = !{!114, !117, !120}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "pcnt_edge", scope: !85, file: !86, line: 45, type: !116, isLocal: true, isDefinition: true)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_pcnt_edge_t", file: !105, line: 65, baseType: !104)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "pcnt_state_work", scope: !85, file: !86, line: 46, type: !119, isLocal: true, isDefinition: true)
!119 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!120 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!121 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!122 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "gpio_bakup_table", scope: !125, file: !126, line: 62, type: !171, isLocal: true, isDefinition: true)
!125 = distinct !DICompileUnit(language: DW_LANG_C99, file: !126, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !127, retainedTypes: !169, globals: !170, splitDebugInlining: false, nameTableKind: None)
!126 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/low_hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!127 = !{!128, !159, !164}
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !129, line: 55, baseType: !7, size: 32, elements: !130)
!129 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158}
!131 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!132 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!133 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!134 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!135 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!136 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!137 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!138 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!139 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!140 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!141 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!142 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!143 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!144 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!145 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!146 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!147 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!148 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!149 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!150 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!151 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!152 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!153 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!154 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!155 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!156 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!157 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!158 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !160, line: 57, baseType: !7, size: 32, elements: !161)
!160 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!161 = !{!162, !163}
!162 = !DIEnumerator(name: "eDirection_IN", value: 0)
!163 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !165, line: 1209, baseType: !7, size: 32, elements: !166)
!165 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!166 = !{!167, !168}
!167 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!168 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!169 = !{!58}
!170 = !{!123}
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 1408, elements: !181)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_backup_restore_t", file: !126, line: 60, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 57, size: 64, elements: !174)
!174 = !{!175, !180}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "reg_data", scope: !173, file: !126, line: 58, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !177, line: 48, baseType: !178)
!177 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !179, line: 79, baseType: !7)
!179 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!180 = !DIDerivedType(tag: DW_TAG_member, name: "reg_addr", scope: !173, file: !126, line: 59, baseType: !176, size: 32, offset: 32)
!181 = !{!182}
!182 = !DISubrange(count: 22)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !185, file: !186, line: 43, type: !176, isLocal: true, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !187, globals: !193, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!187 = !{!188, !80, !190, !192}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !176)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!193 = !{!183, !194}
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !185, file: !186, line: 44, type: !176, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !198, file: !199, line: 54, type: !176, isLocal: false, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !224, globals: !233, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!200 = !{!201, !207}
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !202, line: 71, baseType: !7, size: 32, elements: !203)
!202 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!203 = !{!204, !205, !206}
!204 = !DIEnumerator(name: "UART_PORT0", value: 0)
!205 = !DIEnumerator(name: "UART_PORT1", value: 1)
!206 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !208, line: 129, baseType: !7, size: 32, elements: !209)
!208 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!209 = !{!210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!210 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!211 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!212 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!213 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!214 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!215 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!216 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!217 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!218 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!219 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!220 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!221 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!222 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!223 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!224 = !{!188, !176, !225, !227, !229, !231, !80}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !6, line: 113, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !6, line: 59, baseType: !230)
!230 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !229)
!233 = !{!196}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !236, file: !237, line: 53, type: !328, isLocal: false, isDefinition: true)
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !238, retainedTypes: !247, globals: !327, splitDebugInlining: false, nameTableKind: None)
!237 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!238 = !{!239, !11}
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !240, line: 152, baseType: !13, size: 32, elements: !241)
!240 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!241 = !{!242, !243, !244, !245, !246}
!242 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!243 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!244 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!245 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!246 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!247 = !{!248, !249, !176, !250, !252, !288}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !12, line: 97, baseType: !61)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !177, line: 44, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !179, line: 77, baseType: !13)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !254, line: 378, baseType: !255)
!254 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 363, size: 28704, elements: !256)
!256 = !{!257, !261, !265, !266, !267, !268, !269, !270, !271, !272, !276, !283, !287}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !255, file: !254, line: 365, baseType: !258, size: 256)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 256, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 8)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !255, file: !254, line: 366, baseType: !262, size: 768, offset: 256)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 768, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 24)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !255, file: !254, line: 367, baseType: !258, size: 256, offset: 1024)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !255, file: !254, line: 368, baseType: !262, size: 768, offset: 1280)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !255, file: !254, line: 369, baseType: !258, size: 256, offset: 2048)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !255, file: !254, line: 370, baseType: !262, size: 768, offset: 2304)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !255, file: !254, line: 371, baseType: !258, size: 256, offset: 3072)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !255, file: !254, line: 372, baseType: !262, size: 768, offset: 3328)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !255, file: !254, line: 373, baseType: !258, size: 256, offset: 4096)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !255, file: !254, line: 374, baseType: !273, size: 1792, offset: 4352)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 1792, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 56)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !255, file: !254, line: 375, baseType: !277, size: 1920, offset: 6144)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 1920, elements: !281)
!278 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !177, line: 24, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !179, line: 43, baseType: !230)
!281 = !{!282}
!282 = !DISubrange(count: 240)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !255, file: !254, line: 376, baseType: !284, size: 20608, offset: 8064)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 20608, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 644)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !255, file: !254, line: 377, baseType: !191, size: 32, offset: 28672)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !254, line: 418, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 395, size: 1120, elements: !291)
!291 = !{!292, !294, !295, !296, !297, !298, !299, !303, !304, !305, !306, !307, !308, !309, !310, !314, !315, !316, !320, !324, !326}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !290, file: !254, line: 397, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !290, file: !254, line: 398, baseType: !191, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !290, file: !254, line: 399, baseType: !191, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !290, file: !254, line: 400, baseType: !191, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !290, file: !254, line: 401, baseType: !191, size: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !290, file: !254, line: 402, baseType: !191, size: 32, offset: 160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !290, file: !254, line: 403, baseType: !300, size: 96, offset: 192)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 96, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 12)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !290, file: !254, line: 404, baseType: !191, size: 32, offset: 288)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !290, file: !254, line: 405, baseType: !191, size: 32, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !290, file: !254, line: 406, baseType: !191, size: 32, offset: 352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !290, file: !254, line: 407, baseType: !191, size: 32, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !290, file: !254, line: 408, baseType: !191, size: 32, offset: 416)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !290, file: !254, line: 409, baseType: !191, size: 32, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !290, file: !254, line: 410, baseType: !191, size: 32, offset: 480)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !290, file: !254, line: 411, baseType: !311, size: 64, offset: 512)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 64, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 2)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !290, file: !254, line: 412, baseType: !293, size: 32, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !290, file: !254, line: 413, baseType: !293, size: 32, offset: 608)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !290, file: !254, line: 414, baseType: !317, size: 128, offset: 640)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 128, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 4)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !290, file: !254, line: 415, baseType: !321, size: 160, offset: 768)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 160, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 5)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !290, file: !254, line: 416, baseType: !325, size: 160, offset: 928)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 160, elements: !322)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !290, file: !254, line: 417, baseType: !191, size: 32, offset: 1088)
!327 = !{!234}
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 6144, elements: !337)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !237, line: 50, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 47, size: 64, elements: !331)
!331 = !{!332, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !330, file: !237, line: 48, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !248}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !330, file: !237, line: 49, baseType: !176, size: 32, offset: 32)
!337 = !{!338}
!338 = !DISubrange(count: 96)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !341, file: !342, line: 61, type: !374, isLocal: true, isDefinition: true)
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !343, retainedTypes: !372, globals: !373, splitDebugInlining: false, nameTableKind: None)
!342 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!343 = !{!344, !352, !359, !363, !368}
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !345, line: 387, baseType: !13, size: 32, elements: !346)
!345 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!346 = !{!347, !348, !349, !350, !351}
!347 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!348 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!349 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!350 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!351 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!352 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 657, baseType: !7, size: 32, elements: !353)
!353 = !{!354, !355, !356, !357, !358}
!354 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!355 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!356 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!357 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!358 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!359 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !345, line: 397, baseType: !7, size: 32, elements: !360)
!360 = !{!361, !362}
!361 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!362 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 666, baseType: !7, size: 32, elements: !364)
!364 = !{!365, !366, !367}
!365 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!366 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!367 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_BUS", value: 2)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !345, line: 380, baseType: !7, size: 32, elements: !369)
!369 = !{!370, !371}
!370 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!371 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!372 = !{!249, !176}
!373 = !{!339}
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 640, elements: !322)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !342, line: 55, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 51, size: 128, elements: !377)
!377 = !{!378, !380, !390}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !376, file: !342, line: 52, baseType: !379, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !345, line: 400, baseType: !359)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !376, file: !342, line: 53, baseType: !381, size: 64, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !342, line: 49, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 46, size: 64, elements: !383)
!383 = !{!384, !389}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !382, file: !342, line: 47, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !345, line: 371, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !249}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !382, file: !342, line: 48, baseType: !249, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !376, file: !342, line: 54, baseType: !119, size: 8, offset: 96)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !393, file: !394, line: 77, type: !459, isLocal: true, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !395, retainedTypes: !445, globals: !447, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!395 = !{!396, !404, !409, !425, !431, !435, !201, !207, !440}
!396 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 345, baseType: !13, size: 32, elements: !398)
!397 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!398 = !{!399, !400, !401, !402, !403}
!399 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!400 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!401 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!402 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!403 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!404 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 109, baseType: !7, size: 32, elements: !405)
!405 = !{!406, !407, !408}
!406 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!407 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!408 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!409 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 302, baseType: !7, size: 32, elements: !410)
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!411 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!412 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!413 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!414 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!415 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!416 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!417 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!418 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!419 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!420 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!421 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!422 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!423 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!424 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 321, baseType: !7, size: 32, elements: !426)
!426 = !{!427, !428, !429, !430}
!427 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!428 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!429 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!430 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 330, baseType: !7, size: 32, elements: !432)
!432 = !{!433, !434}
!433 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!434 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 337, baseType: !7, size: 32, elements: !436)
!436 = !{!437, !438, !439}
!437 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!438 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!439 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 355, baseType: !13, size: 32, elements: !441)
!441 = !{!442, !443, !444}
!442 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!443 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!444 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!445 = !{!7, !249, !230, !446, !279}
!446 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!447 = !{!391, !448}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "func_tbl", scope: !450, file: !394, line: 536, type: !457, isLocal: true, isDefinition: true)
!450 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !394, file: !394, line: 534, type: !451, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !455)
!451 = !DISubroutineType(types: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !208, line: 197, baseType: !74)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !96, line: 113, baseType: !404)
!455 = !{!456}
!456 = !DILocalVariable(name: "uart_port", arg: 1, scope: !450, file: !394, line: 534, type: !454)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 64, elements: !312)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 1024, elements: !312)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !394, line: 75, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 68, size: 512, elements: !462)
!462 = !{!463, !464, !476, !477, !488, !489}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !461, file: !394, line: 69, baseType: !119, size: 8)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !461, file: !394, line: 70, baseType: !465, size: 128, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !397, line: 378, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 373, size: 128, elements: !467)
!467 = !{!468, !470, !472, !474}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !466, file: !397, line: 374, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !397, line: 317, baseType: !409)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !466, file: !397, line: 375, baseType: !471, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !397, line: 326, baseType: !425)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !466, file: !397, line: 376, baseType: !473, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !397, line: 333, baseType: !431)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !466, file: !397, line: 377, baseType: !475, size: 32, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !397, line: 341, baseType: !435)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !461, file: !394, line: 71, baseType: !119, size: 8, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !461, file: !394, line: 72, baseType: !478, size: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !394, line: 66, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 63, size: 64, elements: !480)
!480 = !{!481, !487}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !479, file: !394, line: 64, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !397, line: 410, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !486, !249}
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !397, line: 359, baseType: !440)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !479, file: !394, line: 65, baseType: !249, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !461, file: !394, line: 73, baseType: !119, size: 8, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !461, file: !394, line: 74, baseType: !490, size: 224, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !397, line: 390, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 382, size: 224, elements: !492)
!492 = !{!493, !495, !496, !497, !498, !499, !500}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !491, file: !397, line: 383, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !491, file: !397, line: 384, baseType: !176, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !491, file: !397, line: 385, baseType: !176, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !491, file: !397, line: 386, baseType: !494, size: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !491, file: !397, line: 387, baseType: !176, size: 32, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !491, file: !397, line: 388, baseType: !176, size: 32, offset: 160)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !491, file: !397, line: 389, baseType: !176, size: 32, offset: 192)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !503, file: !504, line: 59, type: !176, isLocal: false, isDefinition: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !505, globals: !568, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!505 = !{!506, !514, !539}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !254, line: 656, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 650, size: 128, elements: !509)
!509 = !{!510, !511, !512, !513}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !508, file: !254, line: 652, baseType: !191, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !508, file: !254, line: 653, baseType: !191, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !508, file: !254, line: 654, baseType: !191, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !508, file: !254, line: 655, baseType: !293, size: 32, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !254, line: 418, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 395, size: 1120, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !516, file: !254, line: 397, baseType: !293, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !516, file: !254, line: 398, baseType: !191, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !516, file: !254, line: 399, baseType: !191, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !516, file: !254, line: 400, baseType: !191, size: 32, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !516, file: !254, line: 401, baseType: !191, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !516, file: !254, line: 402, baseType: !191, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !516, file: !254, line: 403, baseType: !300, size: 96, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !516, file: !254, line: 404, baseType: !191, size: 32, offset: 288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !516, file: !254, line: 405, baseType: !191, size: 32, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !516, file: !254, line: 406, baseType: !191, size: 32, offset: 352)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !516, file: !254, line: 407, baseType: !191, size: 32, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !516, file: !254, line: 408, baseType: !191, size: 32, offset: 416)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !516, file: !254, line: 409, baseType: !191, size: 32, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !516, file: !254, line: 410, baseType: !191, size: 32, offset: 480)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !516, file: !254, line: 411, baseType: !311, size: 64, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !516, file: !254, line: 412, baseType: !293, size: 32, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !516, file: !254, line: 413, baseType: !293, size: 32, offset: 608)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !516, file: !254, line: 414, baseType: !317, size: 128, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !516, file: !254, line: 415, baseType: !321, size: 160, offset: 768)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !516, file: !254, line: 416, baseType: !325, size: 160, offset: 928)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !516, file: !254, line: 417, baseType: !191, size: 32, offset: 1088)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !541, line: 72, baseType: !542)
!541 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 56, size: 525312, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !558, !559, !563, !567}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !542, file: !541, line: 57, baseType: !191, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !542, file: !541, line: 58, baseType: !191, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !542, file: !541, line: 59, baseType: !191, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !542, file: !541, line: 60, baseType: !191, size: 32, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !542, file: !541, line: 61, baseType: !191, size: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !542, file: !541, line: 62, baseType: !191, size: 32, offset: 160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !542, file: !541, line: 63, baseType: !191, size: 32, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !542, file: !541, line: 64, baseType: !191, size: 32, offset: 224)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !542, file: !541, line: 65, baseType: !191, size: 32, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !542, file: !541, line: 66, baseType: !191, size: 32, offset: 288)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !542, file: !541, line: 67, baseType: !555, size: 32, offset: 320)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 32, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 1)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !542, file: !541, line: 68, baseType: !191, size: 32, offset: 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !542, file: !541, line: 69, baseType: !560, size: 523904, offset: 384)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 523904, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 16372)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !542, file: !541, line: 70, baseType: !564, size: 512, offset: 524288)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 512, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 16)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !542, file: !541, line: 71, baseType: !564, size: 512, offset: 524800)
!568 = !{!501, !569}
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !503, file: !504, line: 61, type: !191, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "heap_end", scope: !573, file: !574, line: 66, type: !579, isLocal: true, isDefinition: true)
!573 = distinct !DISubprogram(name: "_sbrk_r", scope: !574, file: !574, line: 63, type: !575, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !771, retainedNodes: !775)
!574 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!575 = !DISubroutineType(types: !576)
!576 = !{!577, !580, !770}
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !578, line: 123, baseType: !579)
!578 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !582, line: 377, size: 1920, elements: !583)
!582 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!583 = !{!584, !585, !659, !660, !661, !662, !663, !664, !665, !668, !689, !693, !694, !695, !696, !706, !719, !720, !725, !744, !745, !752, !753, !769}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !581, file: !582, line: 381, baseType: !13, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !581, file: !582, line: 386, baseType: !586, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !582, line: 292, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !582, line: 186, size: 832, elements: !589)
!589 = !{!590, !592, !593, !594, !596, !597, !602, !603, !604, !605, !609, !615, !622, !626, !627, !628, !629, !633, !635, !636, !637, !639, !645, !658}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !588, file: !582, line: 187, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !588, file: !582, line: 188, baseType: !13, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !588, file: !582, line: 189, baseType: !13, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !588, file: !582, line: 190, baseType: !595, size: 16, offset: 96)
!595 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !588, file: !582, line: 191, baseType: !595, size: 16, offset: 112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !588, file: !582, line: 192, baseType: !598, size: 64, offset: 128)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !582, line: 122, size: 64, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !598, file: !582, line: 123, baseType: !591, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !598, file: !582, line: 124, baseType: !13, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !588, file: !582, line: 193, baseType: !13, size: 32, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !588, file: !582, line: 196, baseType: !580, size: 32, offset: 224)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !588, file: !582, line: 200, baseType: !249, size: 32, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !588, file: !582, line: 202, baseType: !606, size: 32, offset: 288)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DISubroutineType(types: !608)
!608 = !{!13, !580, !249, !579, !13}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !588, file: !582, line: 204, baseType: !610, size: 32, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DISubroutineType(types: !612)
!612 = !{!13, !580, !249, !613, !13}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !588, file: !582, line: 207, baseType: !616, size: 32, offset: 352)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DISubroutineType(types: !618)
!618 = !{!619, !580, !249, !619, !13}
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !620, line: 116, baseType: !621)
!620 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!621 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !588, file: !582, line: 208, baseType: !623, size: 32, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DISubroutineType(types: !625)
!625 = !{!13, !580, !249}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !588, file: !582, line: 211, baseType: !598, size: 64, offset: 416)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !588, file: !582, line: 212, baseType: !591, size: 32, offset: 480)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !588, file: !582, line: 213, baseType: !13, size: 32, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !588, file: !582, line: 216, baseType: !630, size: 24, offset: 544)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 24, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 3)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !588, file: !582, line: 217, baseType: !634, size: 8, offset: 568)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 8, elements: !556)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !588, file: !582, line: 220, baseType: !598, size: 64, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !588, file: !582, line: 223, baseType: !13, size: 32, offset: 640)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !588, file: !582, line: 224, baseType: !638, size: 32, offset: 672)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !620, line: 46, baseType: !621)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !588, file: !582, line: 231, baseType: !640, size: 32, offset: 704)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !582, line: 35, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !642, line: 34, baseType: !643)
!642 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !642, line: 33, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !588, file: !582, line: 233, baseType: !646, size: 64, offset: 736)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !620, line: 170, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !620, line: 162, size: 64, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !647, file: !620, line: 164, baseType: !13, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !647, file: !620, line: 169, baseType: !651, size: 32, offset: 32)
!651 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !647, file: !620, line: 165, size: 32, elements: !652)
!652 = !{!653, !656}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !651, file: !620, line: 167, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !655, line: 116, baseType: !13)
!655 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !651, file: !620, line: 168, baseType: !657, size: 32)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 32, elements: !318)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !588, file: !582, line: 234, baseType: !13, size: 32, offset: 800)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !581, file: !582, line: 386, baseType: !586, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !581, file: !582, line: 386, baseType: !586, size: 32, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !581, file: !582, line: 388, baseType: !13, size: 32, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !581, file: !582, line: 390, baseType: !579, size: 32, offset: 160)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !581, file: !582, line: 392, baseType: !13, size: 32, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !581, file: !582, line: 394, baseType: !13, size: 32, offset: 224)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !581, file: !582, line: 395, baseType: !666, size: 32, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !582, line: 45, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !581, file: !582, line: 397, baseType: !669, size: 32, offset: 288)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !582, line: 349, size: 128, elements: !671)
!671 = !{!672, !685, !686, !687}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !670, file: !582, line: 352, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !582, line: 52, size: 192, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !674, file: !582, line: 54, baseType: !673, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !674, file: !582, line: 55, baseType: !13, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !674, file: !582, line: 55, baseType: !13, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !674, file: !582, line: 55, baseType: !13, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !674, file: !582, line: 55, baseType: !13, size: 32, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !674, file: !582, line: 56, baseType: !682, size: 32, offset: 160)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 32, elements: !556)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !582, line: 22, baseType: !684)
!684 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !670, file: !582, line: 353, baseType: !13, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !670, file: !582, line: 354, baseType: !673, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !670, file: !582, line: 355, baseType: !688, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !581, file: !582, line: 399, baseType: !690, size: 32, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !580}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !581, file: !582, line: 401, baseType: !13, size: 32, offset: 352)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !581, file: !582, line: 404, baseType: !13, size: 32, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !581, file: !582, line: 405, baseType: !579, size: 32, offset: 416)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !581, file: !582, line: 407, baseType: !697, size: 32, offset: 448)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !582, line: 324, size: 192, elements: !699)
!699 = !{!700, !702, !703, !704}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !698, file: !582, line: 325, baseType: !701, size: 48)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 48, elements: !631)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !698, file: !582, line: 326, baseType: !701, size: 48, offset: 48)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !698, file: !582, line: 327, baseType: !228, size: 16, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !698, file: !582, line: 330, baseType: !705, size: 64, offset: 128)
!705 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !581, file: !582, line: 408, baseType: !707, size: 32, offset: 480)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !582, line: 60, size: 288, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !708, file: !582, line: 62, baseType: !13, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !708, file: !582, line: 63, baseType: !13, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !708, file: !582, line: 64, baseType: !13, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !708, file: !582, line: 65, baseType: !13, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !708, file: !582, line: 66, baseType: !13, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !708, file: !582, line: 67, baseType: !13, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !708, file: !582, line: 68, baseType: !13, size: 32, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !708, file: !582, line: 69, baseType: !13, size: 32, offset: 224)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !708, file: !582, line: 70, baseType: !13, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !581, file: !582, line: 409, baseType: !579, size: 32, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !581, file: !582, line: 412, baseType: !721, size: 32, offset: 544)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !13}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !581, file: !582, line: 416, baseType: !726, size: 32, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !582, line: 90, size: 1120, elements: !728)
!728 = !{!729, !730, !731, !735}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !727, file: !582, line: 91, baseType: !726, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !727, file: !582, line: 92, baseType: !13, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !727, file: !582, line: 93, baseType: !732, size: 1024, offset: 64)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1024, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !727, file: !582, line: 94, baseType: !736, size: 32, offset: 1088)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 32)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !582, line: 79, size: 2112, elements: !738)
!738 = !{!739, !741, !742, !743}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !737, file: !582, line: 80, baseType: !740, size: 1024)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 1024, elements: !733)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !737, file: !582, line: 81, baseType: !740, size: 1024, offset: 1024)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !737, file: !582, line: 83, baseType: !683, size: 32, offset: 2048)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !737, file: !582, line: 86, baseType: !683, size: 32, offset: 2080)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !581, file: !582, line: 417, baseType: !727, size: 1120, offset: 608)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !581, file: !582, line: 420, baseType: !746, size: 96, offset: 1728)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !582, line: 296, size: 96, elements: !747)
!747 = !{!748, !750, !751}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !746, file: !582, line: 298, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !746, file: !582, line: 299, baseType: !13, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !746, file: !582, line: 300, baseType: !586, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !581, file: !582, line: 421, baseType: !586, size: 32, offset: 1824)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !581, file: !582, line: 422, baseType: !754, size: 32, offset: 1856)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !582, line: 359, size: 640, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !763, !764, !765, !766, !767, !768}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !755, file: !582, line: 362, baseType: !579, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !755, file: !582, line: 363, baseType: !646, size: 64, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !755, file: !582, line: 364, baseType: !646, size: 64, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !755, file: !582, line: 365, baseType: !646, size: 64, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !755, file: !582, line: 366, baseType: !762, size: 64, offset: 224)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 64, elements: !259)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !755, file: !582, line: 367, baseType: !13, size: 32, offset: 288)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !755, file: !582, line: 368, baseType: !646, size: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !755, file: !582, line: 369, baseType: !646, size: 64, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !755, file: !582, line: 370, baseType: !646, size: 64, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !755, file: !582, line: 371, baseType: !646, size: 64, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !755, file: !582, line: 372, baseType: !646, size: 64, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !581, file: !582, line: 423, baseType: !579, size: 32, offset: 1888)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !655, line: 46, baseType: !7)
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !773, globals: !774, splitDebugInlining: false, nameTableKind: None)
!772 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!773 = !{!579, !577}
!774 = !{!571}
!775 = !{!776, !777, !778, !779}
!776 = !DILocalVariable(name: "r", arg: 1, scope: !573, file: !574, line: 63, type: !580)
!777 = !DILocalVariable(name: "nbytes", arg: 2, scope: !573, file: !574, line: 63, type: !770)
!778 = !DILocalVariable(name: "prev_heap_end", scope: !573, file: !574, line: 67, type: !579)
!779 = !DILocalVariable(name: "stack", scope: !573, file: !574, line: 68, type: !579)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !782, file: !787, line: 4, type: !793, isLocal: false, isDefinition: true)
!782 = distinct !DICompileUnit(language: DW_LANG_C99, file: !783, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !784, splitDebugInlining: false, nameTableKind: None)
!783 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!784 = !{!780, !785, !791}
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !782, file: !787, line: 5, type: !788, isLocal: false, isDefinition: true)
!787 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 88, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 11)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !782, file: !787, line: 6, type: !788, isLocal: false, isDefinition: true)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 248, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 31)
!796 = distinct !DICompileUnit(language: DW_LANG_C99, file: !797, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !798, retainedTypes: !799, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!798 = !{!164}
!799 = !{!58, !60}
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !801, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !802, retainedTypes: !808, splitDebugInlining: false, nameTableKind: None)
!801 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pcnt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!802 = !{!803, !104}
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 55, baseType: !7, size: 32, elements: !804)
!804 = !{!805, !806, !807}
!805 = !DIEnumerator(name: "HAL_PCNT_STATUS_OK", value: 0)
!806 = !DIEnumerator(name: "HAL_PCNT_STATUS_NOT_SUPPORTED", value: 1)
!807 = !DIEnumerator(name: "HAL_PCNT_STATUS_INVALID_PARAMETER", value: 2)
!808 = !{!176, !58}
!809 = distinct !DICompileUnit(language: DW_LANG_C99, file: !810, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !811, retainedTypes: !889, splitDebugInlining: false, nameTableKind: None)
!810 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!811 = !{!812}
!812 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !813, line: 150, baseType: !7, size: 32, elements: !814)
!813 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888}
!815 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!816 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!817 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!818 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!819 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!820 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!821 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!822 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!823 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!824 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!825 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!826 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!827 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!828 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!829 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!830 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!831 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!832 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!833 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!834 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!835 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!836 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!837 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!838 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!839 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!840 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!841 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!842 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!843 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!844 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!845 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!846 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!847 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!848 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!849 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!850 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!851 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!852 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!853 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!854 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!855 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!856 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!857 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!858 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!859 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!860 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!861 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!862 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!863 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!864 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!865 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!866 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!867 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!868 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!869 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!870 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!871 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!872 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!873 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!874 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!875 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!876 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!877 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!878 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!879 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!880 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!881 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!882 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!883 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!884 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!885 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!886 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!887 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!888 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!889 = !{!58, !80}
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !892, splitDebugInlining: false, nameTableKind: None)
!891 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!892 = !{!893, !918}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !254, line: 418, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 395, size: 1120, elements: !896)
!896 = !{!897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !895, file: !254, line: 397, baseType: !293, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !895, file: !254, line: 398, baseType: !191, size: 32, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !895, file: !254, line: 399, baseType: !191, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !895, file: !254, line: 400, baseType: !191, size: 32, offset: 96)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !895, file: !254, line: 401, baseType: !191, size: 32, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !895, file: !254, line: 402, baseType: !191, size: 32, offset: 160)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !895, file: !254, line: 403, baseType: !300, size: 96, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !895, file: !254, line: 404, baseType: !191, size: 32, offset: 288)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !895, file: !254, line: 405, baseType: !191, size: 32, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !895, file: !254, line: 406, baseType: !191, size: 32, offset: 352)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !895, file: !254, line: 407, baseType: !191, size: 32, offset: 384)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !895, file: !254, line: 408, baseType: !191, size: 32, offset: 416)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !895, file: !254, line: 409, baseType: !191, size: 32, offset: 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !895, file: !254, line: 410, baseType: !191, size: 32, offset: 480)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !895, file: !254, line: 411, baseType: !311, size: 64, offset: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !895, file: !254, line: 412, baseType: !293, size: 32, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !895, file: !254, line: 413, baseType: !293, size: 32, offset: 608)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !895, file: !254, line: 414, baseType: !317, size: 128, offset: 640)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !895, file: !254, line: 415, baseType: !321, size: 160, offset: 768)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !895, file: !254, line: 416, baseType: !325, size: 160, offset: 928)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !895, file: !254, line: 417, baseType: !191, size: 32, offset: 1088)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !254, line: 378, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 363, size: 28704, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !920, file: !254, line: 365, baseType: !258, size: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !920, file: !254, line: 366, baseType: !262, size: 768, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !920, file: !254, line: 367, baseType: !258, size: 256, offset: 1024)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !920, file: !254, line: 368, baseType: !262, size: 768, offset: 1280)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !920, file: !254, line: 369, baseType: !258, size: 256, offset: 2048)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !920, file: !254, line: 370, baseType: !262, size: 768, offset: 2304)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !920, file: !254, line: 371, baseType: !258, size: 256, offset: 3072)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !920, file: !254, line: 372, baseType: !262, size: 768, offset: 3328)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !920, file: !254, line: 373, baseType: !258, size: 256, offset: 4096)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !920, file: !254, line: 374, baseType: !273, size: 1792, offset: 4352)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !920, file: !254, line: 375, baseType: !277, size: 1920, offset: 6144)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !920, file: !254, line: 376, baseType: !284, size: 20608, offset: 8064)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !920, file: !254, line: 377, baseType: !191, size: 32, offset: 28672)
!935 = distinct !DICompileUnit(language: DW_LANG_C99, file: !936, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !937, splitDebugInlining: false, nameTableKind: None)
!936 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!937 = !{!128, !812}
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !939, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !940, splitDebugInlining: false, nameTableKind: None)
!939 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/timer.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!940 = !{!621, !58}
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!942 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !945, retainedTypes: !1004, splitDebugInlining: false, nameTableKind: None)
!944 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!945 = !{!946, !953, !128, !984, !990, !994, !998, !159}
!946 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !947, line: 233, baseType: !13, size: 32, elements: !948)
!947 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!948 = !{!949, !950, !951, !952}
!949 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!950 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!951 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!952 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 249, baseType: !7, size: 32, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983}
!955 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!956 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!957 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!958 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!959 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!960 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!961 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!962 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!963 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!964 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!965 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!966 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!967 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!968 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!969 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!970 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!971 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!972 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!973 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!974 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!975 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!976 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!977 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!978 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!979 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!980 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!981 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!982 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!983 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!984 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !947, line: 224, baseType: !13, size: 32, elements: !985)
!985 = !{!986, !987, !988, !989}
!986 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!987 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!988 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!989 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!990 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !947, line: 217, baseType: !7, size: 32, elements: !991)
!991 = !{!992, !993}
!992 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!993 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!994 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !947, line: 210, baseType: !7, size: 32, elements: !995)
!995 = !{!996, !997}
!996 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!997 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!998 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !947, line: 242, baseType: !7, size: 32, elements: !999)
!999 = !{!1000, !1001, !1002, !1003}
!1000 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!1001 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!1002 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!1003 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!1004 = !{!1005, !249, !1006, !279, !1007, !1008}
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !129, line: 87, baseType: !128)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !947, line: 220, baseType: !990)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !947, line: 247, baseType: !998)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !160, line: 60, baseType: !159)
!1009 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1010, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1011, retainedTypes: !1012, splitDebugInlining: false, nameTableKind: None)
!1010 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpc_capture_pulses_polling/GCC")
!1011 = !{!404, !409, !425, !431, !435, !953, !88, !100, !95, !994, !990}
!1012 = !{!13}
!1013 = !{!"Ubuntu clang version 14.0.6"}
!1014 = !{i32 7, !"Dwarf Version", i32 2}
!1015 = !{i32 2, !"Debug Info Version", i32 3}
!1016 = !{i32 1, !"wchar_size", i32 4}
!1017 = !{i32 1, !"min_enum_size", i32 4}
!1018 = !{i32 1, !"branch-target-enforcement", i32 0}
!1019 = !{i32 1, !"sign-return-address", i32 0}
!1020 = !{i32 1, !"sign-return-address-all", i32 0}
!1021 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!1022 = !{i32 7, !"frame-pointer", i32 2}
!1023 = distinct !DISubprogram(name: "GPT_ResetTimer", scope: !3, file: !3, line: 73, type: !1024, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1026)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{null, !60, !60, !119}
!1026 = !{!1027, !1028, !1029}
!1027 = !DILocalVariable(name: "timerNum", arg: 1, scope: !1023, file: !3, line: 73, type: !60)
!1028 = !DILocalVariable(name: "countValue", arg: 2, scope: !1023, file: !3, line: 73, type: !60)
!1029 = !DILocalVariable(name: "autoRepeat", arg: 3, scope: !1023, file: !3, line: 73, type: !119)
!1030 = !DILocation(line: 0, scope: !1023)
!1031 = !DILocation(line: 75, column: 5, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 75, column: 5)
!1033 = !DILocation(line: 75, column: 5, scope: !1023)
!1034 = !DILocation(line: 75, column: 5, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 75, column: 5)
!1036 = distinct !{!1036, !1034, !1034}
!1037 = !DILocation(line: 77, column: 9, scope: !1023)
!1038 = !DILocation(line: 78, column: 30, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 77, column: 24)
!1040 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 77, column: 9)
!1041 = !DILocation(line: 0, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 79, column: 13)
!1043 = !DILocation(line: 79, column: 13, scope: !1039)
!1044 = !DILocation(line: 80, column: 34, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 79, column: 37)
!1046 = !DILocation(line: 81, column: 9, scope: !1045)
!1047 = !DILocation(line: 82, column: 34, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 81, column: 16)
!1049 = !DILocation(line: 85, column: 30, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 84, column: 31)
!1051 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 84, column: 16)
!1052 = !DILocation(line: 0, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 86, column: 13)
!1054 = !DILocation(line: 86, column: 13, scope: !1050)
!1055 = !DILocation(line: 87, column: 34, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 86, column: 37)
!1057 = !DILocation(line: 88, column: 9, scope: !1056)
!1058 = !DILocation(line: 89, column: 34, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 88, column: 16)
!1060 = !DILocation(line: 92, column: 1, scope: !1023)
!1061 = distinct !DISubprogram(name: "GPT_Start", scope: !3, file: !3, line: 94, type: !1062, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1064)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !60}
!1064 = !{!1065}
!1065 = !DILocalVariable(name: "timerNum", arg: 1, scope: !1061, file: !3, line: 94, type: !60)
!1066 = !DILocation(line: 0, scope: !1061)
!1067 = !DILocation(line: 96, column: 5, scope: !1061)
!1068 = !DILocation(line: 96, column: 5, scope: !1069)
