; ModuleID = 'build/arduino_due/userspace/shared_mem/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

module asm ".text"
module asm ".balign 2"
module asm ".thumb"
module asm ".pushsection data_smem_user_part_data,\22aw\22,%progbits"
module asm "\09.global user_part_placeholder"
module asm "\09user_part_placeholder:"
module asm "\09.popsection"
module asm "\09"
module asm ".pushsection data_smem_red_part_data,\22aw\22,%progbits"
module asm "\09.global red_part_placeholder"
module asm "\09red_part_placeholder:"
module asm "\09.popsection"
module asm "\09"
module asm ".pushsection data_smem_enc_part_data,\22aw\22,%progbits"
module asm "\09.global enc_part_placeholder"
module asm "\09enc_part_placeholder:"
module asm "\09.popsection"
module asm "\09"
module asm ".pushsection data_smem_blk_part_data,\22aw\22,%progbits"
module asm "\09.global blk_part_placeholder"
module asm "\09blk_part_placeholder:"
module asm "\09.popsection"
module asm "\09"
module asm ".pushsection data_smem_ct_part_data,\22aw\22,%progbits"
module asm "\09.global ct_part_placeholder"
module asm "\09ct_part_placeholder:"
module asm "\09.popsection"
module asm "\09"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.z_stack_data = type { i32, i8* }
%struct.k_mem_partition = type { i32, i32, %struct._thread_userspace_local_data }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_thread_idx_map", scope: !27, file: !112, line: 59, type: !130, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !108, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem/zephyr/kobject_hash.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !105, !106, !107}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!106 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!107 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !{!25, !109, !123, !331, !336}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "asso_values", scope: !111, file: !112, line: 39, type: !120, isLocal: true, isDefinition: true)
!111 = distinct !DISubprogram(name: "hash", scope: !112, file: !112, line: 37, type: !113, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !117)
!112 = !DIFile(filename: "kobject_hash.gperf", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem")
!113 = !DISubroutineType(types: !114)
!114 = !{!32, !102, !115}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 214, baseType: !32)
!116 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !{!118, !119}
!118 = !DILocalVariable(name: "str", arg: 1, scope: !111, file: !112, line: 37, type: !102)
!119 = !DILocalVariable(name: "len", arg: 2, scope: !111, file: !112, line: 37, type: !115)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 2048, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 256)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "wordlist", scope: !27, file: !112, line: 76, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 1152, align: 32, elements: !329)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_object", file: !31, line: 85, size: 96, align: 32, elements: !127)
!127 = !{!128, !129, !134, !135, !136}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !31, line: 86, baseType: !105, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !126, file: !31, line: 87, baseType: !130, size: 16, offset: 32)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 16, elements: !132)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !107)
!132 = !{!133}
!133 = !DISubrange(count: 2)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !31, line: 88, baseType: !131, size: 8, offset: 48)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !31, line: 89, baseType: !131, size: 8, offset: 56)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !31, line: 90, baseType: !137, size: 32, offset: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "z_object_data", file: !31, line: 61, size: 32, elements: !138)
!138 = !{!139, !313, !314, !322, !328}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !137, file: !31, line: 63, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !142, line: 2720, size: 160, elements: !143)
!142 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !165, !311, !312}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !141, file: !142, line: 2722, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !147, file: !146, line: 232, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !153)
!153 = !{!154, !160}
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 38, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 38, size: 32, elements: !156)
!156 = !{!157, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !155, file: !151, line: 39, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !151, line: 40, baseType: !158, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 42, baseType: !161, size: 32, offset: 32)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 42, size: 32, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !161, file: !151, line: 43, baseType: !158, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !151, line: 44, baseType: !158, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !141, file: !142, line: 2724, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 1472, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170, !218, !231, !232, !233, !237, !242, !248, !273, !281, !282, !301}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !167, file: !168, line: 247, baseType: !171, size: 384)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !172)
!172 = !{!173, !185, !187, !188, !189, !202, !204, !205}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 60, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 60, size: 64, elements: !175)
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !174, file: !168, line: 61, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !174, file: !168, line: 62, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !179, file: !180, line: 50, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !132)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !171, file: !168, line: 68, baseType: !186, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !171, file: !168, line: 71, baseType: !131, size: 8, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !171, file: !168, line: 74, baseType: !131, size: 8, offset: 104)
!189 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 90, baseType: !190, size: 16, offset: 112)
!190 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 90, size: 16, elements: !191)
!191 = !{!192, !199}
!192 = !DIDerivedType(tag: DW_TAG_member, scope: !190, file: !168, line: 91, baseType: !193, size: 16)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !190, file: !168, line: 91, size: 16, elements: !194)
!194 = !{!195, !198}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !193, file: !168, line: 96, baseType: !196, size: 8)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !197)
!197 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !193, file: !168, line: 97, baseType: !131, size: 8, offset: 8)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !190, file: !168, line: 100, baseType: !200, size: 16)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !201)
!201 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !171, file: !168, line: 107, baseType: !203, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !171, file: !168, line: 127, baseType: !105, size: 32, offset: 160)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !171, file: !168, line: 131, baseType: !206, size: 192, offset: 192)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !207)
!207 = !{!208, !209, !215}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !206, file: !146, line: 245, baseType: !177, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !206, file: !146, line: 246, baseType: !210, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !206, file: !146, line: 249, baseType: !216, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !217)
!217 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !167, file: !168, line: 250, baseType: !219, size: 288, offset: 384)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !220, line: 25, size: 288, elements: !221)
!220 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !219, file: !220, line: 26, baseType: !203, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !219, file: !220, line: 27, baseType: !203, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !219, file: !220, line: 28, baseType: !203, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !219, file: !220, line: 29, baseType: !203, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !219, file: !220, line: 30, baseType: !203, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !219, file: !220, line: 31, baseType: !203, size: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !219, file: !220, line: 32, baseType: !203, size: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !219, file: !220, line: 33, baseType: !203, size: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !219, file: !220, line: 34, baseType: !203, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !167, file: !168, line: 253, baseType: !105, size: 32, offset: 672)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !167, file: !168, line: 256, baseType: !145, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !167, file: !168, line: 279, baseType: !234, size: 256, offset: 768)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 256, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "userspace_local_data", scope: !167, file: !168, line: 288, baseType: !238, size: 32, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_userspace_local_data", file: !168, line: 185, size: 32, elements: !240)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !239, file: !168, line: 187, baseType: !106, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !167, file: !168, line: 300, baseType: !243, size: 96, offset: 1056)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !168, line: 149, size: 96, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !243, file: !168, line: 153, baseType: !22, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !243, file: !168, line: 162, baseType: !115, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !243, file: !168, line: 168, baseType: !115, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain_info", scope: !167, file: !168, line: 305, baseType: !249, size: 96, offset: 1152)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mem_domain_info", file: !168, line: 175, size: 96, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain_q_node", scope: !249, file: !168, line: 177, baseType: !177, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain", scope: !249, file: !168, line: 179, baseType: !253, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_domain", file: !255, line: 80, size: 1632, elements: !256)
!255 = !DIFile(filename: "zephyr/include/zephyr/app_memory/mem_domain.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!256 = !{!257, !271, !272}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "partitions", scope: !254, file: !255, line: 85, baseType: !258, size: 1536)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 1536, elements: !269)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_partition", file: !255, line: 55, size: 96, elements: !260)
!260 = !{!261, !262, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !259, file: !255, line: 57, baseType: !22, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !259, file: !255, line: 59, baseType: !115, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !259, file: !255, line: 61, baseType: !264, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !265, line: 151, baseType: !266)
!265 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 149, size: 32, elements: !267)
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !266, file: !265, line: 150, baseType: !203, size: 32)
!269 = !{!270}
!270 = !DISubrange(count: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain_q", scope: !254, file: !255, line: 87, baseType: !150, size: 64, offset: 1536)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "num_partitions", scope: !254, file: !255, line: 89, baseType: !131, size: 8, offset: 1600)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "stack_obj", scope: !167, file: !168, line: 307, baseType: !274, size: 32, offset: 1248)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !276, line: 44, baseType: !277)
!276 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !278, line: 47, size: 8, elements: !279)
!278 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !277, file: !278, line: 48, baseType: !104, size: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_frame", scope: !167, file: !168, line: 309, baseType: !105, size: 32, offset: 1280)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !167, file: !168, line: 325, baseType: !283, size: 32, offset: 1312)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 192, elements: !285)
!285 = !{!286, !295, !296}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !284, file: !142, line: 5074, baseType: !287, size: 96)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !288, line: 56, size: 96, elements: !289)
!288 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!289 = !{!290, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !287, file: !288, line: 57, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !288, line: 57, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !287, file: !288, line: 58, baseType: !105, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !287, file: !288, line: 59, baseType: !115, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !284, file: !142, line: 5075, baseType: !145, size: 64, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !284, file: !142, line: 5076, baseType: !297, size: 32, offset: 160)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !298, line: 43, size: 32, elements: !299)
!298 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !297, file: !298, line: 52, baseType: !22, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !167, file: !168, line: 343, baseType: !302, size: 128, offset: 1344)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !220, line: 60, size: 128, elements: !303)
!303 = !{!304, !305, !306, !310}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !302, file: !220, line: 63, baseType: !203, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !302, file: !220, line: 66, baseType: !203, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, scope: !302, file: !220, line: 110, baseType: !307, size: 32, offset: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !302, file: !220, line: 110, size: 32, elements: !308)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !307, file: !220, line: 111, baseType: !203, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "priv_stack_start", scope: !302, file: !220, line: 123, baseType: !203, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !141, file: !142, line: 2727, baseType: !203, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !141, file: !142, line: 2730, baseType: !106, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !137, file: !31, line: 66, baseType: !32, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "stack_data", scope: !137, file: !31, line: 70, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stack_data", file: !31, line: 51, size: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !317, file: !31, line: 53, baseType: !115, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !317, file: !31, line: 56, baseType: !321, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "futex_data", scope: !137, file: !31, line: 77, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_futex_data", file: !142, line: 2011, size: 96, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !324, file: !142, line: 2012, baseType: !145, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !324, file: !142, line: 2013, baseType: !297, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !137, file: !31, line: 80, baseType: !106, size: 32)
!329 = !{!330}
!330 = !DISubrange(count: 12)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "stack_data", scope: !27, file: !112, line: 14, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 256, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 4)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "priv_stacks", scope: !27, file: !112, line: 13, type: !338, isLocal: true, isDefinition: true, align: 512)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 34816, elements: !339)
!339 = !{!335, !340}
!340 = !DISubrange(count: 1088)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "user_part", scope: !343, file: !501, line: 34, type: !452, isLocal: false, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !345, globals: !498, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/userspace/shared_mem/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem")
!345 = !{!346, !347, !105, !351, !115, !106, !353, !107, !354, !22, !495, !203, !496}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !276, line: 46, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !105, !105, !105}
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !352, line: 46, baseType: !216)
!352 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !168, line: 347, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 1472, elements: !357)
!357 = !{!358, !416, !428, !429, !430, !431, !436, !442, !463, !469, !470, !485}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !356, file: !168, line: 247, baseType: !359, size: 384)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !360)
!360 = !{!361, !385, !392, !393, !394, !403, !404, !405}
!361 = !DIDerivedType(tag: DW_TAG_member, scope: !359, file: !168, line: 60, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !359, file: !168, line: 60, size: 64, elements: !363)
!363 = !{!364, !379}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !362, file: !168, line: 61, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !367)
!367 = !{!368, !374}
!368 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !151, line: 38, baseType: !369, size: 32)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !151, line: 38, size: 32, elements: !370)
!370 = !{!371, !373}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !369, file: !151, line: 39, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !151, line: 40, baseType: !372, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !151, line: 42, baseType: !375, size: 32, offset: 32)
!375 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !151, line: 42, size: 32, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !375, file: !151, line: 43, baseType: !372, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !375, file: !151, line: 44, baseType: !372, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !362, file: !168, line: 62, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !380, file: !180, line: 50, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 64, elements: !132)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !359, file: !168, line: 68, baseType: !386, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !389)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !388, file: !146, line: 232, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !366)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !359, file: !168, line: 71, baseType: !131, size: 8, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !359, file: !168, line: 74, baseType: !131, size: 8, offset: 104)
!394 = !DIDerivedType(tag: DW_TAG_member, scope: !359, file: !168, line: 90, baseType: !395, size: 16, offset: 112)
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !359, file: !168, line: 90, size: 16, elements: !396)
!396 = !{!397, !402}
!397 = !DIDerivedType(tag: DW_TAG_member, scope: !395, file: !168, line: 91, baseType: !398, size: 16)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !395, file: !168, line: 91, size: 16, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !398, file: !168, line: 96, baseType: !196, size: 8)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !398, file: !168, line: 97, baseType: !131, size: 8, offset: 8)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !395, file: !168, line: 100, baseType: !200, size: 16)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !359, file: !168, line: 107, baseType: !203, size: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !359, file: !168, line: 127, baseType: !105, size: 32, offset: 160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !359, file: !168, line: 131, baseType: !406, size: 192, offset: 192)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !407)
!407 = !{!408, !409, !415}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !406, file: !146, line: 245, baseType: !365, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !406, file: !146, line: 246, baseType: !410, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !406, file: !146, line: 249, baseType: !216, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !356, file: !168, line: 250, baseType: !417, size: 288, offset: 384)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !220, line: 25, size: 288, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !417, file: !220, line: 26, baseType: !203, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !417, file: !220, line: 27, baseType: !203, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !417, file: !220, line: 28, baseType: !203, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !417, file: !220, line: 29, baseType: !203, size: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !417, file: !220, line: 30, baseType: !203, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !417, file: !220, line: 31, baseType: !203, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !417, file: !220, line: 32, baseType: !203, size: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !417, file: !220, line: 33, baseType: !203, size: 32, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !417, file: !220, line: 34, baseType: !203, size: 32, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !356, file: !168, line: 253, baseType: !105, size: 32, offset: 672)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !356, file: !168, line: 256, baseType: !387, size: 64, offset: 704)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !356, file: !168, line: 279, baseType: !234, size: 256, offset: 768)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "userspace_local_data", scope: !356, file: !168, line: 288, baseType: !432, size: 32, offset: 1024)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_userspace_local_data", file: !168, line: 185, size: 32, elements: !434)
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !433, file: !168, line: 187, baseType: !106, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !356, file: !168, line: 300, baseType: !437, size: 96, offset: 1056)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !168, line: 149, size: 96, elements: !438)
!438 = !{!439, !440, !441}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !437, file: !168, line: 153, baseType: !22, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !437, file: !168, line: 162, baseType: !115, size: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !437, file: !168, line: 168, baseType: !115, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain_info", scope: !356, file: !168, line: 305, baseType: !443, size: 96, offset: 1152)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mem_domain_info", file: !168, line: 175, size: 96, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain_q_node", scope: !443, file: !168, line: 177, baseType: !365, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain", scope: !443, file: !168, line: 179, baseType: !447, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_domain", file: !255, line: 80, size: 1632, elements: !449)
!449 = !{!450, !461, !462}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "partitions", scope: !448, file: !255, line: 85, baseType: !451, size: 1536)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 1536, elements: !269)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_partition", file: !255, line: 55, size: 96, elements: !453)
!453 = !{!454, !455, !456}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !452, file: !255, line: 57, baseType: !22, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !452, file: !255, line: 59, baseType: !115, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !452, file: !255, line: 61, baseType: !457, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !265, line: 151, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 149, size: 32, elements: !459)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !458, file: !265, line: 150, baseType: !203, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain_q", scope: !448, file: !255, line: 87, baseType: !391, size: 64, offset: 1536)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "num_partitions", scope: !448, file: !255, line: 89, baseType: !131, size: 8, offset: 1600)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "stack_obj", scope: !356, file: !168, line: 307, baseType: !464, size: 32, offset: 1248)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !276, line: 44, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !278, line: 47, size: 8, elements: !467)
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !466, file: !278, line: 48, baseType: !104, size: 8)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_frame", scope: !356, file: !168, line: 309, baseType: !105, size: 32, offset: 1280)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !356, file: !168, line: 325, baseType: !471, size: 32, offset: 1312)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 192, elements: !473)
!473 = !{!474, !480, !481}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !472, file: !142, line: 5074, baseType: !475, size: 96)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !288, line: 56, size: 96, elements: !476)
!476 = !{!477, !478, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !475, file: !288, line: 57, baseType: !291, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !475, file: !288, line: 58, baseType: !105, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !475, file: !288, line: 59, baseType: !115, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !472, file: !142, line: 5075, baseType: !387, size: 64, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !472, file: !142, line: 5076, baseType: !482, size: 32, offset: 160)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !298, line: 43, size: 32, elements: !483)
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !482, file: !298, line: 52, baseType: !22, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !356, file: !168, line: 343, baseType: !486, size: 128, offset: 1344)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !220, line: 60, size: 128, elements: !487)
!487 = !{!488, !489, !490, !494}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !486, file: !220, line: 63, baseType: !203, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !486, file: !220, line: 66, baseType: !203, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, scope: !486, file: !220, line: 110, baseType: !491, size: 32, offset: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !486, file: !220, line: 110, size: 32, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !491, file: !220, line: 111, baseType: !203, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "priv_stack_start", scope: !486, file: !220, line: 123, baseType: !203, size: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !106)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !497)
!497 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!498 = !{!341, !499, !508, !510, !512, !514, !516, !518, !520, !522, !524, !530, !532, !534, !536, !543, !548, !553, !558, !563, !565, !567, !569, !574, !576, !578, !581, !583, !585, !587, !589, !591, !593, !598, !600, !602, !604, !606, !612}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "user_part_region", scope: !343, file: !501, line: 34, type: !502, isLocal: false, isDefinition: true)
!501 = !DIFile(filename: "zephyr/samples/userspace/shared_mem/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_app_region", file: !504, line: 56, size: 64, elements: !505)
!504 = !DIFile(filename: "zephyr/include/zephyr/app_memory/app_memdomain.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bss_start", scope: !503, file: !504, line: 57, baseType: !105, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bss_size", scope: !503, file: !504, line: 58, baseType: !115, size: 32, offset: 32)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "red_part", scope: !343, file: !501, line: 34, type: !452, isLocal: false, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "red_part_region", scope: !343, file: !501, line: 34, type: !502, isLocal: false, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "enc_part", scope: !343, file: !501, line: 34, type: !452, isLocal: false, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "enc_part_region", scope: !343, file: !501, line: 34, type: !502, isLocal: false, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "blk_part", scope: !343, file: !501, line: 34, type: !452, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "blk_part_region", scope: !343, file: !501, line: 34, type: !502, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "ct_part", scope: !343, file: !501, line: 34, type: !452, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "ct_part_region", scope: !343, file: !501, line: 34, type: !502, isLocal: false, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "W1", scope: !343, file: !501, line: 52, type: !526, isLocal: false, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 208, elements: !528)
!527 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !107)
!528 = !{!529}
!529 = !DISubrange(count: 26)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "W2", scope: !343, file: !501, line: 54, type: !526, isLocal: false, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "W3", scope: !343, file: !501, line: 55, type: !526, isLocal: false, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "R", scope: !343, file: !501, line: 56, type: !526, isLocal: false, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "allforone", scope: !343, file: !501, line: 73, type: !538, isLocal: false, isDefinition: true, align: 32)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !142, line: 2909, size: 128, elements: !539)
!539 = !{!540, !541, !542}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !538, file: !142, line: 2910, baseType: !387, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !538, file: !142, line: 2911, baseType: !32, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !538, file: !142, line: 2912, baseType: !32, size: 32, offset: 96)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "encMSG", scope: !343, file: !501, line: 84, type: !545, isLocal: false, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 48, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 6)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "ptMSG", scope: !343, file: !501, line: 88, type: !550, isLocal: false, isDefinition: true)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 192, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 24)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "ptMSG2", scope: !343, file: !501, line: 96, type: !555, isLocal: false, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 144, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 18)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "ctMSG", scope: !343, file: !501, line: 98, type: !560, isLocal: false, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 40, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 5)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "pt_domain", scope: !343, file: !501, line: 36, type: !448, isLocal: false, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "enc_domain", scope: !343, file: !501, line: 36, type: !448, isLocal: false, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "fBUFIN", scope: !343, file: !501, line: 41, type: !527, isLocal: false, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "BUFIN", scope: !343, file: !501, line: 42, type: !571, isLocal: false, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 504, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 63)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "fBUFOUT", scope: !343, file: !501, line: 44, type: !527, isLocal: false, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "BUFOUT", scope: !343, file: !501, line: 45, type: !571, isLocal: false, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "IW1", scope: !343, file: !501, line: 58, type: !580, isLocal: false, isDefinition: true)
!580 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !106)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "IW2", scope: !343, file: !501, line: 59, type: !580, isLocal: false, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "IW3", scope: !343, file: !501, line: 60, type: !580, isLocal: false, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "W1R", scope: !343, file: !501, line: 66, type: !526, isLocal: false, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "W2R", scope: !343, file: !501, line: 67, type: !526, isLocal: false, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "W3R", scope: !343, file: !501, line: 68, type: !526, isLocal: false, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "enc_thread", scope: !343, file: !501, line: 75, type: !356, isLocal: false, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "enc_stack", scope: !343, file: !501, line: 76, type: !595, isLocal: false, isDefinition: true, align: 8192)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 8192, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 1024)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "pt_thread", scope: !343, file: !501, line: 78, type: !356, isLocal: false, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "pt_stack", scope: !343, file: !501, line: 79, type: !595, isLocal: false, isDefinition: true, align: 8192)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "ct_thread", scope: !343, file: !501, line: 81, type: !356, isLocal: false, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "ct_stack", scope: !343, file: !501, line: 82, type: !595, isLocal: false, isDefinition: true, align: 8192)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "enc_pt", scope: !343, file: !501, line: 85, type: !608, isLocal: false, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 400, elements: !610)
!609 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!610 = !{!611}
!611 = !DISubrange(count: 50)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "enc_ct", scope: !343, file: !501, line: 86, type: !608, isLocal: false, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !616, file: !630, line: 18, type: !631, isLocal: false, isDefinition: true)
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !618, globals: !629, splitDebugInlining: false, nameTableKind: None)
!617 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem")
!618 = !{!22, !105, !24, !619, !621, !623, !115, !106, !624, !625, !627, !628, !353, !321, !200, !102}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!626 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!629 = !{!614}
!630 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !633, line: 16, size: 64, elements: !634)
!633 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !632, file: !633, line: 17, baseType: !102, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !632, file: !633, line: 18, baseType: !131, size: 8, offset: 32)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "_char_out", scope: !639, file: !646, line: 54, type: !672, isLocal: false, isDefinition: true)
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !641, globals: !642, splitDebugInlining: false, nameTableKind: None)
!640 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem")
!641 = !{!105, !106, !115, !353}
!642 = !{!637, !643, !663, !669}
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !645, file: !646, line: 176, type: !657, isLocal: true, isDefinition: true)
!645 = distinct !DISubprogram(name: "z_vrfy_k_str_out", scope: !646, file: !646, line: 174, type: !647, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !639, retainedNodes: !649)
!646 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!647 = !DISubroutineType(types: !648)
!648 = !{null, !353, !115}
!649 = !{!650, !651, !652}
!650 = !DILocalVariable(name: "c", arg: 1, scope: !645, file: !646, line: 174, type: !353)
!651 = !DILocalVariable(name: "n", arg: 2, scope: !645, file: !646, line: 174, type: !115)
!652 = !DILocalVariable(name: "expr_copy", scope: !653, file: !646, line: 176, type: !656)
!653 = distinct !DILexicalBlock(scope: !654, file: !646, line: 176, column: 2)
!654 = distinct !DILexicalBlock(scope: !655, file: !646, line: 176, column: 2)
!655 = distinct !DILexicalBlock(scope: !645, file: !646, line: 176, column: 2)
!656 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !633, line: 16, size: 64, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !659, file: !633, line: 17, baseType: !102, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !659, file: !633, line: 18, baseType: !131, size: 8, offset: 32)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "__log_current_dynamic_data", scope: !645, file: !646, line: 176, type: !665, isLocal: true, isDefinition: true)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_dynamic_data", file: !633, line: 29, size: 32, elements: !667)
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !666, file: !633, line: 30, baseType: !203, size: 32)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "__log_level", scope: !645, file: !646, line: 176, type: !671, isLocal: true, isDefinition: true)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DISubroutineType(types: !674)
!674 = !{!106, !106}
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !677, file: !738, line: 235, type: !739, isLocal: true, isDefinition: true, align: 32)
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !679, globals: !737, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem")
!679 = !{!105, !106, !680, !691}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !682, line: 46, baseType: !683)
!682 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 41, size: 128, elements: !684)
!684 = !{!685, !687, !688, !690}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !683, file: !682, line: 42, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !203)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !683, file: !682, line: 43, baseType: !686, size: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !683, file: !682, line: 44, baseType: !689, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !683, file: !682, line: 45, baseType: !689, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !693, line: 75, baseType: !694)
!693 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !693, line: 41, size: 2176, elements: !695)
!695 = !{!696, !697, !698, !699, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !719, !721, !722, !723, !724, !725, !726, !727, !728, !730, !731, !732, !733, !734, !735, !736}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !694, file: !693, line: 42, baseType: !686, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !694, file: !693, line: 43, baseType: !686, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !694, file: !693, line: 44, baseType: !689, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !694, file: !693, line: 45, baseType: !700, size: 32, offset: 96)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 32, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 1)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !694, file: !693, line: 46, baseType: !686, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !694, file: !693, line: 47, baseType: !686, size: 32, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !694, file: !693, line: 48, baseType: !689, size: 32, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !694, file: !693, line: 49, baseType: !686, size: 32, offset: 224)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !694, file: !693, line: 50, baseType: !686, size: 32, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !694, file: !693, line: 51, baseType: !689, size: 32, offset: 288)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !694, file: !693, line: 52, baseType: !686, size: 32, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !694, file: !693, line: 53, baseType: !700, size: 32, offset: 352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !694, file: !693, line: 54, baseType: !686, size: 32, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !694, file: !693, line: 55, baseType: !700, size: 32, offset: 416)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !694, file: !693, line: 56, baseType: !686, size: 32, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !694, file: !693, line: 57, baseType: !700, size: 32, offset: 480)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !694, file: !693, line: 58, baseType: !716, size: 96, offset: 512)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 96, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 3)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !694, file: !693, line: 59, baseType: !720, size: 160, offset: 608)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 160, elements: !561)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !694, file: !693, line: 60, baseType: !686, size: 32, offset: 768)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !694, file: !693, line: 61, baseType: !686, size: 32, offset: 800)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !694, file: !693, line: 62, baseType: !689, size: 32, offset: 832)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !694, file: !693, line: 63, baseType: !689, size: 32, offset: 864)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !694, file: !693, line: 64, baseType: !686, size: 32, offset: 896)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !694, file: !693, line: 65, baseType: !686, size: 32, offset: 928)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !694, file: !693, line: 66, baseType: !686, size: 32, offset: 960)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !694, file: !693, line: 67, baseType: !729, size: 832, offset: 992)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 832, elements: !528)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !694, file: !693, line: 68, baseType: !686, size: 32, offset: 1824)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !694, file: !693, line: 69, baseType: !689, size: 32, offset: 1856)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !694, file: !693, line: 70, baseType: !720, size: 160, offset: 1888)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !694, file: !693, line: 71, baseType: !686, size: 32, offset: 2048)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !694, file: !693, line: 72, baseType: !686, size: 32, offset: 2080)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !694, file: !693, line: 73, baseType: !689, size: 32, offset: 2112)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !694, file: !693, line: 74, baseType: !686, size: 32, offset: 2144)
!737 = !{!675}
!738 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !741, line: 51, size: 64, elements: !742)
!741 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!742 = !{!743, !768}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !740, file: !741, line: 60, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DISubroutineType(types: !746)
!746 = !{!106, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !750, line: 378, size: 192, elements: !751)
!750 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!751 = !{!752, !753, !754, !755, !761, !762}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !749, file: !750, line: 380, baseType: !102, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !749, file: !750, line: 382, baseType: !13, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !749, file: !750, line: 384, baseType: !13, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !749, file: !750, line: 386, baseType: !756, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !750, line: 351, size: 16, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !757, file: !750, line: 359, baseType: !131, size: 8)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !757, file: !750, line: 364, baseType: !656, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !749, file: !750, line: 388, baseType: !105, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !749, file: !750, line: 396, baseType: !763, size: 32, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !750, line: 43, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !767)
!767 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !740, file: !741, line: 65, baseType: !747, size: 32, offset: 32)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !771, file: !778, line: 17, type: !948, isLocal: false, isDefinition: true)
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !773, globals: !774, splitDebugInlining: false, nameTableKind: None)
!772 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem")
!773 = !{!115, !106, !203, !22, !105}
!774 = !{!769, !775, !944}
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !777, file: !778, line: 198, type: !937, isLocal: true, isDefinition: true)
!777 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !778, file: !778, line: 175, type: !779, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !771, retainedNodes: !921)
!778 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!779 = !DISubroutineType(types: !780)
!780 = !{null, !781}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 1472, elements: !783)
!783 = !{!784, !842, !854, !855, !856, !857, !862, !868, !889, !895, !896, !911}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !782, file: !168, line: 247, baseType: !785, size: 384)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !786)
!786 = !{!787, !811, !818, !819, !820, !829, !830, !831}
!787 = !DIDerivedType(tag: DW_TAG_member, scope: !785, file: !168, line: 60, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !785, file: !168, line: 60, size: 64, elements: !789)
!789 = !{!790, !805}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !788, file: !168, line: 61, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !793)
!793 = !{!794, !800}
!794 = !DIDerivedType(tag: DW_TAG_member, scope: !792, file: !151, line: 38, baseType: !795, size: 32)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !792, file: !151, line: 38, size: 32, elements: !796)
!796 = !{!797, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !795, file: !151, line: 39, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !795, file: !151, line: 40, baseType: !798, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, scope: !792, file: !151, line: 42, baseType: !801, size: 32, offset: 32)
!801 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !792, file: !151, line: 42, size: 32, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !801, file: !151, line: 43, baseType: !798, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !801, file: !151, line: 44, baseType: !798, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !788, file: !168, line: 62, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !807)
!807 = !{!808}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !806, file: !180, line: 50, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 64, elements: !132)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !785, file: !168, line: 68, baseType: !812, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !815)
!815 = !{!816}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !814, file: !146, line: 232, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !792)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !785, file: !168, line: 71, baseType: !131, size: 8, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !785, file: !168, line: 74, baseType: !131, size: 8, offset: 104)
!820 = !DIDerivedType(tag: DW_TAG_member, scope: !785, file: !168, line: 90, baseType: !821, size: 16, offset: 112)
!821 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !785, file: !168, line: 90, size: 16, elements: !822)
!822 = !{!823, !828}
!823 = !DIDerivedType(tag: DW_TAG_member, scope: !821, file: !168, line: 91, baseType: !824, size: 16)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !821, file: !168, line: 91, size: 16, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !824, file: !168, line: 96, baseType: !196, size: 8)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !824, file: !168, line: 97, baseType: !131, size: 8, offset: 8)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !821, file: !168, line: 100, baseType: !200, size: 16)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !785, file: !168, line: 107, baseType: !203, size: 32, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !785, file: !168, line: 127, baseType: !105, size: 32, offset: 160)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !785, file: !168, line: 131, baseType: !832, size: 192, offset: 192)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !833)
!833 = !{!834, !835, !841}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !832, file: !146, line: 245, baseType: !791, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !832, file: !146, line: 246, baseType: !836, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !840}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !832, file: !146, line: 249, baseType: !216, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !782, file: !168, line: 250, baseType: !843, size: 288, offset: 384)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !220, line: 25, size: 288, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !843, file: !220, line: 26, baseType: !203, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !843, file: !220, line: 27, baseType: !203, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !843, file: !220, line: 28, baseType: !203, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !843, file: !220, line: 29, baseType: !203, size: 32, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !843, file: !220, line: 30, baseType: !203, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !843, file: !220, line: 31, baseType: !203, size: 32, offset: 160)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !843, file: !220, line: 32, baseType: !203, size: 32, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !843, file: !220, line: 33, baseType: !203, size: 32, offset: 224)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !843, file: !220, line: 34, baseType: !203, size: 32, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !782, file: !168, line: 253, baseType: !105, size: 32, offset: 672)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !782, file: !168, line: 256, baseType: !813, size: 64, offset: 704)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !782, file: !168, line: 279, baseType: !234, size: 256, offset: 768)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "userspace_local_data", scope: !782, file: !168, line: 288, baseType: !858, size: 32, offset: 1024)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_userspace_local_data", file: !168, line: 185, size: 32, elements: !860)
!860 = !{!861}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !859, file: !168, line: 187, baseType: !106, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !782, file: !168, line: 300, baseType: !863, size: 96, offset: 1056)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !168, line: 149, size: 96, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !863, file: !168, line: 153, baseType: !22, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !863, file: !168, line: 162, baseType: !115, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !863, file: !168, line: 168, baseType: !115, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain_info", scope: !782, file: !168, line: 305, baseType: !869, size: 96, offset: 1152)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mem_domain_info", file: !168, line: 175, size: 96, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain_q_node", scope: !869, file: !168, line: 177, baseType: !791, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain", scope: !869, file: !168, line: 179, baseType: !873, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_domain", file: !255, line: 80, size: 1632, elements: !875)
!875 = !{!876, !887, !888}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "partitions", scope: !874, file: !255, line: 85, baseType: !877, size: 1536)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !878, size: 1536, elements: !269)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_partition", file: !255, line: 55, size: 96, elements: !879)
!879 = !{!880, !881, !882}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !878, file: !255, line: 57, baseType: !22, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !878, file: !255, line: 59, baseType: !115, size: 32, offset: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !878, file: !255, line: 61, baseType: !883, size: 32, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !265, line: 151, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 149, size: 32, elements: !885)
!885 = !{!886}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !884, file: !265, line: 150, baseType: !203, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "mem_domain_q", scope: !874, file: !255, line: 87, baseType: !817, size: 64, offset: 1536)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "num_partitions", scope: !874, file: !255, line: 89, baseType: !131, size: 8, offset: 1600)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "stack_obj", scope: !782, file: !168, line: 307, baseType: !890, size: 32, offset: 1248)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !276, line: 44, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !278, line: 47, size: 8, elements: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !892, file: !278, line: 48, baseType: !104, size: 8)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_frame", scope: !782, file: !168, line: 309, baseType: !105, size: 32, offset: 1280)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !782, file: !168, line: 325, baseType: !897, size: 32, offset: 1312)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 192, elements: !899)
!899 = !{!900, !906, !907}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !898, file: !142, line: 5074, baseType: !901, size: 96)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !288, line: 56, size: 96, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !901, file: !288, line: 57, baseType: !291, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !901, file: !288, line: 58, baseType: !105, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !901, file: !288, line: 59, baseType: !115, size: 32, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !898, file: !142, line: 5075, baseType: !813, size: 64, offset: 96)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !898, file: !142, line: 5076, baseType: !908, size: 32, offset: 160)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !298, line: 43, size: 32, elements: !909)
!909 = !{!910}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !908, file: !298, line: 52, baseType: !22, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !782, file: !168, line: 343, baseType: !912, size: 128, offset: 1344)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !220, line: 60, size: 128, elements: !913)
!913 = !{!914, !915, !916, !920}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !912, file: !220, line: 63, baseType: !203, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !912, file: !220, line: 66, baseType: !203, size: 32, offset: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, scope: !912, file: !220, line: 110, baseType: !917, size: 32, offset: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !912, file: !220, line: 110, size: 32, elements: !918)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !917, file: !220, line: 111, baseType: !203, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "priv_stack_start", scope: !912, file: !220, line: 123, baseType: !203, size: 32, offset: 96)
!921 = !{!922, !923, !924, !925, !928, !930, !931, !934, !935, !936}
!922 = !DILocalVariable(name: "thread", arg: 1, scope: !777, file: !778, line: 175, type: !781)
!923 = !DILocalVariable(name: "region_num", scope: !777, file: !778, line: 200, type: !131)
!924 = !DILocalVariable(name: "mem_domain", scope: !777, file: !778, line: 205, type: !873)
!925 = !DILocalVariable(name: "num_partitions", scope: !926, file: !778, line: 209, type: !203)
!926 = distinct !DILexicalBlock(scope: !927, file: !778, line: 207, column: 18)
!927 = distinct !DILexicalBlock(scope: !777, file: !778, line: 207, column: 6)
!928 = !DILocalVariable(name: "partition", scope: !926, file: !778, line: 210, type: !929)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!930 = !DILocalVariable(name: "i", scope: !926, file: !778, line: 211, type: !106)
!931 = !DILocalVariable(name: "base", scope: !932, file: !778, line: 243, type: !22)
!932 = distinct !DILexicalBlock(scope: !933, file: !778, line: 241, column: 37)
!933 = distinct !DILexicalBlock(scope: !777, file: !778, line: 241, column: 6)
!934 = !DILocalVariable(name: "size", scope: !932, file: !778, line: 244, type: !115)
!935 = !DILocalVariable(name: "guard_start", scope: !777, file: !778, line: 265, type: !22)
!936 = !DILocalVariable(name: "guard_size", scope: !777, file: !778, line: 266, type: !115)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 1728, elements: !556)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !939, line: 52, size: 96, elements: !940)
!939 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!940 = !{!941, !942, !943}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !938, file: !939, line: 53, baseType: !22, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !938, file: !939, line: 54, baseType: !115, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !938, file: !939, line: 55, baseType: !883, size: 32, offset: 64)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "static_regions", scope: !771, file: !778, line: 62, type: !946, isLocal: true, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 96, elements: !701)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !633, line: 16, size: 64, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !949, file: !633, line: 17, baseType: !102, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !949, file: !633, line: 18, baseType: !131, size: 8, offset: 32)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !955, file: !987, line: 39, type: !131, isLocal: true, isDefinition: true)
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !956, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !957, globals: !986, splitDebugInlining: false, nameTableKind: None)
!956 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem")
!957 = !{!958, !105, !106, !974, !131, !203}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !960, line: 1168, baseType: !961)
!960 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !960, line: 1155, size: 352, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !961, file: !960, line: 1157, baseType: !689, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !961, file: !960, line: 1158, baseType: !686, size: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !961, file: !960, line: 1159, baseType: !686, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !961, file: !960, line: 1160, baseType: !686, size: 32, offset: 96)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !961, file: !960, line: 1161, baseType: !686, size: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !961, file: !960, line: 1162, baseType: !686, size: 32, offset: 160)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !961, file: !960, line: 1163, baseType: !686, size: 32, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !961, file: !960, line: 1164, baseType: !686, size: 32, offset: 224)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !961, file: !960, line: 1165, baseType: !686, size: 32, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !961, file: !960, line: 1166, baseType: !686, size: 32, offset: 288)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !961, file: !960, line: 1167, baseType: !686, size: 32, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !977, line: 27, size: 96, elements: !978)
!977 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!978 = !{!979, !980, !981}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !976, file: !977, line: 29, baseType: !203, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !976, file: !977, line: 31, baseType: !102, size: 32, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !976, file: !977, line: 37, baseType: !982, size: 32, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !265, line: 146, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !265, line: 141, size: 32, elements: !984)
!984 = !{!985}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !983, file: !265, line: 143, baseType: !203, size: 32)
!986 = !{!953}
!987 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !990, file: !1000, line: 21, type: !672, isLocal: true, isDefinition: true)
!990 = distinct !DICompileUnit(language: DW_LANG_C99, file: !991, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !992, globals: !996, splitDebugInlining: false, nameTableKind: None)
!991 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/userspace/shared_mem")
!992 = !{!993, !105, !22, !106, !115, !13}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !995, line: 22, baseType: !106)
!995 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!996 = !{!988, !997, !1024, !1030, !1032, !1034, !1036}
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !999, file: !1000, line: 92, type: !1018, isLocal: true, isDefinition: true)
!999 = distinct !DISubprogram(name: "z_vrfy_zephyr_fwrite", scope: !1000, file: !1000, line: 87, type: !1001, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !990, retainedNodes: !1005)
