; ModuleID = 'build/96b_meerkat96/runtime_obs_registration/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type { i32 }
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct._slist*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/runtime_obs_registration/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/runtime_obs_registration")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/runtime_obs_registration")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_consumer_sub", scope: !27, file: !114, line: 11, type: !123, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/runtime_obs_registration/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/runtime_obs_registration")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !299, !332, !336, !341, !346}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "consumer_sub", scope: !27, file: !114, line: 11, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !116, line: 85, size: 96, elements: !117)
!116 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !{!118, !120, !166}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !115, file: !116, line: 91, baseType: !119, size: 8)
!119 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !115, file: !116, line: 93, baseType: !121, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !124, line: 4204, size: 352, elements: !125)
!124 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!125 = !{!126, !147, !152, !155, !156, !159, !160, !161, !162, !163}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !123, file: !124, line: 4206, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !128, line: 233, baseType: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 231, size: 64, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !129, file: !128, line: 232, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !133, line: 48, baseType: !134)
!133 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !133, line: 37, size: 64, elements: !135)
!135 = !{!136, !142}
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !133, line: 38, baseType: !137, size: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !133, line: 38, size: 32, elements: !138)
!138 = !{!139, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !137, file: !133, line: 39, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !133, line: 40, baseType: !140, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !133, line: 42, baseType: !143, size: 32, offset: 32)
!143 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !133, line: 42, size: 32, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !143, file: !133, line: 43, baseType: !140, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !133, line: 44, baseType: !140, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !123, file: !124, line: 4208, baseType: !148, size: 32, offset: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !149, line: 43, size: 32, elements: !150)
!149 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !148, file: !149, line: 52, baseType: !22, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !123, file: !124, line: 4210, baseType: !153, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !154, line: 214, baseType: !32)
!154 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !123, file: !124, line: 4212, baseType: !108, size: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !123, file: !124, line: 4214, baseType: !157, size: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !123, file: !124, line: 4216, baseType: !157, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !123, file: !124, line: 4218, baseType: !157, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !123, file: !124, line: 4220, baseType: !157, size: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !123, file: !124, line: 4222, baseType: !108, size: 32, offset: 288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !124, line: 4227, baseType: !164, size: 8, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !165)
!165 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !115, file: !116, line: 96, baseType: !167, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !116, line: 29, size: 224, elements: !174)
!174 = !{!175, !179, !181, !182, !187, !280, !294}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !173, file: !116, line: 35, baseType: !176, size: 16)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !178)
!178 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !173, file: !116, line: 40, baseType: !180, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !173, file: !116, line: 45, baseType: !180, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !173, file: !116, line: 51, baseType: !183, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DISubroutineType(types: !186)
!186 = !{!119, !13, !153}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !173, file: !116, line: 56, baseType: !188, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !124, line: 2720, size: 160, elements: !190)
!190 = !{!191, !192, !278, !279}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !189, file: !124, line: 2722, baseType: !127, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !189, file: !124, line: 2724, baseType: !193, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !195, line: 245, size: 896, elements: !196)
!195 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!196 = !{!197, !242, !255, !256, !257, !258, !273}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !194, file: !195, line: 247, baseType: !198, size: 384)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !195, line: 57, size: 384, elements: !199)
!199 = !{!200, !214, !216, !217, !218, !229, !230, !231}
!200 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !195, line: 60, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !195, line: 60, size: 64, elements: !202)
!202 = !{!203, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !201, file: !195, line: 61, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !133, line: 49, baseType: !134)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !201, file: !195, line: 62, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !207, line: 49, size: 64, elements: !208)
!207 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !206, file: !207, line: 50, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 64, elements: !212)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!212 = !{!213}
!213 = !DISubrange(count: 2)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !198, file: !195, line: 68, baseType: !215, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !198, file: !195, line: 71, baseType: !164, size: 8, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !198, file: !195, line: 74, baseType: !164, size: 8, offset: 104)
!218 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !195, line: 90, baseType: !219, size: 16, offset: 112)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !195, line: 90, size: 16, elements: !220)
!220 = !{!221, !228}
!221 = !DIDerivedType(tag: DW_TAG_member, scope: !219, file: !195, line: 91, baseType: !222, size: 16)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !195, line: 91, size: 16, elements: !223)
!223 = !{!224, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !222, file: !195, line: 96, baseType: !225, size: 8)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !226)
!226 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !222, file: !195, line: 97, baseType: !164, size: 8, offset: 8)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !219, file: !195, line: 100, baseType: !177, size: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !198, file: !195, line: 107, baseType: !108, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !198, file: !195, line: 127, baseType: !102, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !198, file: !195, line: 131, baseType: !232, size: 192, offset: 192)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !128, line: 244, size: 192, elements: !233)
!233 = !{!234, !235, !241}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !232, file: !128, line: 245, baseType: !204, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !232, file: !128, line: 246, baseType: !236, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !128, line: 242, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !232, file: !128, line: 249, baseType: !106, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !194, file: !195, line: 250, baseType: !243, size: 288, offset: 384)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !244, line: 25, size: 288, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !243, file: !244, line: 26, baseType: !108, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !243, file: !244, line: 27, baseType: !108, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !243, file: !244, line: 28, baseType: !108, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !243, file: !244, line: 29, baseType: !108, size: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !243, file: !244, line: 30, baseType: !108, size: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !243, file: !244, line: 31, baseType: !108, size: 32, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !243, file: !244, line: 32, baseType: !108, size: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !243, file: !244, line: 33, baseType: !108, size: 32, offset: 224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !243, file: !244, line: 34, baseType: !108, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !194, file: !195, line: 253, baseType: !102, size: 32, offset: 672)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !194, file: !195, line: 256, baseType: !127, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !194, file: !195, line: 294, baseType: !103, size: 32, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !194, file: !195, line: 325, baseType: !259, size: 32, offset: 800)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !124, line: 5073, size: 192, elements: !261)
!261 = !{!262, !271, !272}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !260, file: !124, line: 5074, baseType: !263, size: 96)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !264, line: 56, size: 96, elements: !265)
!264 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!265 = !{!266, !269, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !263, file: !264, line: 57, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !264, line: 57, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !263, file: !264, line: 58, baseType: !102, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !263, file: !264, line: 59, baseType: !153, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !260, file: !124, line: 5075, baseType: !127, size: 64, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !260, file: !124, line: 5076, baseType: !148, size: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !194, file: !195, line: 343, baseType: !274, size: 64, offset: 832)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !244, line: 60, size: 64, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !274, file: !244, line: 63, baseType: !108, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !274, file: !244, line: 66, baseType: !108, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !189, file: !124, line: 2727, baseType: !108, size: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !189, file: !124, line: 2730, baseType: !103, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_observers", scope: !173, file: !116, line: 61, baseType: !281, size: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !283, line: 40, baseType: !284)
!283 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !283, line: 35, size: 64, elements: !285)
!285 = !{!286, !293}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !284, file: !283, line: 36, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !283, line: 33, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !283, line: 29, size: 32, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !283, line: 30, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !284, file: !283, line: 37, baseType: !287, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !173, file: !116, line: 67, baseType: !295, size: 32, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "_k_thread_data_consumer_thread_id", scope: !27, file: !114, line: 25, type: !301, isLocal: false, isDefinition: true, align: 32)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !124, line: 620, size: 384, elements: !302)
!302 = !{!303, !304, !312, !313, !318, !319, !320, !321, !322, !323, !325, !329}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !301, file: !124, line: 621, baseType: !193, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !301, file: !124, line: 622, baseType: !305, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !307, line: 44, baseType: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !309, line: 47, size: 8, elements: !310)
!309 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !308, file: !309, line: 48, baseType: !158, size: 8)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !301, file: !124, line: 623, baseType: !32, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !301, file: !124, line: 624, baseType: !314, size: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !307, line: 46, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !102, !102, !102}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !301, file: !124, line: 625, baseType: !102, size: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !301, file: !124, line: 626, baseType: !102, size: 32, offset: 160)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !301, file: !124, line: 627, baseType: !102, size: 32, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !301, file: !124, line: 628, baseType: !103, size: 32, offset: 224)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !301, file: !124, line: 629, baseType: !108, size: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !301, file: !124, line: 630, baseType: !324, size: 32, offset: 288)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !301, file: !124, line: 631, baseType: !326, size: 32, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DISubroutineType(types: !328)
!328 = !{null}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !301, file: !124, line: 632, baseType: !330, size: 32, offset: 352)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "consumer_thread_id", scope: !27, file: !114, line: 25, type: !334, isLocal: false, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !195, line: 347, baseType: !193)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_consumer_sub", scope: !27, file: !114, line: 11, type: !338, isLocal: true, isDefinition: true, align: 32)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 16)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "_k_thread_stack_consumer_thread_id", scope: !27, file: !114, line: 25, type: !343, isLocal: false, isDefinition: true, align: 64)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 4096, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 512)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "_k_thread_obj_consumer_thread_id", scope: !27, file: !114, line: 25, type: !194, isLocal: false, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_zbus_mutex_processed_data_chan", scope: !350, file: !356, line: 15, type: !366, isLocal: true, isDefinition: true, align: 32)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !352, globals: !353, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/runtime_obs_registration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/runtime_obs_registration")
!352 = !{!104, !102, !103, !108, !109}
!353 = !{!348, !354, !510, !512, !514, !516, !518, !523, !531}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "processed_data_chan", scope: !350, file: !356, line: 15, type: !357, isLocal: false, isDefinition: true, align: 32)
!356 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !116, line: 29, size: 224, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !468, !481}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !358, file: !116, line: 35, baseType: !176, size: 16)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !358, file: !116, line: 40, baseType: !180, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !358, file: !116, line: 45, baseType: !180, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !358, file: !116, line: 51, baseType: !183, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !358, file: !116, line: 56, baseType: !365, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !124, line: 2720, size: 160, elements: !367)
!367 = !{!368, !387, !466, !467}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !366, file: !124, line: 2722, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !128, line: 233, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 231, size: 64, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !370, file: !128, line: 232, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !133, line: 48, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !133, line: 37, size: 64, elements: !375)
!375 = !{!376, !382}
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !133, line: 38, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !133, line: 38, size: 32, elements: !378)
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !377, file: !133, line: 39, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !133, line: 40, baseType: !380, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !133, line: 42, baseType: !383, size: 32, offset: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !133, line: 42, size: 32, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !383, file: !133, line: 43, baseType: !380, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !383, file: !133, line: 44, baseType: !380, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !366, file: !124, line: 2724, baseType: !388, size: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !195, line: 245, size: 896, elements: !390)
!390 = !{!391, !431, !443, !444, !445, !446, !461}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !389, file: !195, line: 247, baseType: !392, size: 384)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !195, line: 57, size: 384, elements: !393)
!393 = !{!394, !405, !407, !408, !409, !418, !419, !420}
!394 = !DIDerivedType(tag: DW_TAG_member, scope: !392, file: !195, line: 60, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !392, file: !195, line: 60, size: 64, elements: !396)
!396 = !{!397, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !395, file: !195, line: 61, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !133, line: 49, baseType: !374)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !395, file: !195, line: 62, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !207, line: 49, size: 64, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !400, file: !207, line: 50, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 64, elements: !212)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !392, file: !195, line: 68, baseType: !406, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !392, file: !195, line: 71, baseType: !164, size: 8, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !392, file: !195, line: 74, baseType: !164, size: 8, offset: 104)
!409 = !DIDerivedType(tag: DW_TAG_member, scope: !392, file: !195, line: 90, baseType: !410, size: 16, offset: 112)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !392, file: !195, line: 90, size: 16, elements: !411)
!411 = !{!412, !417}
!412 = !DIDerivedType(tag: DW_TAG_member, scope: !410, file: !195, line: 91, baseType: !413, size: 16)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !195, line: 91, size: 16, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !413, file: !195, line: 96, baseType: !225, size: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !413, file: !195, line: 97, baseType: !164, size: 8, offset: 8)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !410, file: !195, line: 100, baseType: !177, size: 16)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !392, file: !195, line: 107, baseType: !108, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !392, file: !195, line: 127, baseType: !102, size: 32, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !392, file: !195, line: 131, baseType: !421, size: 192, offset: 192)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !128, line: 244, size: 192, elements: !422)
!422 = !{!423, !424, !430}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !421, file: !128, line: 245, baseType: !398, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !421, file: !128, line: 246, baseType: !425, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !128, line: 242, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !421, file: !128, line: 249, baseType: !106, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !389, file: !195, line: 250, baseType: !432, size: 288, offset: 384)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !244, line: 25, size: 288, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !432, file: !244, line: 26, baseType: !108, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !432, file: !244, line: 27, baseType: !108, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !432, file: !244, line: 28, baseType: !108, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !432, file: !244, line: 29, baseType: !108, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !432, file: !244, line: 30, baseType: !108, size: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !432, file: !244, line: 31, baseType: !108, size: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !432, file: !244, line: 32, baseType: !108, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !432, file: !244, line: 33, baseType: !108, size: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !432, file: !244, line: 34, baseType: !108, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !389, file: !195, line: 253, baseType: !102, size: 32, offset: 672)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !389, file: !195, line: 256, baseType: !369, size: 64, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !389, file: !195, line: 294, baseType: !103, size: 32, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !389, file: !195, line: 325, baseType: !447, size: 32, offset: 800)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !124, line: 5073, size: 192, elements: !449)
!449 = !{!450, !456, !457}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !448, file: !124, line: 5074, baseType: !451, size: 96)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !264, line: 56, size: 96, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !451, file: !264, line: 57, baseType: !267, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !451, file: !264, line: 58, baseType: !102, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !451, file: !264, line: 59, baseType: !153, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !448, file: !124, line: 5075, baseType: !369, size: 64, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !448, file: !124, line: 5076, baseType: !458, size: 32, offset: 160)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !149, line: 43, size: 32, elements: !459)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !458, file: !149, line: 52, baseType: !22, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !389, file: !195, line: 343, baseType: !462, size: 64, offset: 832)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !244, line: 60, size: 64, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !462, file: !244, line: 63, baseType: !108, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !462, file: !244, line: 66, baseType: !108, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !366, file: !124, line: 2727, baseType: !108, size: 32, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !366, file: !124, line: 2730, baseType: !103, size: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_observers", scope: !358, file: !116, line: 61, baseType: !469, size: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !283, line: 40, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !283, line: 35, size: 64, elements: !472)
!472 = !{!473, !480}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !471, file: !283, line: 36, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !283, line: 33, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !283, line: 29, size: 32, elements: !477)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !476, file: !283, line: 30, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !471, file: !283, line: 37, baseType: !474, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !358, file: !116, line: 67, baseType: !482, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !116, line: 85, size: 96, elements: !487)
!487 = !{!488, !489, !504}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !486, file: !116, line: 91, baseType: !119, size: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !486, file: !116, line: 93, baseType: !490, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !124, line: 4204, size: 352, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !492, file: !124, line: 4206, baseType: !369, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !492, file: !124, line: 4208, baseType: !458, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !492, file: !124, line: 4210, baseType: !153, size: 32, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !492, file: !124, line: 4212, baseType: !108, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !492, file: !124, line: 4214, baseType: !157, size: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !492, file: !124, line: 4216, baseType: !157, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !492, file: !124, line: 4218, baseType: !157, size: 32, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !492, file: !124, line: 4220, baseType: !157, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !492, file: !124, line: 4222, baseType: !108, size: 32, offset: 288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !492, file: !124, line: 4227, baseType: !164, size: 8, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !486, file: !116, line: 96, baseType: !505, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "filter_lis", scope: !350, file: !356, line: 38, type: !486, isLocal: false, isDefinition: true, align: 32)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_state_change_sub", scope: !350, file: !356, line: 40, type: !492, isLocal: false, isDefinition: true, align: 32)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "state_change_sub", scope: !350, file: !356, line: 40, type: !486, isLocal: false, isDefinition: true, align: 32)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "_runtime_observers_processed_data_chan", scope: !350, file: !356, line: 15, type: !470, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_state_change_sub", scope: !350, file: !356, line: 40, type: !520, isLocal: true, isDefinition: true, align: 32)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 160, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 20)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "_zbus_message_processed_data_chan", scope: !350, file: !356, line: 15, type: !525, isLocal: true, isDefinition: true)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_msg", file: !526, line: 11, size: 96, elements: !527)
!526 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !525, file: !526, line: 12, baseType: !103, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !525, file: !526, line: 13, baseType: !103, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !525, file: !526, line: 14, baseType: !103, size: 32, offset: 64)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "_zbus_observers_processed_data_chan", scope: !350, file: !356, line: 15, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 64, elements: !212)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "_zbus_mutex_raw_data_chan", scope: !536, file: !541, line: 11, type: !551, isLocal: true, isDefinition: true, align: 32)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !538, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/runtime_obs_registration/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/runtime_obs_registration")
!538 = !{!534, !539, !695, !697, !699, !720, !724, !726, !728, !731, !733, !740, !745, !747}
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "raw_data_chan", scope: !536, file: !541, line: 11, type: !542, isLocal: false, isDefinition: true, align: 32)
!541 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !116, line: 29, size: 224, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !653, !666}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !543, file: !116, line: 35, baseType: !176, size: 16)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !543, file: !116, line: 40, baseType: !180, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !543, file: !116, line: 45, baseType: !180, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !543, file: !116, line: 51, baseType: !183, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !543, file: !116, line: 56, baseType: !550, size: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !124, line: 2720, size: 160, elements: !552)
!552 = !{!553, !572, !651, !652}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !551, file: !124, line: 2722, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !128, line: 233, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 231, size: 64, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !555, file: !128, line: 232, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !133, line: 48, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !133, line: 37, size: 64, elements: !560)
!560 = !{!561, !567}
!561 = !DIDerivedType(tag: DW_TAG_member, scope: !559, file: !133, line: 38, baseType: !562, size: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !559, file: !133, line: 38, size: 32, elements: !563)
!563 = !{!564, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !562, file: !133, line: 39, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !562, file: !133, line: 40, baseType: !565, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, scope: !559, file: !133, line: 42, baseType: !568, size: 32, offset: 32)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !559, file: !133, line: 42, size: 32, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !568, file: !133, line: 43, baseType: !565, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !568, file: !133, line: 44, baseType: !565, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !551, file: !124, line: 2724, baseType: !573, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !195, line: 245, size: 896, elements: !575)
!575 = !{!576, !616, !628, !629, !630, !631, !646}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !574, file: !195, line: 247, baseType: !577, size: 384)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !195, line: 57, size: 384, elements: !578)
!578 = !{!579, !590, !592, !593, !594, !603, !604, !605}
!579 = !DIDerivedType(tag: DW_TAG_member, scope: !577, file: !195, line: 60, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !577, file: !195, line: 60, size: 64, elements: !581)
!581 = !{!582, !584}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !580, file: !195, line: 61, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !133, line: 49, baseType: !559)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !580, file: !195, line: 62, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !207, line: 49, size: 64, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !585, file: !207, line: 50, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 64, elements: !212)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !577, file: !195, line: 68, baseType: !591, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !577, file: !195, line: 71, baseType: !164, size: 8, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !577, file: !195, line: 74, baseType: !164, size: 8, offset: 104)
!594 = !DIDerivedType(tag: DW_TAG_member, scope: !577, file: !195, line: 90, baseType: !595, size: 16, offset: 112)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !577, file: !195, line: 90, size: 16, elements: !596)
!596 = !{!597, !602}
!597 = !DIDerivedType(tag: DW_TAG_member, scope: !595, file: !195, line: 91, baseType: !598, size: 16)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !595, file: !195, line: 91, size: 16, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !598, file: !195, line: 96, baseType: !225, size: 8)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !598, file: !195, line: 97, baseType: !164, size: 8, offset: 8)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !595, file: !195, line: 100, baseType: !177, size: 16)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !577, file: !195, line: 107, baseType: !108, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !577, file: !195, line: 127, baseType: !102, size: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !577, file: !195, line: 131, baseType: !606, size: 192, offset: 192)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !128, line: 244, size: 192, elements: !607)
!607 = !{!608, !609, !615}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !606, file: !128, line: 245, baseType: !583, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !606, file: !128, line: 246, baseType: !610, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !128, line: 242, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !606, file: !128, line: 249, baseType: !106, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !574, file: !195, line: 250, baseType: !617, size: 288, offset: 384)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !244, line: 25, size: 288, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !617, file: !244, line: 26, baseType: !108, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !617, file: !244, line: 27, baseType: !108, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !617, file: !244, line: 28, baseType: !108, size: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !617, file: !244, line: 29, baseType: !108, size: 32, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !617, file: !244, line: 30, baseType: !108, size: 32, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !617, file: !244, line: 31, baseType: !108, size: 32, offset: 160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !617, file: !244, line: 32, baseType: !108, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !617, file: !244, line: 33, baseType: !108, size: 32, offset: 224)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !617, file: !244, line: 34, baseType: !108, size: 32, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !574, file: !195, line: 253, baseType: !102, size: 32, offset: 672)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !574, file: !195, line: 256, baseType: !554, size: 64, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !574, file: !195, line: 294, baseType: !103, size: 32, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !574, file: !195, line: 325, baseType: !632, size: 32, offset: 800)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !124, line: 5073, size: 192, elements: !634)
!634 = !{!635, !641, !642}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !633, file: !124, line: 5074, baseType: !636, size: 96)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !264, line: 56, size: 96, elements: !637)
!637 = !{!638, !639, !640}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !636, file: !264, line: 57, baseType: !267, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !636, file: !264, line: 58, baseType: !102, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !636, file: !264, line: 59, baseType: !153, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !633, file: !124, line: 5075, baseType: !554, size: 64, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !633, file: !124, line: 5076, baseType: !643, size: 32, offset: 160)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !149, line: 43, size: 32, elements: !644)
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !643, file: !149, line: 52, baseType: !22, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !574, file: !195, line: 343, baseType: !647, size: 64, offset: 832)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !244, line: 60, size: 64, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !647, file: !244, line: 63, baseType: !108, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !647, file: !244, line: 66, baseType: !108, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !551, file: !124, line: 2727, baseType: !108, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !551, file: !124, line: 2730, baseType: !103, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_observers", scope: !543, file: !116, line: 61, baseType: !654, size: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !283, line: 40, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !283, line: 35, size: 64, elements: !657)
!657 = !{!658, !665}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !656, file: !283, line: 36, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !283, line: 33, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !283, line: 29, size: 32, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !661, file: !283, line: 30, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !656, file: !283, line: 37, baseType: !659, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !543, file: !116, line: 67, baseType: !667, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !116, line: 85, size: 96, elements: !672)
!672 = !{!673, !674, !689}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !671, file: !116, line: 91, baseType: !119, size: 8)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !671, file: !116, line: 93, baseType: !675, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !124, line: 4204, size: 352, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !677, file: !124, line: 4206, baseType: !554, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !677, file: !124, line: 4208, baseType: !643, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !677, file: !124, line: 4210, baseType: !153, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !677, file: !124, line: 4212, baseType: !108, size: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !677, file: !124, line: 4214, baseType: !157, size: 32, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !677, file: !124, line: 4216, baseType: !157, size: 32, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !677, file: !124, line: 4218, baseType: !157, size: 32, offset: 224)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !677, file: !124, line: 4220, baseType: !157, size: 32, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !677, file: !124, line: 4222, baseType: !108, size: 32, offset: 288)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !677, file: !124, line: 4227, baseType: !164, size: 8, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !671, file: !116, line: 96, baseType: !690, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "_zbus_mutex_state_chan", scope: !536, file: !541, line: 14, type: !551, isLocal: true, isDefinition: true, align: 32)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "state_chan", scope: !536, file: !541, line: 14, type: !542, isLocal: false, isDefinition: true, align: 32)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "_k_thread_data_produce_thread_id", scope: !536, file: !541, line: 43, type: !701, isLocal: false, isDefinition: true, align: 32)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !124, line: 620, size: 384, elements: !702)
!702 = !{!703, !704, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !701, file: !124, line: 621, baseType: !573, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !701, file: !124, line: 622, baseType: !705, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !307, line: 44, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !309, line: 47, size: 8, elements: !708)
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !707, file: !309, line: 48, baseType: !158, size: 8)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !701, file: !124, line: 623, baseType: !32, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !701, file: !124, line: 624, baseType: !314, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !701, file: !124, line: 625, baseType: !102, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !701, file: !124, line: 626, baseType: !102, size: 32, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !701, file: !124, line: 627, baseType: !102, size: 32, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !701, file: !124, line: 628, baseType: !103, size: 32, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !701, file: !124, line: 629, baseType: !108, size: 32, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !701, file: !124, line: 630, baseType: !324, size: 32, offset: 288)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !701, file: !124, line: 631, baseType: !326, size: 32, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !701, file: !124, line: 632, baseType: !330, size: 32, offset: 352)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "produce_thread_id", scope: !536, file: !541, line: 43, type: !722, isLocal: false, isDefinition: true)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !195, line: 347, baseType: !573)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "_runtime_observers_raw_data_chan", scope: !536, file: !541, line: 11, type: !655, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "_runtime_observers_state_chan", scope: !536, file: !541, line: 14, type: !655, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "_k_thread_stack_produce_thread_id", scope: !536, file: !541, line: 43, type: !730, isLocal: false, isDefinition: true, align: 64)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 4096, elements: !344)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "_k_thread_obj_produce_thread_id", scope: !536, file: !541, line: 43, type: !574, isLocal: false, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "_zbus_message_raw_data_chan", scope: !536, file: !541, line: 11, type: !735, isLocal: true, isDefinition: true)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_msg", file: !526, line: 11, size: 96, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !735, file: !526, line: 12, baseType: !103, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !735, file: !526, line: 13, baseType: !103, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !735, file: !526, line: 14, baseType: !103, size: 32, offset: 64)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "_zbus_observers_raw_data_chan", scope: !536, file: !541, line: 11, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 32, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 1)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "_zbus_message_state_chan", scope: !536, file: !541, line: 14, type: !119, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "_zbus_observers_state_chan", scope: !536, file: !541, line: 14, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 64, elements: !212)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !752, file: !767, line: 18, type: !768, isLocal: false, isDefinition: true)
!752 = distinct !DICompileUnit(language: DW_LANG_C99, file: !753, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !754, globals: !766, splitDebugInlining: false, nameTableKind: None)
!753 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/runtime_obs_registration")
!754 = !{!22, !102, !24, !755, !757, !759, !153, !103, !760, !761, !763, !764, !157, !765, !177, !330}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!766 = !{!750}
!767 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !770, line: 16, size: 64, elements: !771)
!770 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !769, file: !770, line: 17, baseType: !330, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !769, file: !770, line: 18, baseType: !164, size: 8, offset: 32)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "_char_out", scope: !776, file: !780, line: 54, type: !781, isLocal: false, isDefinition: true)
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !778, globals: !779, splitDebugInlining: false, nameTableKind: None)
!777 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/runtime_obs_registration")
!778 = !{!102, !103}
!779 = !{!774}
!780 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{!103, !103}
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !786, file: !1200, line: 258, type: !1201, isLocal: true, isDefinition: true, align: 32)
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !788, retainedTypes: !1071, globals: !1199, splitDebugInlining: false, nameTableKind: None)
!787 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/runtime_obs_registration")
!788 = !{!789, !821, !831, !880, !886, !1007, !1042}
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !790, line: 54, baseType: !32, size: 32, elements: !791)
!790 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!792 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!793 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!794 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!795 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!796 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!797 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!798 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!799 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!800 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!801 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!802 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!803 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!804 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!805 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!806 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!807 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!808 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!809 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!810 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!811 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!812 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!813 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!814 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!815 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!816 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!817 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!818 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!819 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!820 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!821 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !790, line: 224, baseType: !32, size: 32, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830}
!823 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!824 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!825 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!826 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!827 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!828 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!829 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!830 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!831 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !790, line: 275, baseType: !32, size: 32, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!833 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!834 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!835 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!836 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!837 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!838 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!839 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!840 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!841 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!842 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!843 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!844 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!845 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!846 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!847 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!848 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!849 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!850 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!851 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!852 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!853 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!854 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!855 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!856 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!857 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!858 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!859 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!860 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!861 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!862 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!863 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!864 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!865 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!866 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!867 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!868 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!869 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!870 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!871 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!872 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!873 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!874 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!875 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!876 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!877 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!878 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!879 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !790, line: 327, baseType: !32, size: 32, elements: !881)
!881 = !{!882, !883, !884, !885}
!882 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!883 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!884 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!885 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!886 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !887, line: 76, baseType: !32, size: 32, elements: !888)
!887 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!889 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!890 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!891 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!892 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!893 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!894 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!895 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!896 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!897 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!898 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!899 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!900 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!901 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!902 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!903 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!904 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!905 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!906 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!907 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!908 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!909 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!910 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!911 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!912 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!913 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!914 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!915 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!916 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!917 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!918 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!919 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!920 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!921 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!922 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!923 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!924 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!925 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!926 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!927 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!928 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!929 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!930 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!931 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!932 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!933 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!934 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!935 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!936 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!937 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!938 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!939 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!940 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!941 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!942 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!943 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!944 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!945 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!946 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!947 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!948 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!949 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!950 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!951 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!952 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!953 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!954 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!955 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!956 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!957 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!958 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!959 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!960 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!961 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!962 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!963 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!964 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!965 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!966 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!967 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!968 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!969 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!970 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!971 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!972 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!973 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!974 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!975 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!976 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!977 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!978 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!979 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!980 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!981 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!982 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!983 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!984 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!985 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!986 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!987 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!988 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!989 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!990 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!991 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!992 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!993 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!994 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!995 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!996 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!997 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!998 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!999 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!1000 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!1001 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!1002 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!1003 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!1004 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!1005 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!1006 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!1007 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !790, line: 237, baseType: !32, size: 32, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041}
!1009 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!1010 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!1011 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!1012 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!1013 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!1014 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!1015 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!1016 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!1017 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!1018 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!1019 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!1020 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!1021 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!1022 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!1023 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!1024 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!1025 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!1026 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!1027 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!1028 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!1029 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!1030 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!1031 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!1032 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!1033 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!1034 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!1035 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!1036 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!1037 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!1038 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!1039 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!1040 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!1041 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!1042 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !887, line: 44, baseType: !32, size: 32, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070}
!1044 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!1045 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!1046 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!1047 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!1048 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!1049 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!1050 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!1051 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!1052 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!1053 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!1054 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!1055 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!1056 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!1057 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!1058 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!1059 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!1060 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!1061 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!1062 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!1063 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!1064 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!1065 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!1066 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!1067 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!1068 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!1069 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!1070 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!1071 = !{!1072, !1144, !1187, !1198, !108}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 32)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !1074, line: 4575, baseType: !1075)
!1074 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1074, line: 4532, size: 390144, elements: !1076)
!1076 = !{!1077, !1079, !1080, !1081, !1082, !1086, !1096, !1100, !1110, !1114}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !1075, file: !1074, line: 4533, baseType: !1078, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !1075, file: !1074, line: 4534, baseType: !1078, size: 32, offset: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !1075, file: !1074, line: 4535, baseType: !1078, size: 32, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !1075, file: !1074, line: 4536, baseType: !1078, size: 32, offset: 96)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !1075, file: !1074, line: 4537, baseType: !1083, size: 16256, offset: 128)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 16256, elements: !1084)
!1084 = !{!1085}
!1085 = !DISubrange(count: 2032)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !1075, file: !1074, line: 4543, baseType: !1087, size: 4224, offset: 16384)
