; ModuleID = 'build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.rtio_executor_api = type { i32 (%struct.rtio*)*, void (%struct.rtio*, %struct.rtio_sqe*, i32)*, void (%struct.rtio*, %struct.rtio_sqe*, i32)* }
%struct.rtio = type { %struct.rtio_executor*, i32, %struct.rtio_sq*, %struct.rtio_cq* }
%struct.rtio_executor = type { %struct.rtio_executor_api* }
%struct.rtio_sq = type { %struct.rtio_spsc, [0 x %struct.rtio_sqe] }
%struct.rtio_spsc = type { i32, i32, i32, i32, i32 }
%struct.rtio_sqe = type { i8, i8, i16, %struct.rtio_iodev*, i8*, %union.anon.3 }
%struct.rtio_iodev = type { %struct.rtio_iodev_api*, %struct.rtio_iodev_sq*, i8* }
%struct.rtio_iodev_api = type { void (%struct.rtio_sqe*, %struct.rtio*)* }
%struct.rtio_iodev_sq = type { %struct.rtio_spsc, [0 x %struct.rtio_iodev_sqe] }
%struct.rtio_iodev_sqe = type { %struct.rtio_sqe*, %struct.rtio* }
%union.anon.3 = type { %struct.anon.4 }
%struct.anon.4 = type { i32, i8* }
%struct.rtio_cq = type { %struct.rtio_spsc, [0 x %struct.anon.4] }
%struct.rtio_simple_executor = type { %struct.rtio_executor }
%struct.rtio_spsc__sq_ez_io = type { %struct.rtio_spsc, [8 x %struct.rtio_sqe] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !119, line: 12, type: !252, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !103, globals: !116, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/rtio/sensor_batch_processing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_RTIO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_RTIO_IODEV", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_LAST", value: 68)
!103 = !{!104, !105, !108, !109, !113, !114}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !110, line: 46, baseType: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !112)
!112 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !115)
!115 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!116 = !{!25, !117, !227, !229, !235, !237, !245}
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "simple_exec", scope: !27, file: !119, line: 24, type: !120, isLocal: false, isDefinition: true)
!119 = !DIFile(filename: "zephyr/samples/subsys/rtio/sensor_batch_processing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_simple_executor", file: !121, line: 57, size: 32, elements: !122)
!121 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_executor_simple.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !120, file: !121, line: 58, baseType: !124, size: 32)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !126)
!125 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !124, file: !125, line: 211, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !131)
!131 = !{!132, !222, !226}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !130, file: !125, line: 177, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!108, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !138)
!138 = !{!139, !141, !145, !210}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !137, file: !125, line: 228, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !137, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !143, line: 22, baseType: !144)
!143 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!144 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !137, file: !125, line: 254, baseType: !146, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !148)
!148 = !{!149, !159}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !147, file: !125, line: 143, baseType: !150, size: 160)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_spsc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = !{!153, !154, !155, !156, !157}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !150, file: !151, line: 60, baseType: !24, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !150, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !150, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !150, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !150, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !147, file: !125, line: 144, baseType: !160, offset: 160)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, elements: !197)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !162)
!162 = !{!163, !166, !167, !170, !200, !201}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !161, file: !125, line: 110, baseType: !164, size: 8)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !165)
!165 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !161, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !161, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !169)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !161, file: !125, line: 116, baseType: !171, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !174)
!174 = !{!175, !186, !199}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !173, file: !125, line: 308, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !178, file: !125, line: 271, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !184, !136}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !173, file: !125, line: 311, baseType: !187, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !188, file: !125, line: 299, baseType: !150, size: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !188, file: !125, line: 300, baseType: !192, offset: 160)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, elements: !197)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !193, file: !125, line: 289, baseType: !184, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !193, file: !125, line: 290, baseType: !136, size: 32, offset: 32)
!197 = !{!198}
!198 = !DISubrange(count: -1)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !161, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !125, line: 127, baseType: !202, size: 64, offset: 96)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !125, line: 127, size: 64, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !125, line: 128, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !202, file: !125, line: 128, size: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !205, file: !125, line: 129, baseType: !113, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !205, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !137, file: !125, line: 257, baseType: !211, size: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !212, file: !125, line: 162, baseType: !150, size: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !212, file: !125, line: 163, baseType: !216, offset: 160)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, elements: !197)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !218)
!218 = !{!219, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !217, file: !125, line: 151, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !108)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !217, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !130, file: !125, line: 182, baseType: !223, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !136, !184, !108}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !130, file: !125, line: 187, baseType: !223, size: 32, offset: 64)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "ez_io", scope: !27, file: !119, line: 25, type: !137, isLocal: false, isDefinition: true, align: 32)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "bufs", scope: !27, file: !119, line: 27, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 1024, elements: !232)
!232 = !{!233, !234}
!233 = !DISubrange(count: 8)
!234 = !DISubrange(count: 16)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "z_rtio_simple_api", scope: !27, file: !121, line: 64, type: !129, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "_sq_ez_io", scope: !27, file: !119, line: 25, type: !239, isLocal: true, isDefinition: true)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc__sq_ez_io", file: !119, line: 25, size: 1440, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !239, file: !119, line: 25, baseType: !150, size: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !239, file: !119, line: 25, baseType: !243, size: 1280, offset: 160)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1280, elements: !244)
!244 = !{!233}
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "_cq_ez_io", scope: !27, file: !119, line: 25, type: !247, isLocal: true, isDefinition: true)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc__cq_ez_io", file: !119, line: 25, size: 672, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !247, file: !119, line: 25, baseType: !150, size: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !247, file: !119, line: 25, baseType: !251, size: 512, offset: 160)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 512, elements: !244)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !255)
!254 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !254, line: 17, baseType: !105, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !253, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "log_const_vnd_sensor", scope: !260, file: !265, line: 14, type: !489, isLocal: false, isDefinition: true)
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !262, globals: !450, splitDebugInlining: false, nameTableKind: None)
!261 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/rtio/sensor_batch_processing/src/vnd_sensor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!262 = !{!104, !108, !263, !109, !443, !113, !114}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnd_sensor_data", file: !265, line: 21, size: 960, elements: !266)
!265 = !DIFile(filename: "zephyr/samples/subsys/rtio/sensor_batch_processing/src/vnd_sensor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = !{!267, !357, !407, !430, !449}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !264, file: !265, line: 22, baseType: !268, size: 96)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !269)
!269 = !{!270, !345, !356}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !268, file: !125, line: 308, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !274)
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !273, file: !125, line: 271, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279, !298}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !282)
!282 = !{!283, !284, !285, !286, !289, !290}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !281, file: !125, line: 110, baseType: !164, size: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !281, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !281, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !281, file: !125, line: 116, baseType: !287, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !281, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !125, line: 127, baseType: !291, size: 64, offset: 96)
!291 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !125, line: 127, size: 64, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, scope: !291, file: !125, line: 128, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !125, line: 128, size: 64, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !294, file: !125, line: 129, baseType: !113, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !294, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !300)
!300 = !{!301, !319, !320, !334}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !299, file: !125, line: 228, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !304)
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !303, file: !125, line: 211, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !309)
!309 = !{!310, !314, !318}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !308, file: !125, line: 177, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!108, !298}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !308, file: !125, line: 182, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !298, !279, !108}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !308, file: !125, line: 187, baseType: !315, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !299, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !299, file: !125, line: 254, baseType: !321, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !323)
!323 = !{!324, !332}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !322, file: !125, line: 143, baseType: !325, size: 160)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !326)
!326 = !{!327, !328, !329, !330, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !325, file: !151, line: 60, baseType: !24, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !325, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !325, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !325, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !325, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !322, file: !125, line: 144, baseType: !333, offset: 160)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, elements: !197)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !299, file: !125, line: 257, baseType: !335, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !336, file: !125, line: 162, baseType: !325, size: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !336, file: !125, line: 163, baseType: !340, offset: 160)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, elements: !197)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !341, file: !125, line: 151, baseType: !220, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !341, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !268, file: !125, line: 311, baseType: !346, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !347, file: !125, line: 299, baseType: !325, size: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !347, file: !125, line: 300, baseType: !351, offset: 160)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, elements: !197)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !352, file: !125, line: 289, baseType: !279, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !352, file: !125, line: 290, baseType: !298, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !264, file: !265, line: 23, baseType: !358, size: 448, offset: 128)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !359, line: 1318, size: 448, elements: !360)
!359 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !{!361, !388, !394, !399, !400, !405, !406}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !358, file: !359, line: 1324, baseType: !362, size: 192)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !363, line: 244, size: 192, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !381, !387}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !362, file: !363, line: 245, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !367, line: 49, baseType: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !367, line: 37, size: 64, elements: !369)
!369 = !{!370, !376}
!370 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !367, line: 38, baseType: !371, size: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 38, size: 32, elements: !372)
!372 = !{!373, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !371, file: !367, line: 39, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !367, line: 40, baseType: !374, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !367, line: 42, baseType: !377, size: 32, offset: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 42, size: 32, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !377, file: !367, line: 43, baseType: !374, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !377, file: !367, line: 44, baseType: !374, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !362, file: !363, line: 246, baseType: !382, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !363, line: 242, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !362, file: !363, line: 249, baseType: !111, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !358, file: !359, line: 1327, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !363, line: 233, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 231, size: 64, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !390, file: !363, line: 232, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !367, line: 48, baseType: !368)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !358, file: !359, line: 1330, baseType: !395, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !358, file: !359, line: 1333, baseType: !395, size: 32, offset: 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !358, file: !359, line: 1336, baseType: !401, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !110, line: 67, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 65, size: 64, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !402, file: !110, line: 66, baseType: !109, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !358, file: !359, line: 1339, baseType: !113, size: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !358, file: !359, line: 1342, baseType: !104, size: 32, offset: 416)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !264, file: !265, line: 24, baseType: !408, size: 32, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !411, line: 378, size: 192, elements: !412)
!411 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = !{!413, !414, !415, !416, !423, !424}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !411, line: 380, baseType: !105, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !410, file: !411, line: 382, baseType: !13, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !410, file: !411, line: 384, baseType: !13, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !410, file: !411, line: 386, baseType: !417, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !411, line: 351, size: 16, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !418, file: !411, line: 359, baseType: !164, size: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !418, file: !411, line: 364, baseType: !422, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!422 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !411, line: 388, baseType: !104, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !410, file: !411, line: 396, baseType: !425, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !411, line: 43, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !429)
!429 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !264, file: !265, line: 25, baseType: !431, size: 320, offset: 608)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !359, line: 4204, size: 320, elements: !432)
!432 = !{!433, !434, !438, !441, !442, !444, !445, !446, !447, !448}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !431, file: !359, line: 4206, baseType: !389, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !431, file: !359, line: 4208, baseType: !435, offset: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!436 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!437 = !{}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !431, file: !359, line: 4210, baseType: !439, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !440, line: 214, baseType: !32)
!440 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !431, file: !359, line: 4212, baseType: !113, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !431, file: !359, line: 4214, baseType: !443, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !431, file: !359, line: 4216, baseType: !443, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !431, file: !359, line: 4218, baseType: !443, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !431, file: !359, line: 4220, baseType: !443, size: 32, offset: 224)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !431, file: !359, line: 4222, baseType: !113, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !359, line: 4227, baseType: !164, size: 8, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_number", scope: !264, file: !265, line: 26, baseType: !113, size: 32, offset: 928)
!450 = !{!258, !451, !458, !463, !465, !476, !478, !485, !487}
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "vnd_sensor_iodev_sq_0", scope: !260, file: !265, line: 152, type: !453, isLocal: false, isDefinition: true)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc_vnd_sensor_iodev_sq_0", file: !265, line: 152, size: 672, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !453, file: !265, line: 152, baseType: !325, size: 160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !453, file: !265, line: 152, baseType: !457, size: 512, offset: 160)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 512, elements: !244)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !260, file: !265, line: 152, type: !460, isLocal: false, isDefinition: true, align: 16)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 64, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 4)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "__device_dts_ord_14", scope: !260, file: !265, line: 152, type: !409, isLocal: false, isDefinition: true, align: 32)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_14", scope: !260, file: !265, line: 152, type: !467, isLocal: true, isDefinition: true, align: 32)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !469, line: 51, size: 64, elements: !470)
!469 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!470 = !{!471, !475}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !468, file: !469, line: 60, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DISubroutineType(types: !474)
!474 = !{!108, !408}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !468, file: !469, line: 65, baseType: !408, size: 32, offset: 32)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_14", scope: !260, file: !265, line: 152, type: !418, isLocal: true, isDefinition: true, align: 8)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "vnd_sensor_config_0", scope: !260, file: !265, line: 152, type: !480, isLocal: true, isDefinition: true)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnd_sensor_config", file: !265, line: 16, size: 64, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sample_period", scope: !481, file: !265, line: 17, baseType: !113, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sample_size", scope: !481, file: !265, line: 18, baseType: !439, size: 32, offset: 32)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "vnd_sensor_data_0", scope: !260, file: !265, line: 152, type: !264, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "vnd_sensor_iodev_api", scope: !260, file: !265, line: 127, type: !272, isLocal: true, isDefinition: true)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !254, line: 17, baseType: !105, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !490, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !496, file: !501, line: 27, type: !502, isLocal: false, isDefinition: true, align: 16)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !498, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!498 = !{!499, !505, !507, !509, !494}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_62", scope: !496, file: !501, line: 7, type: !502, isLocal: false, isDefinition: true, align: 16)
!501 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 48, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 3)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_4", scope: !496, file: !501, line: 12, type: !502, isLocal: false, isDefinition: true, align: 16)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_91", scope: !496, file: !501, line: 17, type: !502, isLocal: false, isDefinition: true, align: 16)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_90", scope: !496, file: !501, line: 22, type: !502, isLocal: false, isDefinition: true, align: 16)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !513, file: !526, line: 18, type: !527, isLocal: false, isDefinition: true)
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !515, globals: !525, splitDebugInlining: false, nameTableKind: None)
!514 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!515 = !{!22, !104, !24, !516, !518, !520, !439, !108, !521, !522, !523, !524, !443, !209, !168, !105}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!525 = !{!511}
!526 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !254, line: 17, baseType: !105, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !528, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "_char_out", scope: !534, file: !538, line: 54, type: !539, isLocal: false, isDefinition: true)
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !536, globals: !537, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!536 = !{!104, !108}
!537 = !{!532}
!538 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DISubroutineType(types: !541)
!541 = !{!108, !108}
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !544, file: !597, line: 35, type: !613, isLocal: false, isDefinition: true)
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !545, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !546, globals: !594, splitDebugInlining: false, nameTableKind: None)
!545 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!546 = !{!104, !108, !547, !113, !558}
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !549, file: !548, line: 167, baseType: !557)
!548 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!549 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !548, file: !548, line: 134, type: !550, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !544, retainedNodes: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !113}
!552 = !{!553, !554, !556}
!553 = !DILocalVariable(name: "time_us", arg: 1, scope: !549, file: !548, line: 134, type: !113)
!554 = !DILocalVariable(name: "delay_cycles", scope: !549, file: !548, line: 168, type: !555)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!556 = !DILocalVariable(name: "cycles", scope: !549, file: !548, line: 171, type: !113)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !560, line: 1928, baseType: !561)
!560 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !560, line: 1909, size: 11360, elements: !562)
!562 = !{!563, !569, !570, !571, !572, !576, !577, !578, !579, !581, !582, !584, !585, !586, !587, !588, !592, !593}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !561, file: !560, line: 1910, baseType: !564, size: 8192)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 8192, elements: !567)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!567 = !{!568}
!568 = !DISubrange(count: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !561, file: !560, line: 1911, baseType: !565, size: 32, offset: 8192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !561, file: !560, line: 1912, baseType: !565, size: 32, offset: 8224)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !561, file: !560, line: 1913, baseType: !565, size: 32, offset: 8256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !561, file: !560, line: 1914, baseType: !573, size: 1984, offset: 8288)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 1984, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 62)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !561, file: !560, line: 1915, baseType: !566, size: 32, offset: 10272)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !561, file: !560, line: 1916, baseType: !565, size: 32, offset: 10304)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !561, file: !560, line: 1917, baseType: !566, size: 32, offset: 10336)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !561, file: !560, line: 1918, baseType: !580, size: 96, offset: 10368)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 96, elements: !503)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !561, file: !560, line: 1919, baseType: !566, size: 32, offset: 10464)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !561, file: !560, line: 1920, baseType: !583, size: 256, offset: 10496)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 256, elements: !244)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !561, file: !560, line: 1921, baseType: !566, size: 32, offset: 10752)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !561, file: !560, line: 1922, baseType: !565, size: 32, offset: 10784)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !561, file: !560, line: 1923, baseType: !566, size: 32, offset: 10816)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !561, file: !560, line: 1924, baseType: !566, size: 32, offset: 10848)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !561, file: !560, line: 1925, baseType: !589, size: 416, offset: 10880)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 416, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 13)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !561, file: !560, line: 1926, baseType: !566, size: 32, offset: 11296)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !561, file: !560, line: 1927, baseType: !566, size: 32, offset: 11328)
!594 = !{!542, !595, !609}
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !544, file: !597, line: 65, type: !598, isLocal: true, isDefinition: true, align: 32)
!597 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !469, line: 51, size: 64, elements: !600)
!600 = !{!601, !608}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !599, file: !469, line: 60, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DISubroutineType(types: !604)
!604 = !{!108, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !469, line: 48, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !599, file: !469, line: 65, baseType: !605, size: 32, offset: 32)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !549, file: !548, line: 161, type: !611, isLocal: true, isDefinition: true, align: 128)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 48, elements: !503)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !614, file: !254, line: 17, baseType: !105, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !614, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !620, file: !654, line: 22, type: !682, isLocal: false, isDefinition: true)
!620 = distinct !DICompileUnit(language: DW_LANG_C99, file: !621, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !622, retainedTypes: !634, globals: !651, splitDebugInlining: false, nameTableKind: None)
!621 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!622 = !{!623, !30}
!623 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !624, line: 27, baseType: !32, size: 32, elements: !625)
!624 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633}
!626 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!627 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!628 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!629 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!630 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!631 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!632 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!633 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!634 = !{!104, !109, !108, !24, !635, !443, !113, !114}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !637, line: 54, size: 96, elements: !638)
!637 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!638 = !{!639, !646, !650}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !636, file: !637, line: 55, baseType: !640, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !641, line: 33, baseType: !642)
!641 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !641, line: 29, size: 32, elements: !643)
!643 = !{!644}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !642, file: !641, line: 30, baseType: !645, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !636, file: !637, line: 60, baseType: !647, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !623}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !636, file: !637, line: 65, baseType: !647, size: 32, offset: 64)
!651 = !{!618, !652, !658, !661, !663, !672, !674}
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !620, file: !654, line: 27, type: !655, isLocal: true, isDefinition: true)
!654 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 32, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 1)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !620, file: !654, line: 44, type: !660, isLocal: true, isDefinition: true)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !620, file: !654, line: 49, type: !660, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !620, file: !654, line: 36, type: !665, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 128, elements: !656)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !624, line: 114, size: 128, elements: !667)
!667 = !{!668, !669, !670, !671}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !666, file: !624, line: 115, baseType: !623, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !666, file: !624, line: 141, baseType: !164, size: 8, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !666, file: !624, line: 149, baseType: !113, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !666, file: !624, line: 156, baseType: !113, size: 32, offset: 96)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !620, file: !654, line: 40, type: !665, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !620, file: !654, line: 28, type: !676, isLocal: true, isDefinition: true)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !641, line: 40, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !641, line: 35, size: 64, elements: !678)
!678 = !{!679, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !677, file: !641, line: 36, baseType: !680, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !677, file: !641, line: 37, baseType: !680, size: 32, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !683, file: !254, line: 17, baseType: !105, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !683, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!687 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!688 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !691, file: !717, line: 50, type: !220, isLocal: true, isDefinition: true)
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !622, retainedTypes: !693, globals: !714, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!693 = !{!428, !109, !439, !108, !104, !113, !114, !694, !443, !220, !705}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !696, line: 45, size: 64, elements: !697)
!696 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!697 = !{!698, !704}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !695, file: !696, line: 46, baseType: !699, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !641, line: 33, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !641, line: 29, size: 32, elements: !701)
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !700, file: !641, line: 30, baseType: !703, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !695, file: !696, line: 48, baseType: !113, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !696, line: 38, size: 64, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !706, file: !696, line: 39, baseType: !699, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !706, file: !696, line: 41, baseType: !710, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !696, line: 35, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !220}
!714 = !{!715, !719, !727, !689, !729, !739}
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "latency_lock", scope: !691, file: !717, line: 44, type: !718, isLocal: true, isDefinition: true)
!717 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !691, file: !717, line: 46, type: !721, isLocal: true, isDefinition: true)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !641, line: 40, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !641, line: 35, size: 64, elements: !723)
!723 = !{!724, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !722, file: !641, line: 36, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !722, file: !641, line: 37, baseType: !725, size: 32, offset: 32)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "latency_subs", scope: !691, file: !717, line: 52, type: !721, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !691, file: !717, line: 39, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, elements: !737)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !717, line: 35, size: 96, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !732, file: !717, line: 36, baseType: !623, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !732, file: !717, line: 37, baseType: !164, size: 8, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !732, file: !717, line: 38, baseType: !142, size: 32, offset: 64)
!737 = !{!738}
!738 = !DISubrange(count: 0)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !691, file: !717, line: 48, type: !220, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !743, file: !750, line: 47, type: !764, isLocal: true, isDefinition: true)
!743 = distinct !DICompileUnit(language: DW_LANG_C99, file: !744, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !745, retainedTypes: !746, globals: !747, splitDebugInlining: false, nameTableKind: None)
!744 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!745 = !{!623}
!746 = !{!439, !108}
!747 = !{!748, !741, !760}
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "cpus_states", scope: !743, file: !750, line: 50, type: !751, isLocal: true, isDefinition: true)
!750 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 32, elements: !656)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !624, line: 114, size: 128, elements: !755)
!755 = !{!756, !757, !758, !759}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !754, file: !624, line: 115, baseType: !623, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !754, file: !624, line: 141, baseType: !164, size: 8, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !754, file: !624, line: 149, baseType: !113, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !754, file: !624, line: 156, baseType: !113, size: 32, offset: 96)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !743, file: !750, line: 55, type: !762, isLocal: true, isDefinition: true)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 8, elements: !656)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, elements: !737)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !767, file: !774, line: 17, type: !907, isLocal: false, isDefinition: true)
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !769, globals: !770, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!769 = !{!439, !108, !113, !104}
!770 = !{!765, !771, !903}
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !773, file: !774, line: 198, type: !890, isLocal: true, isDefinition: true)
!773 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !774, file: !774, line: 175, type: !775, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !767, retainedNodes: !887)
!774 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!775 = !DISubroutineType(types: !776)
!776 = !{null, !777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !779, line: 245, size: 1024, elements: !780)
!779 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!780 = !{!781, !844, !857, !858, !859, !860, !866, !882}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !778, file: !779, line: 247, baseType: !782, size: 384)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !779, line: 57, size: 384, elements: !783)
!783 = !{!784, !811, !818, !819, !820, !831, !832, !833}
!784 = !DIDerivedType(tag: DW_TAG_member, scope: !782, file: !779, line: 60, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !782, file: !779, line: 60, size: 64, elements: !786)
!786 = !{!787, !802}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !785, file: !779, line: 61, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !367, line: 49, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !367, line: 37, size: 64, elements: !790)
!790 = !{!791, !797}
!791 = !DIDerivedType(tag: DW_TAG_member, scope: !789, file: !367, line: 38, baseType: !792, size: 32)
!792 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !789, file: !367, line: 38, size: 32, elements: !793)
!793 = !{!794, !796}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !792, file: !367, line: 39, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !792, file: !367, line: 40, baseType: !795, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, scope: !789, file: !367, line: 42, baseType: !798, size: 32, offset: 32)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !789, file: !367, line: 42, size: 32, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !798, file: !367, line: 43, baseType: !795, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !798, file: !367, line: 44, baseType: !795, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !785, file: !779, line: 62, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !804, line: 49, size: 64, elements: !805)
!804 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !803, file: !804, line: 50, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 64, elements: !809)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!809 = !{!810}
!810 = !DISubrange(count: 2)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !782, file: !779, line: 68, baseType: !812, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !363, line: 233, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 231, size: 64, elements: !815)
!815 = !{!816}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !814, file: !363, line: 232, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !367, line: 48, baseType: !789)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !782, file: !779, line: 71, baseType: !164, size: 8, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !782, file: !779, line: 74, baseType: !164, size: 8, offset: 104)
!820 = !DIDerivedType(tag: DW_TAG_member, scope: !782, file: !779, line: 90, baseType: !821, size: 16, offset: 112)
!821 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !782, file: !779, line: 90, size: 16, elements: !822)
!822 = !{!823, !830}
!823 = !DIDerivedType(tag: DW_TAG_member, scope: !821, file: !779, line: 91, baseType: !824, size: 16)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !821, file: !779, line: 91, size: 16, elements: !825)
!825 = !{!826, !829}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !824, file: !779, line: 96, baseType: !827, size: 8)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !828)
!828 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !824, file: !779, line: 97, baseType: !164, size: 8, offset: 8)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !821, file: !779, line: 100, baseType: !168, size: 16)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !782, file: !779, line: 107, baseType: !113, size: 32, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !782, file: !779, line: 127, baseType: !104, size: 32, offset: 160)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !782, file: !779, line: 131, baseType: !834, size: 192, offset: 192)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !363, line: 244, size: 192, elements: !835)
!835 = !{!836, !837, !843}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !834, file: !363, line: 245, baseType: !788, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !834, file: !363, line: 246, baseType: !838, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !363, line: 242, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !842}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !834, file: !363, line: 249, baseType: !111, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !778, file: !779, line: 250, baseType: !845, size: 288, offset: 384)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !846, line: 25, size: 288, elements: !847)
!846 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !845, file: !846, line: 26, baseType: !113, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !845, file: !846, line: 27, baseType: !113, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !845, file: !846, line: 28, baseType: !113, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !845, file: !846, line: 29, baseType: !113, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !845, file: !846, line: 30, baseType: !113, size: 32, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !845, file: !846, line: 31, baseType: !113, size: 32, offset: 160)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !845, file: !846, line: 32, baseType: !113, size: 32, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !845, file: !846, line: 33, baseType: !113, size: 32, offset: 224)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !845, file: !846, line: 34, baseType: !113, size: 32, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !778, file: !779, line: 253, baseType: !104, size: 32, offset: 672)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !778, file: !779, line: 256, baseType: !813, size: 64, offset: 704)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !778, file: !779, line: 294, baseType: !108, size: 32, offset: 768)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !778, file: !779, line: 300, baseType: !861, size: 96, offset: 800)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !779, line: 149, size: 96, elements: !862)
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !861, file: !779, line: 153, baseType: !22, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !861, file: !779, line: 162, baseType: !439, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !861, file: !779, line: 168, baseType: !439, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !778, file: !779, line: 325, baseType: !867, size: 32, offset: 896)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !359, line: 5073, size: 160, elements: !869)
!869 = !{!870, !879, !880}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !868, file: !359, line: 5074, baseType: !871, size: 96)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !872, line: 56, size: 96, elements: !873)
!872 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!873 = !{!874, !877, !878}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !871, file: !872, line: 57, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !872, line: 57, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !871, file: !872, line: 58, baseType: !104, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !871, file: !872, line: 59, baseType: !439, size: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !868, file: !359, line: 5075, baseType: !813, size: 64, offset: 96)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !868, file: !359, line: 5076, baseType: !881, offset: 160)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !778, file: !779, line: 343, baseType: !883, size: 64, offset: 928)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !846, line: 60, size: 64, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !883, file: !846, line: 63, baseType: !113, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !883, file: !846, line: 66, baseType: !113, size: 32, offset: 32)
!887 = !{!888, !889}
!888 = !DILocalVariable(name: "thread", arg: 1, scope: !773, file: !774, line: 175, type: !777)
!889 = !DILocalVariable(name: "region_num", scope: !773, file: !774, line: 200, type: !164)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, elements: !737)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !892, line: 52, size: 96, elements: !893)
!892 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !891, file: !892, line: 53, baseType: !22, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !891, file: !892, line: 54, baseType: !439, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !891, file: !892, line: 55, baseType: !897, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !898, line: 304, baseType: !899)
!898 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !898, line: 301, size: 32, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !899, file: !898, line: 302, baseType: !168, size: 16)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !899, file: !898, line: 303, baseType: !168, size: 16, offset: 16)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "static_regions", scope: !767, file: !774, line: 62, type: !905, isLocal: true, isDefinition: true)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 96, elements: !656)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !891)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !254, line: 17, baseType: !105, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !908, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !914, file: !968, line: 39, type: !164, isLocal: true, isDefinition: true)
!914 = distinct !DICompileUnit(language: DW_LANG_C99, file: !915, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !916, globals: !959, splitDebugInlining: false, nameTableKind: None)
!915 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!916 = !{!917, !104, !108, !945}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !919, line: 1495, baseType: !920)
!919 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !919, line: 1474, size: 448, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !935}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !920, file: !919, line: 1476, baseType: !565, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !920, file: !919, line: 1477, baseType: !566, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !920, file: !919, line: 1478, baseType: !566, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !920, file: !919, line: 1479, baseType: !566, size: 32, offset: 96)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !920, file: !919, line: 1480, baseType: !566, size: 32, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !920, file: !919, line: 1481, baseType: !566, size: 32, offset: 160)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !920, file: !919, line: 1482, baseType: !566, size: 32, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !920, file: !919, line: 1483, baseType: !566, size: 32, offset: 224)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !920, file: !919, line: 1484, baseType: !566, size: 32, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !920, file: !919, line: 1485, baseType: !566, size: 32, offset: 288)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !920, file: !919, line: 1486, baseType: !566, size: 32, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !920, file: !919, line: 1487, baseType: !934, size: 32, offset: 352)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 32, elements: !656)
!935 = !DIDerivedType(tag: DW_TAG_member, scope: !920, file: !919, line: 1488, baseType: !936, size: 64, offset: 384)
!936 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !920, file: !919, line: 1488, size: 64, elements: !937)
!937 = !{!938, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !936, file: !919, line: 1489, baseType: !939, size: 64)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 64, elements: !809)
!940 = !DIDerivedType(tag: DW_TAG_member, scope: !936, file: !919, line: 1490, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !936, file: !919, line: 1490, size: 64, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !941, file: !919, line: 1491, baseType: !566, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !941, file: !919, line: 1492, baseType: !566, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !948, line: 27, size: 128, elements: !949)
!948 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!949 = !{!950, !951, !952}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !947, file: !948, line: 29, baseType: !113, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !947, file: !948, line: 31, baseType: !105, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !947, file: !948, line: 37, baseType: !953, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !898, line: 298, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !898, line: 289, size: 64, elements: !955)
!955 = !{!956, !957, !958}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !954, file: !898, line: 291, baseType: !164, size: 5, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !954, file: !898, line: 293, baseType: !164, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !954, file: !898, line: 295, baseType: !113, size: 32, offset: 32)
!959 = !{!912, !960}
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !914, file: !962, line: 31, type: !963, isLocal: true, isDefinition: true)
!962 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 160, elements: !656)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !962, line: 21, size: 160, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !964, file: !962, line: 22, baseType: !108, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !964, file: !962, line: 23, baseType: !947, size: 128, offset: 32)
!968 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !971, file: !978, line: 21, type: !539, isLocal: true, isDefinition: true)
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !973, globals: !977, splitDebugInlining: false, nameTableKind: None)
!972 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!973 = !{!974, !108, !104}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !976, line: 22, baseType: !108)
!976 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!977 = !{!969}
!978 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !981, file: !986, line: 13, type: !1005, isLocal: true, isDefinition: true)
!981 = distinct !DICompileUnit(language: DW_LANG_C99, file: !982, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !983, splitDebugInlining: false, nameTableKind: None)
!982 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!983 = !{!984, !979}
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "mpu_config", scope: !981, file: !986, line: 37, type: !987, isLocal: false, isDefinition: true)
!986 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !948, line: 41, size: 64, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !988, file: !948, line: 43, baseType: !113, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !988, file: !948, line: 45, baseType: !992, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !948, line: 27, size: 128, elements: !995)
!995 = !{!996, !997, !998}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !994, file: !948, line: 29, baseType: !113, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !994, file: !948, line: 31, baseType: !105, size: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !994, file: !948, line: 37, baseType: !999, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !898, line: 298, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !898, line: 289, size: 64, elements: !1001)
!1001 = !{!1002, !1003, !1004}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !1000, file: !898, line: 291, baseType: !164, size: 5, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !1000, file: !898, line: 293, baseType: !164, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !1000, file: !898, line: 295, baseType: !113, size: 32, offset: 32)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 256, elements: !809)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "log_const_board_control", scope: !1008, file: !1106, line: 12, type: !1115, isLocal: false, isDefinition: true)
!1008 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1009, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1010, retainedTypes: !1022, globals: !1103, splitDebugInlining: false, nameTableKind: None)
!1009 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/rtio/sensor_batch_processing")
!1010 = !{!1011, !1017}
