; ModuleID = 'build/96b_aerocore2/work_queue/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.zbus_observer = type { i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type { i32 }
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 103, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5824, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 91)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2912, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !27, file: !106, line: 16, type: !288, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !329, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/work_queue/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !313, !325, !190, !327}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_wq_info", file: !106, line: 68, size: 192, elements: !107)
!106 = !DIFile(filename: "zephyr/samples/subsys/zbus/work_queue/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!107 = !{!108, !269, !324}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !105, file: !106, line: 69, baseType: !109, size: 128)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !110, line: 3663, size: 128, elements: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112, !119, !125, !268}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !109, file: !110, line: 3669, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !114, line: 33, baseType: !115)
!114 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !114, line: 29, size: 32, elements: !116)
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !114, line: 30, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !109, file: !110, line: 3672, baseType: !120, size: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !110, line: 3071, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !109, file: !110, line: 3675, baseType: !126, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !110, line: 3810, size: 1536, elements: !128)
!128 = !{!129, !258, !265, !266, !267}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !127, file: !110, line: 3812, baseType: !130, size: 1280)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !131, line: 245, size: 1280, elements: !132)
!131 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!132 = !{!133, !205, !218, !219, !220, !225, !226, !234, !253}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !130, file: !131, line: 247, baseType: !134, size: 384)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !131, line: 57, size: 384, elements: !135)
!135 = !{!136, !164, !172, !175, !176, !189, !191, !192}
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !131, line: 60, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !131, line: 60, size: 64, elements: !138)
!138 = !{!139, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !137, file: !131, line: 61, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !141, line: 49, baseType: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !141, line: 37, size: 64, elements: !143)
!143 = !{!144, !150}
!144 = !DIDerivedType(tag: DW_TAG_member, scope: !142, file: !141, line: 38, baseType: !145, size: 32)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !141, line: 38, size: 32, elements: !146)
!146 = !{!147, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !145, file: !141, line: 39, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !141, line: 40, baseType: !148, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, scope: !142, file: !141, line: 42, baseType: !151, size: 32, offset: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !141, line: 42, size: 32, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !151, file: !141, line: 43, baseType: !148, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !151, file: !141, line: 44, baseType: !148, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !137, file: !131, line: 62, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !156, file: !157, line: 50, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!162 = !{!163}
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !134, file: !131, line: 68, baseType: !165, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !167, line: 233, baseType: !168)
!167 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 231, size: 64, elements: !169)
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !168, file: !167, line: 232, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !141, line: 48, baseType: !142)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !134, file: !131, line: 71, baseType: !173, size: 8, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !174)
!174 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !134, file: !131, line: 74, baseType: !173, size: 8, offset: 104)
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !131, line: 90, baseType: !177, size: 16, offset: 112)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !131, line: 90, size: 16, elements: !178)
!178 = !{!179, !186}
!179 = !DIDerivedType(tag: DW_TAG_member, scope: !177, file: !131, line: 91, baseType: !180, size: 16)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !131, line: 91, size: 16, elements: !181)
!181 = !{!182, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !180, file: !131, line: 96, baseType: !183, size: 8)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !184)
!184 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !180, file: !131, line: 97, baseType: !173, size: 8, offset: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !177, file: !131, line: 100, baseType: !187, size: 16)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !188)
!188 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !134, file: !131, line: 107, baseType: !190, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !134, file: !131, line: 127, baseType: !102, size: 32, offset: 160)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !134, file: !131, line: 131, baseType: !193, size: 192, offset: 192)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !167, line: 244, size: 192, elements: !194)
!194 = !{!195, !196, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !193, file: !167, line: 245, baseType: !140, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !193, file: !167, line: 246, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !167, line: 242, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !193, file: !167, line: 249, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !204)
!204 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !130, file: !131, line: 250, baseType: !206, size: 288, offset: 384)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !207, line: 25, size: 288, elements: !208)
!207 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !206, file: !207, line: 26, baseType: !190, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !206, file: !207, line: 27, baseType: !190, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !206, file: !207, line: 28, baseType: !190, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !206, file: !207, line: 29, baseType: !190, size: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !206, file: !207, line: 30, baseType: !190, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !206, file: !207, line: 31, baseType: !190, size: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !206, file: !207, line: 32, baseType: !190, size: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !206, file: !207, line: 33, baseType: !190, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !206, file: !207, line: 34, baseType: !190, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !130, file: !131, line: 253, baseType: !102, size: 32, offset: 672)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !130, file: !131, line: 256, baseType: !166, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !131, line: 279, baseType: !221, size: 256, offset: 768)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 256, elements: !223)
!222 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!223 = !{!224}
!224 = !DISubrange(count: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !130, file: !131, line: 294, baseType: !103, size: 32, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !130, file: !131, line: 300, baseType: !227, size: 96, offset: 1056)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !131, line: 149, size: 96, elements: !228)
!228 = !{!229, !230, !233}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !227, file: !131, line: 153, baseType: !22, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !227, file: !131, line: 162, baseType: !231, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !232, line: 214, baseType: !32)
!232 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !227, file: !131, line: 168, baseType: !231, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !130, file: !131, line: 325, baseType: !235, size: 32, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !110, line: 5073, size: 192, elements: !237)
!237 = !{!238, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !236, file: !110, line: 5074, baseType: !239, size: 96)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !240, line: 57, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !240, line: 57, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !239, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !239, file: !240, line: 59, baseType: !231, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !236, file: !110, line: 5075, baseType: !166, size: 64, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !236, file: !110, line: 5076, baseType: !249, size: 32, offset: 160)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, size: 32, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !249, file: !250, line: 52, baseType: !22, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !130, file: !131, line: 343, baseType: !254, size: 64, offset: 1184)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !207, line: 60, size: 64, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !254, file: !207, line: 63, baseType: !190, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !254, file: !207, line: 66, baseType: !190, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !127, file: !110, line: 3819, baseType: !259, size: 64, offset: 1280)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !114, line: 40, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !114, line: 35, size: 64, elements: !261)
!261 = !{!262, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !260, file: !114, line: 36, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !260, file: !114, line: 37, baseType: !263, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !127, file: !110, line: 3822, baseType: !166, size: 64, offset: 1344)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !127, file: !110, line: 3825, baseType: !166, size: 64, offset: 1408)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !127, file: !110, line: 3828, baseType: !190, size: 32, offset: 1472)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !109, file: !110, line: 3683, baseType: !190, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !105, file: !106, line: 70, baseType: !270, size: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !273, line: 29, size: 192, elements: !274)
!273 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !{!275, !277, !279, !280, !286, !295}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !272, file: !273, line: 35, baseType: !276, size: 16)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !272, file: !273, line: 40, baseType: !278, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !272, file: !273, line: 45, baseType: !278, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !272, file: !273, line: 51, baseType: !281, size: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !13, !231}
!285 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !272, file: !273, line: 56, baseType: !287, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !110, line: 2720, size: 160, elements: !289)
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !288, file: !110, line: 2722, baseType: !166, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !288, file: !110, line: 2724, baseType: !292, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !288, file: !110, line: 2727, baseType: !190, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !288, file: !110, line: 2730, baseType: !103, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !272, file: !273, line: 67, baseType: !296, size: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !273, line: 85, size: 96, elements: !301)
!301 = !{!302, !303, !319}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !300, file: !273, line: 91, baseType: !285, size: 8)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !300, file: !273, line: 93, baseType: !304, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !110, line: 4204, size: 352, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !314, !315, !316, !317, !318}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !306, file: !110, line: 4206, baseType: !166, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !110, line: 4208, baseType: !249, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !306, file: !110, line: 4210, baseType: !231, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !306, file: !110, line: 4212, baseType: !190, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !306, file: !110, line: 4214, baseType: !313, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !306, file: !110, line: 4216, baseType: !313, size: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !306, file: !110, line: 4218, baseType: !313, size: 32, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !306, file: !110, line: 4220, baseType: !313, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !306, file: !110, line: 4222, baseType: !190, size: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !306, file: !110, line: 4227, baseType: !173, size: 8, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !300, file: !273, line: 96, baseType: !320, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !270}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !105, file: !106, line: 71, baseType: !173, size: 8, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !326, line: 46, baseType: !203)
!326 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !328)
!328 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!329 = !{!25, !330, !332, !334, !336, !338, !340, !342, !344, !346, !348, !350, !352, !385, !389, !391, !393, !395, !397, !399, !401, !403, !405, !410, !415, !417, !419, !421, !423, !425, !427, !429, !437, !442, !449, !454, !456, !458}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "version_chan", scope: !27, file: !106, line: 16, type: !271, isLocal: false, isDefinition: true, align: 32)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "_zbus_mutex_sensor_data_chan", scope: !27, file: !106, line: 26, type: !288, isLocal: true, isDefinition: true, align: 32)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "sensor_data_chan", scope: !27, file: !106, line: 26, type: !271, isLocal: false, isDefinition: true, align: 32)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "fast_handler1_lis", scope: !27, file: !106, line: 46, type: !300, isLocal: false, isDefinition: true, align: 32)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "fast_handler2_lis", scope: !27, file: !106, line: 56, type: !300, isLocal: false, isDefinition: true, align: 32)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "fast_handler3_lis", scope: !27, file: !106, line: 66, type: !300, isLocal: false, isDefinition: true, align: 32)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "delay_handler1_lis", scope: !27, file: !106, line: 97, type: !300, isLocal: false, isDefinition: true, align: 32)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "delay_handler2_lis", scope: !27, file: !106, line: 106, type: !300, isLocal: false, isDefinition: true, align: 32)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "delay_handler3_lis", scope: !27, file: !106, line: 115, type: !300, isLocal: false, isDefinition: true, align: 32)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_thread_handler1_sub", scope: !27, file: !106, line: 128, type: !306, isLocal: false, isDefinition: true, align: 32)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "thread_handler1_sub", scope: !27, file: !106, line: 128, type: !300, isLocal: false, isDefinition: true, align: 32)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_handler1_id", scope: !27, file: !106, line: 145, type: !354, isLocal: false, isDefinition: true, align: 32)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !110, line: 620, size: 384, elements: !355)
!355 = !{!356, !357, !365, !366, !371, !372, !373, !374, !375, !376, !378, !382}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !354, file: !110, line: 621, baseType: !292, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !354, file: !110, line: 622, baseType: !358, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !360, line: 44, baseType: !361)
!360 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !362, line: 47, size: 8, elements: !363)
!362 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !361, file: !362, line: 48, baseType: !222, size: 8)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !354, file: !110, line: 623, baseType: !32, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !354, file: !110, line: 624, baseType: !367, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !360, line: 46, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !102, !102, !102}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !354, file: !110, line: 625, baseType: !102, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !354, file: !110, line: 626, baseType: !102, size: 32, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !354, file: !110, line: 627, baseType: !102, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !354, file: !110, line: 628, baseType: !103, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !354, file: !110, line: 629, baseType: !190, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !354, file: !110, line: 630, baseType: !377, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !354, file: !110, line: 631, baseType: !379, size: 32, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = !DISubroutineType(types: !381)
!381 = !{null}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !354, file: !110, line: 632, baseType: !383, size: 32, offset: 352)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "thread_handler1_id", scope: !27, file: !106, line: 145, type: !387, isLocal: false, isDefinition: true)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !131, line: 347, baseType: !292)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_thread_handler2_sub", scope: !27, file: !106, line: 147, type: !306, isLocal: false, isDefinition: true, align: 32)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "thread_handler2_sub", scope: !27, file: !106, line: 147, type: !300, isLocal: false, isDefinition: true, align: 32)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_handler2_id", scope: !27, file: !106, line: 164, type: !354, isLocal: false, isDefinition: true, align: 32)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "thread_handler2_id", scope: !27, file: !106, line: 164, type: !387, isLocal: false, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_thread_handler3_sub", scope: !27, file: !106, line: 166, type: !306, isLocal: false, isDefinition: true, align: 32)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "thread_handler3_sub", scope: !27, file: !106, line: 166, type: !300, isLocal: false, isDefinition: true, align: 32)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_handler3_id", scope: !27, file: !106, line: 183, type: !354, isLocal: false, isDefinition: true, align: 32)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "thread_handler3_id", scope: !27, file: !106, line: 183, type: !387, isLocal: false, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_thread_handler1_sub", scope: !27, file: !106, line: 128, type: !407, isLocal: true, isDefinition: true, align: 32)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 128, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 16)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_handler1_id", scope: !27, file: !106, line: 145, type: !412, isLocal: false, isDefinition: true, align: 512)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 8704, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 1088)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_handler1_id", scope: !27, file: !106, line: 145, type: !130, isLocal: false, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_thread_handler2_sub", scope: !27, file: !106, line: 147, type: !407, isLocal: true, isDefinition: true, align: 32)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_handler2_id", scope: !27, file: !106, line: 164, type: !412, isLocal: false, isDefinition: true, align: 512)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_handler2_id", scope: !27, file: !106, line: 164, type: !130, isLocal: false, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_thread_handler3_sub", scope: !27, file: !106, line: 166, type: !407, isLocal: true, isDefinition: true, align: 32)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_handler3_id", scope: !27, file: !106, line: 183, type: !412, isLocal: false, isDefinition: true, align: 512)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_handler3_id", scope: !27, file: !106, line: 183, type: !130, isLocal: false, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !27, file: !106, line: 16, type: !431, isLocal: true, isDefinition: true)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !432, line: 9, size: 32, elements: !433)
!432 = !DIFile(filename: "zephyr/samples/subsys/zbus/work_queue/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !431, file: !432, line: 10, baseType: !173, size: 8)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !431, file: !432, line: 11, baseType: !173, size: 8, offset: 8)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !431, file: !432, line: 12, baseType: !187, size: 16, offset: 16)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !27, file: !106, line: 16, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 32, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 1)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "_zbus_message_sensor_data_chan", scope: !27, file: !106, line: 26, type: !444, isLocal: true, isDefinition: true)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_msg", file: !432, line: 15, size: 96, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !444, file: !432, line: 16, baseType: !190, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "press", scope: !444, file: !432, line: 17, baseType: !190, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "humidity", scope: !444, file: !432, line: 18, baseType: !190, size: 32, offset: 64)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "_zbus_observers_sensor_data_chan", scope: !27, file: !106, line: 26, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 320, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 10)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "wq_handler1", scope: !27, file: !106, line: 74, type: !105, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "wq_handler2", scope: !27, file: !106, line: 75, type: !105, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "wq_handler3", scope: !27, file: !106, line: 76, type: !105, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "_k_thread_obj_peripheral_thread_id", scope: !462, file: !468, line: 30, type: !473, isLocal: false, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !464, globals: !465, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/work_queue/src/sensors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!464 = !{!325, !102, !103, !190, !327}
!465 = !{!466, !591, !595, !460}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "_k_thread_data_peripheral_thread_id", scope: !462, file: !468, line: 30, type: !469, isLocal: false, isDefinition: true, align: 32)
!468 = !DIFile(filename: "zephyr/samples/subsys/zbus/work_queue/src/sensors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !110, line: 620, size: 384, elements: !470)
!470 = !{!471, !575, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !469, file: !110, line: 621, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !131, line: 245, size: 1280, elements: !474)
!474 = !{!475, !533, !545, !546, !547, !548, !549, !555, !570}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !473, file: !131, line: 247, baseType: !476, size: 384)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !131, line: 57, size: 384, elements: !477)
!477 = !{!478, !502, !509, !510, !511, !520, !521, !522}
!478 = !DIDerivedType(tag: DW_TAG_member, scope: !476, file: !131, line: 60, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !476, file: !131, line: 60, size: 64, elements: !480)
!480 = !{!481, !496}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !479, file: !131, line: 61, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !141, line: 49, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !141, line: 37, size: 64, elements: !484)
!484 = !{!485, !491}
!485 = !DIDerivedType(tag: DW_TAG_member, scope: !483, file: !141, line: 38, baseType: !486, size: 32)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !483, file: !141, line: 38, size: 32, elements: !487)
!487 = !{!488, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !486, file: !141, line: 39, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !486, file: !141, line: 40, baseType: !489, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, scope: !483, file: !141, line: 42, baseType: !492, size: 32, offset: 32)
!492 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !483, file: !141, line: 42, size: 32, elements: !493)
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !492, file: !141, line: 43, baseType: !489, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !492, file: !141, line: 44, baseType: !489, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !479, file: !131, line: 62, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !497, file: !157, line: 50, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 64, elements: !162)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !476, file: !131, line: 68, baseType: !503, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !167, line: 233, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 231, size: 64, elements: !506)
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !505, file: !167, line: 232, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !141, line: 48, baseType: !483)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !476, file: !131, line: 71, baseType: !173, size: 8, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !476, file: !131, line: 74, baseType: !173, size: 8, offset: 104)
!511 = !DIDerivedType(tag: DW_TAG_member, scope: !476, file: !131, line: 90, baseType: !512, size: 16, offset: 112)
!512 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !476, file: !131, line: 90, size: 16, elements: !513)
!513 = !{!514, !519}
!514 = !DIDerivedType(tag: DW_TAG_member, scope: !512, file: !131, line: 91, baseType: !515, size: 16)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !512, file: !131, line: 91, size: 16, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !515, file: !131, line: 96, baseType: !183, size: 8)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !515, file: !131, line: 97, baseType: !173, size: 8, offset: 8)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !512, file: !131, line: 100, baseType: !187, size: 16)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !476, file: !131, line: 107, baseType: !190, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !476, file: !131, line: 127, baseType: !102, size: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !476, file: !131, line: 131, baseType: !523, size: 192, offset: 192)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !167, line: 244, size: 192, elements: !524)
!524 = !{!525, !526, !532}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !523, file: !167, line: 245, baseType: !482, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !523, file: !167, line: 246, baseType: !527, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !167, line: 242, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !531}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !523, file: !167, line: 249, baseType: !203, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !473, file: !131, line: 250, baseType: !534, size: 288, offset: 384)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !207, line: 25, size: 288, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !534, file: !207, line: 26, baseType: !190, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !534, file: !207, line: 27, baseType: !190, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !534, file: !207, line: 28, baseType: !190, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !534, file: !207, line: 29, baseType: !190, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !534, file: !207, line: 30, baseType: !190, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !534, file: !207, line: 31, baseType: !190, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !534, file: !207, line: 32, baseType: !190, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !534, file: !207, line: 33, baseType: !190, size: 32, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !534, file: !207, line: 34, baseType: !190, size: 32, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !473, file: !131, line: 253, baseType: !102, size: 32, offset: 672)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !473, file: !131, line: 256, baseType: !504, size: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !473, file: !131, line: 279, baseType: !221, size: 256, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !473, file: !131, line: 294, baseType: !103, size: 32, offset: 1024)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !473, file: !131, line: 300, baseType: !550, size: 96, offset: 1056)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !131, line: 149, size: 96, elements: !551)
!551 = !{!552, !553, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !550, file: !131, line: 153, baseType: !22, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !550, file: !131, line: 162, baseType: !231, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !550, file: !131, line: 168, baseType: !231, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !473, file: !131, line: 325, baseType: !556, size: 32, offset: 1152)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !110, line: 5073, size: 192, elements: !558)
!558 = !{!559, !565, !566}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !557, file: !110, line: 5074, baseType: !560, size: 96)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !560, file: !240, line: 57, baseType: !243, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !560, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !560, file: !240, line: 59, baseType: !231, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !557, file: !110, line: 5075, baseType: !504, size: 64, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !557, file: !110, line: 5076, baseType: !567, size: 32, offset: 160)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, size: 32, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !567, file: !250, line: 52, baseType: !22, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !473, file: !131, line: 343, baseType: !571, size: 64, offset: 1184)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !207, line: 60, size: 64, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !571, file: !207, line: 63, baseType: !190, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !571, file: !207, line: 66, baseType: !190, size: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !469, file: !110, line: 622, baseType: !576, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !360, line: 44, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !362, line: 47, size: 8, elements: !579)
!579 = !{!580}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !578, file: !362, line: 48, baseType: !222, size: 8)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !469, file: !110, line: 623, baseType: !32, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !469, file: !110, line: 624, baseType: !367, size: 32, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !469, file: !110, line: 625, baseType: !102, size: 32, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !469, file: !110, line: 626, baseType: !102, size: 32, offset: 160)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !469, file: !110, line: 627, baseType: !102, size: 32, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !469, file: !110, line: 628, baseType: !103, size: 32, offset: 224)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !469, file: !110, line: 629, baseType: !190, size: 32, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !469, file: !110, line: 630, baseType: !377, size: 32, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !469, file: !110, line: 631, baseType: !379, size: 32, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !469, file: !110, line: 632, baseType: !383, size: 32, offset: 352)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "peripheral_thread_id", scope: !462, file: !468, line: 30, type: !593, isLocal: false, isDefinition: true)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !131, line: 347, baseType: !472)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "_k_thread_stack_peripheral_thread_id", scope: !462, file: !468, line: 30, type: !597, isLocal: false, isDefinition: true, align: 512)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 8704, elements: !413)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !600, file: !615, line: 18, type: !616, isLocal: false, isDefinition: true)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !602, globals: !614, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!602 = !{!22, !102, !24, !603, !605, !607, !231, !103, !608, !609, !611, !612, !313, !613, !187, !383}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!614 = !{!598}
!615 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !618, line: 16, size: 64, elements: !619)
!618 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !617, file: !618, line: 17, baseType: !383, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !617, file: !618, line: 18, baseType: !173, size: 8, offset: 32)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "_char_out", scope: !624, file: !628, line: 54, type: !629, isLocal: false, isDefinition: true)
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !626, globals: !627, splitDebugInlining: false, nameTableKind: None)
!625 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!626 = !{!102, !103}
!627 = !{!622}
!628 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DISubroutineType(types: !631)
!631 = !{!103, !103}
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !634, file: !651, line: 56, type: !652, isLocal: true, isDefinition: true, align: 32)
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !636, globals: !650, splitDebugInlining: false, nameTableKind: None)
!635 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !639, line: 501, baseType: !640)
!639 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f427xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 492, size: 224, elements: !641)
!641 = !{!642, !644, !645, !646, !647, !648, !649}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !640, file: !639, line: 494, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !190)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !640, file: !639, line: 495, baseType: !643, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !640, file: !639, line: 496, baseType: !643, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !640, file: !639, line: 497, baseType: !643, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !640, file: !639, line: 498, baseType: !643, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !640, file: !639, line: 499, baseType: !643, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !640, file: !639, line: 500, baseType: !643, size: 32, offset: 192)
!650 = !{!632}
!651 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !654, line: 51, size: 64, elements: !655)
!654 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!655 = !{!656, !681}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !653, file: !654, line: 60, baseType: !657, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DISubroutineType(types: !659)
!659 = !{!103, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !663, line: 378, size: 192, elements: !664)
!663 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!664 = !{!665, !666, !667, !668, !674, !675}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !662, file: !663, line: 380, baseType: !383, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !662, file: !663, line: 382, baseType: !13, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !662, file: !663, line: 384, baseType: !13, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !662, file: !663, line: 386, baseType: !669, size: 32, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !663, line: 351, size: 16, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !670, file: !663, line: 359, baseType: !173, size: 8)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !670, file: !663, line: 364, baseType: !285, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !662, file: !663, line: 388, baseType: !102, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !662, file: !663, line: 396, baseType: !676, size: 32, offset: 160)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !663, line: 43, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !680)
!680 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !653, file: !654, line: 65, baseType: !660, size: 32, offset: 32)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !684, file: !687, line: 71, type: !688, isLocal: true, isDefinition: true, align: 32)
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !686, splitDebugInlining: false, nameTableKind: None)
!685 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!686 = !{!682}
!687 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !654, line: 51, size: 64, elements: !690)
!690 = !{!691, !710}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !689, file: !654, line: 60, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DISubroutineType(types: !694)
!694 = !{!103, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !663, line: 378, size: 192, elements: !698)
!698 = !{!699, !700, !701, !702, !708, !709}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !697, file: !663, line: 380, baseType: !383, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !697, file: !663, line: 382, baseType: !13, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !697, file: !663, line: 384, baseType: !13, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !697, file: !663, line: 386, baseType: !703, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !663, line: 351, size: 16, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !704, file: !663, line: 359, baseType: !173, size: 8)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !704, file: !663, line: 364, baseType: !285, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !663, line: 388, baseType: !102, size: 32, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !697, file: !663, line: 396, baseType: !676, size: 32, offset: 160)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !689, file: !654, line: 65, baseType: !695, size: 32, offset: 32)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !713, file: !720, line: 17, type: !847, isLocal: false, isDefinition: true)
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !715, globals: !716, splitDebugInlining: false, nameTableKind: None)
!714 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!715 = !{!231, !103, !190, !102}
!716 = !{!711, !717, !843}
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !719, file: !720, line: 198, type: !831, isLocal: true, isDefinition: true)
!719 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !720, file: !720, line: 175, type: !721, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !713, retainedNodes: !826)
!720 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!721 = !DISubroutineType(types: !722)
!722 = !{null, !723}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !131, line: 245, size: 1280, elements: !725)
!725 = !{!726, !784, !796, !797, !798, !799, !800, !806, !821}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !724, file: !131, line: 247, baseType: !727, size: 384)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !131, line: 57, size: 384, elements: !728)
!728 = !{!729, !753, !760, !761, !762, !771, !772, !773}
!729 = !DIDerivedType(tag: DW_TAG_member, scope: !727, file: !131, line: 60, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !727, file: !131, line: 60, size: 64, elements: !731)
!731 = !{!732, !747}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !730, file: !131, line: 61, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !141, line: 49, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !141, line: 37, size: 64, elements: !735)
!735 = !{!736, !742}
!736 = !DIDerivedType(tag: DW_TAG_member, scope: !734, file: !141, line: 38, baseType: !737, size: 32)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !734, file: !141, line: 38, size: 32, elements: !738)
!738 = !{!739, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !737, file: !141, line: 39, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !737, file: !141, line: 40, baseType: !740, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, scope: !734, file: !141, line: 42, baseType: !743, size: 32, offset: 32)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !734, file: !141, line: 42, size: 32, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !743, file: !141, line: 43, baseType: !740, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !743, file: !141, line: 44, baseType: !740, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !730, file: !131, line: 62, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !749)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !748, file: !157, line: 50, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 64, elements: !162)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !727, file: !131, line: 68, baseType: !754, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !167, line: 233, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 231, size: 64, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !756, file: !167, line: 232, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !141, line: 48, baseType: !734)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !727, file: !131, line: 71, baseType: !173, size: 8, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !727, file: !131, line: 74, baseType: !173, size: 8, offset: 104)
!762 = !DIDerivedType(tag: DW_TAG_member, scope: !727, file: !131, line: 90, baseType: !763, size: 16, offset: 112)
!763 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !727, file: !131, line: 90, size: 16, elements: !764)
!764 = !{!765, !770}
!765 = !DIDerivedType(tag: DW_TAG_member, scope: !763, file: !131, line: 91, baseType: !766, size: 16)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !763, file: !131, line: 91, size: 16, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !766, file: !131, line: 96, baseType: !183, size: 8)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !766, file: !131, line: 97, baseType: !173, size: 8, offset: 8)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !763, file: !131, line: 100, baseType: !187, size: 16)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !727, file: !131, line: 107, baseType: !190, size: 32, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !727, file: !131, line: 127, baseType: !102, size: 32, offset: 160)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !727, file: !131, line: 131, baseType: !774, size: 192, offset: 192)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !167, line: 244, size: 192, elements: !775)
!775 = !{!776, !777, !783}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !774, file: !167, line: 245, baseType: !733, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !774, file: !167, line: 246, baseType: !778, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !167, line: 242, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !782}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !774, file: !167, line: 249, baseType: !203, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !724, file: !131, line: 250, baseType: !785, size: 288, offset: 384)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !207, line: 25, size: 288, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !785, file: !207, line: 26, baseType: !190, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !785, file: !207, line: 27, baseType: !190, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !785, file: !207, line: 28, baseType: !190, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !785, file: !207, line: 29, baseType: !190, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !785, file: !207, line: 30, baseType: !190, size: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !785, file: !207, line: 31, baseType: !190, size: 32, offset: 160)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !785, file: !207, line: 32, baseType: !190, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !785, file: !207, line: 33, baseType: !190, size: 32, offset: 224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !785, file: !207, line: 34, baseType: !190, size: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !724, file: !131, line: 253, baseType: !102, size: 32, offset: 672)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !724, file: !131, line: 256, baseType: !755, size: 64, offset: 704)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !724, file: !131, line: 279, baseType: !221, size: 256, offset: 768)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !724, file: !131, line: 294, baseType: !103, size: 32, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !724, file: !131, line: 300, baseType: !801, size: 96, offset: 1056)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !131, line: 149, size: 96, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !801, file: !131, line: 153, baseType: !22, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !801, file: !131, line: 162, baseType: !231, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !801, file: !131, line: 168, baseType: !231, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !724, file: !131, line: 325, baseType: !807, size: 32, offset: 1152)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !110, line: 5073, size: 192, elements: !809)
!809 = !{!810, !816, !817}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !808, file: !110, line: 5074, baseType: !811, size: 96)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !811, file: !240, line: 57, baseType: !243, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !811, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !811, file: !240, line: 59, baseType: !231, size: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !808, file: !110, line: 5075, baseType: !755, size: 64, offset: 96)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !808, file: !110, line: 5076, baseType: !818, size: 32, offset: 160)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, size: 32, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !818, file: !250, line: 52, baseType: !22, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !724, file: !131, line: 343, baseType: !822, size: 64, offset: 1184)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !207, line: 60, size: 64, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !822, file: !207, line: 63, baseType: !190, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !822, file: !207, line: 66, baseType: !190, size: 32, offset: 32)
!826 = !{!827, !828, !829, !830}
!827 = !DILocalVariable(name: "thread", arg: 1, scope: !719, file: !720, line: 175, type: !723)
!828 = !DILocalVariable(name: "region_num", scope: !719, file: !720, line: 200, type: !173)
!829 = !DILocalVariable(name: "guard_start", scope: !719, file: !720, line: 265, type: !22)
!830 = !DILocalVariable(name: "guard_size", scope: !719, file: !720, line: 266, type: !231)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 96, elements: !440)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !833, line: 52, size: 96, elements: !834)
!833 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!834 = !{!835, !836, !837}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !832, file: !833, line: 53, baseType: !22, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !832, file: !833, line: 54, baseType: !231, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !832, file: !833, line: 55, baseType: !838, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !839, line: 151, baseType: !840)
!839 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !839, line: 149, size: 32, elements: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !840, file: !839, line: 150, baseType: !190, size: 32)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "static_regions", scope: !713, file: !720, line: 62, type: !845, isLocal: true, isDefinition: true)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 96, elements: !440)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !618, line: 16, size: 64, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !848, file: !618, line: 17, baseType: !383, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !848, file: !618, line: 18, baseType: !173, size: 8, offset: 32)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !854, file: !887, line: 39, type: !173, isLocal: true, isDefinition: true)
!854 = distinct !DICompileUnit(language: DW_LANG_C99, file: !855, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !856, globals: !886, splitDebugInlining: false, nameTableKind: None)
!855 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!856 = !{!857, !102, !103, !874, !173}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !859, line: 1226, baseType: !860)
!859 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !859, line: 1213, size: 352, elements: !861)
!861 = !{!862, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !860, file: !859, line: 1215, baseType: !863, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !860, file: !859, line: 1216, baseType: !643, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !860, file: !859, line: 1217, baseType: !643, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !860, file: !859, line: 1218, baseType: !643, size: 32, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !860, file: !859, line: 1219, baseType: !643, size: 32, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !860, file: !859, line: 1220, baseType: !643, size: 32, offset: 160)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !860, file: !859, line: 1221, baseType: !643, size: 32, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !860, file: !859, line: 1222, baseType: !643, size: 32, offset: 224)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !860, file: !859, line: 1223, baseType: !643, size: 32, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !860, file: !859, line: 1224, baseType: !643, size: 32, offset: 288)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !860, file: !859, line: 1225, baseType: !643, size: 32, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !877, line: 27, size: 96, elements: !878)
!877 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!878 = !{!879, !880, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !876, file: !877, line: 29, baseType: !190, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !876, file: !877, line: 31, baseType: !383, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !876, file: !877, line: 37, baseType: !882, size: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !839, line: 146, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !839, line: 141, size: 32, elements: !884)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !883, file: !839, line: 143, baseType: !190, size: 32)
!886 = !{!852}
!887 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !890, file: !897, line: 21, type: !629, isLocal: true, isDefinition: true)
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !892, globals: !896, splitDebugInlining: false, nameTableKind: None)
!891 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!892 = !{!893, !103, !102}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !895, line: 22, baseType: !103)
!895 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!896 = !{!888}
!897 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !900, file: !905, line: 13, type: !922, isLocal: true, isDefinition: true)
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !902, splitDebugInlining: false, nameTableKind: None)
!901 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!902 = !{!903, !898}
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "mpu_config", scope: !900, file: !905, line: 37, type: !906, isLocal: false, isDefinition: true)
!905 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !877, line: 41, size: 64, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !907, file: !877, line: 43, baseType: !190, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !907, file: !877, line: 45, baseType: !911, size: 32, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !877, line: 27, size: 96, elements: !914)
!914 = !{!915, !916, !917}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !913, file: !877, line: 29, baseType: !190, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !913, file: !877, line: 31, baseType: !383, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !913, file: !877, line: 37, baseType: !918, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !839, line: 146, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !839, line: 141, size: 32, elements: !920)
!920 = !{!921}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !919, file: !839, line: 143, baseType: !190, size: 32)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 192, elements: !162)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !925, file: !929, line: 10, type: !930, isLocal: false, isDefinition: true)
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !927, globals: !928, splitDebugInlining: false, nameTableKind: None)
!926 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!927 = !{!325, !102, !103}
!928 = !{!923}
!929 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !618, line: 16, size: 64, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !618, line: 17, baseType: !383, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !931, file: !618, line: 18, baseType: !173, size: 8, offset: 32)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !937, file: !1052, line: 72, type: !1135, isLocal: true, isDefinition: true)
!937 = distinct !DICompileUnit(language: DW_LANG_C99, file: !938, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !939, retainedTypes: !1038, globals: !1049, splitDebugInlining: false, nameTableKind: None)
!938 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/work_queue")
!939 = !{!30, !940}
!940 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !639, line: 65, baseType: !103, size: 32, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037}
!942 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!943 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!944 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!945 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!946 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!947 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!948 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!949 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!950 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!951 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!952 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!953 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!954 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!955 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!956 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!957 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!958 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!959 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!960 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!961 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!962 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!963 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!964 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!965 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!966 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!967 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!968 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!969 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!970 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!971 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!972 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!973 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!974 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!975 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!976 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!977 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!978 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!979 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!980 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!981 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!982 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!983 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!984 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!985 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!986 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!987 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!988 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!989 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!990 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!991 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!992 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!993 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!994 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!995 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!996 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!997 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!998 = !DIEnumerator(name: "FMC_IRQn", value: 48)
!999 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!1000 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
