; ModuleID = 'build/adafruit_feather_nrf52840/boards/stm32/backup_sram/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "backup_value", scope: !27, file: !105, line: 11, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/boards/stm32/backup_sram/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/samples/boards/stm32/backup_sram/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "_char_out", scope: !109, file: !112, line: 54, type: !113, isLocal: false, isDefinition: true)
!109 = distinct !DICompileUnit(language: DW_LANG_C99, file: !110, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!110 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!111 = !{!107}
!112 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DISubroutineType(types: !115)
!115 = !{!103, !103}
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !118, file: !160, line: 27, type: !189, isLocal: true, isDefinition: true)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !119, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !132, globals: !157, splitDebugInlining: false, nameTableKind: None)
!119 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!120 = !{!121, !30}
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !122, line: 27, baseType: !32, size: 32, elements: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131}
!124 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!125 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!126 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!127 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!128 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!129 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!130 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!131 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!132 = !{!102, !133, !103, !24, !137, !153, !106, !155}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !134, line: 46, baseType: !135)
!134 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !136)
!136 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !139, line: 54, size: 96, elements: !140)
!139 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!140 = !{!141, !148, !152}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !138, file: !139, line: 55, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !143, line: 33, baseType: !144)
!143 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !143, line: 29, size: 32, elements: !145)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !144, file: !143, line: 30, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !138, file: !139, line: 60, baseType: !149, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !121}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !138, file: !139, line: 65, baseType: !149, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !156)
!156 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!157 = !{!116, !158, !164, !166, !179, !181}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !118, file: !160, line: 44, type: !161, isLocal: true, isDefinition: true)
!160 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !162, line: 43, elements: !163)
!162 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!163 = !{}
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !118, file: !160, line: 49, type: !161, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !118, file: !160, line: 36, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 128, elements: !177)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !122, line: 114, size: 128, elements: !170)
!170 = !{!171, !172, !175, !176}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !169, file: !122, line: 115, baseType: !121, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !169, file: !122, line: 141, baseType: !173, size: 8, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !174)
!174 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !169, file: !122, line: 149, baseType: !106, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !169, file: !122, line: 156, baseType: !106, size: 32, offset: 96)
!177 = !{!178}
!178 = !DISubrange(count: 1)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !118, file: !160, line: 40, type: !168, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !118, file: !160, line: 28, type: !183, isLocal: true, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !143, line: 40, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !143, line: 35, size: 64, elements: !185)
!185 = !{!186, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !184, file: !143, line: 36, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !184, file: !143, line: 37, baseType: !187, size: 32, offset: 32)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 32, elements: !177)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !191, line: 22, baseType: !192)
!191 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!192 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!193 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!194 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !197, file: !228, line: 50, type: !215, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !120, retainedTypes: !199, globals: !225, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!199 = !{!200, !133, !202, !103, !102, !106, !155, !204, !153, !215, !216}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !201)
!201 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !203, line: 214, baseType: !32)
!203 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !206, line: 45, size: 64, elements: !207)
!206 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !{!208, !214}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !205, file: !206, line: 46, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !143, line: 33, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !143, line: 29, size: 32, elements: !211)
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !143, line: 30, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !205, file: !206, line: 48, baseType: !106, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !206, line: 38, size: 64, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !217, file: !206, line: 39, baseType: !209, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !217, file: !206, line: 41, baseType: !221, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !206, line: 35, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !215}
!225 = !{!226, !230, !238, !195, !240, !250}
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "latency_lock", scope: !197, file: !228, line: 44, type: !229, isLocal: true, isDefinition: true)
!228 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !162, line: 43, elements: !163)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !197, file: !228, line: 46, type: !232, isLocal: true, isDefinition: true)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !143, line: 40, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !143, line: 35, size: 64, elements: !234)
!234 = !{!235, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !233, file: !143, line: 36, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !233, file: !143, line: 37, baseType: !236, size: 32, offset: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "latency_subs", scope: !197, file: !228, line: 52, type: !232, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !197, file: !228, line: 39, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, elements: !248)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 35, size: 96, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !243, file: !228, line: 36, baseType: !121, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !243, file: !228, line: 37, baseType: !173, size: 8, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !243, file: !228, line: 38, baseType: !190, size: 32, offset: 64)
!248 = !{!249}
!249 = !DISubrange(count: 0)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !197, file: !228, line: 48, type: !215, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !254, file: !261, line: 47, type: !275, isLocal: true, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !256, retainedTypes: !257, globals: !258, splitDebugInlining: false, nameTableKind: None)
!255 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!256 = !{!121}
!257 = !{!202, !103}
!258 = !{!259, !252, !271}
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "cpus_states", scope: !254, file: !261, line: 50, type: !262, isLocal: true, isDefinition: true)
!261 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 32, elements: !177)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !122, line: 114, size: 128, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !265, file: !122, line: 115, baseType: !121, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !265, file: !122, line: 141, baseType: !173, size: 8, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !265, file: !122, line: 149, baseType: !106, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !265, file: !122, line: 156, baseType: !106, size: 32, offset: 96)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !254, file: !261, line: 55, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 8, elements: !177)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, elements: !248)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "static_regions", scope: !278, file: !285, line: 62, type: !418, isLocal: true, isDefinition: true)
!278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !279, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !280, globals: !281, splitDebugInlining: false, nameTableKind: None)
!279 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!280 = !{!202, !103, !106, !102}
!281 = !{!282, !276}
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !284, file: !285, line: 198, type: !406, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !285, file: !285, line: 175, type: !286, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !278, retainedNodes: !403)
!285 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !290, line: 245, size: 1024, elements: !291)
!290 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = !{!292, !359, !372, !373, !374, !375, !381, !398}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !289, file: !290, line: 247, baseType: !293, size: 384)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !290, line: 57, size: 384, elements: !294)
!294 = !{!295, !323, !331, !332, !333, !346, !347, !348}
!295 = !DIDerivedType(tag: DW_TAG_member, scope: !293, file: !290, line: 60, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !290, line: 60, size: 64, elements: !297)
!297 = !{!298, !314}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !296, file: !290, line: 61, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !300, line: 49, baseType: !301)
!300 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !300, line: 37, size: 64, elements: !302)
!302 = !{!303, !309}
!303 = !DIDerivedType(tag: DW_TAG_member, scope: !301, file: !300, line: 38, baseType: !304, size: 32)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !300, line: 38, size: 32, elements: !305)
!305 = !{!306, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !304, file: !300, line: 39, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !300, line: 40, baseType: !307, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, scope: !301, file: !300, line: 42, baseType: !310, size: 32, offset: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !300, line: 42, size: 32, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !310, file: !300, line: 43, baseType: !307, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !310, file: !300, line: 44, baseType: !307, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !296, file: !290, line: 62, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !316, line: 49, size: 64, elements: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !315, file: !316, line: 50, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 64, elements: !321)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!321 = !{!322}
!322 = !DISubrange(count: 2)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !293, file: !290, line: 68, baseType: !324, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !326, line: 233, baseType: !327)
!326 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 231, size: 64, elements: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !327, file: !326, line: 232, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !300, line: 48, baseType: !301)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !293, file: !290, line: 71, baseType: !173, size: 8, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !293, file: !290, line: 74, baseType: !173, size: 8, offset: 104)
!333 = !DIDerivedType(tag: DW_TAG_member, scope: !293, file: !290, line: 90, baseType: !334, size: 16, offset: 112)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !290, line: 90, size: 16, elements: !335)
!335 = !{!336, !343}
!336 = !DIDerivedType(tag: DW_TAG_member, scope: !334, file: !290, line: 91, baseType: !337, size: 16)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !290, line: 91, size: 16, elements: !338)
!338 = !{!339, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !337, file: !290, line: 96, baseType: !340, size: 8)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !341)
!341 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !337, file: !290, line: 97, baseType: !173, size: 8, offset: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !334, file: !290, line: 100, baseType: !344, size: 16)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !345)
!345 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !293, file: !290, line: 107, baseType: !106, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !293, file: !290, line: 127, baseType: !102, size: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !293, file: !290, line: 131, baseType: !349, size: 192, offset: 192)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !326, line: 244, size: 192, elements: !350)
!350 = !{!351, !352, !358}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !349, file: !326, line: 245, baseType: !299, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !349, file: !326, line: 246, baseType: !353, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !326, line: 242, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !349, file: !326, line: 249, baseType: !135, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !289, file: !290, line: 250, baseType: !360, size: 288, offset: 384)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !361, line: 25, size: 288, elements: !362)
!361 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !360, file: !361, line: 26, baseType: !106, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !360, file: !361, line: 27, baseType: !106, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !360, file: !361, line: 28, baseType: !106, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !360, file: !361, line: 29, baseType: !106, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !360, file: !361, line: 30, baseType: !106, size: 32, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !360, file: !361, line: 31, baseType: !106, size: 32, offset: 160)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !360, file: !361, line: 32, baseType: !106, size: 32, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !360, file: !361, line: 33, baseType: !106, size: 32, offset: 224)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !360, file: !361, line: 34, baseType: !106, size: 32, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !289, file: !290, line: 253, baseType: !102, size: 32, offset: 672)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !289, file: !290, line: 256, baseType: !325, size: 64, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !289, file: !290, line: 294, baseType: !103, size: 32, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !289, file: !290, line: 300, baseType: !376, size: 96, offset: 800)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !290, line: 149, size: 96, elements: !377)
!377 = !{!378, !379, !380}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !376, file: !290, line: 153, baseType: !22, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !376, file: !290, line: 162, baseType: !202, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !376, file: !290, line: 168, baseType: !202, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !289, file: !290, line: 325, baseType: !382, size: 32, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !384, line: 5073, size: 160, elements: !385)
!384 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !{!386, !395, !396}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !383, file: !384, line: 5074, baseType: !387, size: 96)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !388, line: 56, size: 96, elements: !389)
!388 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!389 = !{!390, !393, !394}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !387, file: !388, line: 57, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !388, line: 57, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !387, file: !388, line: 58, baseType: !102, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !387, file: !388, line: 59, baseType: !202, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !383, file: !384, line: 5075, baseType: !325, size: 64, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !383, file: !384, line: 5076, baseType: !397, offset: 160)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !162, line: 43, elements: !163)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !289, file: !290, line: 343, baseType: !399, size: 64, offset: 928)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !361, line: 60, size: 64, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !399, file: !361, line: 63, baseType: !106, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !399, file: !361, line: 66, baseType: !106, size: 32, offset: 32)
!403 = !{!404, !405}
!404 = !DILocalVariable(name: "thread", arg: 1, scope: !284, file: !285, line: 175, type: !288)
!405 = !DILocalVariable(name: "region_num", scope: !284, file: !285, line: 200, type: !173)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, elements: !248)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !408, line: 52, size: 96, elements: !409)
!408 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !{!410, !411, !412}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !407, file: !408, line: 53, baseType: !22, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !407, file: !408, line: 54, baseType: !202, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !407, file: !408, line: 55, baseType: !413, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !414, line: 151, baseType: !415)
!414 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 149, size: 32, elements: !416)
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !415, file: !414, line: 150, baseType: !106, size: 32)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 96, elements: !177)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !422, file: !458, line: 39, type: !173, isLocal: true, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !424, globals: !457, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!424 = !{!425, !102, !103, !443, !173}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !427, line: 1226, baseType: !428)
!427 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 1213, size: 352, elements: !429)
!429 = !{!430, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !428, file: !427, line: 1215, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !106)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !428, file: !427, line: 1216, baseType: !432, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !428, file: !427, line: 1217, baseType: !432, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !428, file: !427, line: 1218, baseType: !432, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !428, file: !427, line: 1219, baseType: !432, size: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !428, file: !427, line: 1220, baseType: !432, size: 32, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !428, file: !427, line: 1221, baseType: !432, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !428, file: !427, line: 1222, baseType: !432, size: 32, offset: 224)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !428, file: !427, line: 1223, baseType: !432, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !428, file: !427, line: 1224, baseType: !432, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !428, file: !427, line: 1225, baseType: !432, size: 32, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !446, line: 27, size: 96, elements: !447)
!446 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = !{!448, !449, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !445, file: !446, line: 29, baseType: !106, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !446, line: 31, baseType: !450, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !445, file: !446, line: 37, baseType: !453, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !414, line: 146, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !414, line: 141, size: 32, elements: !455)
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !454, file: !414, line: 143, baseType: !106, size: 32)
!457 = !{!420}
!458 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !461, file: !468, line: 21, type: !113, isLocal: true, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !463, globals: !467, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!463 = !{!464, !103, !102}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !466, line: 22, baseType: !103)
!466 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!467 = !{!459}
!468 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !471, file: !476, line: 13, type: !493, isLocal: true, isDefinition: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !473, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!473 = !{!474, !469}
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "mpu_config", scope: !471, file: !476, line: 37, type: !477, isLocal: false, isDefinition: true)
!476 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !446, line: 41, size: 64, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !478, file: !446, line: 43, baseType: !106, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !478, file: !446, line: 45, baseType: !482, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !446, line: 27, size: 96, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !484, file: !446, line: 29, baseType: !106, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !484, file: !446, line: 31, baseType: !450, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !484, file: !446, line: 37, baseType: !489, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !414, line: 146, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !414, line: 141, size: 32, elements: !491)
!491 = !{!492}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !490, file: !414, line: 143, baseType: !106, size: 32)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 192, elements: !321)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !496, file: !666, line: 93, type: !667, isLocal: true, isDefinition: true, align: 32)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !498, globals: !661, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!498 = !{!499, !173, !102, !103, !579, !106, !580, !616, !627}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !501, line: 1071, baseType: !502)
!501 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !501, line: 1035, size: 19584, elements: !503)
!503 = !{!504, !508, !509, !510, !514, !515, !517, !518, !519, !520, !521, !522, !526, !527, !528, !532, !533, !537, !538, !542, !543, !547, !548, !549, !550, !551, !552, !553, !557, !558, !559, !560, !564, !565, !569}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !502, file: !501, line: 1036, baseType: !505, size: 960)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 960, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 30)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !502, file: !501, line: 1037, baseType: !432, size: 32, offset: 960)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !502, file: !501, line: 1038, baseType: !432, size: 32, offset: 992)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !502, file: !501, line: 1039, baseType: !511, size: 1088, offset: 1024)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 1088, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 34)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !502, file: !501, line: 1040, baseType: !432, size: 32, offset: 2112)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !502, file: !501, line: 1041, baseType: !516, size: 64, offset: 2144)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 64, elements: !321)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !502, file: !501, line: 1042, baseType: !432, size: 32, offset: 2208)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !502, file: !501, line: 1043, baseType: !432, size: 32, offset: 2240)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !502, file: !501, line: 1044, baseType: !432, size: 32, offset: 2272)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !502, file: !501, line: 1045, baseType: !432, size: 32, offset: 2304)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !502, file: !501, line: 1046, baseType: !432, size: 32, offset: 2336)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !502, file: !501, line: 1047, baseType: !523, size: 3808, offset: 2368)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 3808, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 119)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !502, file: !501, line: 1048, baseType: !432, size: 32, offset: 6176)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !502, file: !501, line: 1049, baseType: !432, size: 32, offset: 6208)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !502, file: !501, line: 1050, baseType: !529, size: 1952, offset: 6240)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 1952, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 61)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !502, file: !501, line: 1051, baseType: !432, size: 32, offset: 8192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !502, file: !501, line: 1052, baseType: !534, size: 288, offset: 8224)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 288, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 9)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !502, file: !501, line: 1053, baseType: !431, size: 32, offset: 8512)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !502, file: !501, line: 1054, baseType: !539, size: 96, offset: 8544)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 96, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 3)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !502, file: !501, line: 1055, baseType: !431, size: 32, offset: 8640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !502, file: !501, line: 1056, baseType: !544, size: 1568, offset: 8672)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 1568, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 49)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !502, file: !501, line: 1057, baseType: !432, size: 32, offset: 10240)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !502, file: !501, line: 1058, baseType: !539, size: 96, offset: 10272)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !502, file: !501, line: 1059, baseType: !432, size: 32, offset: 10368)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !502, file: !501, line: 1060, baseType: !516, size: 64, offset: 10400)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !502, file: !501, line: 1061, baseType: !432, size: 32, offset: 10464)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !502, file: !501, line: 1062, baseType: !432, size: 32, offset: 10496)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !502, file: !501, line: 1063, baseType: !554, size: 672, offset: 10528)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 672, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 21)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !502, file: !501, line: 1064, baseType: !432, size: 32, offset: 11200)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !502, file: !501, line: 1065, baseType: !431, size: 32, offset: 11232)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !502, file: !501, line: 1066, baseType: !432, size: 32, offset: 11264)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !502, file: !501, line: 1067, baseType: !561, size: 1504, offset: 11296)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 1504, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 47)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !502, file: !501, line: 1068, baseType: !431, size: 32, offset: 12800)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !502, file: !501, line: 1069, baseType: !566, size: 5600, offset: 12832)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 5600, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 175)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !502, file: !501, line: 1070, baseType: !570, size: 1152, offset: 18432)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 1152, elements: !535)
!571 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !501, line: 278, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !501, line: 272, size: 128, elements: !574)
!574 = !{!575, !576, !577, !578}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !573, file: !501, line: 273, baseType: !432, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !573, file: !501, line: 274, baseType: !432, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !573, file: !501, line: 275, baseType: !432, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !573, file: !501, line: 277, baseType: !431, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !427, line: 468, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 445, size: 1120, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !609, !613, !615}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !582, file: !427, line: 447, baseType: !431, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !582, file: !427, line: 448, baseType: !432, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !582, file: !427, line: 449, baseType: !432, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !582, file: !427, line: 450, baseType: !432, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !582, file: !427, line: 451, baseType: !432, size: 32, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !582, file: !427, line: 452, baseType: !432, size: 32, offset: 160)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !582, file: !427, line: 453, baseType: !591, size: 96, offset: 192)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 96, elements: !593)
!592 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !173)
!593 = !{!594}
!594 = !DISubrange(count: 12)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !582, file: !427, line: 454, baseType: !432, size: 32, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !582, file: !427, line: 455, baseType: !432, size: 32, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !582, file: !427, line: 456, baseType: !432, size: 32, offset: 352)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !582, file: !427, line: 457, baseType: !432, size: 32, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !582, file: !427, line: 458, baseType: !432, size: 32, offset: 416)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !582, file: !427, line: 459, baseType: !432, size: 32, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !582, file: !427, line: 460, baseType: !432, size: 32, offset: 480)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !582, file: !427, line: 461, baseType: !516, size: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !582, file: !427, line: 462, baseType: !431, size: 32, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !582, file: !427, line: 463, baseType: !431, size: 32, offset: 608)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !582, file: !427, line: 464, baseType: !606, size: 128, offset: 640)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 128, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 4)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !582, file: !427, line: 465, baseType: !610, size: 160, offset: 768)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 160, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 5)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !582, file: !427, line: 466, baseType: !614, size: 160, offset: 928)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 160, elements: !611)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !582, file: !427, line: 467, baseType: !432, size: 32, offset: 1088)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !618, file: !617, line: 167, baseType: !626)
!617 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!618 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !617, file: !617, line: 134, type: !619, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !496, retainedNodes: !621)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !106}
!621 = !{!622, !623, !625}
!622 = !DILocalVariable(name: "time_us", arg: 1, scope: !618, file: !617, line: 134, type: !106)
!623 = !DILocalVariable(name: "delay_cycles", scope: !618, file: !617, line: 168, type: !624)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!625 = !DILocalVariable(name: "cycles", scope: !618, file: !617, line: 171, type: !106)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !501, line: 2399, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !501, line: 2373, size: 10880, elements: !630)
!630 = !{!631, !635, !636, !637, !638, !642, !643, !648, !649, !650, !651, !652, !653, !657, !658, !659, !660}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !629, file: !501, line: 2374, baseType: !632, size: 8192)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 8192, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !629, file: !501, line: 2375, baseType: !431, size: 32, offset: 8192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !629, file: !501, line: 2376, baseType: !431, size: 32, offset: 8224)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !629, file: !501, line: 2377, baseType: !431, size: 32, offset: 8256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !629, file: !501, line: 2378, baseType: !639, size: 1984, offset: 8288)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 1984, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 62)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !629, file: !501, line: 2379, baseType: !432, size: 32, offset: 10272)
!643 = !DIDerivedType(tag: DW_TAG_member, scope: !629, file: !501, line: 2381, baseType: !644, size: 32, offset: 10304)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !629, file: !501, line: 2381, size: 32, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !644, file: !501, line: 2382, baseType: !432, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !644, file: !501, line: 2383, baseType: !432, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !629, file: !501, line: 2386, baseType: !432, size: 32, offset: 10336)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !629, file: !501, line: 2387, baseType: !432, size: 32, offset: 10368)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !629, file: !501, line: 2389, baseType: !432, size: 32, offset: 10400)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !629, file: !501, line: 2391, baseType: !432, size: 32, offset: 10432)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !629, file: !501, line: 2393, baseType: !432, size: 32, offset: 10464)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !629, file: !501, line: 2394, baseType: !654, size: 256, offset: 10496)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 256, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 8)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !629, file: !501, line: 2395, baseType: !432, size: 32, offset: 10752)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !629, file: !501, line: 2396, baseType: !431, size: 32, offset: 10784)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !629, file: !501, line: 2397, baseType: !432, size: 32, offset: 10816)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !629, file: !501, line: 2398, baseType: !432, size: 32, offset: 10848)
!661 = !{!494, !662}
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !618, file: !617, line: 161, type: !664, isLocal: true, isDefinition: true, align: 128)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 48, elements: !540)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!666 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !669, line: 51, size: 64, elements: !670)
!669 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!670 = !{!671, !678}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !668, file: !669, line: 60, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DISubroutineType(types: !674)
!674 = !{!103, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !669, line: 48, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !668, file: !669, line: 65, baseType: !675, size: 32, offset: 32)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "__device_dts_ord_38", scope: !681, file: !917, line: 733, type: !1021, isLocal: false, isDefinition: true, align: 32)
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !683, retainedTypes: !826, globals: !913, splitDebugInlining: false, nameTableKind: None)
!682 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/boards/stm32/backup_sram")
!683 = !{!684, !690, !30, !695, !700, !707, !715, !723, !732, !736, !791, !798, !817}
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !685, line: 23, baseType: !32, size: 32, elements: !686)
!685 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!686 = !{!687, !688, !689}
!687 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!688 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!689 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !685, line: 48, baseType: !32, size: 32, elements: !691)
!691 = !{!692, !693, !694}
!692 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!693 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!694 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !696, line: 167, baseType: !32, size: 32, elements: !697)
!696 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!697 = !{!698, !699}
!698 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!699 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !696, line: 107, baseType: !32, size: 32, elements: !701)
!701 = !{!702, !703, !704, !705, !706}
!702 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!703 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!704 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!705 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!706 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !696, line: 208, baseType: !32, size: 32, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714}
!709 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!710 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!711 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!712 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!713 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!714 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!715 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !696, line: 261, baseType: !32, size: 32, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722}
!717 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!718 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!719 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!720 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!721 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!722 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !696, line: 237, baseType: !32, size: 32, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731}
!725 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!726 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!727 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!728 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!729 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!730 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!731 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !696, line: 152, baseType: !32, size: 32, elements: !733)
!733 = !{!734, !735}
!734 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!735 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!736 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !501, line: 71, baseType: !103, size: 32, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!738 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!739 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!740 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!741 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!742 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!743 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!744 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!745 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!746 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!747 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!748 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!749 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!750 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!751 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!752 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!753 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!754 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!755 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!756 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!757 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!758 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!759 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!760 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!761 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!762 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!763 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!764 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!765 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!766 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!767 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!768 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!769 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!770 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!771 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!772 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!773 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!774 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!775 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!776 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!777 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!778 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!779 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!780 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!781 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!782 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!783 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!784 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!785 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!786 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!787 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!788 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!789 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!790 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!791 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !792, line: 44, baseType: !32, size: 32, elements: !793)
!792 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!793 = !{!794, !795, !796, !797}
!794 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!795 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!796 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!797 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!798 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !799, line: 54, baseType: !32, size: 32, elements: !800)
!799 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816}
!801 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!802 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!803 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!804 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!805 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!806 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!807 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!808 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!809 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!810 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!811 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!812 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!813 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!814 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!815 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!816 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!817 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !818, line: 53, baseType: !32, size: 32, elements: !819)
!818 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!819 = !{!820, !821, !822, !823, !824, !825}
!820 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!821 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!822 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!823 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!824 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!825 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!826 = !{!684, !102, !103, !827, !876, !877, !878, !879, !133, !106, !155, !880, !579, !881, !215, !882, !912, !202}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !501, line: 1022, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !501, line: 979, size: 11712, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !842, !843, !844, !845, !846, !847, !848, !849, !850, !854, !855, !856, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !829, file: !501, line: 980, baseType: !432, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !829, file: !501, line: 981, baseType: !432, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !829, file: !501, line: 982, baseType: !432, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !829, file: !501, line: 983, baseType: !432, size: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !829, file: !501, line: 984, baseType: !432, size: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !829, file: !501, line: 985, baseType: !432, size: 32, offset: 160)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !829, file: !501, line: 986, baseType: !432, size: 32, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !829, file: !501, line: 987, baseType: !839, size: 1824, offset: 224)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 1824, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 57)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !829, file: !501, line: 988, baseType: !432, size: 32, offset: 2048)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !829, file: !501, line: 989, baseType: !432, size: 32, offset: 2080)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !829, file: !501, line: 990, baseType: !431, size: 32, offset: 2112)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !829, file: !501, line: 991, baseType: !432, size: 32, offset: 2144)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !829, file: !501, line: 992, baseType: !432, size: 32, offset: 2176)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !829, file: !501, line: 993, baseType: !610, size: 160, offset: 2208)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !829, file: !501, line: 994, baseType: !432, size: 32, offset: 2368)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !829, file: !501, line: 996, baseType: !432, size: 32, offset: 2400)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !829, file: !501, line: 998, baseType: !851, size: 3744, offset: 2432)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 3744, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 117)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !829, file: !501, line: 999, baseType: !432, size: 32, offset: 6176)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !829, file: !501, line: 1000, baseType: !432, size: 32, offset: 6208)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !829, file: !501, line: 1001, baseType: !857, size: 2016, offset: 6240)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 2016, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 63)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !829, file: !501, line: 1002, baseType: !431, size: 32, offset: 8256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !829, file: !501, line: 1004, baseType: !431, size: 32, offset: 8288)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !829, file: !501, line: 1005, baseType: !431, size: 32, offset: 8320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !829, file: !501, line: 1006, baseType: !431, size: 32, offset: 8352)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !829, file: !501, line: 1008, baseType: !431, size: 32, offset: 8384)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !829, file: !501, line: 1009, baseType: !431, size: 32, offset: 8416)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !829, file: !501, line: 1011, baseType: !639, size: 1984, offset: 8448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !829, file: !501, line: 1012, baseType: !432, size: 32, offset: 10432)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !829, file: !501, line: 1013, baseType: !539, size: 96, offset: 10464)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !829, file: !501, line: 1014, baseType: !432, size: 32, offset: 10560)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !829, file: !501, line: 1016, baseType: !539, size: 96, offset: 10592)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !829, file: !501, line: 1017, baseType: !432, size: 32, offset: 10688)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !829, file: !501, line: 1018, baseType: !654, size: 256, offset: 10720)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !829, file: !501, line: 1019, baseType: !432, size: 32, offset: 10976)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !829, file: !501, line: 1020, baseType: !554, size: 672, offset: 11008)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !829, file: !501, line: 1021, baseType: !432, size: 32, offset: 11680)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !696, line: 146, baseType: !700)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !696, line: 164, baseType: !732)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!880 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !427, line: 426, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 411, size: 28704, elements: !885)
!885 = !{!886, !888, !892, !893, !894, !895, !896, !897, !898, !899, !903, !907, !911}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !884, file: !427, line: 413, baseType: !887, size: 256)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 256, elements: !655)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !884, file: !427, line: 414, baseType: !889, size: 768, offset: 256)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 768, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 24)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !884, file: !427, line: 415, baseType: !887, size: 256, offset: 1024)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !884, file: !427, line: 416, baseType: !889, size: 768, offset: 1280)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !884, file: !427, line: 417, baseType: !887, size: 256, offset: 2048)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !884, file: !427, line: 418, baseType: !889, size: 768, offset: 2304)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !884, file: !427, line: 419, baseType: !887, size: 256, offset: 3072)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !884, file: !427, line: 420, baseType: !889, size: 768, offset: 3328)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !884, file: !427, line: 421, baseType: !887, size: 256, offset: 4096)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !884, file: !427, line: 422, baseType: !900, size: 1792, offset: 4352)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 1792, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 56)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !884, file: !427, line: 423, baseType: !904, size: 1920, offset: 6144)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 1920, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 240)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !884, file: !427, line: 424, baseType: !908, size: 20608, offset: 8064)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 20608, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 644)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !884, file: !427, line: 425, baseType: !432, size: 32, offset: 28672)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !792, line: 56, baseType: !102)
!913 = !{!914, !964, !1005, !679, !1011, !1037, !1039, !1056, !1058, !1068, !1071, !1086, !1124, !1138}
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "on", scope: !916, file: !917, line: 549, type: !190, isLocal: true, isDefinition: true)
!916 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !917, file: !917, line: 547, type: !918, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !681, retainedNodes: !920)
!917 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!918 = !DISubroutineType(types: !919)
!919 = !{null, !690}
!920 = !{!921, !922, !925}
!921 = !DILocalVariable(name: "start_mode", arg: 1, scope: !916, file: !917, line: 547, type: !690)
!922 = !DILocalVariable(name: "err", scope: !923, file: !917, line: 553, type: !103)
!923 = distinct !DILexicalBlock(scope: !924, file: !917, line: 552, column: 31)
!924 = distinct !DILexicalBlock(scope: !916, file: !917, line: 552, column: 6)
!925 = !DILocalVariable(name: "mgr", scope: !923, file: !917, line: 554, type: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !928, line: 154, size: 224, elements: !929)
!928 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = !{!930, !942, !943, !959, !961, !962, !963}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !927, file: !928, line: 158, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !143, line: 40, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !143, line: 35, size: 64, elements: !933)
!933 = !{!934, !941}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !932, file: !143, line: 36, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !143, line: 33, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !143, line: 29, size: 32, elements: !938)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !937, file: !143, line: 30, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !932, file: !143, line: 37, baseType: !935, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !927, file: !928, line: 163, baseType: !931, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !927, file: !928, line: 166, baseType: !944, size: 32, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !928, line: 133, size: 96, elements: !947)
!947 = !{!948, !957, !958}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !946, file: !928, line: 135, baseType: !949, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !928, line: 129, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !926, !953}
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !928, line: 101, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !926, !103}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !946, file: !928, line: 138, baseType: !949, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !946, file: !928, line: 143, baseType: !949, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !927, file: !928, line: 169, baseType: !960, offset: 160)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !162, line: 43, elements: !163)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !927, file: !928, line: 172, baseType: !103, size: 32, offset: 160)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !927, file: !928, line: 175, baseType: !344, size: 16, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !927, file: !928, line: 178, baseType: !344, size: 16, offset: 208)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "cli", scope: !916, file: !917, line: 550, type: !966, isLocal: true, isDefinition: true)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !928, line: 273, size: 128, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !966, file: !928, line: 280, baseType: !936, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !966, file: !928, line: 283, baseType: !970, size: 96, offset: 32)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !971, line: 138, size: 96, elements: !972)
!971 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!972 = !{!973, !1002, !1003}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !970, file: !971, line: 149, baseType: !974, size: 32)
!974 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !971, line: 139, size: 32, elements: !975)
!975 = !{!976, !997}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !974, file: !971, line: 145, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !384, line: 5397, size: 128, elements: !979)
!979 = !{!980, !995, !996}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !978, file: !384, line: 5399, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !300, line: 48, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !300, line: 37, size: 64, elements: !983)
!983 = !{!984, !990}
!984 = !DIDerivedType(tag: DW_TAG_member, scope: !982, file: !300, line: 38, baseType: !985, size: 32)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !982, file: !300, line: 38, size: 32, elements: !986)
!986 = !{!987, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !985, file: !300, line: 39, baseType: !988, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !985, file: !300, line: 40, baseType: !988, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, scope: !982, file: !300, line: 42, baseType: !991, size: 32, offset: 32)
!991 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !982, file: !300, line: 42, size: 32, elements: !992)
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !991, file: !300, line: 43, baseType: !988, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !991, file: !300, line: 44, baseType: !988, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !978, file: !384, line: 5405, baseType: !32, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !978, file: !384, line: 5408, baseType: !103, size: 32, offset: 96)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !974, file: !971, line: 148, baseType: !998, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !971, line: 98, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{null, null}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !970, file: !971, line: 165, baseType: !432, size: 32, offset: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !970, file: !971, line: 174, baseType: !1004, size: 32, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_38", scope: !681, file: !917, line: 733, type: !1007, isLocal: false, isDefinition: true, align: 16)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 80, elements: !611)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !1010, line: 43, baseType: !200)
!1010 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_38", scope: !681, file: !917, line: 733, type: !1013, isLocal: true, isDefinition: true, align: 32)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !669, line: 51, size: 64, elements: !1015)
!1015 = !{!1016, !1036}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1014, file: !669, line: 60, baseType: !1017, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!103, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !1010, line: 378, size: 192, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027, !1033, !1034}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1022, file: !1010, line: 380, baseType: !450, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1022, file: !1010, line: 382, baseType: !13, size: 32, offset: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1022, file: !1010, line: 384, baseType: !13, size: 32, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1022, file: !1010, line: 386, baseType: !1028, size: 32, offset: 96)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !1010, line: 351, size: 16, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1029, file: !1010, line: 359, baseType: !173, size: 8)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1029, file: !1010, line: 364, baseType: !880, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1022, file: !1010, line: 388, baseType: !102, size: 32, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1022, file: !1010, line: 396, baseType: !1035, size: 32, offset: 160)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1014, file: !669, line: 65, baseType: !1020, size: 32, offset: 32)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !681, file: !917, line: 79, type: !190, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "data", scope: !681, file: !917, line: 702, type: !1041, isLocal: true, isDefinition: true)
