; ModuleID = './build/uart_loopback_data_dma.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.DMA_INPUT = type { i32, i32, i32, i8*, void ()* }
%struct.DMA_FULLSIZE_HWMENU = type { %struct.DMA_TMODE, i32, i32, i32 }
%struct.DMA_TMODE = type { i8, i8 }
%struct.DMA_HWMENU = type { %struct.DMA_TMODE, i32, i32 }
%struct.DMA_SWCOPYMENU = type { i32, i32 }
%struct.DMA_FULLSIZE_HWRINGBUFF_MENU = type { %struct.DMA_TMODE, i32, i32, i32, i8*, i8* }
%struct.DMA_HWRINGBUFF_MENU = type { %struct.DMA_TMODE, i32, i32, i8*, i8* }
%struct.__va_list = type { i8* }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }

!38 = !DIEnumerator(name: "DMA_SWCOPY", value: 2)
!39 = !DIEnumerator(name: "DMA_HWTX_RINGBUFF", value: 3)
!40 = !DIEnumerator(name: "DMA_HWRX_RINGBUFF", value: 4)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 110, baseType: !7, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DMA_BYTE", value: 0)
!44 = !DIEnumerator(name: "DMA_SHORT", value: 1)
!45 = !DIEnumerator(name: "DMA_LONG", value: 2)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 121, baseType: !7, size: 32, elements: !48)
!47 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!50 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !52, line: 47, baseType: !53, size: 32, elements: !54)
!52 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!55 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!56 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!57 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!58 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!59 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!60 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!61 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!62 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!63 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!64 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!65 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!66 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!67 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!68 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!69 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!70 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!71 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!72 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!73 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!74 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!75 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!76 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!77 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!78 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!79 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!80 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!81 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!82 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!83 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!84 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!85 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!86 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!87 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!88 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!89 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!90 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!91 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!92 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!93 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!94 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!95 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!96 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 129, baseType: !7, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!99 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!100 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!101 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!102 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!103 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!104 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!105 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!106 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!107 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!108 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!109 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!110 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!111 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!112 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!113 = !{!114, !115, !117, !139, !146, !152, !163, !172, !161, !173, !174}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !47, line: 116, baseType: !7)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWMENU", file: !6, line: 174, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 128, elements: !120)
!120 = !{!121, !133, !135, !138}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !119, file: !6, line: 170, baseType: !122, size: 16)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_TMODE", file: !6, line: 127, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 124, size: 16, elements: !124)
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "burst_mode", scope: !123, file: !6, line: 125, baseType: !126, size: 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !123, file: !6, line: 126, baseType: !128, size: 8, offset: 8)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !129, line: 24, baseType: !130)
!129 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !131, line: 43, baseType: !132)
!131 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !119, file: !6, line: 171, baseType: !134, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_Master", file: !6, line: 108, baseType: !5)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !119, file: !6, line: 172, baseType: !136, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !129, line: 48, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !131, line: 79, baseType: !7)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !119, file: !6, line: 173, baseType: !136, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWMENU", file: !6, line: 158, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 154, size: 96, elements: !142)
!142 = !{!143, !144, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !141, file: !6, line: 155, baseType: !122, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !141, file: !6, line: 156, baseType: !134, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !141, file: !6, line: 157, baseType: !136, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_SWCOPYMENU", file: !6, line: 179, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 176, size: 64, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "srcaddr", scope: !148, file: !6, line: 177, baseType: !136, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dstaddr", scope: !148, file: !6, line: 178, baseType: !136, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWRINGBUFF_MENU", file: !6, line: 167, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 160, size: 192, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !162}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !154, file: !6, line: 161, baseType: !122, size: 16)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !154, file: !6, line: 162, baseType: !134, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !154, file: !6, line: 163, baseType: !136, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !154, file: !6, line: 164, baseType: !136, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !154, file: !6, line: 165, baseType: !161, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !154, file: !6, line: 166, baseType: !161, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWRINGBUFF_MENU", file: !6, line: 152, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 146, size: 160, elements: !166)
!166 = !{!167, !168, !169, !170, !171}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !165, file: !6, line: 147, baseType: !122, size: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !165, file: !6, line: 148, baseType: !134, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !165, file: !6, line: 149, baseType: !136, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !165, file: !6, line: 150, baseType: !161, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !165, file: !6, line: 151, baseType: !161, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !52, line: 95, baseType: !51)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint8", file: !47, line: 108, baseType: !132)
!175 = !{!0, !176, !185, !187, !192, !194}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "DMA_VFIFO_LISR_FUNC", scope: !2, file: !3, line: 60, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 448, elements: !183)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !6, line: 197, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{null}
!183 = !{!184}
!184 = !DISubrange(count: 14)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "DMA_VFIFO_TO_LISR_FUNC", scope: !2, file: !3, line: 64, type: !178, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "DMA_Owner", scope: !2, file: !3, line: 71, type: !189, isLocal: false, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 352, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 11)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "DMA_Channel_Status", scope: !2, file: !3, line: 68, type: !114, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "DMA_used_channel", scope: !2, file: !3, line: 69, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 88, elements: !190)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 352, elements: !190)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !200, file: !201, line: 43, type: !136, isLocal: true, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !202, globals: !210, splitDebugInlining: false, nameTableKind: None)
!201 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!202 = !{!203, !205, !206, !208}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !47, line: 62, baseType: !7)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !136)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !205)
!210 = !{!198, !211}
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !200, file: !201, line: 44, type: !136, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !215, file: !216, line: 54, type: !136, isLocal: false, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !217, retainedTypes: !224, globals: !232, splitDebugInlining: false, nameTableKind: None)
!216 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!217 = !{!218, !97}
!218 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !219, line: 71, baseType: !7, size: 32, elements: !220)
!219 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!220 = !{!221, !222, !223}
!221 = !DIEnumerator(name: "UART_PORT0", value: 0)
!222 = !DIEnumerator(name: "UART_PORT1", value: 1)
!223 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!224 = !{!203, !136, !225, !227, !229, !230, !205}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !47, line: 113, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !47, line: 59, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !229)
!232 = !{!213}
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !235, file: !236, line: 51, type: !315, isLocal: false, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !237, retainedTypes: !284, globals: !314, splitDebugInlining: false, nameTableKind: None)
!236 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!237 = !{!238, !249, !268, !275}
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 163, baseType: !53, size: 32, elements: !240)
!239 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248}
!241 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!242 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!243 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!244 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!245 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!246 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!247 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!248 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 186, baseType: !7, size: 32, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!251 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!252 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!253 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!254 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!255 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!256 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!257 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!258 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!259 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!260 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!261 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!262 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!263 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!264 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!265 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!266 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!267 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 176, baseType: !7, size: 32, elements: !269)
!269 = !{!270, !271, !272, !273, !274}
!270 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!271 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!272 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!273 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!274 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 99, baseType: !7, size: 32, elements: !277)
!276 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!277 = !{!278, !279, !280, !281, !282, !283}
!278 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!279 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!280 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!281 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!282 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!283 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!284 = !{!285, !161}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !287, line: 72, baseType: !288)
!287 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 56, size: 525312, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !304, !305, !309, !313}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !288, file: !287, line: 57, baseType: !207, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !288, file: !287, line: 58, baseType: !207, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !288, file: !287, line: 59, baseType: !207, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !288, file: !287, line: 60, baseType: !207, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !288, file: !287, line: 61, baseType: !207, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !288, file: !287, line: 62, baseType: !207, size: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !288, file: !287, line: 63, baseType: !207, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !288, file: !287, line: 64, baseType: !207, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !288, file: !287, line: 65, baseType: !207, size: 32, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !288, file: !287, line: 66, baseType: !207, size: 32, offset: 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !288, file: !287, line: 67, baseType: !301, size: 32, offset: 320)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 1)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !288, file: !287, line: 68, baseType: !207, size: 32, offset: 352)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !288, file: !287, line: 69, baseType: !306, size: 523904, offset: 384)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 523904, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 16372)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !288, file: !287, line: 70, baseType: !310, size: 512, offset: 524288)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 512, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 16)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !288, file: !287, line: 71, baseType: !310, size: 512, offset: 524800)
!314 = !{!233}
!315 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !318, file: !319, line: 53, type: !407, isLocal: false, isDefinition: true)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !320, retainedTypes: !329, globals: !406, splitDebugInlining: false, nameTableKind: None)
!319 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!320 = !{!321, !51}
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !322, line: 152, baseType: !53, size: 32, elements: !323)
!322 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!323 = !{!324, !325, !326, !327, !328}
!324 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!325 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!326 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!327 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!328 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!329 = !{!330, !161, !136, !331, !333, !367}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !52, line: 97, baseType: !173)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !129, line: 44, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !131, line: 77, baseType: !53)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !335, line: 378, baseType: !336)
!335 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 363, size: 28704, elements: !337)
!337 = !{!338, !342, !346, !347, !348, !349, !350, !351, !352, !353, !357, !362, !366}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !336, file: !335, line: 365, baseType: !339, size: 256)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 256, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !336, file: !335, line: 366, baseType: !343, size: 768, offset: 256)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 768, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 24)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !336, file: !335, line: 367, baseType: !339, size: 256, offset: 1024)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !336, file: !335, line: 368, baseType: !343, size: 768, offset: 1280)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !336, file: !335, line: 369, baseType: !339, size: 256, offset: 2048)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !336, file: !335, line: 370, baseType: !343, size: 768, offset: 2304)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !336, file: !335, line: 371, baseType: !339, size: 256, offset: 3072)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !336, file: !335, line: 372, baseType: !343, size: 768, offset: 3328)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !336, file: !335, line: 373, baseType: !339, size: 256, offset: 4096)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !336, file: !335, line: 374, baseType: !354, size: 1792, offset: 4352)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1792, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 56)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !336, file: !335, line: 375, baseType: !358, size: 1920, offset: 6144)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 1920, elements: !360)
!359 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !128)
!360 = !{!361}
!361 = !DISubrange(count: 240)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !336, file: !335, line: 376, baseType: !363, size: 20608, offset: 8064)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 20608, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 644)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !336, file: !335, line: 377, baseType: !207, size: 32, offset: 28672)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !335, line: 418, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 395, size: 1120, elements: !370)
!370 = !{!371, !373, !374, !375, !376, !377, !378, !382, !383, !384, !385, !386, !387, !388, !389, !393, !394, !395, !399, !403, !405}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !369, file: !335, line: 397, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !369, file: !335, line: 398, baseType: !207, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !369, file: !335, line: 399, baseType: !207, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !369, file: !335, line: 400, baseType: !207, size: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !369, file: !335, line: 401, baseType: !207, size: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !369, file: !335, line: 402, baseType: !207, size: 32, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !369, file: !335, line: 403, baseType: !379, size: 96, offset: 192)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 96, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 12)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !369, file: !335, line: 404, baseType: !207, size: 32, offset: 288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !369, file: !335, line: 405, baseType: !207, size: 32, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !369, file: !335, line: 406, baseType: !207, size: 32, offset: 352)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !369, file: !335, line: 407, baseType: !207, size: 32, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !369, file: !335, line: 408, baseType: !207, size: 32, offset: 416)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !369, file: !335, line: 409, baseType: !207, size: 32, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !369, file: !335, line: 410, baseType: !207, size: 32, offset: 480)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !369, file: !335, line: 411, baseType: !390, size: 64, offset: 512)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 64, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 2)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !369, file: !335, line: 412, baseType: !372, size: 32, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !369, file: !335, line: 413, baseType: !372, size: 32, offset: 608)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !369, file: !335, line: 414, baseType: !396, size: 128, offset: 640)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 128, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 4)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !369, file: !335, line: 415, baseType: !400, size: 160, offset: 768)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 160, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 5)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !369, file: !335, line: 416, baseType: !404, size: 160, offset: 928)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 160, elements: !401)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !369, file: !335, line: 417, baseType: !207, size: 32, offset: 1088)
!406 = !{!316}
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 6144, elements: !416)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !319, line: 50, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 47, size: 64, elements: !410)
!410 = !{!411, !415}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !409, file: !319, line: 48, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !330}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !409, file: !319, line: 49, baseType: !136, size: 32, offset: 32)
!416 = !{!417}
!417 = !DISubrange(count: 96)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !420, file: !421, line: 77, type: !486, isLocal: true, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !473, globals: !475, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!422 = !{!423, !431, !437, !453, !459, !463, !218, !97, !468}
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 345, baseType: !53, size: 32, elements: !425)
!424 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!425 = !{!426, !427, !428, !429, !430}
!426 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!427 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!428 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!429 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!430 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !432, line: 109, baseType: !7, size: 32, elements: !433)
!432 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!433 = !{!434, !435, !436}
!434 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!435 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!436 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!437 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 302, baseType: !7, size: 32, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!439 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!440 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!441 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!442 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!443 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!444 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!445 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!446 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!447 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!448 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!449 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!450 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!451 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!452 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 321, baseType: !7, size: 32, elements: !454)
!454 = !{!455, !456, !457, !458}
!455 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!456 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!457 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!458 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 330, baseType: !7, size: 32, elements: !460)
!460 = !{!461, !462}
!461 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!462 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 337, baseType: !7, size: 32, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!466 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!467 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 355, baseType: !53, size: 32, elements: !469)
!469 = !{!470, !471, !472}
!470 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!471 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!472 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!473 = !{!7, !161, !132, !474, !128}
!474 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!475 = !{!418, !476}
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "func_tbl", scope: !478, file: !421, line: 536, type: !484, isLocal: true, isDefinition: true)
!478 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !421, file: !421, line: 534, type: !479, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !420, retainedNodes: !482)
!479 = !DISubroutineType(types: !480)
!480 = !{!179, !481}
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !432, line: 113, baseType: !431)
!482 = !{!483}
!483 = !DILocalVariable(name: "uart_port", arg: 1, scope: !478, file: !421, line: 534, type: !481)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 64, elements: !391)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 1024, elements: !391)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !421, line: 75, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 68, size: 512, elements: !489)
!489 = !{!490, !491, !503, !504, !515, !516}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !488, file: !421, line: 69, baseType: !126, size: 8)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !488, file: !421, line: 70, baseType: !492, size: 128, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !424, line: 378, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 373, size: 128, elements: !494)
!494 = !{!495, !497, !499, !501}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !493, file: !424, line: 374, baseType: !496, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !424, line: 317, baseType: !437)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !493, file: !424, line: 375, baseType: !498, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !424, line: 326, baseType: !453)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !493, file: !424, line: 376, baseType: !500, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !424, line: 333, baseType: !459)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !493, file: !424, line: 377, baseType: !502, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !424, line: 341, baseType: !463)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !488, file: !421, line: 71, baseType: !126, size: 8, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !488, file: !421, line: 72, baseType: !505, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !421, line: 66, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 63, size: 64, elements: !507)
!507 = !{!508, !514}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !506, file: !421, line: 64, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !424, line: 410, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !513, !161}
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !424, line: 359, baseType: !468)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !506, file: !421, line: 65, baseType: !161, size: 32, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !488, file: !421, line: 73, baseType: !126, size: 8, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !488, file: !421, line: 74, baseType: !517, size: 224, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !424, line: 390, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 382, size: 224, elements: !519)
!519 = !{!520, !522, !523, !524, !525, !526, !527}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !518, file: !424, line: 383, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !518, file: !424, line: 384, baseType: !136, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !518, file: !424, line: 385, baseType: !136, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !518, file: !424, line: 386, baseType: !521, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !518, file: !424, line: 387, baseType: !136, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !518, file: !424, line: 388, baseType: !136, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !518, file: !424, line: 389, baseType: !136, size: 32, offset: 192)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "g_uart_receive_buffer", scope: !530, file: !531, line: 60, type: !570, isLocal: true, isDefinition: true, align: 32)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !532, retainedTypes: !564, globals: !567, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/uart_loopback_data_dma/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!532 = !{!437, !453, !459, !463, !533, !431, !468}
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !432, line: 249, baseType: !7, size: 32, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!535 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!536 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!537 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!538 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!539 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!540 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!541 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!542 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!543 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!544 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!545 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!546 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!547 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!548 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!549 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!550 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!551 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!552 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!553 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!554 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!555 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!556 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!557 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!558 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!559 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!560 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!561 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!562 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!563 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!564 = !{!161, !565}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!567 = !{!528, !568, !573}
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "g_uart_send_buffer", scope: !530, file: !531, line: 59, type: !570, isLocal: true, isDefinition: true, align: 32)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 2048, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 256)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "g_uart_receive_event", scope: !530, file: !531, line: 61, type: !315, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !577, file: !578, line: 59, type: !136, isLocal: false, isDefinition: true)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !579, globals: !632, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/uart_loopback_data_dma/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!579 = !{!580, !588, !613}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !335, line: 656, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 650, size: 128, elements: !583)
!583 = !{!584, !585, !586, !587}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !582, file: !335, line: 652, baseType: !207, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !582, file: !335, line: 653, baseType: !207, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !582, file: !335, line: 654, baseType: !207, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !582, file: !335, line: 655, baseType: !372, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !335, line: 418, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 395, size: 1120, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !590, file: !335, line: 397, baseType: !372, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !590, file: !335, line: 398, baseType: !207, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !590, file: !335, line: 399, baseType: !207, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !590, file: !335, line: 400, baseType: !207, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !590, file: !335, line: 401, baseType: !207, size: 32, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !590, file: !335, line: 402, baseType: !207, size: 32, offset: 160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !590, file: !335, line: 403, baseType: !379, size: 96, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !590, file: !335, line: 404, baseType: !207, size: 32, offset: 288)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !590, file: !335, line: 405, baseType: !207, size: 32, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !590, file: !335, line: 406, baseType: !207, size: 32, offset: 352)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !590, file: !335, line: 407, baseType: !207, size: 32, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !590, file: !335, line: 408, baseType: !207, size: 32, offset: 416)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !590, file: !335, line: 409, baseType: !207, size: 32, offset: 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !590, file: !335, line: 410, baseType: !207, size: 32, offset: 480)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !590, file: !335, line: 411, baseType: !390, size: 64, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !590, file: !335, line: 412, baseType: !372, size: 32, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !590, file: !335, line: 413, baseType: !372, size: 32, offset: 608)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !590, file: !335, line: 414, baseType: !396, size: 128, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !590, file: !335, line: 415, baseType: !400, size: 160, offset: 768)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !590, file: !335, line: 416, baseType: !404, size: 160, offset: 928)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !590, file: !335, line: 417, baseType: !207, size: 32, offset: 1088)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !287, line: 72, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 56, size: 525312, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !615, file: !287, line: 57, baseType: !207, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !615, file: !287, line: 58, baseType: !207, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !615, file: !287, line: 59, baseType: !207, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !615, file: !287, line: 60, baseType: !207, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !615, file: !287, line: 61, baseType: !207, size: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !615, file: !287, line: 62, baseType: !207, size: 32, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !615, file: !287, line: 63, baseType: !207, size: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !615, file: !287, line: 64, baseType: !207, size: 32, offset: 224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !615, file: !287, line: 65, baseType: !207, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !615, file: !287, line: 66, baseType: !207, size: 32, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !615, file: !287, line: 67, baseType: !301, size: 32, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !615, file: !287, line: 68, baseType: !207, size: 32, offset: 352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !615, file: !287, line: 69, baseType: !306, size: 523904, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !615, file: !287, line: 70, baseType: !310, size: 512, offset: 524288)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !615, file: !287, line: 71, baseType: !310, size: 512, offset: 524800)
!632 = !{!575, !633}
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !577, file: !578, line: 61, type: !207, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "heap_end", scope: !637, file: !638, line: 66, type: !643, isLocal: true, isDefinition: true)
!637 = distinct !DISubprogram(name: "_sbrk_r", scope: !638, file: !638, line: 63, type: !639, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !835, retainedNodes: !839)
!638 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!639 = !DISubroutineType(types: !640)
!640 = !{!641, !644, !834}
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !642, line: 123, baseType: !643)
!642 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !646, line: 377, size: 1920, elements: !647)
!646 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!647 = !{!648, !649, !723, !724, !725, !726, !727, !728, !729, !732, !753, !757, !758, !759, !760, !770, !783, !784, !789, !808, !809, !816, !817, !833}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !645, file: !646, line: 381, baseType: !53, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !645, file: !646, line: 386, baseType: !650, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !646, line: 292, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !646, line: 186, size: 832, elements: !653)
!653 = !{!654, !656, !657, !658, !660, !661, !666, !667, !668, !669, !673, !679, !686, !690, !691, !692, !693, !697, !699, !700, !701, !703, !709, !722}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !652, file: !646, line: 187, baseType: !655, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !652, file: !646, line: 188, baseType: !53, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !652, file: !646, line: 189, baseType: !53, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !652, file: !646, line: 190, baseType: !659, size: 16, offset: 96)
!659 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !652, file: !646, line: 191, baseType: !659, size: 16, offset: 112)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !652, file: !646, line: 192, baseType: !662, size: 64, offset: 128)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !646, line: 122, size: 64, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !662, file: !646, line: 123, baseType: !655, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !662, file: !646, line: 124, baseType: !53, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !652, file: !646, line: 193, baseType: !53, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !652, file: !646, line: 196, baseType: !644, size: 32, offset: 224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !652, file: !646, line: 200, baseType: !161, size: 32, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !652, file: !646, line: 202, baseType: !670, size: 32, offset: 288)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DISubroutineType(types: !672)
!672 = !{!53, !644, !161, !643, !53}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !652, file: !646, line: 204, baseType: !674, size: 32, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DISubroutineType(types: !676)
!676 = !{!53, !644, !161, !677, !53}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !652, file: !646, line: 207, baseType: !680, size: 32, offset: 352)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DISubroutineType(types: !682)
!682 = !{!683, !644, !161, !683, !53}
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !684, line: 116, baseType: !685)
!684 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!685 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !652, file: !646, line: 208, baseType: !687, size: 32, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DISubroutineType(types: !689)
!689 = !{!53, !644, !161}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !652, file: !646, line: 211, baseType: !662, size: 64, offset: 416)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !652, file: !646, line: 212, baseType: !655, size: 32, offset: 480)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !652, file: !646, line: 213, baseType: !53, size: 32, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !652, file: !646, line: 216, baseType: !694, size: 24, offset: 544)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 24, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 3)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !652, file: !646, line: 217, baseType: !698, size: 8, offset: 568)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8, elements: !302)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !652, file: !646, line: 220, baseType: !662, size: 64, offset: 576)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !652, file: !646, line: 223, baseType: !53, size: 32, offset: 640)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !652, file: !646, line: 224, baseType: !702, size: 32, offset: 672)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !684, line: 46, baseType: !685)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !652, file: !646, line: 231, baseType: !704, size: 32, offset: 704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !646, line: 35, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !706, line: 34, baseType: !707)
!706 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !706, line: 33, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !652, file: !646, line: 233, baseType: !710, size: 64, offset: 736)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !684, line: 170, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 162, size: 64, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !711, file: !684, line: 164, baseType: !53, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !711, file: !684, line: 169, baseType: !715, size: 32, offset: 32)
!715 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !711, file: !684, line: 165, size: 32, elements: !716)
!716 = !{!717, !720}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !715, file: !684, line: 167, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !719, line: 116, baseType: !53)
!719 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !715, file: !684, line: 168, baseType: !721, size: 32)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 32, elements: !397)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !652, file: !646, line: 234, baseType: !53, size: 32, offset: 800)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !645, file: !646, line: 386, baseType: !650, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !645, file: !646, line: 386, baseType: !650, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !645, file: !646, line: 388, baseType: !53, size: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !645, file: !646, line: 390, baseType: !643, size: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !645, file: !646, line: 392, baseType: !53, size: 32, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !645, file: !646, line: 394, baseType: !53, size: 32, offset: 224)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !645, file: !646, line: 395, baseType: !730, size: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !646, line: 45, flags: DIFlagFwdDecl)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !645, file: !646, line: 397, baseType: !733, size: 32, offset: 288)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !646, line: 349, size: 128, elements: !735)
!735 = !{!736, !749, !750, !751}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !734, file: !646, line: 352, baseType: !737, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !646, line: 52, size: 192, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !738, file: !646, line: 54, baseType: !737, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !738, file: !646, line: 55, baseType: !53, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !738, file: !646, line: 55, baseType: !53, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !738, file: !646, line: 55, baseType: !53, size: 32, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !738, file: !646, line: 55, baseType: !53, size: 32, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !738, file: !646, line: 56, baseType: !746, size: 32, offset: 160)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 32, elements: !302)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !646, line: 22, baseType: !748)
!748 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !734, file: !646, line: 353, baseType: !53, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !734, file: !646, line: 354, baseType: !737, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !734, file: !646, line: 355, baseType: !752, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !645, file: !646, line: 399, baseType: !754, size: 32, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !644}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !645, file: !646, line: 401, baseType: !53, size: 32, offset: 352)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !645, file: !646, line: 404, baseType: !53, size: 32, offset: 384)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !645, file: !646, line: 405, baseType: !643, size: 32, offset: 416)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !645, file: !646, line: 407, baseType: !761, size: 32, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !646, line: 324, size: 192, elements: !763)
!763 = !{!764, !766, !767, !768}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !762, file: !646, line: 325, baseType: !765, size: 48)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 48, elements: !695)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !762, file: !646, line: 326, baseType: !765, size: 48, offset: 48)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !762, file: !646, line: 327, baseType: !228, size: 16, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !762, file: !646, line: 330, baseType: !769, size: 64, offset: 128)
!769 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !645, file: !646, line: 408, baseType: !771, size: 32, offset: 480)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !646, line: 60, size: 288, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !772, file: !646, line: 62, baseType: !53, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !772, file: !646, line: 63, baseType: !53, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !772, file: !646, line: 64, baseType: !53, size: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !772, file: !646, line: 65, baseType: !53, size: 32, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !772, file: !646, line: 66, baseType: !53, size: 32, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !772, file: !646, line: 67, baseType: !53, size: 32, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !772, file: !646, line: 68, baseType: !53, size: 32, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !772, file: !646, line: 69, baseType: !53, size: 32, offset: 224)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !772, file: !646, line: 70, baseType: !53, size: 32, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !645, file: !646, line: 409, baseType: !643, size: 32, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !645, file: !646, line: 412, baseType: !785, size: 32, offset: 544)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !53}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !645, file: !646, line: 416, baseType: !790, size: 32, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !646, line: 90, size: 1120, elements: !792)
!792 = !{!793, !794, !795, !799}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !791, file: !646, line: 91, baseType: !790, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !791, file: !646, line: 92, baseType: !53, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !791, file: !646, line: 93, baseType: !796, size: 1024, offset: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 1024, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !791, file: !646, line: 94, baseType: !800, size: 32, offset: 1088)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !646, line: 79, size: 2112, elements: !802)
!802 = !{!803, !805, !806, !807}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !801, file: !646, line: 80, baseType: !804, size: 1024)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1024, elements: !797)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !801, file: !646, line: 81, baseType: !804, size: 1024, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !801, file: !646, line: 83, baseType: !747, size: 32, offset: 2048)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !801, file: !646, line: 86, baseType: !747, size: 32, offset: 2080)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !645, file: !646, line: 417, baseType: !791, size: 1120, offset: 608)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !645, file: !646, line: 420, baseType: !810, size: 96, offset: 1728)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !646, line: 296, size: 96, elements: !811)
!811 = !{!812, !814, !815}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !810, file: !646, line: 298, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !810, file: !646, line: 299, baseType: !53, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !810, file: !646, line: 300, baseType: !650, size: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !645, file: !646, line: 421, baseType: !650, size: 32, offset: 1824)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !645, file: !646, line: 422, baseType: !818, size: 32, offset: 1856)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !646, line: 359, size: 640, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !827, !828, !829, !830, !831, !832}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !819, file: !646, line: 362, baseType: !643, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !819, file: !646, line: 363, baseType: !710, size: 64, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !819, file: !646, line: 364, baseType: !710, size: 64, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !819, file: !646, line: 365, baseType: !710, size: 64, offset: 160)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !819, file: !646, line: 366, baseType: !826, size: 64, offset: 224)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 64, elements: !340)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !819, file: !646, line: 367, baseType: !53, size: 32, offset: 288)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !819, file: !646, line: 368, baseType: !710, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !819, file: !646, line: 369, baseType: !710, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !819, file: !646, line: 370, baseType: !710, size: 64, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !819, file: !646, line: 371, baseType: !710, size: 64, offset: 512)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !819, file: !646, line: 372, baseType: !710, size: 64, offset: 576)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !645, file: !646, line: 423, baseType: !643, size: 32, offset: 1888)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !719, line: 46, baseType: !7)
!835 = distinct !DICompileUnit(language: DW_LANG_C99, file: !836, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !837, globals: !838, splitDebugInlining: false, nameTableKind: None)
!836 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!837 = !{!643, !641}
!838 = !{!635}
!839 = !{!840, !841, !842, !843}
!840 = !DILocalVariable(name: "r", arg: 1, scope: !637, file: !638, line: 63, type: !644)
!841 = !DILocalVariable(name: "nbytes", arg: 2, scope: !637, file: !638, line: 63, type: !834)
!842 = !DILocalVariable(name: "prev_heap_end", scope: !637, file: !638, line: 67, type: !643)
!843 = !DILocalVariable(name: "stack", scope: !637, file: !638, line: 68, type: !643)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !846, file: !851, line: 4, type: !855, isLocal: false, isDefinition: true)
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !848, splitDebugInlining: false, nameTableKind: None)
!847 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!848 = !{!844, !849, !853}
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !846, file: !851, line: 5, type: !852, isLocal: false, isDefinition: true)
!851 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 88, elements: !190)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !846, file: !851, line: 6, type: !852, isLocal: false, isDefinition: true)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 248, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 31)
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !860, retainedTypes: !866, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!860 = !{!861}
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !862, line: 1209, baseType: !7, size: 32, elements: !863)
!862 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!863 = !{!864, !865}
!864 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!865 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!866 = !{!115, !114}
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !869, retainedTypes: !947, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!869 = !{!870}
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !871, line: 150, baseType: !7, size: 32, elements: !872)
!871 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!872 = !{!873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946}
!873 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!874 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!875 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!876 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!877 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!878 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!879 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!880 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!881 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!882 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!883 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!884 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!885 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!886 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!887 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!888 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!889 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!890 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!891 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!892 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!893 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!894 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!895 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!896 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!897 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!898 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!899 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!900 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!901 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!902 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!903 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!904 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!905 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!906 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!907 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!908 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!909 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!910 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!911 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!912 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!913 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!914 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!915 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!916 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!917 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!918 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!919 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!920 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!921 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!922 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!923 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!924 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!925 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!926 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!927 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!928 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!929 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!930 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!931 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!932 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!933 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!934 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!935 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!936 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!937 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!938 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!939 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!940 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!941 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!942 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!943 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!944 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!945 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!946 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!947 = !{!115, !205}
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !950, splitDebugInlining: false, nameTableKind: None)
!949 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!950 = !{!951, !976}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !335, line: 418, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 395, size: 1120, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !953, file: !335, line: 397, baseType: !372, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !953, file: !335, line: 398, baseType: !207, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !953, file: !335, line: 399, baseType: !207, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !953, file: !335, line: 400, baseType: !207, size: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !953, file: !335, line: 401, baseType: !207, size: 32, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !953, file: !335, line: 402, baseType: !207, size: 32, offset: 160)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !953, file: !335, line: 403, baseType: !379, size: 96, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !953, file: !335, line: 404, baseType: !207, size: 32, offset: 288)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !953, file: !335, line: 405, baseType: !207, size: 32, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !953, file: !335, line: 406, baseType: !207, size: 32, offset: 352)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !953, file: !335, line: 407, baseType: !207, size: 32, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !953, file: !335, line: 408, baseType: !207, size: 32, offset: 416)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !953, file: !335, line: 409, baseType: !207, size: 32, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !953, file: !335, line: 410, baseType: !207, size: 32, offset: 480)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !953, file: !335, line: 411, baseType: !390, size: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !953, file: !335, line: 412, baseType: !372, size: 32, offset: 576)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !953, file: !335, line: 413, baseType: !372, size: 32, offset: 608)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !953, file: !335, line: 414, baseType: !396, size: 128, offset: 640)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !953, file: !335, line: 415, baseType: !400, size: 160, offset: 768)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !953, file: !335, line: 416, baseType: !404, size: 160, offset: 928)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !953, file: !335, line: 417, baseType: !207, size: 32, offset: 1088)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !335, line: 378, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 363, size: 28704, elements: !979)
!979 = !{!980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !978, file: !335, line: 365, baseType: !339, size: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !978, file: !335, line: 366, baseType: !343, size: 768, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !978, file: !335, line: 367, baseType: !339, size: 256, offset: 1024)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !978, file: !335, line: 368, baseType: !343, size: 768, offset: 1280)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !978, file: !335, line: 369, baseType: !339, size: 256, offset: 2048)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !978, file: !335, line: 370, baseType: !343, size: 768, offset: 2304)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !978, file: !335, line: 371, baseType: !339, size: 256, offset: 3072)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !978, file: !335, line: 372, baseType: !343, size: 768, offset: 3328)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !978, file: !335, line: 373, baseType: !339, size: 256, offset: 4096)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !978, file: !335, line: 374, baseType: !354, size: 1792, offset: 4352)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !978, file: !335, line: 375, baseType: !358, size: 1920, offset: 6144)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !978, file: !335, line: 376, baseType: !363, size: 20608, offset: 8064)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !978, file: !335, line: 377, baseType: !207, size: 32, offset: 28672)
!993 = distinct !DICompileUnit(language: DW_LANG_C99, file: !994, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !995, splitDebugInlining: false, nameTableKind: None)
!994 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!995 = !{!996, !870}
!996 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !997, line: 55, baseType: !7, size: 32, elements: !998)
!997 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026}
!999 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!1000 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!1001 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!1002 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!1003 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!1004 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!1005 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!1006 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!1007 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!1008 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!1009 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!1010 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!1011 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!1012 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!1013 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!1014 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!1015 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!1016 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!1017 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!1018 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!1019 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!1020 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!1021 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!1022 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!1023 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!1024 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!1025 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!1026 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!1027 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1028, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1028 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!1029 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1030, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1031, retainedTypes: !1064, splitDebugInlining: false, nameTableKind: None)
!1030 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!1031 = !{!1032, !533, !996, !1039, !1045, !1049, !1053, !1059}
!1032 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1033, line: 233, baseType: !53, size: 32, elements: !1034)
!1033 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!1034 = !{!1035, !1036, !1037, !1038}
!1035 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!1036 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!1037 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!1038 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!1039 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1033, line: 224, baseType: !53, size: 32, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044}
!1041 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!1042 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!1043 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!1044 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!1045 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1033, line: 217, baseType: !7, size: 32, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!1048 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!1049 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1033, line: 210, baseType: !7, size: 32, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!1052 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!1053 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1033, line: 242, baseType: !7, size: 32, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058}
!1055 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!1056 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!1057 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!1058 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!1059 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1060, line: 57, baseType: !7, size: 32, elements: !1061)
!1060 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/uart_loopback_data_dma/GCC")
!1061 = !{!1062, !1063}
!1062 = !DIEnumerator(name: "eDirection_IN", value: 0)
!1063 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!1064 = !{!1065, !161, !1066, !128, !1067, !1068}
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !997, line: 87, baseType: !996)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !1033, line: 220, baseType: !1045)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !1033, line: 247, baseType: !1053)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !1060, line: 60, baseType: !1059)
!1069 = !{!"Ubuntu clang version 14.0.6"}
!1070 = !{i32 7, !"Dwarf Version", i32 2}
!1071 = !{i32 2, !"Debug Info Version", i32 3}
!1072 = !{i32 1, !"wchar_size", i32 4}
!1073 = !{i32 1, !"min_enum_size", i32 4}
!1074 = !{i32 1, !"branch-target-enforcement", i32 0}
!1075 = !{i32 1, !"sign-return-address", i32 0}
!1076 = !{i32 1, !"sign-return-address-all", i32 0}
!1077 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!1078 = !{i32 7, !"frame-pointer", i32 2}
!1079 = distinct !DISubprogram(name: "DMA_ERROR_LISR", scope: !3, file: !3, line: 509, type: !181, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1080)
!1080 = !{}
!1081 = !DILocation(line: 511, column: 5, scope: !1079)
!1082 = distinct !{!1082, !1081, !1083}
!1083 = !DILocation(line: 511, column: 14, scope: !1079)
!1084 = distinct !DISubprogram(name: "DMA_Stop", scope: !3, file: !3, line: 73, type: !1085, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1087)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{null, !128}
!1087 = !{!1088}
!1088 = !DILocalVariable(name: "channel", arg: 1, scope: !1084, file: !3, line: 73, type: !128)
!1089 = !DILocation(line: 0, scope: !1084)
!1090 = !DILocation(line: 75, column: 5, scope: !1084)
!1091 = !DILocation(line: 76, column: 5, scope: !1084)
!1092 = !DILocation(line: 77, column: 1, scope: !1084)
!1093 = distinct !DISubprogram(name: "DMA_Run", scope: !3, file: !3, line: 79, type: !1085, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1094)
!1094 = !{!1095}
!1095 = !DILocalVariable(name: "channel", arg: 1, scope: !1093, file: !3, line: 79, type: !128)
!1096 = !DILocation(line: 0, scope: !1093)
!1097 = !DILocation(line: 81, column: 5, scope: !1093)
!1098 = !DILocation(line: 82, column: 5, scope: !1093)
!1099 = !DILocation(line: 83, column: 1, scope: !1093)
