; ModuleID = 'build/96b_wistrio/integration/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.ztest_suite_stats = type { i32, i32, i32 }
%struct.ztest_suite_node = type { i8*, i8* ()*, void (i8*)*, void (i8*)*, void (i8*)*, i1 (i8*)*, %struct.ztest_suite_stats* }
%struct.ztest_unit_test_stats = type { i32, i32, i32, i32, i32 }
%struct.ztest_unit_test = type { i8*, i8*, void (i8*)*, i32, %struct.ztest_unit_test_stats* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.z_thread_stack_element = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, [32 x i8], i32, %struct.ztest_suite_stats, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "z_ztest_suite_node_stats_framework_tests", scope: !27, file: !111, line: 10, type: !149, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !108, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/testsuite/integration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_NODE", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_STATS", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_ZTEST_UNIT_TEST", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_ZTEST_TEST_RULE", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 68)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 69)
!104 = !DIEnumerator(name: "K_OBJ_LAST", value: 70)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !{!109, !155, !25, !173}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_ztest_test_node_framework_tests", scope: !27, file: !111, line: 10, type: !112, isLocal: true, isDefinition: true, align: 32)
!111 = !DIFile(filename: "zephyr/samples/subsys/testsuite/integration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !115)
!114 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/include/zephyr/ztest_test_new.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !{!116, !121, !127, !133, !136, !139, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 179, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !113, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_setup_t", file: !114, line: 141, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!106}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !113, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_before_t", file: !114, line: 148, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !106}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !113, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_after_t", file: !114, line: 155, baseType: !130)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !113, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_teardown_t", file: !114, line: 162, baseType: !130)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !113, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_predicate_t", file: !114, line: 171, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !13}
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !113, file: !114, line: 197, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !150)
!150 = !{!151, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !149, file: !114, line: 116, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !149, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !149, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "z_ztest_unit_test__framework_tests__test_assert", scope: !27, file: !111, line: 18, type: !157, isLocal: true, isDefinition: true, align: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test", file: !114, line: 97, size: 160, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "test_suite_name", scope: !157, file: !114, line: 98, baseType: !118, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !114, line: 99, baseType: !118, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !157, file: !114, line: 100, baseType: !130, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "thread_options", scope: !157, file: !114, line: 101, baseType: !152, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !157, file: !114, line: 104, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test_stats", file: !114, line: 123, size: 160, elements: !167)
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !166, file: !114, line: 125, baseType: !152, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !166, file: !114, line: 127, baseType: !152, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !166, file: !114, line: 129, baseType: !152, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pass_count", scope: !166, file: !114, line: 131, baseType: !152, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "duration_worst_ms", scope: !166, file: !114, line: 133, baseType: !152, size: 32, offset: 128)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_ztest_unit_test_stats_framework_tests_test_assert", scope: !27, file: !111, line: 18, type: !166, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !177, file: !200, line: 18, type: !201, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !179, globals: !199, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!179 = !{!22, !106, !24, !180, !182, !184, !185, !107, !187, !188, !190, !192, !193, !194, !197, !118}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 214, baseType: !32)
!186 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !196)
!196 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !198)
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !{!175}
!200 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 17, baseType: !118, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "_char_out", scope: !209, file: !212, line: 54, type: !213, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !211, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!211 = !{!207}
!212 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!107, !107}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !218, file: !248, line: 60, type: !249, isLocal: true, isDefinition: true, align: 32)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !220, globals: !247, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!220 = !{!221, !241}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !223, line: 386, baseType: !224)
!223 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !223, line: 370, size: 448, elements: !225)
!225 = !{!226, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !224, file: !223, line: 372, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !152)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !224, file: !223, line: 373, baseType: !227, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !224, file: !223, line: 374, baseType: !227, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !224, file: !223, line: 375, baseType: !227, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !224, file: !223, line: 376, baseType: !227, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !224, file: !223, line: 377, baseType: !227, size: 32, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !224, file: !223, line: 378, baseType: !227, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !224, file: !223, line: 379, baseType: !227, size: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !224, file: !223, line: 380, baseType: !227, size: 32, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !224, file: !223, line: 381, baseType: !227, size: 32, offset: 288)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !224, file: !223, line: 382, baseType: !227, size: 32, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !224, file: !223, line: 383, baseType: !227, size: 32, offset: 352)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !224, file: !223, line: 384, baseType: !227, size: 32, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !224, file: !223, line: 385, baseType: !227, size: 32, offset: 416)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !223, line: 364, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !223, line: 360, size: 64, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !243, file: !223, line: 362, baseType: !227, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !243, file: !223, line: 363, baseType: !227, size: 32, offset: 32)
!247 = !{!216}
!248 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !251, line: 51, size: 64, elements: !252)
!251 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = !{!253, !278}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !250, file: !251, line: 60, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!107, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !260, line: 378, size: 192, elements: !261)
!260 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !{!262, !263, !264, !265, !271, !272}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !259, file: !260, line: 380, baseType: !118, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !259, file: !260, line: 382, baseType: !13, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !259, file: !260, line: 384, baseType: !13, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !259, file: !260, line: 386, baseType: !266, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !260, line: 351, size: 16, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !267, file: !260, line: 359, baseType: !195, size: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !267, file: !260, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !259, file: !260, line: 388, baseType: !106, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !259, file: !260, line: 396, baseType: !273, size: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !260, line: 43, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !277)
!277 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !250, file: !251, line: 65, baseType: !257, size: 32, offset: 32)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !281, file: !284, line: 71, type: !285, isLocal: true, isDefinition: true, align: 32)
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !283, splitDebugInlining: false, nameTableKind: None)
!282 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!283 = !{!279}
!284 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !251, line: 51, size: 64, elements: !287)
!287 = !{!288, !307}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !286, file: !251, line: 60, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{!107, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !260, line: 378, size: 192, elements: !295)
!295 = !{!296, !297, !298, !299, !305, !306}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !294, file: !260, line: 380, baseType: !118, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !294, file: !260, line: 382, baseType: !13, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !294, file: !260, line: 384, baseType: !13, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !294, file: !260, line: 386, baseType: !300, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !260, line: 351, size: 16, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !301, file: !260, line: 359, baseType: !195, size: 8)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !301, file: !260, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !260, line: 388, baseType: !106, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !294, file: !260, line: 396, baseType: !273, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !286, file: !251, line: 65, baseType: !292, size: 32, offset: 32)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !310, file: !317, line: 17, type: !464, isLocal: false, isDefinition: true)
!310 = distinct !DICompileUnit(language: DW_LANG_C99, file: !311, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !312, globals: !313, splitDebugInlining: false, nameTableKind: None)
!311 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!312 = !{!185, !107, !152, !106}
!313 = !{!308, !314, !460}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !316, file: !317, line: 198, type: !446, isLocal: true, isDefinition: true)
!316 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !317, file: !317, line: 175, type: !318, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !310, retainedNodes: !441)
!317 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!318 = !DISubroutineType(types: !319)
!319 = !{null, !320}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !322, line: 245, size: 1280, elements: !323)
!322 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!323 = !{!324, !390, !403, !404, !405, !409, !410, !416, !436}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !321, file: !322, line: 247, baseType: !325, size: 384)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !322, line: 57, size: 384, elements: !326)
!326 = !{!327, !355, !363, !364, !365, !376, !377, !378}
!327 = !DIDerivedType(tag: DW_TAG_member, scope: !325, file: !322, line: 60, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !325, file: !322, line: 60, size: 64, elements: !329)
!329 = !{!330, !346}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !328, file: !322, line: 61, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !332, line: 49, baseType: !333)
!332 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !332, line: 37, size: 64, elements: !334)
!334 = !{!335, !341}
!335 = !DIDerivedType(tag: DW_TAG_member, scope: !333, file: !332, line: 38, baseType: !336, size: 32)
!336 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !333, file: !332, line: 38, size: 32, elements: !337)
!337 = !{!338, !340}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !336, file: !332, line: 39, baseType: !339, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !336, file: !332, line: 40, baseType: !339, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !333, file: !332, line: 42, baseType: !342, size: 32, offset: 32)
!342 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !333, file: !332, line: 42, size: 32, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !342, file: !332, line: 43, baseType: !339, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !342, file: !332, line: 44, baseType: !339, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !328, file: !322, line: 62, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !348, line: 49, size: 64, elements: !349)
!348 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !347, file: !348, line: 50, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 64, elements: !353)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!353 = !{!354}
!354 = !DISubrange(count: 2)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !325, file: !322, line: 68, baseType: !356, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !358, line: 233, baseType: !359)
!358 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !358, line: 231, size: 64, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !359, file: !358, line: 232, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !332, line: 48, baseType: !333)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !325, file: !322, line: 71, baseType: !195, size: 8, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !325, file: !322, line: 74, baseType: !195, size: 8, offset: 104)
!365 = !DIDerivedType(tag: DW_TAG_member, scope: !325, file: !322, line: 90, baseType: !366, size: 16, offset: 112)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !325, file: !322, line: 90, size: 16, elements: !367)
!367 = !{!368, !375}
!368 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !322, line: 91, baseType: !369, size: 16)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !366, file: !322, line: 91, size: 16, elements: !370)
!370 = !{!371, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !369, file: !322, line: 96, baseType: !372, size: 8)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !373)
!373 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !369, file: !322, line: 97, baseType: !195, size: 8, offset: 8)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !366, file: !322, line: 100, baseType: !197, size: 16)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !325, file: !322, line: 107, baseType: !152, size: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !325, file: !322, line: 127, baseType: !106, size: 32, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !325, file: !322, line: 131, baseType: !379, size: 192, offset: 192)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !358, line: 244, size: 192, elements: !380)
!380 = !{!381, !382, !388}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !379, file: !358, line: 245, baseType: !331, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !379, file: !358, line: 246, baseType: !383, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !358, line: 242, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !379, file: !358, line: 249, baseType: !389, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !191)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !321, file: !322, line: 250, baseType: !391, size: 288, offset: 384)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !392, line: 25, size: 288, elements: !393)
!392 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !391, file: !392, line: 26, baseType: !152, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !391, file: !392, line: 27, baseType: !152, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !391, file: !392, line: 28, baseType: !152, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !391, file: !392, line: 29, baseType: !152, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !391, file: !392, line: 30, baseType: !152, size: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !391, file: !392, line: 31, baseType: !152, size: 32, offset: 160)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !391, file: !392, line: 32, baseType: !152, size: 32, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !391, file: !392, line: 33, baseType: !152, size: 32, offset: 224)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !391, file: !392, line: 34, baseType: !152, size: 32, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !321, file: !322, line: 253, baseType: !106, size: 32, offset: 672)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !321, file: !322, line: 256, baseType: !357, size: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !321, file: !322, line: 279, baseType: !406, size: 256, offset: 768)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !321, file: !322, line: 294, baseType: !107, size: 32, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !321, file: !322, line: 300, baseType: !411, size: 96, offset: 1056)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !322, line: 149, size: 96, elements: !412)
!412 = !{!413, !414, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !411, file: !322, line: 153, baseType: !22, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !411, file: !322, line: 162, baseType: !185, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !411, file: !322, line: 168, baseType: !185, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !321, file: !322, line: 325, baseType: !417, size: 32, offset: 1152)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !419, line: 5073, size: 192, elements: !420)
!419 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = !{!421, !430, !431}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !418, file: !419, line: 5074, baseType: !422, size: 96)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !423, line: 56, size: 96, elements: !424)
!423 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!424 = !{!425, !428, !429}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !422, file: !423, line: 57, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !423, line: 57, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !422, file: !423, line: 58, baseType: !106, size: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !422, file: !423, line: 59, baseType: !185, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !418, file: !419, line: 5075, baseType: !357, size: 64, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !418, file: !419, line: 5076, baseType: !432, size: 32, offset: 160)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !433, line: 43, size: 32, elements: !434)
!433 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !432, file: !433, line: 52, baseType: !22, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !321, file: !322, line: 343, baseType: !437, size: 64, offset: 1184)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !392, line: 60, size: 64, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !437, file: !392, line: 63, baseType: !152, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !437, file: !392, line: 66, baseType: !152, size: 32, offset: 32)
!441 = !{!442, !443, !444, !445}
!442 = !DILocalVariable(name: "thread", arg: 1, scope: !316, file: !317, line: 175, type: !320)
!443 = !DILocalVariable(name: "region_num", scope: !316, file: !317, line: 200, type: !195)
!444 = !DILocalVariable(name: "guard_start", scope: !316, file: !317, line: 265, type: !22)
!445 = !DILocalVariable(name: "guard_size", scope: !316, file: !317, line: 266, type: !185)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 96, elements: !458)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !448, line: 52, size: 96, elements: !449)
!448 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !447, file: !448, line: 53, baseType: !22, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !447, file: !448, line: 54, baseType: !185, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !447, file: !448, line: 55, baseType: !453, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !454, line: 151, baseType: !455)
!454 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !454, line: 149, size: 32, elements: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !455, file: !454, line: 150, baseType: !152, size: 32)
!458 = !{!459}
!459 = !DISubrange(count: 1)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "static_regions", scope: !310, file: !317, line: 62, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 96, elements: !458)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !465, file: !203, line: 17, baseType: !118, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !465, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !471, file: !504, line: 39, type: !195, isLocal: true, isDefinition: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !473, globals: !503, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!473 = !{!474, !106, !107, !491, !195}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !476, line: 1168, baseType: !477)
!476 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 1155, size: 352, elements: !478)
!478 = !{!479, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !477, file: !476, line: 1157, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !477, file: !476, line: 1158, baseType: !227, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !477, file: !476, line: 1159, baseType: !227, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !477, file: !476, line: 1160, baseType: !227, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !477, file: !476, line: 1161, baseType: !227, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !477, file: !476, line: 1162, baseType: !227, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !477, file: !476, line: 1163, baseType: !227, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !477, file: !476, line: 1164, baseType: !227, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !477, file: !476, line: 1165, baseType: !227, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !477, file: !476, line: 1166, baseType: !227, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !477, file: !476, line: 1167, baseType: !227, size: 32, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !494, line: 27, size: 96, elements: !495)
!494 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !493, file: !494, line: 29, baseType: !152, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !493, file: !494, line: 31, baseType: !118, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !493, file: !494, line: 37, baseType: !499, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !454, line: 146, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !454, line: 141, size: 32, elements: !501)
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !500, file: !454, line: 143, baseType: !152, size: 32)
!503 = !{!469}
!504 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !507, file: !514, line: 21, type: !213, isLocal: true, isDefinition: true)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !509, globals: !513, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!509 = !{!510, !107, !106}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !512, line: 22, baseType: !107)
!512 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!513 = !{!505}
!514 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !517, file: !522, line: 13, type: !539, isLocal: true, isDefinition: true)
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !519, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!519 = !{!520, !515}
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "mpu_config", scope: !517, file: !522, line: 37, type: !523, isLocal: false, isDefinition: true)
!522 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !494, line: 41, size: 64, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !524, file: !494, line: 43, baseType: !152, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !524, file: !494, line: 45, baseType: !528, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !494, line: 27, size: 96, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !530, file: !494, line: 29, baseType: !152, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !530, file: !494, line: 31, baseType: !118, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !530, file: !494, line: 37, baseType: !535, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !454, line: 146, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !454, line: 141, size: 32, elements: !537)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !536, file: !454, line: 143, baseType: !152, size: 32)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 192, elements: !353)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !542, file: !639, line: 36, type: !640, isLocal: true, isDefinition: true, align: 32)
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !544, retainedTypes: !556, globals: !638, splitDebugInlining: false, nameTableKind: None)
!543 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!544 = !{!545, !551}
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !546, line: 506, baseType: !32, size: 32, elements: !547)
!546 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = !{!548, !549, !550}
!548 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!549 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!550 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!551 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !546, line: 512, baseType: !32, size: 32, elements: !552)
!552 = !{!553, !554, !555}
!553 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!554 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!555 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!556 = !{!557, !627, !632, !592, !551, !545, !637, !106}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !546, line: 523, size: 288, elements: !560)
!560 = !{!561, !582, !588, !593, !597, !598, !599, !603, !623}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !559, file: !546, line: 524, baseType: !562, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DISubroutineType(types: !564)
!564 = !{!107, !565, !580, !581}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !260, line: 378, size: 192, elements: !568)
!568 = !{!569, !570, !571, !572, !578, !579}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !567, file: !260, line: 380, baseType: !118, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !567, file: !260, line: 382, baseType: !13, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !567, file: !260, line: 384, baseType: !13, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !567, file: !260, line: 386, baseType: !573, size: 32, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !260, line: 351, size: 16, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !574, file: !260, line: 359, baseType: !195, size: 8)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !574, file: !260, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !567, file: !260, line: 388, baseType: !106, size: 32, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !567, file: !260, line: 396, baseType: !273, size: 32, offset: 160)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !546, line: 237, baseType: !195)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !546, line: 257, baseType: !152)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !559, file: !546, line: 530, baseType: !583, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 32)
!584 = !DISubroutineType(types: !585)
!585 = !{!107, !565, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !546, line: 229, baseType: !152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !559, file: !546, line: 532, baseType: !589, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DISubroutineType(types: !591)
!591 = !{!107, !565, !592, !587}
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !546, line: 216, baseType: !152)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !559, file: !546, line: 535, baseType: !594, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DISubroutineType(types: !596)
!596 = !{!107, !565, !592}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !559, file: !546, line: 537, baseType: !594, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !559, file: !546, line: 539, baseType: !594, size: 32, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !559, file: !546, line: 541, baseType: !600, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = !DISubroutineType(types: !602)
!602 = !{!107, !565, !580, !545, !551}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !559, file: !546, line: 544, baseType: !604, size: 32, offset: 224)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!605 = !DISubroutineType(types: !606)
!606 = !{!107, !565, !607, !145}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !546, line: 478, size: 96, elements: !609)
!609 = !{!610, !617, !622}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !608, file: !546, line: 482, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !612, line: 33, baseType: !613)
!612 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !612, line: 29, size: 32, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !613, file: !612, line: 30, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !608, file: !546, line: 485, baseType: !618, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !546, line: 464, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !565, !607, !592}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !608, file: !546, line: 493, baseType: !592, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !559, file: !546, line: 547, baseType: !624, size: 32, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = !DISubroutineType(types: !626)
!626 = !{!152, !565}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !546, line: 428, size: 32, elements: !630)
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !629, file: !546, line: 434, baseType: !592, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !546, line: 441, size: 32, elements: !635)
!635 = !{!636}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !634, file: !546, line: 447, baseType: !592, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!638 = !{!540}
!639 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !251, line: 51, size: 64, elements: !642)
!642 = !{!643, !647}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !641, file: !251, line: 60, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = !DISubroutineType(types: !646)
!646 = !{!107, !565}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !641, file: !251, line: 65, baseType: !565, size: 32, offset: 32)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "phase", scope: !650, file: !654, line: 61, type: !653, isLocal: false, isDefinition: true)
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !652, retainedTypes: !679, globals: !689, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!652 = !{!653, !662, !670, !30, !675}
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_phase", file: !654, line: 40, baseType: !32, size: 32, elements: !655)
!654 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!655 = !{!656, !657, !658, !659, !660, !661}
!656 = !DIEnumerator(name: "TEST_PHASE_SETUP", value: 0)
!657 = !DIEnumerator(name: "TEST_PHASE_BEFORE", value: 1)
!658 = !DIEnumerator(name: "TEST_PHASE_TEST", value: 2)
!659 = !DIEnumerator(name: "TEST_PHASE_AFTER", value: 3)
!660 = !DIEnumerator(name: "TEST_PHASE_TEARDOWN", value: 4)
!661 = !DIEnumerator(name: "TEST_PHASE_FRAMEWORK", value: 5)
!662 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_result", file: !654, line: 226, baseType: !32, size: 32, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669}
!664 = !DIEnumerator(name: "ZTEST_RESULT_PENDING", value: 0)
!665 = !DIEnumerator(name: "ZTEST_RESULT_PASS", value: 1)
!666 = !DIEnumerator(name: "ZTEST_RESULT_FAIL", value: 2)
!667 = !DIEnumerator(name: "ZTEST_RESULT_SKIP", value: 3)
!668 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_SKIP", value: 4)
!669 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_FAIL", value: 5)
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_status", file: !654, line: 52, baseType: !32, size: 32, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIEnumerator(name: "ZTEST_STATUS_OK", value: 0)
!673 = !DIEnumerator(name: "ZTEST_STATUS_HAS_FAILURE", value: 1)
!674 = !DIEnumerator(name: "ZTEST_STATUS_CRITICAL_ERROR", value: 2)
!675 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_expected_result", file: !114, line: 36, baseType: !32, size: 32, elements: !676)
!676 = !{!677, !678}
!677 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_FAIL", value: 0)
!678 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_SKIP", value: 1)
!679 = !{!106, !107, !185, !680, !685, !152, !687}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !681, line: 46, baseType: !682)
!681 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !106, !106, !106}
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !686, line: 46, baseType: !389)
!686 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !688)
!688 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!689 = !{!648, !690, !692, !694, !703, !705, !809, !812}
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "test_result", scope: !650, file: !654, line: 234, type: !662, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "current_test_failed_assumption", scope: !650, file: !654, line: 294, type: !145, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "ztest_thread_stack", scope: !650, file: !654, line: 430, type: !696, isLocal: false, isDefinition: true, align: 512)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 8704, elements: !701)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !698, line: 47, size: 8, elements: !699)
!698 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !698, line: 48, baseType: !120, size: 8)
!701 = !{!702}
!702 = !DISubrange(count: 1088)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "test_status", scope: !650, file: !654, line: 63, type: !670, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "ztest_thread", scope: !650, file: !654, line: 17, type: !707, isLocal: true, isDefinition: true)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !322, line: 245, size: 1280, elements: !708)
!708 = !{!709, !767, !779, !780, !781, !782, !783, !789, !804}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !707, file: !322, line: 247, baseType: !710, size: 384)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !322, line: 57, size: 384, elements: !711)
!711 = !{!712, !736, !743, !744, !745, !754, !755, !756}
!712 = !DIDerivedType(tag: DW_TAG_member, scope: !710, file: !322, line: 60, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !710, file: !322, line: 60, size: 64, elements: !714)
!714 = !{!715, !730}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !713, file: !322, line: 61, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !332, line: 49, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !332, line: 37, size: 64, elements: !718)
!718 = !{!719, !725}
!719 = !DIDerivedType(tag: DW_TAG_member, scope: !717, file: !332, line: 38, baseType: !720, size: 32)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !717, file: !332, line: 38, size: 32, elements: !721)
!721 = !{!722, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !720, file: !332, line: 39, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !332, line: 40, baseType: !723, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, scope: !717, file: !332, line: 42, baseType: !726, size: 32, offset: 32)
!726 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !717, file: !332, line: 42, size: 32, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !726, file: !332, line: 43, baseType: !723, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !726, file: !332, line: 44, baseType: !723, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !713, file: !322, line: 62, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !348, line: 49, size: 64, elements: !732)
!732 = !{!733}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !731, file: !348, line: 50, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 64, elements: !353)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !710, file: !322, line: 68, baseType: !737, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !358, line: 233, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !358, line: 231, size: 64, elements: !740)
!740 = !{!741}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !739, file: !358, line: 232, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !332, line: 48, baseType: !717)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !710, file: !322, line: 71, baseType: !195, size: 8, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !710, file: !322, line: 74, baseType: !195, size: 8, offset: 104)
!745 = !DIDerivedType(tag: DW_TAG_member, scope: !710, file: !322, line: 90, baseType: !746, size: 16, offset: 112)
!746 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !710, file: !322, line: 90, size: 16, elements: !747)
!747 = !{!748, !753}
!748 = !DIDerivedType(tag: DW_TAG_member, scope: !746, file: !322, line: 91, baseType: !749, size: 16)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !746, file: !322, line: 91, size: 16, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !749, file: !322, line: 96, baseType: !372, size: 8)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !749, file: !322, line: 97, baseType: !195, size: 8, offset: 8)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !746, file: !322, line: 100, baseType: !197, size: 16)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !710, file: !322, line: 107, baseType: !152, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !710, file: !322, line: 127, baseType: !106, size: 32, offset: 160)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !710, file: !322, line: 131, baseType: !757, size: 192, offset: 192)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !358, line: 244, size: 192, elements: !758)
!758 = !{!759, !760, !766}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !757, file: !358, line: 245, baseType: !716, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !757, file: !358, line: 246, baseType: !761, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !358, line: 242, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !757, file: !358, line: 249, baseType: !389, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !707, file: !322, line: 250, baseType: !768, size: 288, offset: 384)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !392, line: 25, size: 288, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !768, file: !392, line: 26, baseType: !152, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !768, file: !392, line: 27, baseType: !152, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !768, file: !392, line: 28, baseType: !152, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !768, file: !392, line: 29, baseType: !152, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !768, file: !392, line: 30, baseType: !152, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !768, file: !392, line: 31, baseType: !152, size: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !768, file: !392, line: 32, baseType: !152, size: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !768, file: !392, line: 33, baseType: !152, size: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !768, file: !392, line: 34, baseType: !152, size: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !707, file: !322, line: 253, baseType: !106, size: 32, offset: 672)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !707, file: !322, line: 256, baseType: !738, size: 64, offset: 704)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !707, file: !322, line: 279, baseType: !406, size: 256, offset: 768)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !707, file: !322, line: 294, baseType: !107, size: 32, offset: 1024)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !707, file: !322, line: 300, baseType: !784, size: 96, offset: 1056)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !322, line: 149, size: 96, elements: !785)
!785 = !{!786, !787, !788}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !784, file: !322, line: 153, baseType: !22, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !784, file: !322, line: 162, baseType: !185, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !784, file: !322, line: 168, baseType: !185, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !707, file: !322, line: 325, baseType: !790, size: 32, offset: 1152)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !419, line: 5073, size: 192, elements: !792)
!792 = !{!793, !799, !800}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !791, file: !419, line: 5074, baseType: !794, size: 96)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !423, line: 56, size: 96, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !794, file: !423, line: 57, baseType: !426, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !794, file: !423, line: 58, baseType: !106, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !794, file: !423, line: 59, baseType: !185, size: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !791, file: !419, line: 5075, baseType: !738, size: 64, offset: 96)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !791, file: !419, line: 5076, baseType: !801, size: 32, offset: 160)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !433, line: 43, size: 32, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !801, file: !433, line: 52, baseType: !22, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !707, file: !322, line: 343, baseType: !805, size: 64, offset: 1184)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !392, line: 60, size: 64, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !805, file: !392, line: 63, baseType: !152, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !805, file: !392, line: 66, baseType: !152, size: 32, offset: 32)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "tc_start_time", scope: !650, file: !811, line: 95, type: !152, isLocal: true, isDefinition: true)
!811 = !DIFile(filename: "zephyr/subsys/testsuite/include/zephyr/tc_util.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "tc_spend_time", scope: !650, file: !811, line: 96, type: !152, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "ztest_api", scope: !817, file: !820, line: 70, type: !821, isLocal: false, isDefinition: true)
!817 = distinct !DICompileUnit(language: DW_LANG_C99, file: !818, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !819, splitDebugInlining: false, nameTableKind: None)
!818 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!819 = !{!815}
!820 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_arch_api", file: !114, line: 499, size: 96, elements: !823)
!823 = !{!824, !825, !846}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "run_all", scope: !822, file: !114, line: 500, baseType: !16, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "should_suite_run", scope: !822, file: !114, line: 501, baseType: !826, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DISubroutineType(types: !828)
!828 = !{!145, !13, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !830, file: !114, line: 179, baseType: !117, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !830, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !830, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !830, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !830, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !830, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !830, file: !114, line: 197, baseType: !839, size: 32, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !842)
!842 = !{!843, !844, !845}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !841, file: !114, line: 116, baseType: !152, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !841, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !841, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "should_test_run", scope: !822, file: !114, line: 502, baseType: !847, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DISubroutineType(types: !849)
!849 = !{!145, !118, !118}
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !852, file: !924, line: 48, type: !1000, isLocal: true, isDefinition: true)
!852 = distinct !DICompileUnit(language: DW_LANG_C99, file: !853, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !854, retainedTypes: !910, globals: !921, splitDebugInlining: false, nameTableKind: None)
!853 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!854 = !{!30, !855}
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !223, line: 69, baseType: !107, size: 32, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!857 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!858 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!859 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!860 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!861 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!862 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!863 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!864 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!865 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!866 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!867 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!868 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!869 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!870 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!871 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!872 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!873 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!874 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!875 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!876 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!877 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!878 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!879 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!880 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!881 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!882 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!883 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!884 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!885 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!886 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!887 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!888 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!889 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!890 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!891 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!892 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!893 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!894 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!895 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!896 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!897 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!898 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!899 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!900 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!901 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!902 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!903 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!904 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!905 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!906 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!907 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!908 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!909 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!910 = !{!185, !107, !106, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !223, line: 270, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !223, line: 262, size: 192, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !913, file: !223, line: 264, baseType: !227, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !913, file: !223, line: 265, baseType: !227, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !913, file: !223, line: 266, baseType: !227, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !913, file: !223, line: 267, baseType: !227, size: 32, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !913, file: !223, line: 268, baseType: !227, size: 32, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !913, file: !223, line: 269, baseType: !227, size: 32, offset: 160)
!921 = !{!922, !928, !944, !955, !972, !850, !974, !988, !990, !992, !994, !996, !998}
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !852, file: !924, line: 424, type: !925, isLocal: false, isDefinition: true, align: 16)
!924 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 64, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 4)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !852, file: !924, line: 424, type: !930, isLocal: false, isDefinition: true, align: 32)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !260, line: 378, size: 192, elements: !932)
!932 = !{!933, !934, !935, !936, !942, !943}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !260, line: 380, baseType: !118, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !931, file: !260, line: 382, baseType: !13, size: 32, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !931, file: !260, line: 384, baseType: !13, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !931, file: !260, line: 386, baseType: !937, size: 32, offset: 96)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !260, line: 351, size: 16, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !938, file: !260, line: 359, baseType: !195, size: 8)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !938, file: !260, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !931, file: !260, line: 388, baseType: !106, size: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !931, file: !260, line: 396, baseType: !273, size: 32, offset: 160)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !852, file: !924, line: 424, type: !946, isLocal: true, isDefinition: true, align: 32)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !251, line: 51, size: 64, elements: !948)
!948 = !{!949, !954}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !947, file: !251, line: 60, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DISubroutineType(types: !952)
!952 = !{!107, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !947, file: !251, line: 65, baseType: !953, size: 32, offset: 32)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "exti_data", scope: !852, file: !924, line: 423, type: !957, isLocal: true, isDefinition: true)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !924, line: 107, size: 1024, elements: !958)
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !957, file: !924, line: 109, baseType: !960, size: 1024)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 1024, elements: !970)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !924, line: 101, size: 64, elements: !962)
!962 = !{!963, !969}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !961, file: !924, line: 102, baseType: !964, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !965, line: 63, baseType: !966)
!965 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !107, !106}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !961, file: !924, line: 103, baseType: !106, size: 32, offset: 32)
!970 = !{!971}
!971 = !DISubrange(count: 16)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !852, file: !924, line: 424, type: !938, isLocal: true, isDefinition: true, align: 8)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !976, file: !924, line: 493, type: !981, isLocal: true, isDefinition: true, align: 32)
!976 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !924, file: !924, line: 460, type: !977, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !852, retainedNodes: !979)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !953}
!979 = !{!980}
!980 = !DILocalVariable(name: "dev", arg: 1, scope: !976, file: !924, line: 460, type: !953)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !982)
!982 = !{!983, !985, !986, !987}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !981, file: !10, line: 55, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !981, file: !10, line: 57, baseType: !984, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !981, file: !10, line: 59, baseType: !106, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !981, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !976, file: !924, line: 497, type: !981, isLocal: true, isDefinition: true, align: 32)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !976, file: !924, line: 507, type: !981, isLocal: true, isDefinition: true, align: 32)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !976, file: !924, line: 512, type: !981, isLocal: true, isDefinition: true, align: 32)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !976, file: !924, line: 516, type: !981, isLocal: true, isDefinition: true, align: 32)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !976, file: !924, line: 523, type: !981, isLocal: true, isDefinition: true, align: 32)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !976, file: !924, line: 527, type: !981, isLocal: true, isDefinition: true, align: 32)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1001, size: 512, elements: !970)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !223, line: 127, baseType: !855)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !1005, file: !1010, line: 21, type: !1030, isLocal: false, isDefinition: true, align: 16)
!1005 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1006, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1007, splitDebugInlining: false, nameTableKind: None)
!1006 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!1007 = !{!1008, !1003, !1014, !1016, !1018, !1020, !1022, !1024, !1026, !1028}
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !1005, file: !1010, line: 16, type: !1011, isLocal: false, isDefinition: true, align: 16)
!1010 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/integration")
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 176, elements: !1012)
!1012 = !{!1013}
!1013 = !DISubrange(count: 11)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !1005, file: !1010, line: 28, type: !925, isLocal: false, isDefinition: true, align: 16)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !1005, file: !1010, line: 35, type: !925, isLocal: false, isDefinition: true, align: 16)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !1005, file: !1010, line: 42, type: !925, isLocal: false, isDefinition: true, align: 16)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !1005, file: !1010, line: 49, type: !925, isLocal: false, isDefinition: true, align: 16)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !1005, file: !1010, line: 56, type: !925, isLocal: false, isDefinition: true, align: 16)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !1005, file: !1010, line: 63, type: !925, isLocal: false, isDefinition: true, align: 16)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !1005, file: !1010, line: 70, type: !925, isLocal: false, isDefinition: true, align: 16)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !1005, file: !1010, line: 77, type: !925, isLocal: false, isDefinition: true, align: 16)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 48, elements: !1031)
!1031 = !{!1032}
!1032 = !DISubrange(count: 3)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !1035, file: !1079, line: 398, type: !1110, isLocal: true, isDefinition: true)
!1035 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1036, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1037, retainedTypes: !1050, globals: !1076, splitDebugInlining: false, nameTableKind: None)
