; ModuleID = 'build/96b_carbon/syst/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config = type { i32*, i32, void (%struct.mpsc_pbuf_buffer*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 97, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5440, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 85)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2720, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 256, baseType: !24)
!23 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stdint.h", directory: "")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_syst", scope: !27, file: !123, line: 15, type: !125, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !112, globals: !120, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/syst/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst")
!29 = !{!30, !37, !42}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !38, line: 33, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!41 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !43, line: 27, baseType: !32, size: 32, elements: !44)
!43 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!45 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!46 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!47 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!48 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!49 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!50 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!51 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!52 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!53 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!54 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!55 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!56 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!57 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!58 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!59 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!60 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!61 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!111 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!112 = !{!113, !114, !117, !119}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 226, baseType: !116)
!116 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!119 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!120 = !{!25, !121}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !123, line: 15, type: !124, isLocal: true, isDefinition: true)
!123 = !DIFile(filename: "zephyr/samples/subsys/logging/syst/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !133}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !127, line: 17, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !126, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !136, file: !159, line: 18, type: !161, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !138, retainedTypes: !139, globals: !156, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst")
!138 = !{!30}
!139 = !{!22, !113, !24, !140, !142, !144, !145, !119, !147, !148, !150, !152, !153, !114, !154, !130}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !146, line: 46, baseType: !32)
!146 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 207, baseType: !155)
!155 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!156 = !{!134, !157}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !136, file: !159, line: 18, type: !160, isLocal: true, isDefinition: true)
!159 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !127, line: 17, baseType: !130, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !162, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "_char_out", scope: !168, file: !173, line: 54, type: !174, isLocal: false, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !171, globals: !172, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst")
!170 = !{!42}
!171 = !{!113, !119}
!172 = !{!166}
!173 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DISubroutineType(types: !176)
!176 = !{!119, !119}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !179, file: !197, line: 56, type: !198, isLocal: true, isDefinition: true, align: 32)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !181, globals: !196, splitDebugInlining: false, nameTableKind: None)
!180 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst")
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !184, line: 258, baseType: !185)
!184 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f401xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !184, line: 249, size: 224, elements: !186)
!186 = !{!187, !190, !191, !192, !193, !194, !195}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !185, file: !184, line: 251, baseType: !188, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 172, baseType: !32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !185, file: !184, line: 252, baseType: !188, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !185, file: !184, line: 253, baseType: !188, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !185, file: !184, line: 254, baseType: !188, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !185, file: !184, line: 255, baseType: !188, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !185, file: !184, line: 256, baseType: !188, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !185, file: !184, line: 257, baseType: !188, size: 32, offset: 192)
!196 = !{!177}
!197 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !200, line: 51, size: 64, elements: !201)
!200 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !{!202, !231}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !199, file: !200, line: 60, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{!119, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !209, line: 378, size: 192, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !212, !213, !214, !221, !222}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !209, line: 380, baseType: !130, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !208, file: !209, line: 382, baseType: !13, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !208, file: !209, line: 384, baseType: !13, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !208, file: !209, line: 386, baseType: !215, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !209, line: 351, size: 16, elements: !217)
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !216, file: !209, line: 359, baseType: !115, size: 8)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !216, file: !209, line: 364, baseType: !220, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!220 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !209, line: 388, baseType: !113, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !208, file: !209, line: 396, baseType: !223, size: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !209, line: 43, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !227, line: 32, baseType: !228)
!227 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/../../../../arm-zephyr-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !229, line: 55, baseType: !230)
!229 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/../../../../arm-zephyr-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!230 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !199, file: !200, line: 65, baseType: !206, size: 32, offset: 32)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !234, file: !237, line: 71, type: !238, isLocal: true, isDefinition: true, align: 32)
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !236, splitDebugInlining: false, nameTableKind: None)
!235 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst")
!236 = !{!232}
!237 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !200, line: 51, size: 64, elements: !240)
!240 = !{!241, !260}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !239, file: !200, line: 60, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{!119, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !209, line: 378, size: 192, elements: !248)
!248 = !{!249, !250, !251, !252, !258, !259}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !247, file: !209, line: 380, baseType: !130, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !247, file: !209, line: 382, baseType: !13, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !247, file: !209, line: 384, baseType: !13, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !247, file: !209, line: 386, baseType: !253, size: 32, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !209, line: 351, size: 16, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !254, file: !209, line: 359, baseType: !115, size: 8)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !254, file: !209, line: 364, baseType: !220, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !247, file: !209, line: 388, baseType: !113, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !247, file: !209, line: 396, baseType: !223, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !239, file: !200, line: 65, baseType: !245, size: 32, offset: 32)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "log_const_log", scope: !263, file: !335, line: 25, type: !578, isLocal: false, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !265, retainedTypes: !266, globals: !332, splitDebugInlining: false, nameTableKind: None)
!264 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst")
!265 = !{!37, !30, !42}
!266 = !{!145, !119, !113, !114, !267, !22, !321, !24, !189, !322, !324, !328, !330}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !269)
!269 = !{!270, !287, !293}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !268, file: !31, line: 112, baseType: !271, size: 32)
!271 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !272, line: 49, size: 32, elements: !273)
!272 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!273 = !{!274, !280, !286}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !271, file: !272, line: 50, baseType: !275, size: 32)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !272, line: 37, size: 32, elements: !276)
!276 = !{!277, !278, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !275, file: !272, line: 38, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !275, file: !272, line: 38, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !272, line: 39, baseType: !189, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !271, file: !272, line: 51, baseType: !281, size: 32)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !272, line: 43, size: 32, elements: !282)
!282 = !{!283, !284, !285}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !281, file: !272, line: 44, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !281, file: !272, line: 44, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !281, file: !272, line: 45, baseType: !189, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !271, file: !272, line: 52, baseType: !189, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !268, file: !31, line: 113, baseType: !288, size: 32)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !289)
!289 = !{!290, !291, !292}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !288, file: !31, line: 108, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !288, file: !31, line: 108, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !288, file: !31, line: 108, baseType: !189, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !268, file: !31, line: 114, baseType: !294, size: 128)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !295)
!295 = !{!296, !313, !317}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !294, file: !31, line: 89, baseType: !297, size: 96)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !298)
!298 = !{!299, !310, !311}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !297, file: !31, line: 67, baseType: !300, size: 32)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !300, file: !31, line: 52, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !300, file: !31, line: 52, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !300, file: !31, line: 52, baseType: !189, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !300, file: !31, line: 53, baseType: !189, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !300, file: !31, line: 54, baseType: !189, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !300, file: !31, line: 55, baseType: !189, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !300, file: !31, line: 56, baseType: !189, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !300, file: !31, line: 57, baseType: !189, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !297, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !297, file: !31, line: 76, baseType: !312, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !189)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !294, file: !31, line: 93, baseType: !314, size: 32, offset: 96)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 32, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 4)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !31, line: 94, baseType: !318, offset: 128)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: -1)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 98, baseType: !323)
!323 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !325, line: 46, baseType: !326)
!325 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !227, line: 56, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !229, line: 103, baseType: !151)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!332 = !{!261, !333, !362, !375, !377, !379, !383, !385, !387, !389, !391, !397, !430, !433, !442, !535, !562, !569, !571, !575, !583, !593}
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !263, file: !335, line: 93, type: !336, isLocal: false, isDefinition: true, align: 32)
!335 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !337, line: 2909, size: 128, elements: !338)
!337 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!338 = !{!339, !360, !361}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !336, file: !337, line: 2910, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !341, line: 233, baseType: !342)
!341 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 231, size: 64, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !342, file: !341, line: 232, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !346, line: 48, baseType: !347)
!346 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !346, line: 37, size: 64, elements: !348)
!348 = !{!349, !355}
!349 = !DIDerivedType(tag: DW_TAG_member, scope: !347, file: !346, line: 38, baseType: !350, size: 32)
!350 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !347, file: !346, line: 38, size: 32, elements: !351)
!351 = !{!352, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !350, file: !346, line: 39, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !346, line: 40, baseType: !353, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, scope: !347, file: !346, line: 42, baseType: !356, size: 32, offset: 32)
!356 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !347, file: !346, line: 42, size: 32, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !356, file: !346, line: 43, baseType: !353, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !356, file: !346, line: 44, baseType: !353, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !336, file: !337, line: 2911, baseType: !32, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !336, file: !337, line: 2912, baseType: !32, size: 32, offset: 96)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !263, file: !335, line: 910, type: !364, isLocal: true, isDefinition: true, align: 32)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !200, line: 51, size: 64, elements: !366)
!366 = !{!367, !374}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !365, file: !200, line: 60, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!369 = !DISubroutineType(types: !370)
!370 = !{!119, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !200, line: 48, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !365, file: !200, line: 65, baseType: !371, size: 32, offset: 32)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "panic_mode", scope: !263, file: !335, line: 96, type: !220, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "backend_attached", scope: !263, file: !335, line: 97, type: !220, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !263, file: !335, line: 98, type: !381, isLocal: true, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !382, line: 22, baseType: !149)
!382 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !263, file: !335, line: 99, type: !381, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !263, file: !335, line: 105, type: !189, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !263, file: !335, line: 107, type: !312, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !263, file: !335, line: 108, type: !381, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !263, file: !335, line: 111, type: !393, isLocal: true, isDefinition: true, align: 32)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !394, line: 29, size: 32, elements: !395)
!394 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !393, file: !394, line: 30, baseType: !267, size: 32)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "log_buffer", scope: !263, file: !335, line: 112, type: !399, isLocal: true, isDefinition: true, align: 32)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !400, line: 87, size: 448, elements: !401)
!400 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !{!402, !403, !404, !405, !406, !407, !411, !420, !425, !427, !428, !429}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !399, file: !400, line: 89, baseType: !189, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !399, file: !400, line: 92, baseType: !189, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !399, file: !400, line: 95, baseType: !189, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !399, file: !400, line: 98, baseType: !189, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !399, file: !400, line: 101, baseType: !189, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !399, file: !400, line: 104, baseType: !408, offset: 160)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !409, line: 43, elements: !410)
!409 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = !{}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !399, file: !400, line: 110, baseType: !412, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !400, line: 83, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !416, !418}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !399, file: !400, line: 113, baseType: !421, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !400, line: 75, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = !DISubroutineType(types: !424)
!424 = !{!189, !418}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !399, file: !400, line: 116, baseType: !426, size: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !399, file: !400, line: 119, baseType: !189, size: 32, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !399, file: !400, line: 122, baseType: !189, size: 32, offset: 288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !399, file: !400, line: 124, baseType: !336, size: 128, offset: 320)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !263, file: !335, line: 113, type: !432, isLocal: true, isDefinition: true)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "logging_stack", scope: !263, file: !335, line: 884, type: !435, isLocal: false, isDefinition: true, align: 512)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 576, elements: !440)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !437, line: 47, size: 8, elements: !438)
!437 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !436, file: !437, line: 48, baseType: !132, size: 8)
!440 = !{!441}
!441 = !DISubrange(count: 72)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "logging_thread", scope: !263, file: !335, line: 885, type: !444, isLocal: false, isDefinition: true)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !445, line: 245, size: 1024, elements: !446)
!445 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = !{!447, !493, !506, !507, !508, !509, !515, !530}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !444, file: !445, line: 247, baseType: !448, size: 384)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !445, line: 57, size: 384, elements: !449)
!449 = !{!450, !464, !466, !467, !468, !480, !481, !482}
!450 = !DIDerivedType(tag: DW_TAG_member, scope: !448, file: !445, line: 60, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !448, file: !445, line: 60, size: 64, elements: !452)
!452 = !{!453, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !451, file: !445, line: 61, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !346, line: 49, baseType: !347)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !451, file: !445, line: 62, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !457, line: 49, size: 64, elements: !458)
!457 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !456, file: !457, line: 50, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 64, elements: !462)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!462 = !{!463}
!463 = !DISubrange(count: 2)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !448, file: !445, line: 68, baseType: !465, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !448, file: !445, line: 71, baseType: !115, size: 8, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !448, file: !445, line: 74, baseType: !115, size: 8, offset: 104)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !448, file: !445, line: 90, baseType: !469, size: 16, offset: 112)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !448, file: !445, line: 90, size: 16, elements: !470)
!470 = !{!471, !479}
!471 = !DIDerivedType(tag: DW_TAG_member, scope: !469, file: !445, line: 91, baseType: !472, size: 16)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !445, line: 91, size: 16, elements: !473)
!473 = !{!474, !478}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !472, file: !445, line: 96, baseType: !475, size: 8)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !227, line: 20, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !229, line: 41, baseType: !477)
!477 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !472, file: !445, line: 97, baseType: !115, size: 8, offset: 8)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !469, file: !445, line: 100, baseType: !154, size: 16)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !448, file: !445, line: 107, baseType: !189, size: 32, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !448, file: !445, line: 127, baseType: !113, size: 32, offset: 160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !448, file: !445, line: 131, baseType: !483, size: 192, offset: 192)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !341, line: 244, size: 192, elements: !484)
!484 = !{!485, !486, !492}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !483, file: !341, line: 245, baseType: !454, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !483, file: !341, line: 246, baseType: !487, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !341, line: 242, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !483, file: !341, line: 249, baseType: !326, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !444, file: !445, line: 250, baseType: !494, size: 288, offset: 384)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !495, line: 25, size: 288, elements: !496)
!495 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !494, file: !495, line: 26, baseType: !189, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !494, file: !495, line: 27, baseType: !189, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !494, file: !495, line: 28, baseType: !189, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !494, file: !495, line: 29, baseType: !189, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !494, file: !495, line: 30, baseType: !189, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !494, file: !495, line: 31, baseType: !189, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !494, file: !495, line: 32, baseType: !189, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !494, file: !495, line: 33, baseType: !189, size: 32, offset: 224)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !494, file: !495, line: 34, baseType: !189, size: 32, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !444, file: !445, line: 253, baseType: !113, size: 32, offset: 672)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !444, file: !445, line: 256, baseType: !340, size: 64, offset: 704)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !444, file: !445, line: 294, baseType: !119, size: 32, offset: 768)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !444, file: !445, line: 300, baseType: !510, size: 96, offset: 800)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !445, line: 149, size: 96, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !510, file: !445, line: 153, baseType: !22, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !510, file: !445, line: 162, baseType: !145, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !510, file: !445, line: 168, baseType: !145, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !444, file: !445, line: 325, baseType: !516, size: 32, offset: 896)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !337, line: 5073, size: 160, elements: !518)
!518 = !{!519, !528, !529}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !517, file: !337, line: 5074, baseType: !520, size: 96)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !521, line: 56, size: 96, elements: !522)
!521 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!522 = !{!523, !526, !527}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !520, file: !521, line: 57, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !521, line: 57, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !520, file: !521, line: 58, baseType: !113, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !520, file: !521, line: 59, baseType: !145, size: 32, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !517, file: !337, line: 5075, baseType: !340, size: 64, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !517, file: !337, line: 5076, baseType: !408, offset: 160)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !444, file: !445, line: 343, baseType: !531, size: 64, offset: 928)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !495, line: 60, size: 64, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !531, file: !495, line: 63, baseType: !189, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !531, file: !495, line: 66, baseType: !189, size: 32, offset: 32)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "format_table", scope: !263, file: !335, line: 72, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 128, elements: !315)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !540, line: 105, baseType: !541)
!540 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !544, !321, !189}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !540, line: 89, size: 128, elements: !547)
!547 = !{!548, !553, !560, !561}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !546, file: !540, line: 90, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !540, line: 79, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = !DISubroutineType(types: !552)
!552 = !{!119, !114, !145, !113}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !546, file: !540, line: 91, baseType: !554, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !540, line: 82, size: 96, elements: !556)
!556 = !{!557, !558, !559}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !555, file: !540, line: 83, baseType: !381, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !555, file: !540, line: 84, baseType: !113, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !555, file: !540, line: 85, baseType: !130, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !546, file: !540, line: 92, baseType: !114, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !546, file: !540, line: 93, baseType: !145, size: 32, offset: 96)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !263, file: !335, line: 104, type: !564, isLocal: true, isDefinition: true)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !565, line: 33, baseType: !566)
!565 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DISubroutineType(types: !568)
!568 = !{!312}
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "initialized", scope: !263, file: !335, line: 95, type: !381, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "proc_tid", scope: !263, file: !335, line: 100, type: !573, isLocal: true, isDefinition: true)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !445, line: 347, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !263, file: !335, line: 25, type: !577, isLocal: true, isDefinition: true)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !579, file: !127, line: 17, baseType: !130, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !579, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !263, file: !335, line: 121, type: !585, isLocal: true, isDefinition: true)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !400, line: 128, size: 160, elements: !587)
!587 = !{!588, !589, !590, !591, !592}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !586, file: !400, line: 130, baseType: !426, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !400, line: 133, baseType: !189, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !586, file: !400, line: 136, baseType: !412, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !586, file: !400, line: 137, baseType: !421, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !586, file: !400, line: 140, baseType: !189, size: 32, offset: 128)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "buf32", scope: !263, file: !335, line: 116, type: !595, isLocal: true, isDefinition: true, align: 64)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 32, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 1)
!598 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !601, file: !608, line: 14, type: !841, isLocal: false, isDefinition: true)
!601 = distinct !DICompileUnit(language: DW_LANG_C99, file: !602, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !603, retainedTypes: !604, globals: !605, splitDebugInlining: false, nameTableKind: None)
!602 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst")
!603 = !{!37, !42}
!604 = !{!113, !119, !117, !114, !130, !22}
!605 = !{!599, !606, !634, !816, !818, !832, !834, !839}
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "sname_cache", scope: !601, file: !608, line: 44, type: !609, isLocal: true, isDefinition: true)
!608 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !610, line: 30, size: 256, elements: !611)
!610 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!611 = !{!612, !625, !626, !631, !632, !633}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !609, file: !610, line: 31, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !614, line: 40, baseType: !615)
!614 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !614, line: 35, size: 64, elements: !616)
!616 = !{!617, !624}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !615, file: !614, line: 36, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !614, line: 33, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !614, line: 29, size: 32, elements: !621)
!621 = !{!622}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !620, file: !614, line: 30, baseType: !623, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !615, file: !614, line: 37, baseType: !618, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !609, file: !610, line: 32, baseType: !613, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !609, file: !610, line: 33, baseType: !627, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !610, line: 21, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DISubroutineType(types: !630)
!630 = !{!220, !22, !22}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !609, file: !610, line: 34, baseType: !189, size: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !609, file: !610, line: 35, baseType: !189, size: 32, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !609, file: !610, line: 36, baseType: !145, size: 32, offset: 224)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !636, file: !608, line: 261, type: !130, isLocal: true, isDefinition: true)
!636 = distinct !DISubprogram(name: "link_domain_name_get", scope: !608, file: !608, line: 256, type: !637, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !601, retainedNodes: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{!130, !115}
!639 = !{!640, !641, !642, !643, !644, !647, !815}
!640 = !DILocalVariable(name: "domain_id", arg: 1, scope: !636, file: !608, line: 256, type: !115)
!641 = !DILocalVariable(name: "cached", scope: !636, file: !608, line: 258, type: !114)
!642 = !DILocalVariable(name: "cache_size", scope: !636, file: !608, line: 259, type: !145)
!643 = !DILocalVariable(name: "id", scope: !636, file: !608, line: 260, type: !22)
!644 = !DILocalVariable(name: "rel_domain_id", scope: !645, file: !608, line: 265, type: !115)
!645 = distinct !DILexicalBlock(scope: !646, file: !608, line: 264, column: 49)
!646 = distinct !DILexicalBlock(scope: !636, file: !608, line: 264, column: 6)
!647 = !DILocalVariable(name: "link", scope: !645, file: !608, line: 266, type: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !651, line: 61, size: 192, elements: !652)
!651 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!652 = !{!653, !742, !743, !752, !753, !805}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !650, file: !651, line: 62, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !651, line: 38, size: 192, elements: !657)
!657 = !{!658, !721, !725, !730, !734, !738}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !656, file: !651, line: 39, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DISubroutineType(types: !661)
!661 = !{!119, !648, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !651, line: 33, size: 64, elements: !664)
!664 = !{!665, !716}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !663, file: !651, line: 34, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !651, line: 27, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !648, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !672)
!672 = !{!673, !689, !695}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !671, file: !31, line: 112, baseType: !674, size: 32)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !272, line: 49, size: 32, elements: !675)
!675 = !{!676, !682, !688}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !674, file: !272, line: 50, baseType: !677, size: 32)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !272, line: 37, size: 32, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !677, file: !272, line: 38, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !677, file: !272, line: 38, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !677, file: !272, line: 39, baseType: !189, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !674, file: !272, line: 51, baseType: !683, size: 32)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !272, line: 43, size: 32, elements: !684)
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !683, file: !272, line: 44, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !683, file: !272, line: 44, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !683, file: !272, line: 45, baseType: !189, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !674, file: !272, line: 52, baseType: !189, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !671, file: !31, line: 113, baseType: !690, size: 32)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !691)
!691 = !{!692, !693, !694}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !690, file: !31, line: 108, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !690, file: !31, line: 108, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !690, file: !31, line: 108, baseType: !189, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !671, file: !31, line: 114, baseType: !696, size: 128)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !697)
!697 = !{!698, !714, !715}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !696, file: !31, line: 89, baseType: !699, size: 96)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !700)
!700 = !{!701, !712, !713}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !699, file: !31, line: 67, baseType: !702, size: 32)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !702, file: !31, line: 52, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !702, file: !31, line: 52, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !702, file: !31, line: 52, baseType: !189, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !702, file: !31, line: 53, baseType: !189, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !702, file: !31, line: 54, baseType: !189, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !702, file: !31, line: 55, baseType: !189, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !702, file: !31, line: 56, baseType: !189, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !702, file: !31, line: 57, baseType: !189, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !699, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !699, file: !31, line: 76, baseType: !312, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !696, file: !31, line: 93, baseType: !314, size: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !696, file: !31, line: 94, baseType: !318, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dropped_cb", scope: !663, file: !651, line: 35, baseType: !717, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_dropped_cb_t", file: !651, line: 30, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !648, !189}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !656, file: !651, line: 40, baseType: !722, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!723 = !DISubroutineType(types: !724)
!724 = !{!119, !648}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "get_domain_name", scope: !656, file: !651, line: 41, baseType: !726, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DISubroutineType(types: !728)
!728 = !{!119, !648, !189, !153, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "get_source_name", scope: !656, file: !651, line: 43, baseType: !731, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 32)
!732 = !DISubroutineType(types: !733)
!733 = !{!119, !648, !189, !154, !153, !729}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "get_levels", scope: !656, file: !651, line: 45, baseType: !735, size: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DISubroutineType(types: !737)
!737 = !{!119, !648, !189, !154, !114, !114}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "set_runtime_level", scope: !656, file: !651, line: 48, baseType: !739, size: 32, offset: 160)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DISubroutineType(types: !741)
!741 = !{!119, !648, !189, !154, !115}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !650, file: !651, line: 63, baseType: !130, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_blk", scope: !650, file: !651, line: 64, baseType: !744, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_ctrl_blk", file: !651, line: 52, size: 128, elements: !746)
!746 = !{!747, !748, !750, !751}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "domain_cnt", scope: !745, file: !651, line: 53, baseType: !189, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "source_cnt", scope: !745, file: !651, line: 54, baseType: !749, size: 16, offset: 32)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 16, elements: !596)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "domain_offset", scope: !745, file: !651, line: 57, baseType: !189, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !745, file: !651, line: 58, baseType: !426, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !650, file: !651, line: 65, baseType: !113, size: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf", scope: !650, file: !651, line: 66, baseType: !754, size: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !400, line: 87, size: 448, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !764, !773, !778, !779, !780, !781}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !755, file: !400, line: 89, baseType: !189, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !755, file: !400, line: 92, baseType: !189, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !755, file: !400, line: 95, baseType: !189, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !755, file: !400, line: 98, baseType: !189, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !755, file: !400, line: 101, baseType: !189, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !755, file: !400, line: 104, baseType: !763, offset: 160)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !409, line: 43, elements: !410)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !755, file: !400, line: 110, baseType: !765, size: 32, offset: 160)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !400, line: 83, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !769, !771}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !755, file: !400, line: 113, baseType: !774, size: 32, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !400, line: 75, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DISubroutineType(types: !777)
!777 = !{!189, !771}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !755, file: !400, line: 116, baseType: !426, size: 32, offset: 224)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !755, file: !400, line: 119, baseType: !189, size: 32, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !755, file: !400, line: 122, baseType: !189, size: 32, offset: 288)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !755, file: !400, line: 124, baseType: !782, size: 128, offset: 320)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !337, line: 2909, size: 128, elements: !783)
!783 = !{!784, !803, !804}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !782, file: !337, line: 2910, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !341, line: 233, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 231, size: 64, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !786, file: !341, line: 232, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !346, line: 48, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !346, line: 37, size: 64, elements: !791)
!791 = !{!792, !798}
!792 = !DIDerivedType(tag: DW_TAG_member, scope: !790, file: !346, line: 38, baseType: !793, size: 32)
!793 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !790, file: !346, line: 38, size: 32, elements: !794)
!794 = !{!795, !797}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !793, file: !346, line: 39, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !793, file: !346, line: 40, baseType: !796, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, scope: !790, file: !346, line: 42, baseType: !799, size: 32, offset: 32)
!799 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !790, file: !346, line: 42, size: 32, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !799, file: !346, line: 43, baseType: !796, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !799, file: !346, line: 44, baseType: !796, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !782, file: !337, line: 2911, baseType: !32, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !782, file: !337, line: 2912, baseType: !32, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf_config", scope: !650, file: !651, line: 67, baseType: !806, size: 32, offset: 160)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !400, line: 128, size: 160, elements: !809)
!809 = !{!810, !811, !812, !813, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !808, file: !400, line: 130, baseType: !426, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !808, file: !400, line: 133, baseType: !189, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !808, file: !400, line: 136, baseType: !765, size: 32, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !808, file: !400, line: 137, baseType: !774, size: 32, offset: 96)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !808, file: !400, line: 140, baseType: !189, size: 32, offset: 128)
!815 = !DILocalVariable(name: "err", scope: !645, file: !608, line: 267, type: !119)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "dname_cache", scope: !601, file: !608, line: 43, type: !609, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "dname_cache_config", scope: !820, file: !608, line: 152, type: !825, isLocal: true, isDefinition: true)
!820 = distinct !DISubprogram(name: "cache_init", scope: !608, file: !608, line: 149, type: !821, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !601, retainedNodes: !823)
!821 = !DISubroutineType(types: !822)
!822 = !{null}
!823 = !{!824}
!824 = !DILocalVariable(name: "err", scope: !820, file: !608, line: 151, type: !119)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache_config", file: !610, line: 23, size: 128, elements: !827)
!827 = !{!828, !829, !830, !831}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !826, file: !610, line: 24, baseType: !113, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !826, file: !610, line: 25, baseType: !145, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !826, file: !610, line: 26, baseType: !145, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !826, file: !610, line: 27, baseType: !627, size: 32, offset: 96)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "sname_cache_config", scope: !820, file: !608, line: 158, type: !825, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "dname_cache_buffer", scope: !601, file: !608, line: 40, type: !836, isLocal: true, isDefinition: true, align: 32)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 72, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 9)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "sname_cache_buffer", scope: !601, file: !608, line: 41, type: !836, isLocal: true, isDefinition: true, align: 32)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !842, file: !127, line: 17, baseType: !130, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !842, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "prefix", scope: !848, file: !849, line: 562, type: !894, isLocal: true, isDefinition: true)
!848 = distinct !DISubprogram(name: "log_output_dropped_process", scope: !849, file: !849, line: 558, type: !850, scopeLine: 559, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !866, retainedNodes: !887)
!849 = !DIFile(filename: "zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!850 = !DISubroutineType(types: !851)
!851 = !{null, !852, !189}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !540, line: 89, size: 128, elements: !855)
!855 = !{!856, !857, !864, !865}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !854, file: !540, line: 90, baseType: !549, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !854, file: !540, line: 91, baseType: !858, size: 32, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !540, line: 82, size: 96, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !859, file: !540, line: 83, baseType: !381, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !859, file: !540, line: 84, baseType: !113, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !859, file: !540, line: 85, baseType: !130, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !854, file: !540, line: 92, baseType: !114, size: 32, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !854, file: !540, line: 93, baseType: !145, size: 32, offset: 96)
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !868, globals: !869, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst")
!868 = !{!22, !113, !114, !322, !119, !189, !852, !132, !116, !117}
!869 = !{!846, !870, !875, !877, !879, !885}
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "postfix", scope: !848, file: !849, line: 563, type: !872, isLocal: true, isDefinition: true)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 224, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 28)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "freq", scope: !866, file: !849, line: 46, type: !189, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "timestamp_div", scope: !866, file: !849, line: 47, type: !312, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "colors", scope: !866, file: !849, line: 38, type: !881, isLocal: true, isDefinition: true)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 160, elements: !883)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!883 = !{!884}
!884 = !DISubrange(count: 5)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "severity", scope: !866, file: !849, line: 30, type: !881, isLocal: true, isDefinition: true)
!887 = !{!888, !889, !890, !892, !893}
!888 = !DILocalVariable(name: "output", arg: 1, scope: !848, file: !849, line: 558, type: !852)
!889 = !DILocalVariable(name: "cnt", arg: 2, scope: !848, file: !849, line: 558, type: !189)
!890 = !DILocalVariable(name: "buf", scope: !848, file: !849, line: 560, type: !891)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 40, elements: !883)
!892 = !DILocalVariable(name: "len", scope: !848, file: !849, line: 561, type: !119)
!893 = !DILocalVariable(name: "outf", scope: !848, file: !849, line: 565, type: !549)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 96, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 12)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "log_const_log_uart", scope: !899, file: !956, line: 16, type: !1084, isLocal: false, isDefinition: true)
!899 = distinct !DICompileUnit(language: DW_LANG_C99, file: !900, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !603, retainedTypes: !901, globals: !953, splitDebugInlining: false, nameTableKind: None)
!900 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/syst")
!901 = !{!113, !119, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !905, line: 336, size: 160, elements: !906)
!905 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!906 = !{!907, !927, !931, !935, !948}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !904, file: !905, line: 365, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DISubroutineType(types: !910)
!910 = !{!119, !911, !926}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !209, line: 378, size: 192, elements: !914)
!914 = !{!915, !916, !917, !918, !924, !925}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !913, file: !209, line: 380, baseType: !130, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !913, file: !209, line: 382, baseType: !13, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !913, file: !209, line: 384, baseType: !13, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !913, file: !209, line: 386, baseType: !919, size: 32, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !209, line: 351, size: 16, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !920, file: !209, line: 359, baseType: !115, size: 8)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !920, file: !209, line: 364, baseType: !220, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !913, file: !209, line: 388, baseType: !113, size: 32, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !913, file: !209, line: 396, baseType: !223, size: 32, offset: 160)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !904, file: !905, line: 366, baseType: !928, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !911, !116}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !904, file: !905, line: 374, baseType: !932, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DISubroutineType(types: !934)
!934 = !{!119, !911}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !904, file: !905, line: 377, baseType: !936, size: 32, offset: 96)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DISubroutineType(types: !938)
!938 = !{!119, !911, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !905, line: 122, size: 64, elements: !942)
!942 = !{!943, !944, !945, !946, !947}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !941, file: !905, line: 123, baseType: !189, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !941, file: !905, line: 124, baseType: !115, size: 8, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !941, file: !905, line: 125, baseType: !115, size: 8, offset: 40)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !941, file: !905, line: 126, baseType: !115, size: 8, offset: 48)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !941, file: !905, line: 127, baseType: !115, size: 8, offset: 56)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !904, file: !905, line: 379, baseType: !949, size: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = !DISubroutineType(types: !951)
!951 = !{!119, !911, !952}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!953 = !{!897, !954, !1052, !1054, !1056, !1071, !1074, !1076, !1079, !1082}
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "log_backend_uart_api", scope: !899, file: !956, line: 156, type: !957, isLocal: false, isDefinition: true)
!956 = !DIFile(filename: "zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend_api", file: !38, line: 62, size: 224, elements: !959)
!959 = !{!960, !1027, !1031, !1035, !1036, !1040, !1044}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !958, file: !38, line: 63, baseType: !961, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !964, !981}
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend", file: !38, line: 93, size: 128, elements: !968)
!968 = !{!969, !971, !979, !980}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !967, file: !38, line: 94, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !967, file: !38, line: 95, baseType: !972, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend_control_block", file: !38, line: 81, size: 64, elements: !974)
!974 = !{!975, !976, !977, !978}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !973, file: !38, line: 82, baseType: !113, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !973, file: !38, line: 83, baseType: !115, size: 8, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !973, file: !38, line: 84, baseType: !220, size: 8, offset: 40)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !973, file: !38, line: 87, baseType: !115, size: 8, offset: 48)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !967, file: !38, line: 96, baseType: !130, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "autostart", scope: !967, file: !38, line: 97, baseType: !220, size: 8, offset: 96)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !983)
!983 = !{!984, !1000, !1006}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !982, file: !31, line: 112, baseType: !985, size: 32)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !272, line: 49, size: 32, elements: !986)
!986 = !{!987, !993, !999}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !985, file: !272, line: 50, baseType: !988, size: 32)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !272, line: 37, size: 32, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !988, file: !272, line: 38, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !988, file: !272, line: 38, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !988, file: !272, line: 39, baseType: !189, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !985, file: !272, line: 51, baseType: !994, size: 32)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !272, line: 43, size: 32, elements: !995)
!995 = !{!996, !997, !998}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !994, file: !272, line: 44, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !994, file: !272, line: 44, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !994, file: !272, line: 45, baseType: !189, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !985, file: !272, line: 52, baseType: !189, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !982, file: !31, line: 113, baseType: !1001, size: 32)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !1001, file: !31, line: 108, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !1001, file: !31, line: 108, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1001, file: !31, line: 108, baseType: !189, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !982, file: !31, line: 114, baseType: !1007, size: 128)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !1008)
!1008 = !{!1009, !1025, !1026}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1007, file: !31, line: 89, baseType: !1010, size: 96)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !1011)
!1011 = !{!1012, !1023, !1024}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !1010, file: !31, line: 67, baseType: !1013, size: 32)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !1013, file: !31, line: 52, baseType: !189, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !1013, file: !31, line: 52, baseType: !189, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1013, file: !31, line: 52, baseType: !189, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !1013, file: !31, line: 53, baseType: !189, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
