; ModuleID = 'build/arduino_nano_33_ble_sense/boards/nrf/clock_skew/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.timeutil_sync_config = type { i32, i32 }
%struct.timeutil_sync_state = type { %struct.timeutil_sync_config*, %struct.timeutil_sync_instant, %struct.timeutil_sync_instant, float }
%struct.timeutil_sync_instant = type { i64, i64 }
%struct.k_work_delayable = type { %struct.k_work, %struct._timeout, %struct.k_work_q* }
%struct.k_work = type { %struct._snode, void (%struct.k_work*)*, %struct.k_work_q*, i32 }
%struct._snode = type { %struct._snode* }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_work_q = type { %struct.k_thread, %struct._slist, %union.anon, %union.anon, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct.timeutil_sync_config }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/boards/nrf/clock_skew/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/boards/nrf/clock_skew")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/boards/nrf/clock_skew")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 256, baseType: !24)
!23 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stdint.h", directory: "")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "sync_config", scope: !27, file: !533, line: 19, type: !545, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !130, globals: !530, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/boards/nrf/clock_skew/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/boards/nrf/clock_skew")
!29 = !{!30, !101, !109, !113, !120, !126}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 107, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105, !106, !107, !108}
!104 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!105 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!106 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!107 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!108 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 152, baseType: !32, size: 32, elements: !110)
!110 = !{!111, !112}
!111 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!112 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !114, line: 44, baseType: !32, size: 32, elements: !115)
!114 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !{!116, !117, !118, !119}
!116 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!117 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!118 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!119 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !121, line: 23, baseType: !32, size: 32, elements: !122)
!121 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123, !124, !125}
!123 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!124 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!125 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 167, baseType: !32, size: 32, elements: !127)
!127 = !{!128, !129}
!128 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!129 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!130 = !{!131, !132, !133, !134, !145, !195, !255, !256, !323, !363, !364, !365, !366, !367, !368, !373, !529}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 172, baseType: !32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!133 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_config_info", file: !137, line: 169, size: 96, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/drivers/counter.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !140, !141, !144}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "max_top_value", scope: !136, file: !137, line: 170, baseType: !131, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !136, file: !137, line: 171, baseType: !131, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !136, file: !137, line: 172, baseType: !142, size: 8, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 226, baseType: !143)
!143 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !136, file: !137, line: 173, baseType: !142, size: 8, offset: 72)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_driver_api", file: !137, line: 198, size: 384, elements: !147)
!147 = !{!148, !181, !183, !189, !197, !214, !219, !236, !241, !243, !248, !253}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !146, file: !137, line: 199, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_start", file: !137, line: 176, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DISubroutineType(types: !152)
!152 = !{!133, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !156, line: 378, size: 192, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !162, !163, !164, !171, !172}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 380, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !155, file: !156, line: 382, baseType: !13, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !155, file: !156, line: 384, baseType: !13, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !155, file: !156, line: 386, baseType: !165, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !156, line: 351, size: 16, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !166, file: !156, line: 359, baseType: !142, size: 8)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !166, file: !156, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!170 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !155, file: !156, line: 388, baseType: !132, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !155, file: !156, line: 396, baseType: !173, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !156, line: 43, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !177, line: 32, baseType: !178)
!177 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/../../../../arm-zephyr-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !179, line: 55, baseType: !180)
!179 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/../../../../arm-zephyr-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!180 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !146, file: !137, line: 200, baseType: !182, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_stop", file: !137, line: 177, baseType: !150)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "get_value", scope: !146, file: !137, line: 201, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_value", file: !137, line: 178, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{!133, !153, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "get_value_64", scope: !146, file: !137, line: 202, baseType: !190, size: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_value_64", file: !137, line: 180, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DISubroutineType(types: !193)
!193 = !{!133, !153, !194}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 98, baseType: !196)
!196 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "set_alarm", scope: !146, file: !137, line: 203, baseType: !198, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_alarm", file: !137, line: 182, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!133, !153, !142, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_alarm_cfg", file: !137, line: 129, size: 128, elements: !205)
!205 = !{!206, !211, !212, !213}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !204, file: !137, line: 130, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_alarm_callback_t", file: !137, line: 111, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !153, !142, !131, !132}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !204, file: !137, line: 131, baseType: !131, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !204, file: !137, line: 132, baseType: !132, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !204, file: !137, line: 133, baseType: !131, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_alarm", scope: !146, file: !137, line: 204, baseType: !215, size: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_cancel_alarm", file: !137, line: 185, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DISubroutineType(types: !218)
!218 = !{!133, !153, !142}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "set_top_value", scope: !146, file: !137, line: 205, baseType: !220, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_top_value", file: !137, line: 187, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DISubroutineType(types: !223)
!223 = !{!133, !153, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_top_cfg", file: !137, line: 152, size: 128, elements: !227)
!227 = !{!228, !229, !234, !235}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !226, file: !137, line: 153, baseType: !131, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !226, file: !137, line: 154, baseType: !230, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_top_callback_t", file: !137, line: 141, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !153, !132}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !226, file: !137, line: 155, baseType: !132, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !226, file: !137, line: 156, baseType: !131, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !146, file: !137, line: 206, baseType: !237, size: 32, offset: 224)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_pending_int", file: !137, line: 189, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DISubroutineType(types: !240)
!240 = !{!131, !153}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "get_top_value", scope: !146, file: !137, line: 207, baseType: !242, size: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_top_value", file: !137, line: 190, baseType: !238)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "get_guard_period", scope: !146, file: !137, line: 208, baseType: !244, size: 32, offset: 288)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_guard_period", file: !137, line: 191, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DISubroutineType(types: !247)
!247 = !{!131, !153, !131}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "set_guard_period", scope: !146, file: !137, line: 209, baseType: !249, size: 32, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_set_guard_period", file: !137, line: 193, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{!133, !153, !131, !131}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "get_freq", scope: !146, file: !137, line: 210, baseType: !254, size: 32, offset: 352)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_api_get_freq", file: !137, line: 196, baseType: !238)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !114, line: 56, baseType: !132)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !258, line: 1022, baseType: !259)
!258 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !258, line: 979, size: 11712, elements: !260)
!260 = !{!261, !263, !264, !265, !266, !267, !268, !269, !274, !275, !276, !277, !278, !279, !283, !284, !285, !289, !290, !291, !295, !296, !297, !298, !299, !300, !301, !305, !306, !310, !311, !312, !313, !317, !318, !322}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !259, file: !258, line: 980, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !259, file: !258, line: 981, baseType: !262, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !259, file: !258, line: 982, baseType: !262, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !259, file: !258, line: 983, baseType: !262, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !259, file: !258, line: 984, baseType: !262, size: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !259, file: !258, line: 985, baseType: !262, size: 32, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !259, file: !258, line: 986, baseType: !262, size: 32, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !259, file: !258, line: 987, baseType: !270, size: 1824, offset: 224)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 1824, elements: !272)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!272 = !{!273}
!273 = !DISubrange(count: 57)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !259, file: !258, line: 988, baseType: !262, size: 32, offset: 2048)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !259, file: !258, line: 989, baseType: !262, size: 32, offset: 2080)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !259, file: !258, line: 990, baseType: !271, size: 32, offset: 2112)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !259, file: !258, line: 991, baseType: !262, size: 32, offset: 2144)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !259, file: !258, line: 992, baseType: !262, size: 32, offset: 2176)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !259, file: !258, line: 993, baseType: !280, size: 160, offset: 2208)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 160, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 5)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !259, file: !258, line: 994, baseType: !262, size: 32, offset: 2368)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !259, file: !258, line: 996, baseType: !262, size: 32, offset: 2400)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !259, file: !258, line: 998, baseType: !286, size: 3744, offset: 2432)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 3744, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 117)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !259, file: !258, line: 999, baseType: !262, size: 32, offset: 6176)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !259, file: !258, line: 1000, baseType: !262, size: 32, offset: 6208)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !259, file: !258, line: 1001, baseType: !292, size: 2016, offset: 6240)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 2016, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 63)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !259, file: !258, line: 1002, baseType: !271, size: 32, offset: 8256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !259, file: !258, line: 1004, baseType: !271, size: 32, offset: 8288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !259, file: !258, line: 1005, baseType: !271, size: 32, offset: 8320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !259, file: !258, line: 1006, baseType: !271, size: 32, offset: 8352)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !259, file: !258, line: 1008, baseType: !271, size: 32, offset: 8384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !259, file: !258, line: 1009, baseType: !271, size: 32, offset: 8416)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !259, file: !258, line: 1011, baseType: !302, size: 1984, offset: 8448)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 1984, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 62)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !259, file: !258, line: 1012, baseType: !262, size: 32, offset: 10432)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !259, file: !258, line: 1013, baseType: !307, size: 96, offset: 10464)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 96, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 3)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !259, file: !258, line: 1014, baseType: !262, size: 32, offset: 10560)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !259, file: !258, line: 1016, baseType: !307, size: 96, offset: 10592)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !259, file: !258, line: 1017, baseType: !262, size: 32, offset: 10688)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !259, file: !258, line: 1018, baseType: !314, size: 256, offset: 10720)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 256, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 8)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !259, file: !258, line: 1019, baseType: !262, size: 32, offset: 10976)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !259, file: !258, line: 1020, baseType: !319, size: 672, offset: 11008)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 672, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 21)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !259, file: !258, line: 1021, baseType: !262, size: 32, offset: 11680)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !114, line: 100, size: 224, elements: !326)
!326 = !{!327, !332, !333, !342, !347, !352, !358}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !325, file: !114, line: 101, baseType: !328, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !114, line: 76, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DISubroutineType(types: !331)
!331 = !{!133, !153, !255}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !325, file: !114, line: 102, baseType: !328, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !325, file: !114, line: 103, baseType: !334, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !114, line: 83, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DISubroutineType(types: !337)
!337 = !{!133, !153, !255, !338, !132}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !114, line: 72, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !153, !255, !132}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !325, file: !114, line: 104, baseType: !343, size: 32, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !114, line: 79, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DISubroutineType(types: !346)
!346 = !{!133, !153, !255, !188}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !325, file: !114, line: 105, baseType: !348, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !114, line: 88, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DISubroutineType(types: !351)
!351 = !{!113, !153, !255}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !325, file: !114, line: 106, baseType: !353, size: 32, offset: 160)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !114, line: 92, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DISubroutineType(types: !356)
!356 = !{!133, !153, !255, !357}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !114, line: 64, baseType: !132)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !325, file: !114, line: 107, baseType: !359, size: 32, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !114, line: 96, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DISubroutineType(types: !362)
!362 = !{!133, !153, !255, !132}
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !102, line: 146, baseType: !101)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !102, line: 164, baseType: !109)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!367 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !369, line: 46, baseType: !370)
!369 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !177, line: 56, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !179, line: 103, baseType: !372)
!372 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !375, line: 3691, size: 384, elements: !376)
!375 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!376 = !{!377, !527, !528}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !374, file: !375, line: 3693, baseType: !378, size: 128)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !375, line: 3663, size: 128, elements: !379)
!379 = !{!380, !387, !393, !526}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !378, file: !375, line: 3669, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !382, line: 33, baseType: !383)
!382 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !382, line: 29, size: 32, elements: !384)
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !382, line: 30, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !378, file: !375, line: 3672, baseType: !388, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !375, line: 3071, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !378, file: !375, line: 3675, baseType: !394, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !375, line: 3810, size: 1280, elements: !396)
!396 = !{!397, !516, !523, !524, !525}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !395, file: !375, line: 3812, baseType: !398, size: 1024)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !399, line: 245, size: 1024, elements: !400)
!399 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!400 = !{!401, !469, !482, !483, !484, !485, !493, !511}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !398, file: !399, line: 247, baseType: !402, size: 384)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !399, line: 57, size: 384, elements: !403)
!403 = !{!404, !432, !440, !441, !442, !456, !457, !458}
!404 = !DIDerivedType(tag: DW_TAG_member, scope: !402, file: !399, line: 60, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !402, file: !399, line: 60, size: 64, elements: !406)
!406 = !{!407, !423}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !405, file: !399, line: 61, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !409, line: 49, baseType: !410)
!409 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !409, line: 37, size: 64, elements: !411)
!411 = !{!412, !418}
!412 = !DIDerivedType(tag: DW_TAG_member, scope: !410, file: !409, line: 38, baseType: !413, size: 32)
!413 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !410, file: !409, line: 38, size: 32, elements: !414)
!414 = !{!415, !417}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !413, file: !409, line: 39, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !413, file: !409, line: 40, baseType: !416, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, scope: !410, file: !409, line: 42, baseType: !419, size: 32, offset: 32)
!419 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !410, file: !409, line: 42, size: 32, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !419, file: !409, line: 43, baseType: !416, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !419, file: !409, line: 44, baseType: !416, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !405, file: !399, line: 62, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !425, line: 49, size: 64, elements: !426)
!425 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !424, file: !425, line: 50, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 64, elements: !430)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!430 = !{!431}
!431 = !DISubrange(count: 2)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !402, file: !399, line: 68, baseType: !433, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !435, line: 233, baseType: !436)
!435 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 231, size: 64, elements: !437)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !436, file: !435, line: 232, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !409, line: 48, baseType: !410)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !402, file: !399, line: 71, baseType: !142, size: 8, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !402, file: !399, line: 74, baseType: !142, size: 8, offset: 104)
!442 = !DIDerivedType(tag: DW_TAG_member, scope: !402, file: !399, line: 90, baseType: !443, size: 16, offset: 112)
!443 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !402, file: !399, line: 90, size: 16, elements: !444)
!444 = !{!445, !453}
!445 = !DIDerivedType(tag: DW_TAG_member, scope: !443, file: !399, line: 91, baseType: !446, size: 16)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !443, file: !399, line: 91, size: 16, elements: !447)
!447 = !{!448, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !446, file: !399, line: 96, baseType: !449, size: 8)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !177, line: 20, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !179, line: 41, baseType: !451)
!451 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !446, file: !399, line: 97, baseType: !142, size: 8, offset: 8)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !443, file: !399, line: 100, baseType: !454, size: 16)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 207, baseType: !455)
!455 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !402, file: !399, line: 107, baseType: !131, size: 32, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !402, file: !399, line: 127, baseType: !132, size: 32, offset: 160)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !402, file: !399, line: 131, baseType: !459, size: 192, offset: 192)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !435, line: 244, size: 192, elements: !460)
!460 = !{!461, !462, !468}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !459, file: !435, line: 245, baseType: !408, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !459, file: !435, line: 246, baseType: !463, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !435, line: 242, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !467}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !459, file: !435, line: 249, baseType: !370, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !398, file: !399, line: 250, baseType: !470, size: 288, offset: 384)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !471, line: 25, size: 288, elements: !472)
!471 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !470, file: !471, line: 26, baseType: !131, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !470, file: !471, line: 27, baseType: !131, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !470, file: !471, line: 28, baseType: !131, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !470, file: !471, line: 29, baseType: !131, size: 32, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !470, file: !471, line: 30, baseType: !131, size: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !470, file: !471, line: 31, baseType: !131, size: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !470, file: !471, line: 32, baseType: !131, size: 32, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !470, file: !471, line: 33, baseType: !131, size: 32, offset: 224)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !470, file: !471, line: 34, baseType: !131, size: 32, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !398, file: !399, line: 253, baseType: !132, size: 32, offset: 672)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !398, file: !399, line: 256, baseType: !434, size: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !398, file: !399, line: 294, baseType: !133, size: 32, offset: 768)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !398, file: !399, line: 300, baseType: !486, size: 96, offset: 800)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !399, line: 149, size: 96, elements: !487)
!487 = !{!488, !489, !492}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !486, file: !399, line: 153, baseType: !22, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !486, file: !399, line: 162, baseType: !490, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !491, line: 46, baseType: !32)
!491 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!492 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !486, file: !399, line: 168, baseType: !490, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !398, file: !399, line: 325, baseType: !494, size: 32, offset: 896)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !375, line: 5073, size: 160, elements: !496)
!496 = !{!497, !506, !507}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !495, file: !375, line: 5074, baseType: !498, size: 96)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !499, line: 56, size: 96, elements: !500)
!499 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!500 = !{!501, !504, !505}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !498, file: !499, line: 57, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !499, line: 57, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !498, file: !499, line: 58, baseType: !132, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !498, file: !499, line: 59, baseType: !490, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !495, file: !375, line: 5075, baseType: !434, size: 64, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !495, file: !375, line: 5076, baseType: !508, offset: 160)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !509, line: 43, elements: !510)
!509 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!510 = !{}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !398, file: !399, line: 343, baseType: !512, size: 64, offset: 928)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !471, line: 60, size: 64, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !512, file: !471, line: 63, baseType: !131, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !512, file: !471, line: 66, baseType: !131, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !395, file: !375, line: 3819, baseType: !517, size: 64, offset: 1024)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !382, line: 40, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !382, line: 35, size: 64, elements: !519)
!519 = !{!520, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !518, file: !382, line: 36, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !518, file: !382, line: 37, baseType: !521, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !395, file: !375, line: 3822, baseType: !434, size: 64, offset: 1088)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !395, file: !375, line: 3825, baseType: !434, size: 64, offset: 1152)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !395, file: !375, line: 3828, baseType: !131, size: 32, offset: 1216)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !378, file: !375, line: 3683, baseType: !131, size: 32, offset: 96)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !374, file: !375, line: 3696, baseType: !459, size: 192, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !374, file: !375, line: 3699, baseType: !394, size: 32, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!530 = !{!531, !535, !25, !537, !557, !559, !576, !579, !584, !586}
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "clock0", scope: !27, file: !533, line: 17, type: !534, isLocal: true, isDefinition: true)
!533 = !DIFile(filename: "zephyr/samples/boards/nrf/clock_skew/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "timer0", scope: !27, file: !533, line: 18, type: !534, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "sync_state", scope: !27, file: !533, line: 21, type: !539, isLocal: true, isDefinition: true)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeutil_sync_state", file: !540, line: 138, size: 384, elements: !541)
!540 = !DIFile(filename: "zephyr/include/zephyr/sys/timeutil.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!541 = !{!542, !549, !554, !555}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !539, file: !540, line: 140, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeutil_sync_config", file: !540, line: 82, size: 64, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ref_Hz", scope: !545, file: !540, line: 90, baseType: !131, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "local_Hz", scope: !545, file: !540, line: 103, baseType: !131, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !539, file: !540, line: 143, baseType: !550, size: 128, offset: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeutil_sync_instant", file: !540, line: 113, size: 128, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !550, file: !540, line: 119, baseType: !195, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !550, file: !540, line: 125, baseType: !195, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "latest", scope: !539, file: !540, line: 149, baseType: !550, size: 128, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "skew", scope: !539, file: !540, line: 166, baseType: !556, size: 32, offset: 320)
!556 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "sync_work", scope: !27, file: !533, line: 22, type: !374, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "lfsrc_s", scope: !561, file: !533, line: 77, type: !574, isLocal: true, isDefinition: true)
!561 = distinct !DISubprogram(name: "show_clocks", scope: !533, file: !533, line: 75, type: !562, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !564)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !159}
!564 = !{!565, !566, !572, !573}
!565 = !DILocalVariable(name: "tag", arg: 1, scope: !561, file: !533, line: 75, type: !159)
!566 = !DILocalVariable(name: "src", scope: !561, file: !533, line: 99, type: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !561, file: !533, line: 95, size: 32, elements: !568)
!568 = !{!569, !570, !571}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !567, file: !533, line: 96, baseType: !32, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lf", scope: !567, file: !533, line: 97, baseType: !363, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "hf", scope: !567, file: !533, line: 98, baseType: !365, size: 32)
!572 = !DILocalVariable(name: "clkstat", scope: !561, file: !533, line: 100, type: !113)
!573 = !DILocalVariable(name: "running", scope: !561, file: !533, line: 101, type: !170)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 96, elements: !308)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "hfsrc_s", scope: !561, file: !533, line: 85, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 64, elements: !430)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "clkstat_s", scope: !561, file: !533, line: 89, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 128, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 4)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "counter_ref", scope: !27, file: !533, line: 20, type: !195, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "ts_buf", scope: !588, file: !533, line: 69, type: !593, isLocal: true, isDefinition: true)
!588 = distinct !DISubprogram(name: "us_to_text", scope: !533, file: !533, line: 67, type: !589, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !591)
!589 = !DISubroutineType(types: !590)
!590 = !{!159, !195}
!591 = !{!592}
!592 = !DILocalVariable(name: "rem", arg: 1, scope: !588, file: !533, line: 67, type: !195)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 256, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 32)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "_char_out", scope: !598, file: !603, line: 54, type: !604, isLocal: false, isDefinition: true)
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !600, retainedTypes: !601, globals: !602, splitDebugInlining: false, nameTableKind: None)
!599 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/boards/nrf/clock_skew")
!600 = !{!30}
!601 = !{!132, !133}
!602 = !{!596}
!603 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!605 = !DISubroutineType(types: !606)
!606 = !{!133, !133}
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !609, file: !642, line: 27, type: !667, isLocal: true, isDefinition: true)
!609 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !611, retainedTypes: !623, globals: !639, splitDebugInlining: false, nameTableKind: None)
!610 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/boards/nrf/clock_skew")
!611 = !{!612, !30}
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !613, line: 27, baseType: !32, size: 32, elements: !614)
!613 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622}
!615 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!616 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!617 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!618 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!619 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!620 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!621 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!622 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!623 = !{!132, !368, !133, !24, !624, !529, !131, !195}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !626, line: 54, size: 96, elements: !627)
!626 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!627 = !{!628, !634, !638}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !625, file: !626, line: 55, baseType: !629, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !382, line: 33, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !382, line: 29, size: 32, elements: !631)
!631 = !{!632}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !630, file: !382, line: 30, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !625, file: !626, line: 60, baseType: !635, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !612}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !625, file: !626, line: 65, baseType: !635, size: 32, offset: 64)
!639 = !{!607, !640, !644, !646, !657, !659}
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !609, file: !642, line: 44, type: !643, isLocal: true, isDefinition: true)
!642 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !509, line: 43, elements: !510)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !609, file: !642, line: 49, type: !643, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !609, file: !642, line: 36, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 128, elements: !655)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !613, line: 114, size: 128, elements: !650)
!650 = !{!651, !652, !653, !654}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !649, file: !613, line: 115, baseType: !612, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !649, file: !613, line: 141, baseType: !142, size: 8, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !649, file: !613, line: 149, baseType: !131, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !649, file: !613, line: 156, baseType: !131, size: 32, offset: 96)
!655 = !{!656}
!656 = !DISubrange(count: 1)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !609, file: !642, line: 40, type: !648, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !609, file: !642, line: 28, type: !661, isLocal: true, isDefinition: true)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !382, line: 40, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !382, line: 35, size: 64, elements: !663)
!663 = !{!664, !666}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !662, file: !382, line: 36, baseType: !665, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !662, file: !382, line: 37, baseType: !665, size: 32, offset: 32)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 32, elements: !655)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !669, line: 22, baseType: !670)
!669 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!670 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!671 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!672 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !675, file: !703, line: 50, type: !689, isLocal: true, isDefinition: true)
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !611, retainedTypes: !677, globals: !700, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/boards/nrf/clock_skew")
!677 = !{!176, !368, !490, !133, !132, !131, !195, !678, !529, !689, !691}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !680, line: 45, size: 64, elements: !681)
!680 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!681 = !{!682, !688}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !679, file: !680, line: 46, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !382, line: 33, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !382, line: 29, size: 32, elements: !685)
!685 = !{!686}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !684, file: !382, line: 30, baseType: !687, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !679, file: !680, line: 48, baseType: !131, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !177, line: 44, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !179, line: 77, baseType: !133)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !680, line: 38, size: 64, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !692, file: !680, line: 39, baseType: !683, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !692, file: !680, line: 41, baseType: !696, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !680, line: 35, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !689}
!700 = !{!701, !705, !713, !673, !715, !725}
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "latency_lock", scope: !675, file: !703, line: 44, type: !704, isLocal: true, isDefinition: true)
!703 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !509, line: 43, elements: !510)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !675, file: !703, line: 46, type: !707, isLocal: true, isDefinition: true)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !382, line: 40, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !382, line: 35, size: 64, elements: !709)
!709 = !{!710, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !708, file: !382, line: 36, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !708, file: !382, line: 37, baseType: !711, size: 32, offset: 32)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "latency_subs", scope: !675, file: !703, line: 52, type: !707, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !675, file: !703, line: 39, type: !717, isLocal: true, isDefinition: true)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, elements: !723)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !703, line: 35, size: 96, elements: !719)
!719 = !{!720, !721, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !718, file: !703, line: 36, baseType: !612, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !718, file: !703, line: 37, baseType: !142, size: 8, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !718, file: !703, line: 38, baseType: !668, size: 32, offset: 64)
!723 = !{!724}
!724 = !DISubrange(count: 0)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !675, file: !703, line: 48, type: !689, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !729, file: !736, line: 47, type: !750, isLocal: true, isDefinition: true)
!729 = distinct !DICompileUnit(language: DW_LANG_C99, file: !730, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !731, retainedTypes: !732, globals: !733, splitDebugInlining: false, nameTableKind: None)
!730 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/boards/nrf/clock_skew")
!731 = !{!612}
!732 = !{!490, !133}
!733 = !{!734, !727, !746}
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "cpus_states", scope: !729, file: !736, line: 50, type: !737, isLocal: true, isDefinition: true)
!736 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 32, elements: !655)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !613, line: 114, size: 128, elements: !741)
!741 = !{!742, !743, !744, !745}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !740, file: !613, line: 115, baseType: !612, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !740, file: !613, line: 141, baseType: !142, size: 8, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !740, file: !613, line: 149, baseType: !131, size: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !740, file: !613, line: 156, baseType: !131, size: 32, offset: 96)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !729, file: !736, line: 55, type: !748, isLocal: true, isDefinition: true)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 8, elements: !655)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, elements: !723)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "static_regions", scope: !753, file: !760, line: 62, type: !880, isLocal: true, isDefinition: true)
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !600, retainedTypes: !755, globals: !756, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/boards/nrf/clock_skew")
!755 = !{!490, !133, !131, !132}
!756 = !{!757, !751}
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !759, file: !760, line: 198, type: !868, isLocal: true, isDefinition: true)
!759 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !760, file: !760, line: 175, type: !761, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !753, retainedNodes: !863)
!760 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!761 = !DISubroutineType(types: !762)
!762 = !{null, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !399, line: 245, size: 1024, elements: !765)
!765 = !{!766, !824, !836, !837, !838, !839, !845, !858}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !764, file: !399, line: 247, baseType: !767, size: 384)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !399, line: 57, size: 384, elements: !768)
!768 = !{!769, !793, !800, !801, !802, !811, !812, !813}
!769 = !DIDerivedType(tag: DW_TAG_member, scope: !767, file: !399, line: 60, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !767, file: !399, line: 60, size: 64, elements: !771)
!771 = !{!772, !787}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !770, file: !399, line: 61, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !409, line: 49, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !409, line: 37, size: 64, elements: !775)
!775 = !{!776, !782}
!776 = !DIDerivedType(tag: DW_TAG_member, scope: !774, file: !409, line: 38, baseType: !777, size: 32)
!777 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !774, file: !409, line: 38, size: 32, elements: !778)
!778 = !{!779, !781}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !777, file: !409, line: 39, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !777, file: !409, line: 40, baseType: !780, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, scope: !774, file: !409, line: 42, baseType: !783, size: 32, offset: 32)
!783 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !774, file: !409, line: 42, size: 32, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !783, file: !409, line: 43, baseType: !780, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !783, file: !409, line: 44, baseType: !780, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !770, file: !399, line: 62, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !425, line: 49, size: 64, elements: !789)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !788, file: !425, line: 50, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 64, elements: !430)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !767, file: !399, line: 68, baseType: !794, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !435, line: 233, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 231, size: 64, elements: !797)
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !796, file: !435, line: 232, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !409, line: 48, baseType: !774)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !767, file: !399, line: 71, baseType: !142, size: 8, offset: 96)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !767, file: !399, line: 74, baseType: !142, size: 8, offset: 104)
!802 = !DIDerivedType(tag: DW_TAG_member, scope: !767, file: !399, line: 90, baseType: !803, size: 16, offset: 112)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !767, file: !399, line: 90, size: 16, elements: !804)
!804 = !{!805, !810}
!805 = !DIDerivedType(tag: DW_TAG_member, scope: !803, file: !399, line: 91, baseType: !806, size: 16)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !803, file: !399, line: 91, size: 16, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !806, file: !399, line: 96, baseType: !449, size: 8)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !806, file: !399, line: 97, baseType: !142, size: 8, offset: 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !803, file: !399, line: 100, baseType: !454, size: 16)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !767, file: !399, line: 107, baseType: !131, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !767, file: !399, line: 127, baseType: !132, size: 32, offset: 160)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !767, file: !399, line: 131, baseType: !814, size: 192, offset: 192)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !435, line: 244, size: 192, elements: !815)
!815 = !{!816, !817, !823}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !814, file: !435, line: 245, baseType: !773, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !814, file: !435, line: 246, baseType: !818, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !435, line: 242, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !822}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !814, file: !435, line: 249, baseType: !370, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !764, file: !399, line: 250, baseType: !825, size: 288, offset: 384)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !471, line: 25, size: 288, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !825, file: !471, line: 26, baseType: !131, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !825, file: !471, line: 27, baseType: !131, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !825, file: !471, line: 28, baseType: !131, size: 32, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !825, file: !471, line: 29, baseType: !131, size: 32, offset: 96)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !825, file: !471, line: 30, baseType: !131, size: 32, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !825, file: !471, line: 31, baseType: !131, size: 32, offset: 160)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !825, file: !471, line: 32, baseType: !131, size: 32, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !825, file: !471, line: 33, baseType: !131, size: 32, offset: 224)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !825, file: !471, line: 34, baseType: !131, size: 32, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !764, file: !399, line: 253, baseType: !132, size: 32, offset: 672)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !764, file: !399, line: 256, baseType: !795, size: 64, offset: 704)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !764, file: !399, line: 294, baseType: !133, size: 32, offset: 768)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !764, file: !399, line: 300, baseType: !840, size: 96, offset: 800)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !399, line: 149, size: 96, elements: !841)
!841 = !{!842, !843, !844}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !840, file: !399, line: 153, baseType: !22, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !840, file: !399, line: 162, baseType: !490, size: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !840, file: !399, line: 168, baseType: !490, size: 32, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !764, file: !399, line: 325, baseType: !846, size: 32, offset: 896)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !375, line: 5073, size: 160, elements: !848)
!848 = !{!849, !855, !856}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !847, file: !375, line: 5074, baseType: !850, size: 96)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !499, line: 56, size: 96, elements: !851)
!851 = !{!852, !853, !854}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !850, file: !499, line: 57, baseType: !502, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !850, file: !499, line: 58, baseType: !132, size: 32, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !850, file: !499, line: 59, baseType: !490, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !847, file: !375, line: 5075, baseType: !795, size: 64, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !847, file: !375, line: 5076, baseType: !857, offset: 160)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !509, line: 43, elements: !510)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !764, file: !399, line: 343, baseType: !859, size: 64, offset: 928)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !471, line: 60, size: 64, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !859, file: !471, line: 63, baseType: !131, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !859, file: !471, line: 66, baseType: !131, size: 32, offset: 32)
!863 = !{!864, !865, !866, !867}
!864 = !DILocalVariable(name: "thread", arg: 1, scope: !759, file: !760, line: 175, type: !763)
!865 = !DILocalVariable(name: "region_num", scope: !759, file: !760, line: 200, type: !142)
!866 = !DILocalVariable(name: "guard_start", scope: !759, file: !760, line: 265, type: !22)
!867 = !DILocalVariable(name: "guard_size", scope: !759, file: !760, line: 266, type: !490)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !869, size: 96, elements: !655)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !870, line: 52, size: 96, elements: !871)
!870 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!871 = !{!872, !873, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !869, file: !870, line: 53, baseType: !22, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !869, file: !870, line: 54, baseType: !490, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !869, file: !870, line: 55, baseType: !875, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !876, line: 151, baseType: !877)
!876 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !876, line: 149, size: 32, elements: !878)
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !877, file: !876, line: 150, baseType: !131, size: 32)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 96, elements: !655)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !884, file: !916, line: 39, type: !142, isLocal: true, isDefinition: true)
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !600, retainedTypes: !886, globals: !915, splitDebugInlining: false, nameTableKind: None)
!885 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/boards/nrf/clock_skew")
!886 = !{!887, !132, !133, !903, !142}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !889, line: 1226, baseType: !890)
!889 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !889, line: 1213, size: 352, elements: !891)
!891 = !{!892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !890, file: !889, line: 1215, baseType: !271, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !890, file: !889, line: 1216, baseType: !262, size: 32, offset: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !890, file: !889, line: 1217, baseType: !262, size: 32, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !890, file: !889, line: 1218, baseType: !262, size: 32, offset: 96)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !890, file: !889, line: 1219, baseType: !262, size: 32, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !890, file: !889, line: 1220, baseType: !262, size: 32, offset: 160)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !890, file: !889, line: 1221, baseType: !262, size: 32, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !890, file: !889, line: 1222, baseType: !262, size: 32, offset: 224)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !890, file: !889, line: 1223, baseType: !262, size: 32, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !890, file: !889, line: 1224, baseType: !262, size: 32, offset: 288)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !890, file: !889, line: 1225, baseType: !262, size: 32, offset: 320)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !906, line: 27, size: 96, elements: !907)
!906 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!907 = !{!908, !909, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !905, file: !906, line: 29, baseType: !131, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !905, file: !906, line: 31, baseType: !159, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !905, file: !906, line: 37, baseType: !911, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !876, line: 146, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !876, line: 141, size: 32, elements: !913)
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !912, file: !876, line: 143, baseType: !131, size: 32)
!915 = !{!882}
!916 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "__init_malloc_prepare", scope: !919, file: !1038, line: 137, type: !1072, isLocal: true, isDefinition: true, align: 32)
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !600, retainedTypes: !921, globals: !1035, splitDebugInlining: false, nameTableKind: None)
!920 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/newlib/libc-hooks.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/boards/nrf/clock_skew")
!921 = !{!529, !22, !490, !132, !922, !946, !368, !133}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !375, line: 2909, size: 128, elements: !924)
!924 = !{!925, !944, !945}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !923, file: !375, line: 2910, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !435, line: 233, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 231, size: 64, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !927, file: !435, line: 232, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !409, line: 48, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !409, line: 37, size: 64, elements: !932)
!932 = !{!933, !939}
!933 = !DIDerivedType(tag: DW_TAG_member, scope: !931, file: !409, line: 38, baseType: !934, size: 32)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !931, file: !409, line: 38, size: 32, elements: !935)
!935 = !{!936, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !934, file: !409, line: 39, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !934, file: !409, line: 40, baseType: !937, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, scope: !931, file: !409, line: 42, baseType: !940, size: 32, offset: 32)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !931, file: !409, line: 42, size: 32, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !940, file: !409, line: 43, baseType: !937, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !940, file: !409, line: 44, baseType: !937, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !923, file: !375, line: 2911, baseType: !32, size: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !923, file: !375, line: 2912, baseType: !32, size: 32, offset: 96)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !375, line: 2720, size: 160, elements: !948)
!948 = !{!949, !950, !1033, !1034}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !947, file: !375, line: 2722, baseType: !926, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !947, file: !375, line: 2724, baseType: !951, size: 32, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !399, line: 245, size: 1024, elements: !953)
!953 = !{!954, !994, !1006, !1007, !1008, !1009, !1015, !1028}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !952, file: !399, line: 247, baseType: !955, size: 384)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !399, line: 57, size: 384, elements: !956)
!956 = !{!957, !968, !970, !971, !972, !981, !982, !983}
!957 = !DIDerivedType(tag: DW_TAG_member, scope: !955, file: !399, line: 60, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !955, file: !399, line: 60, size: 64, elements: !959)
!959 = !{!960, !962}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !958, file: !399, line: 61, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !409, line: 49, baseType: !931)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !958, file: !399, line: 62, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !425, line: 49, size: 64, elements: !964)
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !963, file: !425, line: 50, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 64, elements: !430)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !955, file: !399, line: 68, baseType: !969, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !955, file: !399, line: 71, baseType: !142, size: 8, offset: 96)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !955, file: !399, line: 74, baseType: !142, size: 8, offset: 104)
!972 = !DIDerivedType(tag: DW_TAG_member, scope: !955, file: !399, line: 90, baseType: !973, size: 16, offset: 112)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !955, file: !399, line: 90, size: 16, elements: !974)
!974 = !{!975, !980}
!975 = !DIDerivedType(tag: DW_TAG_member, scope: !973, file: !399, line: 91, baseType: !976, size: 16)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !973, file: !399, line: 91, size: 16, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !976, file: !399, line: 96, baseType: !449, size: 8)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !976, file: !399, line: 97, baseType: !142, size: 8, offset: 8)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !973, file: !399, line: 100, baseType: !454, size: 16)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !955, file: !399, line: 107, baseType: !131, size: 32, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !955, file: !399, line: 127, baseType: !132, size: 32, offset: 160)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !955, file: !399, line: 131, baseType: !984, size: 192, offset: 192)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !435, line: 244, size: 192, elements: !985)
!985 = !{!986, !987, !993}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !984, file: !435, line: 245, baseType: !961, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !984, file: !435, line: 246, baseType: !988, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !435, line: 242, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !992}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !984, file: !435, line: 249, baseType: !370, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !952, file: !399, line: 250, baseType: !995, size: 288, offset: 384)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !471, line: 25, size: 288, elements: !996)
!996 = !{!997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !995, file: !471, line: 26, baseType: !131, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !995, file: !471, line: 27, baseType: !131, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !995, file: !471, line: 28, baseType: !131, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !995, file: !471, line: 29, baseType: !131, size: 32, offset: 96)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !995, file: !471, line: 30, baseType: !131, size: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !995, file: !471, line: 31, baseType: !131, size: 32, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !995, file: !471, line: 32, baseType: !131, size: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !995, file: !471, line: 33, baseType: !131, size: 32, offset: 224)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !995, file: !471, line: 34, baseType: !131, size: 32, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !952, file: !399, line: 253, baseType: !132, size: 32, offset: 672)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !952, file: !399, line: 256, baseType: !926, size: 64, offset: 704)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !952, file: !399, line: 294, baseType: !133, size: 32, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !952, file: !399, line: 300, baseType: !1010, size: 96, offset: 800)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !399, line: 149, size: 96, elements: !1011)
!1011 = !{!1012, !1013, !1014}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1010, file: !399, line: 153, baseType: !22, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1010, file: !399, line: 162, baseType: !490, size: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !1010, file: !399, line: 168, baseType: !490, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !952, file: !399, line: 325, baseType: !1016, size: 32, offset: 896)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !375, line: 5073, size: 160, elements: !1018)
!1018 = !{!1019, !1025, !1026}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !1017, file: !375, line: 5074, baseType: !1020, size: 96)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !499, line: 56, size: 96, elements: !1021)
!1021 = !{!1022, !1023, !1024}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !1020, file: !499, line: 57, baseType: !502, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !1020, file: !499, line: 58, baseType: !132, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !1020, file: !499, line: 59, baseType: !490, size: 32, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !1017, file: !375, line: 5075, baseType: !926, size: 64, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1017, file: !375, line: 5076, baseType: !1027, offset: 160)
