; ModuleID = 'build/arduino_mkrzero/sensor/lis2dh/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.anon.10] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.10 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.gpio_sam0_config = type { %union.anon.1, %struct.PortGroup*, i8 }
%union.anon.1 = type { i32 }
%struct.PortGroup = type { %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, [4 x i8], [16 x %union.PORT_PMUX_Type], [32 x %union.PORT_PMUX_Type], [32 x i8] }
%union.PORT_DIR_Type = type { %union.anon.1 }
%union.PORT_PMUX_Type = type { %struct.anon.10 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/sensor/lis2dh/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/sensor/lis2dh")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/sensor/lis2dh")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/sensor/lis2dh")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !111, file: !852, line: 202, type: !853, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !851, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/sensor/lis2dh")
!113 = !{!102, !103, !114, !243, !582, !583, !650}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !116, line: 335, baseType: !117)
!116 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 320, size: 288, elements: !118)
!118 = !{!119, !132, !142, !157, !168, !179, !183, !194, !195, !206, !207, !222, !223, !233}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !117, file: !116, line: 321, baseType: !120, size: 16)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !116, line: 50, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 43, size: 16, elements: !123)
!123 = !{!124, !131}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !122, file: !116, line: 48, baseType: !125, size: 16)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !116, line: 44, size: 16, elements: !126)
!126 = !{!127, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !125, file: !116, line: 45, baseType: !128, size: 7, flags: DIFlagBitField, extraData: i64 0)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !129)
!129 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !125, file: !116, line: 47, baseType: !128, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !122, file: !116, line: 49, baseType: !128, size: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !117, file: !116, line: 322, baseType: !133, size: 16, offset: 16)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 16, elements: !140)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !135, line: 52, baseType: !136)
!135 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !139)
!139 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!140 = !{!141}
!141 = !DISubrange(count: 2)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !117, file: !116, line: 323, baseType: !143, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !116, line: 107, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 94, size: 32, elements: !146)
!146 = !{!147, !156}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !145, file: !116, line: 105, baseType: !148, size: 32)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !145, file: !116, line: 95, size: 32, elements: !149)
!149 = !{!150, !152, !153, !154, !155}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !148, file: !116, line: 97, baseType: !151, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !148, file: !116, line: 99, baseType: !151, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !148, file: !116, line: 100, baseType: !151, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !148, file: !116, line: 102, baseType: !151, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !148, file: !116, line: 103, baseType: !151, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !145, file: !116, line: 106, baseType: !151, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !117, file: !116, line: 324, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !116, line: 155, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 148, size: 32, elements: !161)
!161 = !{!162, !167}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !160, file: !116, line: 153, baseType: !163, size: 32)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !160, file: !116, line: 149, size: 32, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !163, file: !116, line: 150, baseType: !151, size: 16, flags: DIFlagBitField, extraData: i64 0)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !163, file: !116, line: 151, baseType: !151, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !160, file: !116, line: 154, baseType: !151, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !117, file: !116, line: 325, baseType: !169, size: 8, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !116, line: 194, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 187, size: 8, elements: !172)
!172 = !{!173, !178}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !171, file: !116, line: 192, baseType: !174, size: 8)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !116, line: 188, size: 8, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !174, file: !116, line: 189, baseType: !138, size: 1, flags: DIFlagBitField, extraData: i64 0)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !174, file: !116, line: 190, baseType: !138, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !171, file: !116, line: 193, baseType: !138, size: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !117, file: !116, line: 326, baseType: !180, size: 24, offset: 104)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 24, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 3)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !117, file: !116, line: 327, baseType: !184, size: 8, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !116, line: 215, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 208, size: 8, elements: !187)
!187 = !{!188, !193}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !186, file: !116, line: 213, baseType: !189, size: 8)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !116, line: 209, size: 8, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !189, file: !116, line: 210, baseType: !138, size: 1, flags: DIFlagBitField, extraData: i64 0)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !189, file: !116, line: 211, baseType: !138, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !186, file: !116, line: 214, baseType: !138, size: 8)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !117, file: !116, line: 328, baseType: !180, size: 24, offset: 136)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !117, file: !116, line: 329, baseType: !196, size: 8, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !116, line: 236, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 229, size: 8, elements: !199)
!199 = !{!200, !205}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !198, file: !116, line: 234, baseType: !201, size: 8)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !198, file: !116, line: 230, size: 8, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !201, file: !116, line: 231, baseType: !136, size: 1, flags: DIFlagBitField, extraData: i64 0)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !201, file: !116, line: 232, baseType: !136, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !198, file: !116, line: 235, baseType: !138, size: 8)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !117, file: !116, line: 330, baseType: !180, size: 24, offset: 168)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !117, file: !116, line: 331, baseType: !208, size: 16, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !116, line: 262, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 250, size: 16, elements: !211)
!211 = !{!212, !221}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !210, file: !116, line: 260, baseType: !213, size: 16)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !116, line: 251, size: 16, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !213, file: !116, line: 252, baseType: !128, size: 1, flags: DIFlagBitField, extraData: i64 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !213, file: !116, line: 253, baseType: !128, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !213, file: !116, line: 254, baseType: !128, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !213, file: !116, line: 255, baseType: !128, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !213, file: !116, line: 256, baseType: !128, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !213, file: !116, line: 258, baseType: !128, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !210, file: !116, line: 261, baseType: !128, size: 16)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !117, file: !116, line: 332, baseType: !133, size: 16, offset: 208)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !117, file: !116, line: 333, baseType: !224, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !116, line: 290, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 284, size: 32, elements: !227)
!227 = !{!228, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !226, file: !116, line: 288, baseType: !229, size: 32)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !226, file: !116, line: 285, size: 32, elements: !230)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !229, file: !116, line: 286, baseType: !151, size: 22, flags: DIFlagBitField, extraData: i64 0)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !226, file: !116, line: 289, baseType: !151, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !117, file: !116, line: 334, baseType: !234, size: 16, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !116, line: 308, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !116, line: 303, size: 16, elements: !237)
!237 = !{!238, !242}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !236, file: !116, line: 306, baseType: !239, size: 16)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !236, file: !116, line: 304, size: 16, elements: !240)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !239, file: !116, line: 305, baseType: !128, size: 16, flags: DIFlagBitField, extraData: i64 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !236, file: !116, line: 307, baseType: !128, size: 16)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !245, line: 928, baseType: !246)
!245 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !245, line: 899, size: 672, elements: !247)
!247 = !{!248, !272, !296, !322, !347, !363, !364, !382, !383, !400, !411, !412, !427, !447, !448, !460, !472, !482, !483, !500, !504, !515, !516, !528, !540, !541, !552, !568}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !246, file: !245, line: 900, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !245, line: 64, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 43, size: 32, elements: !252)
!252 = !{!253, !271}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !251, file: !245, line: 62, baseType: !254, size: 32)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !251, file: !245, line: 44, size: 32, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !254, file: !245, line: 45, baseType: !151, size: 1, flags: DIFlagBitField, extraData: i64 0)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !254, file: !245, line: 46, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !254, file: !245, line: 47, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !254, file: !245, line: 48, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !254, file: !245, line: 49, baseType: !151, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !254, file: !245, line: 50, baseType: !151, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !254, file: !245, line: 51, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !254, file: !245, line: 52, baseType: !151, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !254, file: !245, line: 53, baseType: !151, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !254, file: !245, line: 54, baseType: !151, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !254, file: !245, line: 55, baseType: !151, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !254, file: !245, line: 56, baseType: !151, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !254, file: !245, line: 58, baseType: !151, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !254, file: !245, line: 59, baseType: !151, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !254, file: !245, line: 60, baseType: !151, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !251, file: !245, line: 63, baseType: !151, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !246, file: !245, line: 901, baseType: !273, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !245, line: 125, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 104, size: 32, elements: !276)
!276 = !{!277, !295}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !275, file: !245, line: 123, baseType: !278, size: 32)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !275, file: !245, line: 105, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !278, file: !245, line: 106, baseType: !151, size: 1, flags: DIFlagBitField, extraData: i64 0)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !278, file: !245, line: 107, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !278, file: !245, line: 108, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !278, file: !245, line: 109, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !278, file: !245, line: 110, baseType: !151, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !278, file: !245, line: 111, baseType: !151, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !278, file: !245, line: 112, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !278, file: !245, line: 113, baseType: !151, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !278, file: !245, line: 114, baseType: !151, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !278, file: !245, line: 115, baseType: !151, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !278, file: !245, line: 116, baseType: !151, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !278, file: !245, line: 117, baseType: !151, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !278, file: !245, line: 119, baseType: !151, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !278, file: !245, line: 120, baseType: !151, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !278, file: !245, line: 121, baseType: !151, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !275, file: !245, line: 124, baseType: !151, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !246, file: !245, line: 902, baseType: !297, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !245, line: 186, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 165, size: 32, elements: !300)
!300 = !{!301, !321}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !299, file: !245, line: 184, baseType: !302, size: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !245, line: 166, size: 32, elements: !303)
!303 = !{!304, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !302, file: !245, line: 167, baseType: !305, size: 1, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !151)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !302, file: !245, line: 168, baseType: !305, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !302, file: !245, line: 169, baseType: !305, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !302, file: !245, line: 170, baseType: !305, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !302, file: !245, line: 171, baseType: !305, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !302, file: !245, line: 172, baseType: !305, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !302, file: !245, line: 173, baseType: !305, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !302, file: !245, line: 174, baseType: !305, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !302, file: !245, line: 175, baseType: !305, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !302, file: !245, line: 176, baseType: !305, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !302, file: !245, line: 177, baseType: !305, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !302, file: !245, line: 178, baseType: !305, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !302, file: !245, line: 180, baseType: !305, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !302, file: !245, line: 181, baseType: !305, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !302, file: !245, line: 182, baseType: !305, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !299, file: !245, line: 185, baseType: !151, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !246, file: !245, line: 903, baseType: !323, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !245, line: 247, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 226, size: 32, elements: !327)
!327 = !{!328, !346}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !326, file: !245, line: 245, baseType: !329, size: 32)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !245, line: 227, size: 32, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !329, file: !245, line: 228, baseType: !151, size: 1, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !329, file: !245, line: 229, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !329, file: !245, line: 230, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !329, file: !245, line: 231, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !329, file: !245, line: 232, baseType: !151, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !329, file: !245, line: 233, baseType: !151, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !329, file: !245, line: 234, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !329, file: !245, line: 235, baseType: !151, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !329, file: !245, line: 236, baseType: !151, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !329, file: !245, line: 237, baseType: !151, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !329, file: !245, line: 238, baseType: !151, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !329, file: !245, line: 239, baseType: !151, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !329, file: !245, line: 241, baseType: !151, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !329, file: !245, line: 242, baseType: !151, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !329, file: !245, line: 243, baseType: !151, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !326, file: !245, line: 246, baseType: !151, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !246, file: !245, line: 904, baseType: !348, size: 16, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !245, line: 300, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 287, size: 16, elements: !351)
!351 = !{!352, !362}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !350, file: !245, line: 298, baseType: !353, size: 16)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !350, file: !245, line: 288, size: 16, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !361}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !353, file: !245, line: 290, baseType: !128, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !353, file: !245, line: 291, baseType: !128, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !353, file: !245, line: 293, baseType: !128, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !353, file: !245, line: 294, baseType: !128, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !353, file: !245, line: 295, baseType: !128, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !353, file: !245, line: 296, baseType: !128, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !353, file: !245, line: 297, baseType: !128, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !350, file: !245, line: 299, baseType: !128, size: 16)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !246, file: !245, line: 905, baseType: !133, size: 16, offset: 144)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !246, file: !245, line: 906, baseType: !365, size: 16, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !245, line: 352, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 336, size: 16, elements: !368)
!368 = !{!369, !381}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !367, file: !245, line: 350, baseType: !370, size: 16)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !367, file: !245, line: 337, size: 16, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !370, file: !245, line: 339, baseType: !128, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !370, file: !245, line: 340, baseType: !128, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !370, file: !245, line: 341, baseType: !128, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !370, file: !245, line: 342, baseType: !128, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !370, file: !245, line: 343, baseType: !128, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !370, file: !245, line: 344, baseType: !128, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !370, file: !245, line: 345, baseType: !128, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !370, file: !245, line: 346, baseType: !128, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !370, file: !245, line: 348, baseType: !128, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !367, file: !245, line: 351, baseType: !128, size: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !246, file: !245, line: 907, baseType: !133, size: 16, offset: 176)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !246, file: !245, line: 908, baseType: !384, size: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !245, line: 398, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 381, size: 32, elements: !387)
!387 = !{!388, !399}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !386, file: !245, line: 396, baseType: !389, size: 32)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !245, line: 382, size: 32, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !389, file: !245, line: 384, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !389, file: !245, line: 385, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !389, file: !245, line: 386, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !389, file: !245, line: 388, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !389, file: !245, line: 389, baseType: !151, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !389, file: !245, line: 390, baseType: !151, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !389, file: !245, line: 392, baseType: !151, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !389, file: !245, line: 394, baseType: !151, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !386, file: !245, line: 397, baseType: !151, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !246, file: !245, line: 909, baseType: !401, size: 8, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !245, line: 433, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 426, size: 8, elements: !404)
!404 = !{!405, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !403, file: !245, line: 431, baseType: !406, size: 8)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !403, file: !245, line: 427, size: 8, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !406, file: !245, line: 428, baseType: !138, size: 5, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !406, file: !245, line: 430, baseType: !138, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !403, file: !245, line: 432, baseType: !138, size: 8)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !246, file: !245, line: 910, baseType: !180, size: 24, offset: 232)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !246, file: !245, line: 911, baseType: !413, size: 32, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !245, line: 462, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 448, size: 32, elements: !416)
!416 = !{!417, !426}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !415, file: !245, line: 460, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !415, file: !245, line: 449, size: 32, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !418, file: !245, line: 451, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !418, file: !245, line: 453, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !418, file: !245, line: 454, baseType: !151, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !418, file: !245, line: 455, baseType: !151, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !418, file: !245, line: 457, baseType: !151, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !418, file: !245, line: 459, baseType: !151, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !415, file: !245, line: 461, baseType: !151, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !246, file: !245, line: 912, baseType: !428, size: 16, offset: 288)
!428 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !245, line: 520, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 503, size: 16, elements: !431)
!431 = !{!432, !446}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !430, file: !245, line: 518, baseType: !433, size: 16)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !430, file: !245, line: 504, size: 16, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !433, file: !245, line: 506, baseType: !128, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !433, file: !245, line: 507, baseType: !128, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !433, file: !245, line: 508, baseType: !128, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !433, file: !245, line: 509, baseType: !128, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !433, file: !245, line: 510, baseType: !128, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !433, file: !245, line: 511, baseType: !128, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !433, file: !245, line: 512, baseType: !128, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !433, file: !245, line: 513, baseType: !128, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !433, file: !245, line: 514, baseType: !128, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !433, file: !245, line: 515, baseType: !128, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !433, file: !245, line: 516, baseType: !128, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !430, file: !245, line: 519, baseType: !128, size: 16)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !246, file: !245, line: 913, baseType: !133, size: 16, offset: 304)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !246, file: !245, line: 914, baseType: !449, size: 32, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !245, line: 559, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 552, size: 32, elements: !452)
!452 = !{!453, !459}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !451, file: !245, line: 557, baseType: !454, size: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !451, file: !245, line: 553, size: 32, elements: !455)
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !454, file: !245, line: 554, baseType: !151, size: 10, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !454, file: !245, line: 555, baseType: !151, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !454, file: !245, line: 556, baseType: !151, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !451, file: !245, line: 558, baseType: !151, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !246, file: !245, line: 915, baseType: !461, size: 32, offset: 352)
!461 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !245, line: 585, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 578, size: 32, elements: !464)
!464 = !{!465, !471}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !463, file: !245, line: 583, baseType: !466, size: 32)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !463, file: !245, line: 579, size: 32, elements: !467)
!467 = !{!468, !469, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !466, file: !245, line: 580, baseType: !151, size: 16, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !466, file: !245, line: 581, baseType: !151, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !466, file: !245, line: 582, baseType: !151, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !463, file: !245, line: 584, baseType: !151, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !246, file: !245, line: 916, baseType: !473, size: 8, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !245, line: 610, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 604, size: 8, elements: !476)
!476 = !{!477, !481}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !475, file: !245, line: 608, baseType: !478, size: 8)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !245, line: 605, size: 8, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !478, file: !245, line: 607, baseType: !138, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !475, file: !245, line: 609, baseType: !138, size: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !246, file: !245, line: 917, baseType: !180, size: 24, offset: 392)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !246, file: !245, line: 918, baseType: !484, size: 32, offset: 416)
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !245, line: 639, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 622, size: 32, elements: !487)
!487 = !{!488, !499}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !486, file: !245, line: 637, baseType: !489, size: 32)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !486, file: !245, line: 623, size: 32, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !489, file: !245, line: 625, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !489, file: !245, line: 626, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !489, file: !245, line: 627, baseType: !151, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !489, file: !245, line: 629, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !489, file: !245, line: 631, baseType: !151, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !489, file: !245, line: 632, baseType: !151, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !489, file: !245, line: 634, baseType: !151, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !489, file: !245, line: 635, baseType: !151, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !486, file: !245, line: 638, baseType: !151, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !246, file: !245, line: 919, baseType: !501, size: 32, offset: 448)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 4)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !246, file: !245, line: 920, baseType: !505, size: 16, offset: 480)
!505 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !245, line: 715, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 706, size: 16, elements: !508)
!508 = !{!509, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !507, file: !245, line: 713, baseType: !510, size: 16)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !507, file: !245, line: 707, size: 16, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !510, file: !245, line: 709, baseType: !128, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !510, file: !245, line: 711, baseType: !128, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !507, file: !245, line: 714, baseType: !128, size: 16)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !246, file: !245, line: 921, baseType: !133, size: 16, offset: 496)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !246, file: !245, line: 922, baseType: !517, size: 32, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !245, line: 739, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 729, size: 32, elements: !520)
!520 = !{!521, !527}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !519, file: !245, line: 737, baseType: !522, size: 32)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !519, file: !245, line: 730, size: 32, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !522, file: !245, line: 732, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !522, file: !245, line: 733, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !522, file: !245, line: 735, baseType: !151, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !519, file: !245, line: 738, baseType: !151, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !246, file: !245, line: 923, baseType: !529, size: 8, offset: 544)
!529 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !245, line: 765, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 756, size: 8, elements: !532)
!532 = !{!533, !539}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !531, file: !245, line: 763, baseType: !534, size: 8)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !531, file: !245, line: 757, size: 8, elements: !535)
!535 = !{!536, !537, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !534, file: !245, line: 759, baseType: !138, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !534, file: !245, line: 761, baseType: !138, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !534, file: !245, line: 762, baseType: !138, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !531, file: !245, line: 764, baseType: !138, size: 8)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !246, file: !245, line: 924, baseType: !180, size: 24, offset: 552)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !246, file: !245, line: 925, baseType: !542, size: 32, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !245, line: 789, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 781, size: 32, elements: !545)
!545 = !{!546, !551}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !544, file: !245, line: 787, baseType: !547, size: 32)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !544, file: !245, line: 782, size: 32, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !547, file: !245, line: 783, baseType: !151, size: 12, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !547, file: !245, line: 785, baseType: !151, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !544, file: !245, line: 788, baseType: !151, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !246, file: !245, line: 926, baseType: !553, size: 32, offset: 608)
!553 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !245, line: 820, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 805, size: 32, elements: !556)
!556 = !{!557, !567}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !555, file: !245, line: 818, baseType: !558, size: 32)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !555, file: !245, line: 806, size: 32, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !558, file: !245, line: 807, baseType: !151, size: 2, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !558, file: !245, line: 808, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !558, file: !245, line: 809, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !558, file: !245, line: 810, baseType: !151, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !558, file: !245, line: 812, baseType: !151, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !558, file: !245, line: 814, baseType: !151, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !558, file: !245, line: 816, baseType: !151, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !555, file: !245, line: 819, baseType: !151, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !246, file: !245, line: 927, baseType: !569, size: 8, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !245, line: 881, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !245, line: 872, size: 8, elements: !573)
!573 = !{!574, !581}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !572, file: !245, line: 879, baseType: !575, size: 8)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !572, file: !245, line: 873, size: 8, elements: !576)
!576 = !{!577, !578, !579, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !575, file: !245, line: 874, baseType: !138, size: 1, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !575, file: !245, line: 875, baseType: !138, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !575, file: !245, line: 876, baseType: !138, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !575, file: !245, line: 877, baseType: !138, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !572, file: !245, line: 880, baseType: !138, size: 8)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !585, line: 290, baseType: !586)
!585 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !585, line: 284, size: 96, elements: !587)
!587 = !{!588, !598, !609, !622, !639}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !586, file: !585, line: 285, baseType: !589, size: 8)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !585, line: 49, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !585, line: 43, size: 8, elements: !592)
!592 = !{!593, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !591, file: !585, line: 47, baseType: !594, size: 8)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !591, file: !585, line: 44, size: 8, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !594, file: !585, line: 45, baseType: !138, size: 1, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !591, file: !585, line: 48, baseType: !138, size: 8)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !586, file: !585, line: 286, baseType: !599, size: 8, offset: 8)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !585, line: 67, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !585, line: 61, size: 8, elements: !603)
!603 = !{!604, !608}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !602, file: !585, line: 65, baseType: !605, size: 8)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !602, file: !585, line: 62, size: 8, elements: !606)
!606 = !{!607}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !605, file: !585, line: 64, baseType: !138, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !602, file: !585, line: 66, baseType: !138, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !586, file: !585, line: 287, baseType: !610, size: 16, offset: 16)
!610 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !585, line: 89, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !585, line: 79, size: 16, elements: !613)
!613 = !{!614, !621}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !612, file: !585, line: 87, baseType: !615, size: 16)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !612, file: !585, line: 80, size: 16, elements: !616)
!616 = !{!617, !618, !619, !620}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !615, file: !585, line: 81, baseType: !128, size: 6, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !615, file: !585, line: 83, baseType: !128, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !615, file: !585, line: 85, baseType: !128, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !615, file: !585, line: 86, baseType: !128, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !612, file: !585, line: 88, baseType: !128, size: 16)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !586, file: !585, line: 288, baseType: !623, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !585, line: 214, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !585, line: 199, size: 32, elements: !626)
!626 = !{!627, !638}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !625, file: !585, line: 212, baseType: !628, size: 32)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !625, file: !585, line: 200, size: 32, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !628, file: !585, line: 201, baseType: !151, size: 4, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !628, file: !585, line: 203, baseType: !151, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !628, file: !585, line: 205, baseType: !151, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !628, file: !585, line: 206, baseType: !151, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !628, file: !585, line: 207, baseType: !151, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !628, file: !585, line: 208, baseType: !151, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !628, file: !585, line: 209, baseType: !151, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !628, file: !585, line: 210, baseType: !151, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !625, file: !585, line: 213, baseType: !151, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !586, file: !585, line: 289, baseType: !640, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !585, line: 268, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !585, line: 260, size: 32, elements: !643)
!643 = !{!644, !649}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !642, file: !585, line: 266, baseType: !645, size: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !642, file: !585, line: 261, size: 32, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !645, file: !585, line: 262, baseType: !151, size: 4, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !645, file: !585, line: 264, baseType: !151, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !642, file: !585, line: 267, baseType: !151, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !652, line: 513, baseType: !653)
!652 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !652, line: 494, size: 480, elements: !654)
!654 = !{!655, !661, !671, !675, !685, !695, !705, !715, !719, !735, !751, !767, !797, !801, !811, !821, !831, !835}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !653, file: !652, line: 495, baseType: !656, size: 8)
!656 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !652, line: 45, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 43, size: 8, elements: !659)
!659 = !{!660}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !658, file: !652, line: 44, baseType: !138, size: 8)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !653, file: !652, line: 496, baseType: !662, size: 8, offset: 8)
!662 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !652, line: 61, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 55, size: 8, elements: !665)
!665 = !{!666, !670}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !664, file: !652, line: 59, baseType: !667, size: 8)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !652, line: 56, size: 8, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !667, file: !652, line: 57, baseType: !138, size: 2, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !664, file: !652, line: 60, baseType: !138, size: 8)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !653, file: !652, line: 497, baseType: !672, size: 48, offset: 16)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 48, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 6)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !653, file: !652, line: 498, baseType: !676, size: 8, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !652, line: 86, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 80, size: 8, elements: !679)
!679 = !{!680, !684}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !678, file: !652, line: 84, baseType: !681, size: 8)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !652, line: 81, size: 8, elements: !682)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !681, file: !652, line: 82, baseType: !138, size: 3, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !678, file: !652, line: 85, baseType: !138, size: 8)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !653, file: !652, line: 499, baseType: !686, size: 8, offset: 72)
!686 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !652, line: 121, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 115, size: 8, elements: !689)
!689 = !{!690, !694}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !688, file: !652, line: 119, baseType: !691, size: 8)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !688, file: !652, line: 116, size: 8, elements: !692)
!692 = !{!693}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !691, file: !652, line: 117, baseType: !138, size: 3, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !688, file: !652, line: 120, baseType: !138, size: 8)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !653, file: !652, line: 500, baseType: !696, size: 8, offset: 80)
!696 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !652, line: 156, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 150, size: 8, elements: !699)
!699 = !{!700, !704}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !698, file: !652, line: 154, baseType: !701, size: 8)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !698, file: !652, line: 151, size: 8, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !701, file: !652, line: 152, baseType: !138, size: 3, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !698, file: !652, line: 155, baseType: !138, size: 8)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !653, file: !652, line: 501, baseType: !706, size: 8, offset: 88)
!706 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !652, line: 191, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 185, size: 8, elements: !709)
!709 = !{!710, !714}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !708, file: !652, line: 189, baseType: !711, size: 8)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !708, file: !652, line: 186, size: 8, elements: !712)
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !711, file: !652, line: 187, baseType: !138, size: 3, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !708, file: !652, line: 190, baseType: !138, size: 8)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !653, file: !652, line: 502, baseType: !716, size: 64, offset: 96)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 8)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !653, file: !652, line: 503, baseType: !720, size: 32, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !652, line: 232, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 220, size: 32, elements: !723)
!723 = !{!724, !734}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !722, file: !652, line: 230, baseType: !725, size: 32)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !722, file: !652, line: 221, size: 32, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !725, file: !652, line: 222, baseType: !151, size: 1, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !725, file: !652, line: 223, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !725, file: !652, line: 224, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !725, file: !652, line: 225, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !725, file: !652, line: 226, baseType: !151, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !725, file: !652, line: 227, baseType: !151, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !725, file: !652, line: 228, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !722, file: !652, line: 231, baseType: !151, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !653, file: !652, line: 504, baseType: !736, size: 32, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !652, line: 268, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 256, size: 32, elements: !739)
!739 = !{!740, !750}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !738, file: !652, line: 266, baseType: !741, size: 32)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !738, file: !652, line: 257, size: 32, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !741, file: !652, line: 258, baseType: !151, size: 1, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !741, file: !652, line: 259, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !741, file: !652, line: 260, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !741, file: !652, line: 261, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !741, file: !652, line: 262, baseType: !151, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !741, file: !652, line: 263, baseType: !151, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !741, file: !652, line: 264, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !738, file: !652, line: 267, baseType: !151, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !653, file: !652, line: 505, baseType: !752, size: 32, offset: 224)
!752 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !652, line: 304, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 292, size: 32, elements: !755)
!755 = !{!756, !766}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !754, file: !652, line: 302, baseType: !757, size: 32)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !754, file: !652, line: 293, size: 32, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !757, file: !652, line: 294, baseType: !151, size: 1, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !757, file: !652, line: 295, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !757, file: !652, line: 296, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !757, file: !652, line: 297, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !757, file: !652, line: 298, baseType: !151, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !757, file: !652, line: 299, baseType: !151, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !757, file: !652, line: 300, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !754, file: !652, line: 303, baseType: !151, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !653, file: !652, line: 506, baseType: !768, size: 32, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !652, line: 354, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 328, size: 32, elements: !771)
!771 = !{!772, !796}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !770, file: !652, line: 352, baseType: !773, size: 32)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !770, file: !652, line: 329, size: 32, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !773, file: !652, line: 330, baseType: !151, size: 1, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !773, file: !652, line: 331, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !773, file: !652, line: 332, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !773, file: !652, line: 333, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !773, file: !652, line: 334, baseType: !151, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !773, file: !652, line: 335, baseType: !151, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !773, file: !652, line: 336, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !773, file: !652, line: 337, baseType: !151, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !773, file: !652, line: 338, baseType: !151, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !773, file: !652, line: 339, baseType: !151, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !773, file: !652, line: 340, baseType: !151, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !773, file: !652, line: 341, baseType: !151, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !773, file: !652, line: 342, baseType: !151, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !773, file: !652, line: 343, baseType: !151, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !773, file: !652, line: 344, baseType: !151, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !773, file: !652, line: 345, baseType: !151, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !773, file: !652, line: 346, baseType: !151, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !773, file: !652, line: 347, baseType: !151, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_", scope: !773, file: !652, line: 348, baseType: !151, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "PTC_", scope: !773, file: !652, line: 349, baseType: !151, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_", scope: !773, file: !652, line: 350, baseType: !151, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !770, file: !652, line: 353, baseType: !151, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !653, file: !652, line: 507, baseType: !798, size: 128, offset: 288)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 128, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 16)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !653, file: !652, line: 508, baseType: !802, size: 8, offset: 416)
!802 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENCLR_Type", file: !652, line: 412, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 406, size: 8, elements: !805)
!805 = !{!806, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !804, file: !652, line: 410, baseType: !807, size: 8)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !804, file: !652, line: 407, size: 8, elements: !808)
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !807, file: !652, line: 408, baseType: !138, size: 1, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !804, file: !652, line: 411, baseType: !138, size: 8)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !653, file: !652, line: 509, baseType: !812, size: 8, offset: 424)
!812 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENSET_Type", file: !652, line: 430, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 424, size: 8, elements: !815)
!815 = !{!816, !820}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !814, file: !652, line: 428, baseType: !817, size: 8)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !814, file: !652, line: 425, size: 8, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !817, file: !652, line: 426, baseType: !138, size: 1, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !814, file: !652, line: 429, baseType: !138, size: 8)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !653, file: !652, line: 510, baseType: !822, size: 8, offset: 432)
!822 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTFLAG_Type", file: !652, line: 448, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 442, size: 8, elements: !825)
!825 = !{!826, !830}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !824, file: !652, line: 446, baseType: !827, size: 8)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !824, file: !652, line: 443, size: 8, elements: !828)
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !827, file: !652, line: 444, baseType: !136, size: 1, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !824, file: !652, line: 447, baseType: !138, size: 8)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !653, file: !652, line: 511, baseType: !832, size: 8, offset: 440)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 8, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 1)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "RCAUSE", scope: !653, file: !652, line: 512, baseType: !836, size: 8, offset: 448)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_RCAUSE_Type", file: !652, line: 472, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 460, size: 8, elements: !840)
!840 = !{!841, !850}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !839, file: !652, line: 470, baseType: !842, size: 8)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !839, file: !652, line: 461, size: 8, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "POR", scope: !842, file: !652, line: 462, baseType: !138, size: 1, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "BOD12", scope: !842, file: !652, line: 463, baseType: !138, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !842, file: !652, line: 464, baseType: !138, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "EXT", scope: !842, file: !652, line: 466, baseType: !138, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "WDT", scope: !842, file: !652, line: 467, baseType: !138, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "SYST", scope: !842, file: !652, line: 468, baseType: !138, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !839, file: !652, line: 471, baseType: !138, size: 8)
!851 = !{!109}
!852 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!853 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !855, line: 51, size: 64, elements: !856)
!855 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!856 = !{!857, !886}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !854, file: !855, line: 60, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = !DISubroutineType(types: !860)
!860 = !{!103, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !864, line: 378, size: 192, elements: !865)
!864 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!865 = !{!866, !870, !871, !872, !879, !880}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !863, file: !864, line: 380, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !863, file: !864, line: 382, baseType: !13, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !863, file: !864, line: 384, baseType: !13, size: 32, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !863, file: !864, line: 386, baseType: !873, size: 32, offset: 96)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !864, line: 351, size: 16, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !874, file: !864, line: 359, baseType: !138, size: 8)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !874, file: !864, line: 364, baseType: !878, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!878 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !863, file: !864, line: 388, baseType: !102, size: 32, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !863, file: !864, line: 396, baseType: !881, size: 32, offset: 160)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !864, line: 43, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !885)
!885 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !854, file: !855, line: 65, baseType: !861, size: 32, offset: 32)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !889, file: !896, line: 21, type: !106, isLocal: true, isDefinition: true)
!889 = distinct !DICompileUnit(language: DW_LANG_C99, file: !890, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !891, globals: !895, splitDebugInlining: false, nameTableKind: None)
!890 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/sensor/lis2dh")
!891 = !{!892, !103, !102}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !894, line: 22, baseType: !103)
!894 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!895 = !{!887}
