; ModuleID = './build/i2c_control_EEPROM_with_dma_ex.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GPT_REGISTER_GLOABL_T = type { i32, i32, i32 }
%struct.gpt_context_t = type { i32, %struct.gpt_callback_context_t, i8, i8 }
%struct.gpt_callback_context_t = type { void (i8*)*, i8* }
%struct.gpt_sw_context_t = type { [32 x %struct.gpt_sw_timer_t], i32, i32, i32, i32, i8, i8, i8 }
%struct.gpt_sw_timer_t = type { %struct.gpt_callback_context_t, i32, i8, i8 }
%struct.GDMA_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PDMA_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32 }
%struct.VDMA_REGISTER_T = type { i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32 }
%struct.gdma_user_callback_t = type { void (i32, i8*)*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !2, file: !3, line: 51, type: !90, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !53, globals: !89, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!4 = !{!5, !17, !37, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 163, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!10 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!11 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!12 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!13 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!14 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!15 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!16 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 186, baseType: !18, size: 32, elements: !19)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!20 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!21 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!22 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!23 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!24 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!25 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!26 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!27 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!28 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!29 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!30 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!31 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!32 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!33 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!34 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!35 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!36 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 176, baseType: !18, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!40 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!41 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!42 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!43 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 98, baseType: !18, size: 32, elements: !46)
!45 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!46 = !{!47, !48, !49, !50, !51, !52}
!47 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!48 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!49 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!50 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!51 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!52 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!53 = !{!54, !88}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !56, line: 276, baseType: !57)
!56 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 260, size: 525312, elements: !58)
!58 = !{!59, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !78, !79, !83, !87}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !57, file: !56, line: 261, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !62, line: 48, baseType: !63)
!62 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !64, line: 79, baseType: !18)
!64 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !57, file: !56, line: 262, baseType: !60, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !57, file: !56, line: 263, baseType: !60, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !57, file: !56, line: 264, baseType: !60, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !57, file: !56, line: 265, baseType: !60, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !57, file: !56, line: 266, baseType: !60, size: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !57, file: !56, line: 267, baseType: !60, size: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !57, file: !56, line: 268, baseType: !60, size: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !57, file: !56, line: 269, baseType: !60, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !57, file: !56, line: 270, baseType: !60, size: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !57, file: !56, line: 271, baseType: !75, size: 32, offset: 320)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !57, file: !56, line: 272, baseType: !60, size: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !57, file: !56, line: 273, baseType: !80, size: 523904, offset: 384)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 16372)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !57, file: !56, line: 274, baseType: !84, size: 512, offset: 524288)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !57, file: !56, line: 275, baseType: !84, size: 512, offset: 524800)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!89 = !{!0}
!90 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !91)
!91 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "gp_gpt", scope: !94, file: !95, line: 48, type: !341, isLocal: false, isDefinition: true)
!94 = distinct !DICompileUnit(language: DW_LANG_C99, file: !95, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !96, retainedTypes: !263, globals: !278, splitDebugInlining: false, nameTableKind: None)
!95 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!96 = !{!97, !157, !162, !168, !245, !254, !259}
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 1170, baseType: !18, size: 32, elements: !99)
!98 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!100 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_26M", value: 9)
!101 = !DIEnumerator(name: "HAL_CLOCK_CG_CAMINF48M", value: 10)
!102 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_BUSCK", value: 13)
!103 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_N9", value: 15)
!104 = !DIEnumerator(name: "HAL_CLOCK_CG_BUS", value: 20)
!105 = !DIEnumerator(name: "HAL_CLOCK_CG_CM", value: 21)
!106 = !DIEnumerator(name: "HAL_CLOCK_CG_BSI", value: 23)
!107 = !DIEnumerator(name: "HAL_CLOCK_CG_SEJ", value: 32)
!108 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA", value: 33)
!109 = !DIEnumerator(name: "HAL_CLOCK_CG_USB48M", value: 34)
!110 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC0", value: 35)
!111 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C_D2D", value: 38)
!112 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C2", value: 39)
!113 = !DIEnumerator(name: "HAL_CLOCK_CG_CM4_OSTIMER", value: 42)
!114 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA_AO", value: 44)
!115 = !DIEnumerator(name: "HAL_CLOCK_CG_UART0", value: 45)
!116 = !DIEnumerator(name: "HAL_CLOCK_CG_UART1", value: 46)
!117 = !DIEnumerator(name: "HAL_CLOCK_CG_UART2", value: 47)
!118 = !DIEnumerator(name: "HAL_CLOCK_CG_UART3", value: 48)
!119 = !DIEnumerator(name: "HAL_CLOCK_CG_SPISLV", value: 51)
!120 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI0", value: 52)
!121 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI1", value: 53)
!122 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI2", value: 54)
!123 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI3", value: 55)
!124 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM0", value: 64)
!125 = !DIEnumerator(name: "HAL_CLOCK_CG_BTIF", value: 65)
!126 = !DIEnumerator(name: "HAL_CLOCK_CG_GPTIMER", value: 66)
!127 = !DIEnumerator(name: "HAL_CLOCK_CG_GPCOUNTER", value: 67)
!128 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM1", value: 68)
!129 = !DIEnumerator(name: "HAL_CLOCK_CG_EFUSE", value: 70)
!130 = !DIEnumerator(name: "HAL_CLOCK_CG_LPM", value: 71)
!131 = !DIEnumerator(name: "HAL_CLOCK_CG_CM_SYSROM", value: 72)
!132 = !DIEnumerator(name: "HAL_CLOCK_CG_SFC", value: 73)
!133 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC1", value: 74)
!134 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_DMA", value: 76)
!135 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_BUS", value: 77)
!136 = !DIEnumerator(name: "HAL_CLOCK_CG_DISP_PWM", value: 78)
!137 = !DIEnumerator(name: "HAL_CLOCK_CG_TRNG", value: 80)
!138 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM2", value: 83)
!139 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM3", value: 84)
!140 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM4", value: 85)
!141 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM5", value: 86)
!142 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD", value: 96)
!143 = !DIEnumerator(name: "HAL_CLOCK_CG_RESEIZER", value: 97)
!144 = !DIEnumerator(name: "HAL_CLOCK_CG_ROTDMA", value: 98)
!145 = !DIEnumerator(name: "HAL_CLOCK_CG_CAM_BCLK", value: 99)
!146 = !DIEnumerator(name: "HAL_CLOCK_CG_PAD2CAM", value: 100)
!147 = !DIEnumerator(name: "HAL_CLOCK_CG_G2D", value: 101)
!148 = !DIEnumerator(name: "HAL_CLOCK_CG_MM_COLOR", value: 102)
!149 = !DIEnumerator(name: "HAL_CLOCK_CG_AAL", value: 103)
!150 = !DIEnumerator(name: "HAL_CLOCK_CG_DSI0", value: 104)
!151 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD_APB", value: 105)
!152 = !DIEnumerator(name: "HAL_CLOCK_CG_AUXADC", value: 130)
!153 = !DIEnumerator(name: "HAL_CLOCK_CG_GPDAC", value: 134)
!154 = !DIEnumerator(name: "HAL_CLOCK_CG_SENSOR_DMA", value: 136)
!155 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C1", value: 137)
!156 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C0", value: 138)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !158, line: 82, baseType: !18, size: 32, elements: !159)
!158 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_gpt_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!159 = !{!160, !161}
!160 = !DIEnumerator(name: "GPT_CLOCK_UNGATE", value: 0)
!161 = !DIEnumerator(name: "GPT_CLOCK_GATE", value: 64)
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !158, line: 75, baseType: !18, size: 32, elements: !163)
!163 = !{!164, !165, !166, !167}
!164 = !DIEnumerator(name: "GPT_MODE_ONE_SHOT", value: 0)
!165 = !DIEnumerator(name: "GPT_MODE_REPEAT", value: 16)
!166 = !DIEnumerator(name: "GPT_MODE_KEEP_GO", value: 32)
!167 = !DIEnumerator(name: "GPT_MODE_FREE_RUN", value: 48)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !56, line: 44, baseType: !7, size: 32, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!170 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!171 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!172 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!173 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!174 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!175 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!176 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!177 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!178 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!179 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!180 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!181 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!182 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!183 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!184 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!185 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!186 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!187 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!188 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!189 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!190 = !DIEnumerator(name: "KP_IRQn", value: 10)
!191 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!192 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!193 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!194 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!195 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!196 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!197 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!198 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!199 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!200 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!201 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!202 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!203 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!204 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!205 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!206 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!207 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!208 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!209 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!210 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!211 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!212 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!213 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!214 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!215 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!216 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!217 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!218 = !DIEnumerator(name: "SF_IRQn", value: 38)
!219 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!220 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!221 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!222 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!223 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!224 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!225 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!226 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!227 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!228 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!229 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!230 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!231 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!232 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!233 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!234 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!235 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!236 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!237 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!238 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!239 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!240 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!241 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!242 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!243 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!244 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 846, baseType: !18, size: 32, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253}
!247 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!248 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!249 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!250 = !DIEnumerator(name: "HAL_GPT_3", value: 3)
!251 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!252 = !DIEnumerator(name: "HAL_GPT_5", value: 5)
!253 = !DIEnumerator(name: "HAL_GPT_MAX_PORT", value: 6)
!254 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !255, line: 380, baseType: !18, size: 32, elements: !256)
!255 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!256 = !{!257, !258}
!257 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!258 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !255, line: 397, baseType: !18, size: 32, elements: !260)
!260 = !{!261, !262}
!261 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!262 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!263 = !{!61, !264, !88}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_T", file: !56, line: 1272, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1262, size: 288, elements: !267)
!267 = !{!268, !269, !270, !271, !273, !274, !275, !276, !277}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !266, file: !56, line: 1263, baseType: !60, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !266, file: !56, line: 1264, baseType: !60, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !266, file: !56, line: 1265, baseType: !60, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !266, file: !56, line: 1266, baseType: !272, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !266, file: !56, line: 1267, baseType: !60, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !266, file: !56, line: 1268, baseType: !60, size: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !266, file: !56, line: 1269, baseType: !60, size: 32, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !266, file: !56, line: 1270, baseType: !60, size: 32, offset: 224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !266, file: !56, line: 1271, baseType: !60, size: 32, offset: 256)
!278 = !{!92, !279, !288, !294, !316, !339}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "gp_gpt_glb", scope: !94, file: !95, line: 49, type: !281, isLocal: false, isDefinition: true)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_GLOABL_T", file: !56, line: 1260, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1256, size: 96, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQSTA", scope: !283, file: !56, line: 1257, baseType: !272, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK0", scope: !283, file: !56, line: 1258, baseType: !60, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK1", scope: !283, file: !56, line: 1259, baseType: !60, size: 32, offset: 64)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "flag", scope: !290, file: !95, line: 88, type: !91, isLocal: true, isDefinition: true)
!290 = distinct !DISubprogram(name: "gpt_get_lfosc_clock", scope: !95, file: !95, line: 86, type: !291, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !293)
!291 = !DISubroutineType(types: !292)
!292 = !{null}
!293 = !{}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !94, file: !95, line: 51, type: !296, isLocal: false, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 768, elements: !314)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_context_t", file: !158, line: 116, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 111, size: 128, elements: !299)
!299 = !{!300, !302, !312, !313}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !298, file: !158, line: 112, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !255, line: 400, baseType: !259)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !298, file: !158, line: 113, baseType: !303, size: 64, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_callback_context_t", file: !158, line: 109, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 106, size: 64, elements: !305)
!305 = !{!306, !311}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !304, file: !158, line: 107, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !255, line: 371, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !88}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !304, file: !158, line: 108, baseType: !88, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "has_initilized", scope: !298, file: !158, line: 114, baseType: !91, size: 8, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "is_gpt_locked_sleep", scope: !298, file: !158, line: 115, baseType: !91, size: 8, offset: 104)
!314 = !{!315}
!315 = !DISubrange(count: 6)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "gpt_sw_context", scope: !94, file: !95, line: 52, type: !318, isLocal: false, isDefinition: true)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_context_t", file: !158, line: 134, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 125, size: 4256, elements: !320)
!320 = !{!321, !332, !333, !334, !335, !336, !337, !338}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !319, file: !158, line: 126, baseType: !322, size: 4096)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 4096, elements: !330)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_timer_t", file: !158, line: 123, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 118, size: 128, elements: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !324, file: !158, line: 119, baseType: !303, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "time_out_ms", scope: !324, file: !158, line: 120, baseType: !61, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !324, file: !158, line: 121, baseType: !91, size: 8, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !324, file: !158, line: 122, baseType: !91, size: 8, offset: 104)
!330 = !{!331}
!331 = !DISubrange(count: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_time", scope: !319, file: !158, line: 127, baseType: !61, size: 32, offset: 4096)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "last_absolute_time", scope: !319, file: !158, line: 128, baseType: !61, size: 32, offset: 4128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "used_timer_count", scope: !319, file: !158, line: 129, baseType: !61, size: 32, offset: 4160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "running_timer_count", scope: !319, file: !158, line: 130, baseType: !61, size: 32, offset: 4192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_init", scope: !319, file: !158, line: 131, baseType: !91, size: 8, offset: 4224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_start_from_isr", scope: !319, file: !158, line: 132, baseType: !91, size: 8, offset: 4232)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "is_sw_gpt", scope: !319, file: !158, line: 133, baseType: !91, size: 8, offset: 4240)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "gpt_clock_source", scope: !94, file: !95, line: 53, type: !61, isLocal: false, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 192, elements: !314)
!342 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "gdma", scope: !345, file: !346, line: 46, type: !574, isLocal: false, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !347, retainedTypes: !424, globals: !425, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_pdma_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!347 = !{!348, !353, !358, !97, !365, !371, !168, !381, !386, !392, !396, !400, !406, !420}
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 201, baseType: !7, size: 32, elements: !350)
!349 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gdma.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!350 = !{!351, !352}
!351 = !DIEnumerator(name: "HAL_GDMA_EVENT_TRANSACTION_ERROR", value: -1)
!352 = !DIEnumerator(name: "HAL_GDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 124, baseType: !18, size: 32, elements: !355)
!354 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!355 = !{!356, !357}
!356 = !DIEnumerator(name: "DMA_PD", value: 0)
!357 = !DIEnumerator(name: "DMA_AO", value: 1)
!358 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !359, line: 101, baseType: !7, size: 32, elements: !360)
!359 = !DIFile(filename: "../../../../../driver/chip/inc/hal_clock.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!360 = !{!361, !362, !363, !364}
!361 = !DIEnumerator(name: "HAL_CLOCK_STATUS_UNINITIALIZED", value: -3)
!362 = !DIEnumerator(name: "HAL_CLOCK_STATUS_INVALID_PARAMETER", value: -2)
!363 = !DIEnumerator(name: "HAL_CLOCK_STATUS_ERROR", value: -1)
!364 = !DIEnumerator(name: "HAL_CLOCK_STATUS_OK", value: 0)
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 166, baseType: !7, size: 32, elements: !366)
!366 = !{!367, !368, !369, !370}
!367 = !DIEnumerator(name: "PDMA_ERROR", value: -3)
!368 = !DIEnumerator(name: "PDMA_ERROR_CHANNEL", value: -2)
!369 = !DIEnumerator(name: "PDMA_INVALID_PARAMETER", value: -1)
!370 = !DIEnumerator(name: "PDMA_OK", value: 0)
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 137, baseType: !18, size: 32, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380}
!373 = !DIEnumerator(name: "PDMA_START_CHANNEL", value: 1)
!374 = !DIEnumerator(name: "PDMA_MSDC1", value: 1)
!375 = !DIEnumerator(name: "PDMA_MSDC2", value: 2)
!376 = !DIEnumerator(name: "PDMA_I2C0_TX", value: 3)
!377 = !DIEnumerator(name: "PDMA_I2C0_RX", value: 4)
!378 = !DIEnumerator(name: "PDMA_I2C1_TX", value: 5)
!379 = !DIEnumerator(name: "PDMA_I2C1_RX", value: 6)
!380 = !DIEnumerator(name: "PDMA_END_CHANNEL", value: 7)
!381 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 151, baseType: !18, size: 32, elements: !382)
!382 = !{!383, !384, !385}
!383 = !DIEnumerator(name: "PDMA_BYTE", value: 0)
!384 = !DIEnumerator(name: "PDMA_HALF_WORD", value: 1)
!385 = !DIEnumerator(name: "PDMA_WORD", value: 2)
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 180, baseType: !18, size: 32, elements: !387)
!387 = !{!388, !389, !390, !391}
!388 = !DIEnumerator(name: "PDMA_TX", value: 0)
!389 = !DIEnumerator(name: "PDMA_RX", value: 1)
!390 = !DIEnumerator(name: "PDMA_TX_RINGBUFF", value: 2)
!391 = !DIEnumerator(name: "PDMA_RX_RINGBUFF", value: 3)
!392 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 174, baseType: !18, size: 32, elements: !393)
!393 = !{!394, !395}
!394 = !DIEnumerator(name: "PDMA_IDLE", value: 0)
!395 = !DIEnumerator(name: "PDMA_BUSY", value: 1)
!396 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 159, baseType: !7, size: 32, elements: !397)
!397 = !{!398, !399}
!398 = !DIEnumerator(name: "PDMA_EVENT_TRANSACTION_ERROR", value: -1)
!399 = !DIEnumerator(name: "PDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!400 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 206, baseType: !7, size: 32, elements: !401)
!401 = !{!402, !403, !404, !405}
!402 = !DIEnumerator(name: "VDMA_ERROR", value: -3)
!403 = !DIEnumerator(name: "VDMA_ERROR_CHANNEL", value: -2)
!404 = !DIEnumerator(name: "VDMA_INVALID_PARAMETER", value: -1)
!405 = !DIEnumerator(name: "VDMA_OK", value: 0)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 189, baseType: !18, size: 32, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!408 = !DIEnumerator(name: "VDMA_START_CHANNEL", value: 8)
!409 = !DIEnumerator(name: "VDMA_UART1TX", value: 8)
!410 = !DIEnumerator(name: "VDMA_UART1RX", value: 9)
!411 = !DIEnumerator(name: "VDMA_UART2TX", value: 10)
!412 = !DIEnumerator(name: "VDMA_UART2RX", value: 11)
!413 = !DIEnumerator(name: "VDMA_UART3TX", value: 12)
!414 = !DIEnumerator(name: "VDMA_UART3RX", value: 13)
!415 = !DIEnumerator(name: "VDMA_UART0TX", value: 14)
!416 = !DIEnumerator(name: "VDMA_UART0RX", value: 15)
!417 = !DIEnumerator(name: "VDMA_BTIFTX", value: 16)
!418 = !DIEnumerator(name: "VDMA_BTIFRX", value: 17)
!419 = !DIEnumerator(name: "VDMA_END_CHANNEL", value: 18)
!420 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 222, baseType: !7, size: 32, elements: !421)
!421 = !{!422, !423}
!422 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_ERROR", value: -1)
!423 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!424 = !{!88}
!425 = !{!343, !426, !434, !452, !460, !466, !491, !499, !507, !510, !523, !547, !553, !561, !566}
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "gdma_global", scope: !345, file: !346, line: 49, type: !428, isLocal: false, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 32, elements: !76)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDMA_REGISTER_GLOBAL_T", file: !56, line: 843, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 841, size: 32, elements: !432)
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_GLBSTA", scope: !431, file: !56, line: 842, baseType: !60, size: 32)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "pdma", scope: !345, file: !346, line: 52, type: !436, isLocal: false, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 192, elements: !314)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDMA_REGISTER_T", file: !56, line: 859, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 848, size: 320, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !451}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_WPPT", scope: !439, file: !56, line: 849, baseType: !60, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_WPTO", scope: !439, file: !56, line: 850, baseType: !60, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_COUNT", scope: !439, file: !56, line: 851, baseType: !60, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_CON", scope: !439, file: !56, line: 852, baseType: !60, size: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_START", scope: !439, file: !56, line: 853, baseType: !60, size: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_INTSTA", scope: !439, file: !56, line: 854, baseType: !60, size: 32, offset: 160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_ACKINT", scope: !439, file: !56, line: 855, baseType: !60, size: 32, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_RLCT", scope: !439, file: !56, line: 856, baseType: !272, size: 32, offset: 224)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "DUMMY_OFFSET", scope: !439, file: !56, line: 857, baseType: !450, size: 32, offset: 256)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, elements: !76)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_PGMADDR", scope: !439, file: !56, line: 858, baseType: !60, size: 32, offset: 288)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "pdma_global", scope: !345, file: !346, line: 55, type: !454, isLocal: false, isDefinition: true)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 192, elements: !314)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDMA_REGISTER_GLOBAL_T", file: !56, line: 865, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 863, size: 32, elements: !458)
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_GLBSTA", scope: !457, file: !56, line: 864, baseType: !60, size: 32)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "g_pdma_global_running_bit", scope: !345, file: !346, line: 58, type: !462, isLocal: false, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 48, elements: !314)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !62, line: 24, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !64, line: 43, baseType: !465)
!465 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "vdma", scope: !345, file: !346, line: 64, type: !468, isLocal: false, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 320, elements: !489)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "VDMA_REGISTER_T", file: !56, line: 885, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 870, size: 448, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !482, !483, !484, !485, !486, !487, !488}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_COUNT", scope: !471, file: !56, line: 871, baseType: !60, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_CON", scope: !471, file: !56, line: 872, baseType: !60, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_START", scope: !471, file: !56, line: 873, baseType: !60, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_INTSTA", scope: !471, file: !56, line: 874, baseType: !60, size: 32, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_ACKINT", scope: !471, file: !56, line: 875, baseType: !60, size: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "DUMMY_OFFSET", scope: !471, file: !56, line: 876, baseType: !479, size: 64, offset: 160)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 2)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_PGMADDR", scope: !471, file: !56, line: 877, baseType: !60, size: 32, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_WRPTR", scope: !471, file: !56, line: 878, baseType: !272, size: 32, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_RDPTR", scope: !471, file: !56, line: 879, baseType: !272, size: 32, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_FFCNT", scope: !471, file: !56, line: 880, baseType: !272, size: 32, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_FFSTA", scope: !471, file: !56, line: 881, baseType: !272, size: 32, offset: 352)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_ALTLEN", scope: !471, file: !56, line: 882, baseType: !60, size: 32, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_FFSIZE", scope: !471, file: !56, line: 883, baseType: !60, size: 32, offset: 416)
!489 = !{!490}
!490 = !DISubrange(count: 10)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "vdma_port", scope: !345, file: !346, line: 69, type: !493, isLocal: false, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 320, elements: !489)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "VDMA_REGISTER_PORT_T", file: !56, line: 891, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 889, size: 32, elements: !497)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_PORT", scope: !496, file: !56, line: 890, baseType: !60, size: 32)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "vdma_global", scope: !345, file: !346, line: 75, type: !501, isLocal: false, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 320, elements: !489)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "VDMA_REGISTER_GLOBAL_T", file: !56, line: 898, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 896, size: 32, elements: !505)
!505 = !{!506}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_GLBSTA", scope: !504, file: !56, line: 897, baseType: !60, size: 32)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "g_vdma_global_running_bit", scope: !345, file: !346, line: 80, type: !509, isLocal: false, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 80, elements: !489)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "g_gdma_callback", scope: !345, file: !346, line: 92, type: !512, isLocal: false, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 64, elements: !76)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdma_user_callback_t", file: !346, line: 89, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 86, size: 64, elements: !515)
!515 = !{!516, !522}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !514, file: !346, line: 87, baseType: !517, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gdma_callback_t", file: !349, line: 230, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !521, !88}
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gdma_event_t", file: !349, line: 204, baseType: !348)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !514, file: !346, line: 88, baseType: !88, size: 32, offset: 32)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "count", scope: !525, file: !346, line: 1122, type: !61, isLocal: true, isDefinition: true)
!525 = distinct !DISubprogram(name: "pd_domain_dma_interrupt_hander", scope: !346, file: !346, line: 1108, type: !526, scopeLine: 1110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !345, retainedNodes: !530)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !528}
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !56, line: 125, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !56, line: 123, baseType: !168)
!530 = !{!531, !532, !533, !534, !540, !546}
!531 = !DILocalVariable(name: "irq_number", arg: 1, scope: !525, file: !346, line: 1108, type: !528)
!532 = !DILocalVariable(name: "global_status", scope: !525, file: !346, line: 1113, type: !60)
!533 = !DILocalVariable(name: "gdma_callback", scope: !525, file: !346, line: 1116, type: !517)
!534 = !DILocalVariable(name: "pdma_callback", scope: !525, file: !346, line: 1117, type: !535)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_callback_t", file: !354, line: 288, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !539, !88}
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_event_t", file: !354, line: 162, baseType: !396)
!540 = !DILocalVariable(name: "vdma_callback", scope: !525, file: !346, line: 1118, type: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "vdma_callback_t", file: !354, line: 291, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !545, !88}
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "vdma_event_t", file: !354, line: 225, baseType: !420)
!546 = !DILocalVariable(name: "argument", scope: !525, file: !346, line: 1119, type: !88)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "pdma_init_status", scope: !345, file: !346, line: 61, type: !549, isLocal: true, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 56, elements: !551)
!550 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !463)
!551 = !{!552}
!552 = !DISubrange(count: 7)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "g_pdma_callback", scope: !345, file: !346, line: 104, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 384, elements: !314)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_user_callback_t", file: !346, line: 101, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 98, size: 64, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !557, file: !346, line: 99, baseType: !535, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !557, file: !346, line: 100, baseType: !88, size: 32, offset: 32)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "vdma_init_status", scope: !345, file: !346, line: 83, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 144, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 18)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "g_vdma_callback", scope: !345, file: !346, line: 120, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 640, elements: !489)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "vdma_user_callback_t", file: !346, line: 117, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 114, size: 64, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !570, file: !346, line: 115, baseType: !541, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !570, file: !346, line: 116, baseType: !88, size: 32, offset: 32)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 32, elements: !76)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDMA_REGISTER_T", file: !56, line: 837, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 826, size: 320, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_SRC", scope: !577, file: !56, line: 827, baseType: !60, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_DST", scope: !577, file: !56, line: 828, baseType: !60, size: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_WPPT", scope: !577, file: !56, line: 829, baseType: !60, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_WPTO", scope: !577, file: !56, line: 830, baseType: !60, size: 32, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_COUNT", scope: !577, file: !56, line: 831, baseType: !60, size: 32, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_CON", scope: !577, file: !56, line: 832, baseType: !60, size: 32, offset: 160)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_START", scope: !577, file: !56, line: 833, baseType: !60, size: 32, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_INTSTA", scope: !577, file: !56, line: 834, baseType: !60, size: 32, offset: 224)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_ACKINT", scope: !577, file: !56, line: 835, baseType: !60, size: 32, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_RLCT", scope: !577, file: !56, line: 836, baseType: !272, size: 32, offset: 288)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "gpio_register_base", scope: !591, file: !592, line: 64, type: !692, isLocal: false, isDefinition: true)
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !593, retainedTypes: !687, globals: !691, splitDebugInlining: false, nameTableKind: None)
!592 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!593 = !{!594, !646, !653, !657, !663, !667, !676, !681}
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 339, baseType: !18, size: 32, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!596 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!597 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!598 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!599 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!600 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!601 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!602 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!603 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!604 = !DIEnumerator(name: "HAL_GPIO_8", value: 8)
!605 = !DIEnumerator(name: "HAL_GPIO_9", value: 9)
!606 = !DIEnumerator(name: "HAL_GPIO_10", value: 10)
!607 = !DIEnumerator(name: "HAL_GPIO_11", value: 11)
!608 = !DIEnumerator(name: "HAL_GPIO_12", value: 12)
!609 = !DIEnumerator(name: "HAL_GPIO_13", value: 13)
!610 = !DIEnumerator(name: "HAL_GPIO_14", value: 14)
!611 = !DIEnumerator(name: "HAL_GPIO_15", value: 15)
!612 = !DIEnumerator(name: "HAL_GPIO_16", value: 16)
!613 = !DIEnumerator(name: "HAL_GPIO_17", value: 17)
!614 = !DIEnumerator(name: "HAL_GPIO_18", value: 18)
!615 = !DIEnumerator(name: "HAL_GPIO_19", value: 19)
!616 = !DIEnumerator(name: "HAL_GPIO_20", value: 20)
!617 = !DIEnumerator(name: "HAL_GPIO_21", value: 21)
!618 = !DIEnumerator(name: "HAL_GPIO_22", value: 22)
!619 = !DIEnumerator(name: "HAL_GPIO_23", value: 23)
!620 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!621 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!622 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!623 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!624 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!625 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!626 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!627 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!628 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!629 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!630 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!631 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!632 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!633 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!634 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!635 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!636 = !DIEnumerator(name: "HAL_GPIO_40", value: 40)
!637 = !DIEnumerator(name: "HAL_GPIO_41", value: 41)
!638 = !DIEnumerator(name: "HAL_GPIO_42", value: 42)
!639 = !DIEnumerator(name: "HAL_GPIO_43", value: 43)
!640 = !DIEnumerator(name: "HAL_GPIO_44", value: 44)
!641 = !DIEnumerator(name: "HAL_GPIO_45", value: 45)
!642 = !DIEnumerator(name: "HAL_GPIO_46", value: 46)
!643 = !DIEnumerator(name: "HAL_GPIO_47", value: 47)
!644 = !DIEnumerator(name: "HAL_GPIO_48", value: 48)
!645 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 49)
!646 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !647, line: 224, baseType: !7, size: 32, elements: !648)
!647 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!648 = !{!649, !650, !651, !652}
!649 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!650 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!651 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!652 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !647, line: 210, baseType: !18, size: 32, elements: !654)
!654 = !{!655, !656}
!655 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!656 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !647, line: 233, baseType: !7, size: 32, elements: !658)
!658 = !{!659, !660, !661, !662}
!659 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!660 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!661 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!662 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!663 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !647, line: 217, baseType: !18, size: 32, elements: !664)
!664 = !{!665, !666}
!665 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!666 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 415, baseType: !18, size: 32, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675}
!669 = !DIEnumerator(name: "HAL_GPIO_CLOCK_0", value: 0)
!670 = !DIEnumerator(name: "HAL_GPIO_CLOCK_1", value: 1)
!671 = !DIEnumerator(name: "HAL_GPIO_CLOCK_2", value: 2)
!672 = !DIEnumerator(name: "HAL_GPIO_CLOCK_3", value: 3)
!673 = !DIEnumerator(name: "HAL_GPIO_CLOCK_4", value: 4)
!674 = !DIEnumerator(name: "HAL_GPIO_CLOCK_5", value: 5)
!675 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MAX", value: 6)
!676 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 427, baseType: !18, size: 32, elements: !677)
!677 = !{!678, !679, !680}
!678 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_26M", value: 1)
!679 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_32K", value: 4)
!680 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_MAX", value: 5)
!681 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !647, line: 242, baseType: !18, size: 32, elements: !682)
!682 = !{!683, !684, !685, !686}
!683 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!684 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!685 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!686 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!687 = !{!88, !688, !689, !690}
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_direction_t", file: !647, line: 213, baseType: !653)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !647, line: 220, baseType: !663)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !647, line: 247, baseType: !681)
!691 = !{!589}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !56, line: 1554, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1522, size: 29440, elements: !695)
!695 = !{!696, !708, !712, !721, !722, !731, !732, !741, !742, !752, !753, !762, !763, !772, !773, !782, !783, !792, !796, !805, !806, !815, !816, !825, !834, !835, !844, !848, !857, !858}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !694, file: !56, line: 1523, baseType: !697, size: 256)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 256, elements: !480)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !56, line: 1400, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1395, size: 128, elements: !700)
!700 = !{!701, !702, !703, !704}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !699, file: !56, line: 1396, baseType: !60, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !699, file: !56, line: 1397, baseType: !60, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !699, file: !56, line: 1398, baseType: !60, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !699, file: !56, line: 1399, baseType: !705, size: 32, offset: 96)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 32, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 4)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !694, file: !56, line: 1524, baseType: !709, size: 1792, offset: 256)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 1792, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !694, file: !56, line: 1525, baseType: !713, size: 256, offset: 2048)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 256, elements: !480)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !56, line: 1409, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1404, size: 128, elements: !716)
!716 = !{!717, !718, !719, !720}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !715, file: !56, line: 1405, baseType: !60, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !715, file: !56, line: 1406, baseType: !60, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !715, file: !56, line: 1407, baseType: !60, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !715, file: !56, line: 1408, baseType: !705, size: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !694, file: !56, line: 1526, baseType: !709, size: 1792, offset: 2304)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !694, file: !56, line: 1527, baseType: !723, size: 256, offset: 4096)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 256, elements: !480)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !56, line: 1417, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1412, size: 128, elements: !726)
!726 = !{!727, !728, !729, !730}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !725, file: !56, line: 1413, baseType: !60, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !725, file: !56, line: 1414, baseType: !60, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !725, file: !56, line: 1415, baseType: !60, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !725, file: !56, line: 1416, baseType: !705, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !694, file: !56, line: 1528, baseType: !709, size: 1792, offset: 4352)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !694, file: !56, line: 1529, baseType: !733, size: 256, offset: 6144)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 256, elements: !480)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !56, line: 1426, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1421, size: 128, elements: !736)
!736 = !{!737, !738, !739, !740}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !735, file: !56, line: 1422, baseType: !60, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !735, file: !56, line: 1423, baseType: !60, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !735, file: !56, line: 1424, baseType: !60, size: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !735, file: !56, line: 1425, baseType: !705, size: 32, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !694, file: !56, line: 1530, baseType: !709, size: 1792, offset: 6400)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !694, file: !56, line: 1531, baseType: !743, size: 256, offset: 8192)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 256, elements: !480)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !56, line: 1432, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1429, size: 128, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !745, file: !56, line: 1430, baseType: !60, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !745, file: !56, line: 1431, baseType: !749, size: 96, offset: 32)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 96, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 12)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !694, file: !56, line: 1532, baseType: !709, size: 1792, offset: 8448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !694, file: !56, line: 1533, baseType: !754, size: 256, offset: 10240)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 256, elements: !480)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !56, line: 1440, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1435, size: 128, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !756, file: !56, line: 1436, baseType: !60, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !756, file: !56, line: 1437, baseType: !60, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !756, file: !56, line: 1438, baseType: !60, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !756, file: !56, line: 1439, baseType: !705, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !694, file: !56, line: 1534, baseType: !709, size: 1792, offset: 10496)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !694, file: !56, line: 1535, baseType: !764, size: 256, offset: 12288)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 256, elements: !480)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !56, line: 1448, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1443, size: 128, elements: !767)
!767 = !{!768, !769, !770, !771}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !766, file: !56, line: 1444, baseType: !60, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !766, file: !56, line: 1445, baseType: !60, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !766, file: !56, line: 1446, baseType: !60, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !766, file: !56, line: 1447, baseType: !705, size: 32, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !694, file: !56, line: 1536, baseType: !709, size: 1792, offset: 12544)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !694, file: !56, line: 1537, baseType: !774, size: 256, offset: 14336)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 256, elements: !480)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !56, line: 1455, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1450, size: 128, elements: !777)
!777 = !{!778, !779, !780, !781}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !776, file: !56, line: 1451, baseType: !60, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !776, file: !56, line: 1452, baseType: !60, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !776, file: !56, line: 1453, baseType: !60, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !776, file: !56, line: 1454, baseType: !705, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !694, file: !56, line: 1538, baseType: !709, size: 1792, offset: 14592)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !694, file: !56, line: 1539, baseType: !784, size: 512, offset: 16384)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 512, elements: !706)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !56, line: 1463, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1458, size: 128, elements: !787)
!787 = !{!788, !789, !790, !791}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !786, file: !56, line: 1459, baseType: !60, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !786, file: !56, line: 1460, baseType: !60, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !786, file: !56, line: 1461, baseType: !60, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !786, file: !56, line: 1462, baseType: !705, size: 32, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !694, file: !56, line: 1540, baseType: !793, size: 1536, offset: 16896)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 1536, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !694, file: !56, line: 1541, baseType: !797, size: 256, offset: 18432)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 256, elements: !480)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !56, line: 1471, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1466, size: 128, elements: !800)
!800 = !{!801, !802, !803, !804}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !799, file: !56, line: 1467, baseType: !60, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !799, file: !56, line: 1468, baseType: !60, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !799, file: !56, line: 1469, baseType: !60, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !799, file: !56, line: 1470, baseType: !705, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !694, file: !56, line: 1542, baseType: !709, size: 1792, offset: 18688)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !694, file: !56, line: 1543, baseType: !807, size: 256, offset: 20480)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 256, elements: !480)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !56, line: 1480, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1475, size: 128, elements: !810)
!810 = !{!811, !812, !813, !814}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !809, file: !56, line: 1476, baseType: !60, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !809, file: !56, line: 1477, baseType: !60, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !809, file: !56, line: 1478, baseType: !60, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !809, file: !56, line: 1479, baseType: !705, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !694, file: !56, line: 1544, baseType: !709, size: 1792, offset: 20736)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !694, file: !56, line: 1545, baseType: !817, size: 256, offset: 22528)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 256, elements: !480)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !56, line: 1489, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1484, size: 128, elements: !820)
!820 = !{!821, !822, !823, !824}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !819, file: !56, line: 1485, baseType: !60, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !819, file: !56, line: 1486, baseType: !60, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !819, file: !56, line: 1487, baseType: !60, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !819, file: !56, line: 1488, baseType: !705, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !694, file: !56, line: 1546, baseType: !826, size: 256, offset: 22784)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 256, elements: !480)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !56, line: 1497, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1492, size: 128, elements: !829)
!829 = !{!830, !831, !832, !833}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !828, file: !56, line: 1493, baseType: !60, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !828, file: !56, line: 1494, baseType: !60, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !828, file: !56, line: 1495, baseType: !60, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !828, file: !56, line: 1496, baseType: !705, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !694, file: !56, line: 1547, baseType: !793, size: 1536, offset: 23040)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !694, file: !56, line: 1548, baseType: !836, size: 896, offset: 24576)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !837, size: 896, elements: !551)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !56, line: 1505, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1500, size: 128, elements: !839)
!839 = !{!840, !841, !842, !843}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !838, file: !56, line: 1501, baseType: !60, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !838, file: !56, line: 1502, baseType: !60, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !838, file: !56, line: 1503, baseType: !60, size: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !838, file: !56, line: 1504, baseType: !705, size: 32, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !694, file: !56, line: 1549, baseType: !845, size: 1152, offset: 25472)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 1152, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 144)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !694, file: !56, line: 1550, baseType: !849, size: 512, offset: 26624)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 512, elements: !706)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !56, line: 1513, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1508, size: 128, elements: !852)
!852 = !{!853, !854, !855, !856}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !851, file: !56, line: 1509, baseType: !60, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !851, file: !56, line: 1510, baseType: !60, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !851, file: !56, line: 1511, baseType: !60, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !851, file: !56, line: 1512, baseType: !705, size: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !694, file: !56, line: 1551, baseType: !793, size: 1536, offset: 27136)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !694, file: !56, line: 1552, baseType: !859, size: 768, offset: 28672)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !860, size: 768, elements: !314)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !56, line: 1519, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1516, size: 128, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !861, file: !56, line: 1517, baseType: !60, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !861, file: !56, line: 1518, baseType: !749, size: 96, offset: 32)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "g_uart_hwstatus", scope: !867, file: !868, line: 101, type: !984, isLocal: true, isDefinition: true)
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !869, retainedTypes: !934, globals: !943, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!869 = !{!870, !406, !877, !400, !883, !888, !895, !911, !917, !921, !358, !926, !420}
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 180, baseType: !18, size: 32, elements: !871)
!871 = !{!872, !873, !874, !875, !876}
!872 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!873 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!874 = !DIEnumerator(name: "HAL_UART_2", value: 2)
!875 = !DIEnumerator(name: "HAL_UART_3", value: 3)
!876 = !DIEnumerator(name: "HAL_UART_MAX", value: 4)
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 355, baseType: !7, size: 32, elements: !879)
!878 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!879 = !{!880, !881, !882}
!880 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!881 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!882 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !868, line: 65, baseType: !18, size: 32, elements: !884)
!884 = !{!885, !886, !887}
!885 = !DIEnumerator(name: "UART_HWSTATUS_UNINITIALIZED", value: 0)
!886 = !DIEnumerator(name: "UART_HWSTATUS_POLL_INITIALIZED", value: 1)
!887 = !DIEnumerator(name: "UART_HWSTATUS_DMA_INITIALIZED", value: 2)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 345, baseType: !7, size: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894}
!890 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!891 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!892 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!893 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!894 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!895 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 302, baseType: !18, size: 32, elements: !896)
!896 = !{!897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910}
!897 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!898 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!899 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!900 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!901 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!902 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!903 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!904 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!905 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!906 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!907 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!908 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!909 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!910 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 321, baseType: !18, size: 32, elements: !912)
!912 = !{!913, !914, !915, !916}
!913 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!914 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!915 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!916 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!917 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 330, baseType: !18, size: 32, elements: !918)
!918 = !{!919, !920}
!919 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!920 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 337, baseType: !18, size: 32, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!924 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!925 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!926 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !927, line: 152, baseType: !7, size: 32, elements: !928)
!927 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!928 = !{!929, !930, !931, !932, !933}
!929 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!930 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!931 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!932 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!933 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!934 = !{!88, !61, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_dma_callback_data_t", file: !937, line: 96, baseType: !938)
!937 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_uart_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !937, line: 93, size: 64, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "is_rx", scope: !938, file: !937, line: 94, baseType: !91, size: 8)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "uart_port", scope: !938, file: !937, line: 95, baseType: !942, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !98, line: 186, baseType: !870)
!943 = !{!865, !944, !957, !962, !976, !982}
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "g_uart_callback", scope: !867, file: !868, line: 102, type: !946, isLocal: true, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 256, elements: !706)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_callback_t", file: !868, line: 74, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !868, line: 71, size: 64, elements: !949)
!949 = !{!950, !956}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !948, file: !868, line: 72, baseType: !951, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !878, line: 410, baseType: !952)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DISubroutineType(types: !954)
!954 = !{null, !955, !88}
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !878, line: 359, baseType: !877)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !948, file: !868, line: 73, baseType: !88, size: 32, offset: 32)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "g_uart_dma_callback_data", scope: !867, file: !868, line: 103, type: !959, isLocal: true, isDefinition: true)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 512, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 8)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "g_uart_dma_config", scope: !867, file: !868, line: 104, type: !964, isLocal: true, isDefinition: true)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 896, elements: !706)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !878, line: 390, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !878, line: 382, size: 224, elements: !967)
!967 = !{!968, !970, !971, !972, !973, !974, !975}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !966, file: !878, line: 383, baseType: !969, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !966, file: !878, line: 384, baseType: !61, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !966, file: !878, line: 385, baseType: !61, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !966, file: !878, line: 386, baseType: !969, size: 32, offset: 96)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !966, file: !878, line: 387, baseType: !61, size: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !966, file: !878, line: 388, baseType: !61, size: 32, offset: 160)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !966, file: !878, line: 389, baseType: !61, size: 32, offset: 192)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "g_uart_baudrate_map", scope: !867, file: !868, line: 105, type: !978, isLocal: true, isDefinition: true)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 416, elements: !980)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!980 = !{!981}
!981 = !DISubrange(count: 13)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "g_uart_global_data_initialized", scope: !867, file: !868, line: 90, type: !91, isLocal: true, isDefinition: true)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 128, elements: !706)
!985 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_hwstatus_t", file: !868, line: 69, baseType: !883)
!987 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "g_uart_regbase", scope: !990, file: !991, line: 53, type: !1069, isLocal: false, isDefinition: true)
!990 = distinct !DICompileUnit(language: DW_LANG_C99, file: !991, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !992, retainedTypes: !1003, globals: !1059, splitDebugInlining: false, nameTableKind: None)
!991 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart_internal_platform.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!992 = !{!97, !168, !406, !870, !993}
!993 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !937, line: 46, baseType: !18, size: 32, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1000, !1001, !1002}
!995 = !DIEnumerator(name: "UART_INTERRUPT_NONE", value: 0)
!996 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_ERROR", value: 1)
!997 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_TIMEOUT", value: 2)
!998 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_BREAK", value: 3)
!999 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_AVAILABLE", value: 4)
!1000 = !DIEnumerator(name: "UART_INTERRUPT_SEND_AVAILABLE", value: 5)
!1001 = !DIEnumerator(name: "UART_INTERRUPT_SOFTWARE_FLOWCONTROL", value: 6)
!1002 = !DIEnumerator(name: "UART_INTERRUPT_HARDWARE_FLOWCONTROL", value: 7)
!1003 = !{!1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_REGISTER_T", file: !56, line: 588, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 542, size: 800, elements: !1007)
!1007 = !{!1008, !1014, !1019, !1025, !1026, !1031, !1036, !1037, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "RBR_THR_DLL", scope: !1006, file: !56, line: 547, baseType: !1009, size: 32)
!1009 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1006, file: !56, line: 543, size: 32, elements: !1010)
!1010 = !{!1011, !1012, !1013}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "RBR", scope: !1009, file: !56, line: 544, baseType: !272, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "THR", scope: !1009, file: !56, line: 545, baseType: !60, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "DLL", scope: !1009, file: !56, line: 546, baseType: !60, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "IER_DLM", scope: !1006, file: !56, line: 551, baseType: !1015, size: 32, offset: 32)
!1015 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1006, file: !56, line: 548, size: 32, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !1015, file: !56, line: 549, baseType: !60, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "DLM", scope: !1015, file: !56, line: 550, baseType: !60, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "IIR_FCR_EFR", scope: !1006, file: !56, line: 556, baseType: !1020, size: 32, offset: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1006, file: !56, line: 552, size: 32, elements: !1021)
!1021 = !{!1022, !1023, !1024}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "IIR", scope: !1020, file: !56, line: 553, baseType: !272, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !1020, file: !56, line: 554, baseType: !60, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "EFR", scope: !1020, file: !56, line: 555, baseType: !60, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "LCR", scope: !1006, file: !56, line: 557, baseType: !60, size: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "MCR_XON1", scope: !1006, file: !56, line: 561, baseType: !1027, size: 32, offset: 128)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1006, file: !56, line: 558, size: 32, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !1027, file: !56, line: 559, baseType: !60, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "XON1", scope: !1027, file: !56, line: 560, baseType: !60, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "LSR_XON2", scope: !1006, file: !56, line: 565, baseType: !1032, size: 32, offset: 160)
!1032 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1006, file: !56, line: 562, size: 32, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "LSR", scope: !1032, file: !56, line: 563, baseType: !272, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "XON2", scope: !1032, file: !56, line: 564, baseType: !60, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF1", scope: !1006, file: !56, line: 566, baseType: !60, size: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "SCR_XOFF2", scope: !1006, file: !56, line: 570, baseType: !1038, size: 32, offset: 224)
!1038 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1006, file: !56, line: 567, size: 32, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !1038, file: !56, line: 568, baseType: !60, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF2", scope: !1038, file: !56, line: 569, baseType: !60, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_EN", scope: !1006, file: !56, line: 571, baseType: !60, size: 32, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "HIGHSPEED", scope: !1006, file: !56, line: 572, baseType: !60, size: 32, offset: 288)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_COUNT", scope: !1006, file: !56, line: 573, baseType: !60, size: 32, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_POINT", scope: !1006, file: !56, line: 574, baseType: !60, size: 32, offset: 352)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_REG", scope: !1006, file: !56, line: 575, baseType: !272, size: 32, offset: 384)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "RATEFIX_AD", scope: !1006, file: !56, line: 576, baseType: !60, size: 32, offset: 416)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUDSAMPLE", scope: !1006, file: !56, line: 577, baseType: !60, size: 32, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "GUARD", scope: !1006, file: !56, line: 578, baseType: !60, size: 32, offset: 480)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_DAT", scope: !1006, file: !56, line: 579, baseType: !60, size: 32, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_EN", scope: !1006, file: !56, line: 580, baseType: !60, size: 32, offset: 544)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP_EN", scope: !1006, file: !56, line: 581, baseType: !60, size: 32, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "DMA_EN", scope: !1006, file: !56, line: 582, baseType: !60, size: 32, offset: 608)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "RXTRI_AD", scope: !1006, file: !56, line: 583, baseType: !60, size: 32, offset: 640)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_L", scope: !1006, file: !56, line: 584, baseType: !60, size: 32, offset: 672)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_M", scope: !1006, file: !56, line: 585, baseType: !60, size: 32, offset: 704)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "FCR_RD", scope: !1006, file: !56, line: 586, baseType: !272, size: 32, offset: 736)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "TX_ACTIVE_EN", scope: !1006, file: !56, line: 587, baseType: !60, size: 32, offset: 768)
!1059 = !{!988, !1060, !1065}
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(name: "g_uart_port_to_pdn", scope: !990, file: !991, line: 54, type: !1062, isLocal: false, isDefinition: true)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 128, elements: !706)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_clock_cg_id", file: !98, line: 1237, baseType: !97)
!1065 = !DIGlobalVariableExpression(var: !1066, expr: !DIExpression())
!1066 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !990, file: !991, line: 55, type: !1067, isLocal: false, isDefinition: true)
!1067 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 128, elements: !706)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 128, elements: !706)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(name: "s_i2c_master_status", scope: !1073, file: !1074, line: 61, type: !1172, isLocal: true, isDefinition: true)
!1073 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1074, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1075, retainedTypes: !1138, globals: !1150, splitDebugInlining: false, nameTableKind: None)
!1074 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_i2c_master.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!1075 = !{!1076, !1084, !1090, !1099, !1105, !1113, !381, !386, !1130, !168, !396, !1134}
!1076 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1077, line: 455, baseType: !7, size: 32, elements: !1078)
!1077 = !DIFile(filename: "../../../../../driver/chip/inc/hal_i2c_master.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!1078 = !{!1079, !1080, !1081, !1082, !1083}
!1079 = !DIEnumerator(name: "HAL_I2C_STATUS_ERROR", value: -4)
!1080 = !DIEnumerator(name: "HAL_I2C_STATUS_ERROR_BUSY", value: -3)
!1081 = !DIEnumerator(name: "HAL_I2C_STATUS_INVALID_PORT_NUMBER", value: -2)
!1082 = !DIEnumerator(name: "HAL_I2C_STATUS_INVALID_PARAMETER", value: -1)
!1083 = !DIEnumerator(name: "HAL_I2C_STATUS_OK", value: 0)
!1084 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 302, baseType: !18, size: 32, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089}
!1086 = !DIEnumerator(name: "HAL_I2C_MASTER_0", value: 0)
!1087 = !DIEnumerator(name: "HAL_I2C_MASTER_1", value: 1)
!1088 = !DIEnumerator(name: "HAL_I2C_MASTER_2", value: 2)
!1089 = !DIEnumerator(name: "HAL_I2C_MASTER_MAX", value: 3)
!1090 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1077, line: 470, baseType: !18, size: 32, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098}
!1092 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_50K", value: 0)
!1093 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_100K", value: 1)
!1094 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_200K", value: 2)
!1095 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_300K", value: 3)
!1096 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_400K", value: 4)
!1097 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_1M", value: 5)
!1098 = !DIEnumerator(name: "HAL_I2C_FREQUENCY_MAX", value: 6)
!1099 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1077, line: 446, baseType: !7, size: 32, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104}
!1101 = !DIEnumerator(name: "HAL_I2C_EVENT_ACK_ERROR", value: -3)
!1102 = !DIEnumerator(name: "HAL_I2C_EVENT_NACK_ERROR", value: -2)
!1103 = !DIEnumerator(name: "HAL_I2C_EVENT_TIMEOUT_ERROR", value: -1)
!1104 = !DIEnumerator(name: "HAL_I2C_EVENT_SUCCESS", value: 0)
!1105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1106, line: 162, baseType: !7, size: 32, elements: !1107)
!1106 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_i2c_master_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/i2c_control_EEPROM_with_dma_ex/GCC")
!1107 = !{!1108, !1109, !1110, !1111, !1112}
!1108 = !DIEnumerator(name: "I2C_TRANSACTION_UNKNOWN_ERROR", value: -4)
