; ModuleID = 'build/arduino_due/subsys/cpp/cpp_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type { i8 }
%struct._thread_arch = type { i32, i32 }
%class.cpp_semaphore = type { %class.semaphore, %struct.k_sem }
%class.semaphore = type { i32 (...)** }
%struct.k_sem = type { %union.anon, i32, i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "coop_thread", scope: !27, file: !45, line: 40, type: !120, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, globals: !105, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/cpp/cpp_synchronization/src/main.cpp", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!29 = !{!30, !34, !40, !42, !44, !48}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !31, line: 46, baseType: !32)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !33)
!33 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !35, line: 46, baseType: !36)
!35 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39, !39, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !43)
!43 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!44 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "cpp_semaphore", file: !45, line: 50, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !46, vtableHolder: !48)
!45 = !DIFile(filename: "zephyr/samples/subsys/cpp/cpp_synchronization/src/main.cpp", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !66, !93, !97, !98, !101, !104}
!47 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !44, baseType: !48, flags: DIFlagPublic, extraData: i32 0)
!48 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "semaphore", file: !45, line: 29, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !49, vtableHolder: !48, identifier: "_ZTS9semaphore")
!49 = !{!50, !56, !60, !63}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$semaphore", scope: !45, file: !45, baseType: !51, size: 32, flags: DIFlagArtificial)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !53, size: 32)
!53 = !DISubroutineType(types: !54)
!54 = !{!55}
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DISubprogram(name: "wait", linkageName: "_ZN9semaphore4waitEv", scope: !48, file: !45, line: 31, type: !57, scopeLine: 31, containingType: !48, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!57 = !DISubroutineType(types: !58)
!58 = !{!55, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!60 = !DISubprogram(name: "wait", linkageName: "_ZN9semaphore4waitEi", scope: !48, file: !45, line: 32, type: !61, scopeLine: 32, containingType: !48, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!61 = !DISubroutineType(types: !62)
!62 = !{!55, !59, !55}
!63 = !DISubprogram(name: "give", linkageName: "_ZN9semaphore4giveEv", scope: !48, file: !45, line: 33, type: !64, scopeLine: 33, containingType: !48, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !59}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_sema_internal", scope: !44, file: !45, line: 52, baseType: !67, size: 128, offset: 32, flags: DIFlagProtected)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !68, line: 2909, size: 128, flags: DIFlagTypePassByValue, elements: !69, identifier: "_ZTS5k_sem")
!68 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!69 = !{!70, !91, !92}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !67, file: !68, line: 2910, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !73)
!72 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, flags: DIFlagTypePassByValue, elements: !74, identifier: "_ZTS9_wait_q_t")
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !73, file: !72, line: 232, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !78)
!77 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, flags: DIFlagTypePassByValue, elements: !79, identifier: "_ZTS6_dnode")
!79 = !{!80, !86}
!80 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 38, baseType: !81, size: 32)
!81 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 38, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !82, identifier: "_ZTSN6_dnodeUt_E")
!82 = !{!83, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !81, file: !77, line: 39, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !77, line: 40, baseType: !84, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 42, baseType: !87, size: 32, offset: 32)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 42, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !88, identifier: "_ZTSN6_dnodeUt0_E")
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !87, file: !77, line: 43, baseType: !84, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !77, line: 44, baseType: !84, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !67, file: !68, line: 2911, baseType: !41, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !67, file: !68, line: 2912, baseType: !41, size: 32, offset: 96)
!93 = !DISubprogram(name: "cpp_semaphore", scope: !44, file: !45, line: 54, type: !94, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!97 = !DISubprogram(name: "~cpp_semaphore", scope: !44, file: !45, line: 55, type: !94, scopeLine: 55, containingType: !44, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!98 = !DISubprogram(name: "wait", linkageName: "_ZN13cpp_semaphore4waitEv", scope: !44, file: !45, line: 56, type: !99, scopeLine: 56, containingType: !44, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!99 = !DISubroutineType(types: !100)
!100 = !{!55, !96}
!101 = !DISubprogram(name: "wait", linkageName: "_ZN13cpp_semaphore4waitEi", scope: !44, file: !45, line: 57, type: !102, scopeLine: 57, containingType: !44, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!102 = !DISubroutineType(types: !103)
!103 = !{!55, !96, !55}
!104 = !DISubprogram(name: "give", linkageName: "_ZN13cpp_semaphore4giveEv", scope: !44, file: !45, line: 58, type: !94, scopeLine: 58, containingType: !44, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!105 = !{!25, !106, !116, !118}
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "coop_stack", scope: !27, file: !45, line: 41, type: !108, isLocal: false, isDefinition: true, align: 512)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 16512, elements: !114)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !110, line: 47, size: 8, flags: DIFlagTypePassByValue, elements: !111, identifier: "_ZTS22z_thread_stack_element")
!110 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 48, baseType: !113, size: 8)
!113 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!114 = !{!115}
!115 = !DISubrange(count: 2064)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "sem_main", scope: !27, file: !45, line: 110, type: !44, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "sem_coop", scope: !27, file: !45, line: 111, type: !44, isLocal: false, isDefinition: true)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 1024, flags: DIFlagTypePassByValue, elements: !122, identifier: "_ZTS8k_thread")
!121 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123, !172, !185, !186, !187, !188, !196, !199}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !120, file: !121, line: 247, baseType: !124, size: 384)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, flags: DIFlagTypePassByValue, elements: !125, identifier: "_ZTS12_thread_base")
!125 = !{!126, !140, !142, !145, !146, !159, !160, !161}
!126 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !121, line: 60, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !121, line: 60, size: 64, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !128, identifier: "_ZTSN12_thread_baseUt_E")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !127, file: !121, line: 61, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !78)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !127, file: !121, line: 62, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, flags: DIFlagTypePassByValue, elements: !134, identifier: "_ZTS6rbnode")
!133 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !132, file: !133, line: 50, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !138)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!138 = !{!139}
!139 = !DISubrange(count: 2)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !124, file: !121, line: 68, baseType: !141, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !124, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !144)
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !124, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !121, line: 90, baseType: !147, size: 16, offset: 112)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !121, line: 90, size: 16, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !148, identifier: "_ZTSN12_thread_baseUt0_E")
!148 = !{!149, !156}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !121, line: 91, baseType: !150, size: 16)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !147, file: !121, line: 91, size: 16, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !151, identifier: "_ZTSN12_thread_baseUt0_Ut_E")
!151 = !{!152, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !150, file: !121, line: 96, baseType: !153, size: 8)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !154)
!154 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !150, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !147, file: !121, line: 100, baseType: !157, size: 16)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !158)
!158 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !124, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !124, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !124, file: !121, line: 131, baseType: !162, size: 192, offset: 192)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, flags: DIFlagTypePassByValue, elements: !163, identifier: "_ZTS8_timeout")
!163 = !{!164, !165, !171}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !162, file: !72, line: 245, baseType: !130, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !162, file: !72, line: 246, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !162, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !120, file: !121, line: 250, baseType: !173, size: 288, offset: 384)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, flags: DIFlagTypePassByValue, elements: !175, identifier: "_ZTS13_callee_saved")
!174 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !173, file: !174, line: 26, baseType: !40, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !173, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !173, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !173, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !173, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !173, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !173, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !173, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !173, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !120, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !120, file: !121, line: 256, baseType: !71, size: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !120, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !120, file: !121, line: 300, baseType: !189, size: 96, offset: 800)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !121, line: 149, size: 96, flags: DIFlagTypePassByValue, elements: !190, identifier: "_ZTS18_thread_stack_info")
!190 = !{!191, !192, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !189, file: !121, line: 153, baseType: !22, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !189, file: !121, line: 162, baseType: !193, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !194, line: 214, baseType: !41)
!194 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !189, file: !121, line: 168, baseType: !193, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !120, file: !121, line: 325, baseType: !197, size: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, flags: DIFlagFwdDecl, identifier: "_ZTS6k_heap")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !120, file: !121, line: 343, baseType: !200, size: 64, offset: 928)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, flags: DIFlagTypePassByValue, elements: !201, identifier: "_ZTS12_thread_arch")
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !200, file: !174, line: 63, baseType: !40, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !200, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "_char_out", scope: !206, file: !281, line: 54, type: !282, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !279, globals: !280, splitDebugInlining: false, nameTableKind: None)
!207 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!208 = !{!209}
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !210, line: 27, baseType: !41, size: 32, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278}
!212 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!213 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!214 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!215 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!216 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!217 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!218 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!219 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!220 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!221 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!222 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!223 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!224 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!225 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!226 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!227 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!228 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!229 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!230 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!231 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!232 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!233 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!234 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!235 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!236 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!237 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!238 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!239 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!240 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!241 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!242 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!243 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!244 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!245 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!246 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!247 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!248 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!249 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!250 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!251 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!252 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!253 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!254 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!255 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!256 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!257 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!258 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!259 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!260 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!261 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!262 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!263 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!264 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!265 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!266 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!267 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!268 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!269 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!270 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!271 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!272 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!273 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!274 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!275 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!276 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!277 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!278 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!279 = !{!39, !55}
!280 = !{!204}
!281 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DISubroutineType(types: !284)
!284 = !{!55, !55}
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !287, file: !352, line: 235, type: !353, isLocal: true, isDefinition: true, align: 32)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !289, globals: !351, splitDebugInlining: false, nameTableKind: None)
!288 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!289 = !{!39, !55, !290, !301}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !292, line: 46, baseType: !293)
!292 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !292, line: 41, size: 128, elements: !294)
!294 = !{!295, !297, !298, !300}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !293, file: !292, line: 42, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !40)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !293, file: !292, line: 43, baseType: !296, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !293, file: !292, line: 44, baseType: !299, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !293, file: !292, line: 45, baseType: !299, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !303, line: 75, baseType: !304)
!303 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 41, size: 2176, elements: !305)
!305 = !{!306, !307, !308, !309, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !329, !333, !334, !335, !336, !337, !338, !339, !340, !344, !345, !346, !347, !348, !349, !350}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !304, file: !303, line: 42, baseType: !296, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !304, file: !303, line: 43, baseType: !296, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !304, file: !303, line: 44, baseType: !299, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !304, file: !303, line: 45, baseType: !310, size: 32, offset: 96)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 32, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 1)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !304, file: !303, line: 46, baseType: !296, size: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !304, file: !303, line: 47, baseType: !296, size: 32, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !304, file: !303, line: 48, baseType: !299, size: 32, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !304, file: !303, line: 49, baseType: !296, size: 32, offset: 224)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !304, file: !303, line: 50, baseType: !296, size: 32, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !304, file: !303, line: 51, baseType: !299, size: 32, offset: 288)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !304, file: !303, line: 52, baseType: !296, size: 32, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !304, file: !303, line: 53, baseType: !310, size: 32, offset: 352)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !304, file: !303, line: 54, baseType: !296, size: 32, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !304, file: !303, line: 55, baseType: !310, size: 32, offset: 416)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !304, file: !303, line: 56, baseType: !296, size: 32, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !304, file: !303, line: 57, baseType: !310, size: 32, offset: 480)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !304, file: !303, line: 58, baseType: !326, size: 96, offset: 512)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 96, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 3)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !304, file: !303, line: 59, baseType: !330, size: 160, offset: 608)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 160, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 5)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !304, file: !303, line: 60, baseType: !296, size: 32, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !304, file: !303, line: 61, baseType: !296, size: 32, offset: 800)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !304, file: !303, line: 62, baseType: !299, size: 32, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !304, file: !303, line: 63, baseType: !299, size: 32, offset: 864)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !304, file: !303, line: 64, baseType: !296, size: 32, offset: 896)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !304, file: !303, line: 65, baseType: !296, size: 32, offset: 928)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !304, file: !303, line: 66, baseType: !296, size: 32, offset: 960)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !304, file: !303, line: 67, baseType: !341, size: 832, offset: 992)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 832, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 26)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !304, file: !303, line: 68, baseType: !296, size: 32, offset: 1824)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !304, file: !303, line: 69, baseType: !299, size: 32, offset: 1856)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !304, file: !303, line: 70, baseType: !330, size: 160, offset: 1888)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !304, file: !303, line: 71, baseType: !296, size: 32, offset: 2048)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !304, file: !303, line: 72, baseType: !296, size: 32, offset: 2080)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !304, file: !303, line: 73, baseType: !299, size: 32, offset: 2112)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !304, file: !303, line: 74, baseType: !296, size: 32, offset: 2144)
!351 = !{!285}
!352 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !355, line: 51, size: 64, elements: !356)
!355 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !{!357, !385}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !354, file: !355, line: 60, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DISubroutineType(types: !360)
!360 = !{!55, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !364, line: 378, size: 192, elements: !365)
!364 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!365 = !{!366, !369, !370, !371, !378, !379}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !363, file: !364, line: 380, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !363, file: !364, line: 382, baseType: !13, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !363, file: !364, line: 384, baseType: !13, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !363, file: !364, line: 386, baseType: !372, size: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !364, line: 351, size: 16, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !373, file: !364, line: 359, baseType: !143, size: 8)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !373, file: !364, line: 364, baseType: !377, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!377 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !363, file: !364, line: 388, baseType: !39, size: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !363, file: !364, line: 396, baseType: !380, size: 32, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !364, line: 43, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !384)
!384 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !354, file: !355, line: 65, baseType: !361, size: 32, offset: 32)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "__dso_handle", scope: !388, file: !391, line: 15, type: !39, isLocal: false, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !390, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/cpp/cpp_dtors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!390 = !{!386}
!391 = !DIFile(filename: "zephyr/subsys/cpp/cpp_dtors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "static_regions", scope: !394, file: !401, line: 62, type: !527, isLocal: true, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !396, globals: !397, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!396 = !{!193, !55, !40, !39}
!397 = !{!398, !392}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !400, file: !401, line: 198, type: !515, isLocal: true, isDefinition: true)
!400 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !401, file: !401, line: 175, type: !402, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, retainedNodes: !510)
!401 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!402 = !DISubroutineType(types: !403)
!403 = !{null, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 1024, elements: !406)
!406 = !{!407, !465, !477, !478, !479, !480, !486, !505}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !405, file: !121, line: 247, baseType: !408, size: 384)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, elements: !409)
!409 = !{!410, !434, !441, !442, !443, !452, !453, !454}
!410 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !121, line: 60, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !408, file: !121, line: 60, size: 64, elements: !412)
!412 = !{!413, !428}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !411, file: !121, line: 61, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, elements: !416)
!416 = !{!417, !423}
!417 = !DIDerivedType(tag: DW_TAG_member, scope: !415, file: !77, line: 38, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !415, file: !77, line: 38, size: 32, elements: !419)
!419 = !{!420, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !418, file: !77, line: 39, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !418, file: !77, line: 40, baseType: !421, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, scope: !415, file: !77, line: 42, baseType: !424, size: 32, offset: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !415, file: !77, line: 42, size: 32, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !424, file: !77, line: 43, baseType: !421, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !424, file: !77, line: 44, baseType: !421, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !411, file: !121, line: 62, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !429, file: !133, line: 50, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 64, elements: !138)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !408, file: !121, line: 68, baseType: !435, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, elements: !438)
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !437, file: !72, line: 232, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !415)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !408, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !408, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!443 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !121, line: 90, baseType: !444, size: 16, offset: 112)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !408, file: !121, line: 90, size: 16, elements: !445)
!445 = !{!446, !451}
!446 = !DIDerivedType(tag: DW_TAG_member, scope: !444, file: !121, line: 91, baseType: !447, size: 16)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !444, file: !121, line: 91, size: 16, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !447, file: !121, line: 96, baseType: !153, size: 8)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !447, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !444, file: !121, line: 100, baseType: !157, size: 16)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !408, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !408, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !408, file: !121, line: 131, baseType: !455, size: 192, offset: 192)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, elements: !456)
!456 = !{!457, !458, !464}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !455, file: !72, line: 245, baseType: !414, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !455, file: !72, line: 246, baseType: !459, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !463}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !455, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !405, file: !121, line: 250, baseType: !466, size: 288, offset: 384)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !466, file: !174, line: 26, baseType: !40, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !466, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !466, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !466, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !466, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !466, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !466, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !466, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !466, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !405, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !405, file: !121, line: 256, baseType: !436, size: 64, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !405, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !405, file: !121, line: 300, baseType: !481, size: 96, offset: 800)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !121, line: 149, size: 96, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !481, file: !121, line: 153, baseType: !22, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !481, file: !121, line: 162, baseType: !193, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !481, file: !121, line: 168, baseType: !193, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !405, file: !121, line: 325, baseType: !487, size: 32, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, elements: !489)
!489 = !{!490, !499, !500}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !488, file: !68, line: 5074, baseType: !491, size: 96)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !492, line: 56, size: 96, elements: !493)
!492 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!493 = !{!494, !497, !498}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !491, file: !492, line: 57, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !492, line: 57, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !491, file: !492, line: 58, baseType: !39, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !491, file: !492, line: 59, baseType: !193, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !488, file: !68, line: 5075, baseType: !436, size: 64, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !488, file: !68, line: 5076, baseType: !501, size: 8, offset: 160)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !502, line: 43, size: 8, elements: !503)
!502 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !501, file: !502, line: 75, baseType: !113, size: 8)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !405, file: !121, line: 343, baseType: !506, size: 64, offset: 928)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !506, file: !174, line: 63, baseType: !40, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !506, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!510 = !{!511, !512, !513, !514}
!511 = !DILocalVariable(name: "thread", arg: 1, scope: !400, file: !401, line: 175, type: !404)
!512 = !DILocalVariable(name: "region_num", scope: !400, file: !401, line: 200, type: !143)
!513 = !DILocalVariable(name: "guard_start", scope: !400, file: !401, line: 265, type: !22)
!514 = !DILocalVariable(name: "guard_size", scope: !400, file: !401, line: 266, type: !193)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 96, elements: !311)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !517, line: 52, size: 96, elements: !518)
!517 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !516, file: !517, line: 53, baseType: !22, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !516, file: !517, line: 54, baseType: !193, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !516, file: !517, line: 55, baseType: !522, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !523, line: 151, baseType: !524)
!523 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 149, size: 32, elements: !525)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !524, file: !523, line: 150, baseType: !40, size: 32)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 96, elements: !311)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !531, file: !563, line: 39, type: !143, isLocal: true, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !533, globals: !562, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!533 = !{!534, !39, !55, !550, !143}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !536, line: 1168, baseType: !537)
!536 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 1155, size: 352, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !537, file: !536, line: 1157, baseType: !299, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !537, file: !536, line: 1158, baseType: !296, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !537, file: !536, line: 1159, baseType: !296, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !537, file: !536, line: 1160, baseType: !296, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !537, file: !536, line: 1161, baseType: !296, size: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !537, file: !536, line: 1162, baseType: !296, size: 32, offset: 160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !537, file: !536, line: 1163, baseType: !296, size: 32, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !537, file: !536, line: 1164, baseType: !296, size: 32, offset: 224)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !537, file: !536, line: 1165, baseType: !296, size: 32, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !537, file: !536, line: 1166, baseType: !296, size: 32, offset: 288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !537, file: !536, line: 1167, baseType: !296, size: 32, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !553, line: 27, size: 96, elements: !554)
!553 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!554 = !{!555, !556, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !552, file: !553, line: 29, baseType: !40, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !552, file: !553, line: 31, baseType: !367, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !552, file: !553, line: 37, baseType: !558, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !523, line: 146, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !523, line: 141, size: 32, elements: !560)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !559, file: !523, line: 143, baseType: !40, size: 32)
!562 = !{!529}
!563 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "z_malloc_heap_mutex", scope: !566, file: !572, line: 35, type: !596, isLocal: false, isDefinition: true)
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !568, globals: !569, splitDebugInlining: false, nameTableKind: None)
!567 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdlib/malloc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!568 = !{!30, !39, !55}
!569 = !{!570, !584, !564, !591}
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "__init_malloc_prepare", scope: !566, file: !572, line: 119, type: !573, isLocal: true, isDefinition: true, align: 32)
!572 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdlib/malloc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !355, line: 51, size: 64, elements: !575)
!575 = !{!576, !583}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !574, file: !355, line: 60, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DISubroutineType(types: !579)
!579 = !{!55, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !355, line: 48, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !574, file: !355, line: 65, baseType: !580, size: 32, offset: 32)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "z_malloc_heap", scope: !566, file: !572, line: 34, type: !586, isLocal: true, isDefinition: true)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !492, line: 56, size: 96, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !586, file: !492, line: 57, baseType: !495, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !586, file: !492, line: 58, baseType: !39, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !586, file: !492, line: 59, baseType: !193, size: 32, offset: 64)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "z_malloc_heap_mem", scope: !566, file: !572, line: 36, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 1024, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 128)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_mutex", file: !597, line: 137, size: 160, elements: !598)
!597 = !DIFile(filename: "zephyr/include/zephyr/sys/mutex.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_mutex", scope: !596, file: !597, line: 138, baseType: !600, size: 160)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !68, line: 2720, size: 160, elements: !601)
!601 = !{!602, !621, !701, !702}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !600, file: !68, line: 2722, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, elements: !605)
!605 = !{!606}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !604, file: !72, line: 232, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, elements: !609)
!609 = !{!610, !616}
!610 = !DIDerivedType(tag: DW_TAG_member, scope: !608, file: !77, line: 38, baseType: !611, size: 32)
!611 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !608, file: !77, line: 38, size: 32, elements: !612)
!612 = !{!613, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !611, file: !77, line: 39, baseType: !614, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !77, line: 40, baseType: !614, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, scope: !608, file: !77, line: 42, baseType: !617, size: 32, offset: 32)
!617 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !608, file: !77, line: 42, size: 32, elements: !618)
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !617, file: !77, line: 43, baseType: !614, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !617, file: !77, line: 44, baseType: !614, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !600, file: !68, line: 2724, baseType: !622, size: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 1024, elements: !624)
!624 = !{!625, !665, !677, !678, !679, !680, !686, !696}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !623, file: !121, line: 247, baseType: !626, size: 384)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, elements: !627)
!627 = !{!628, !639, !641, !642, !643, !652, !653, !654}
!628 = !DIDerivedType(tag: DW_TAG_member, scope: !626, file: !121, line: 60, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !626, file: !121, line: 60, size: 64, elements: !630)
!630 = !{!631, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !629, file: !121, line: 61, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !608)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !629, file: !121, line: 62, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, elements: !635)
!635 = !{!636}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !634, file: !133, line: 50, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 64, elements: !138)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !626, file: !121, line: 68, baseType: !640, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !626, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !626, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!643 = !DIDerivedType(tag: DW_TAG_member, scope: !626, file: !121, line: 90, baseType: !644, size: 16, offset: 112)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !626, file: !121, line: 90, size: 16, elements: !645)
!645 = !{!646, !651}
!646 = !DIDerivedType(tag: DW_TAG_member, scope: !644, file: !121, line: 91, baseType: !647, size: 16)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !644, file: !121, line: 91, size: 16, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !647, file: !121, line: 96, baseType: !153, size: 8)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !647, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !644, file: !121, line: 100, baseType: !157, size: 16)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !626, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !626, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !626, file: !121, line: 131, baseType: !655, size: 192, offset: 192)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, elements: !656)
!656 = !{!657, !658, !664}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !655, file: !72, line: 245, baseType: !632, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !655, file: !72, line: 246, baseType: !659, size: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !655, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !623, file: !121, line: 250, baseType: !666, size: 288, offset: 384)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !666, file: !174, line: 26, baseType: !40, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !666, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !666, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !666, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !666, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !666, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !666, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !666, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !666, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !623, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !623, file: !121, line: 256, baseType: !603, size: 64, offset: 704)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !623, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !623, file: !121, line: 300, baseType: !681, size: 96, offset: 800)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !121, line: 149, size: 96, elements: !682)
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !681, file: !121, line: 153, baseType: !22, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !681, file: !121, line: 162, baseType: !193, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !681, file: !121, line: 168, baseType: !193, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !623, file: !121, line: 325, baseType: !687, size: 32, offset: 896)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, elements: !689)
!689 = !{!690, !691, !692}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !688, file: !68, line: 5074, baseType: !586, size: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !688, file: !68, line: 5075, baseType: !603, size: 64, offset: 96)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !688, file: !68, line: 5076, baseType: !693, size: 8, offset: 160)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !502, line: 43, size: 8, elements: !694)
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !693, file: !502, line: 75, baseType: !113, size: 8)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !623, file: !121, line: 343, baseType: !697, size: 64, offset: 928)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !697, file: !174, line: 63, baseType: !40, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !697, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !600, file: !68, line: 2727, baseType: !40, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !600, file: !68, line: 2730, baseType: !55, size: 32, offset: 128)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !705, file: !712, line: 21, type: !282, isLocal: true, isDefinition: true)
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !707, globals: !711, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!707 = !{!708, !55, !39}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !710, line: 22, baseType: !55)
!710 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!711 = !{!703}
!712 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !715, file: !720, line: 13, type: !737, isLocal: true, isDefinition: true)
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !717, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!717 = !{!718, !713}
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "mpu_config", scope: !715, file: !720, line: 37, type: !721, isLocal: false, isDefinition: true)
!720 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !553, line: 41, size: 64, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !722, file: !553, line: 43, baseType: !40, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !722, file: !553, line: 45, baseType: !726, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !553, line: 27, size: 96, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !728, file: !553, line: 29, baseType: !40, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !728, file: !553, line: 31, baseType: !367, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !728, file: !553, line: 37, baseType: !733, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !523, line: 146, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !523, line: 141, size: 32, elements: !735)
!735 = !{!736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !734, file: !523, line: 143, baseType: !40, size: 32)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 192, elements: !138)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !740, file: !797, line: 603, type: !799, isLocal: true, isDefinition: true, align: 32)
!740 = distinct !DICompileUnit(language: DW_LANG_C99, file: !741, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !742, globals: !794, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!742 = !{!39, !55, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !746, line: 336, size: 160, elements: !747)
!746 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!747 = !{!748, !768, !772, !776, !789}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !745, file: !746, line: 365, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = !DISubroutineType(types: !751)
!751 = !{!55, !752, !767}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !364, line: 378, size: 192, elements: !755)
!755 = !{!756, !757, !758, !759, !765, !766}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !754, file: !364, line: 380, baseType: !367, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !754, file: !364, line: 382, baseType: !13, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !754, file: !364, line: 384, baseType: !13, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !754, file: !364, line: 386, baseType: !760, size: 32, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !364, line: 351, size: 16, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !761, file: !364, line: 359, baseType: !143, size: 8)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !761, file: !364, line: 364, baseType: !377, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !754, file: !364, line: 388, baseType: !39, size: 32, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !754, file: !364, line: 396, baseType: !380, size: 32, offset: 160)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !745, file: !746, line: 366, baseType: !769, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !752, !144}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !745, file: !746, line: 374, baseType: !773, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DISubroutineType(types: !775)
!775 = !{!55, !752}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !745, file: !746, line: 377, baseType: !777, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DISubroutineType(types: !779)
!779 = !{!55, !752, !780}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !746, line: 122, size: 64, elements: !783)
!783 = !{!784, !785, !786, !787, !788}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !782, file: !746, line: 123, baseType: !40, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !782, file: !746, line: 124, baseType: !143, size: 8, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !782, file: !746, line: 125, baseType: !143, size: 8, offset: 40)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !782, file: !746, line: 126, baseType: !143, size: 8, offset: 48)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !782, file: !746, line: 127, baseType: !143, size: 8, offset: 56)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !745, file: !746, line: 379, baseType: !790, size: 32, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = !DISubroutineType(types: !792)
!792 = !{!55, !752, !793}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!794 = !{!738, !795}
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !740, file: !797, line: 38, type: !798, isLocal: true, isDefinition: true)
!797 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !355, line: 51, size: 64, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !800, file: !355, line: 60, baseType: !773, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !800, file: !355, line: 65, baseType: !752, size: 32, offset: 32)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !806, file: !811, line: 7, type: !812, isLocal: false, isDefinition: true, align: 16)
!806 = distinct !DICompileUnit(language: DW_LANG_C99, file: !807, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !808, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!808 = !{!804, !809}
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !806, file: !811, line: 12, type: !812, isLocal: false, isDefinition: true, align: 16)
!811 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 48, elements: !327)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !815, file: !876, line: 234, type: !912, isLocal: true, isDefinition: true)
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !817, globals: !873, splitDebugInlining: false, nameTableKind: None)
!816 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!817 = !{!818, !40}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !821, line: 134, size: 128, elements: !822)
!821 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!822 = !{!823, !843, !848, !868}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !820, file: !821, line: 135, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !821, line: 113, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DISubroutineType(types: !827)
!827 = !{!55, !828, !143}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !364, line: 378, size: 192, elements: !831)
!831 = !{!832, !833, !834, !835, !841, !842}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !830, file: !364, line: 380, baseType: !367, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !830, file: !364, line: 382, baseType: !13, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !830, file: !364, line: 384, baseType: !13, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !830, file: !364, line: 386, baseType: !836, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !364, line: 351, size: 16, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !837, file: !364, line: 359, baseType: !143, size: 8)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !837, file: !364, line: 364, baseType: !377, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !830, file: !364, line: 388, baseType: !39, size: 32, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !830, file: !364, line: 396, baseType: !380, size: 32, offset: 160)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !820, file: !821, line: 136, baseType: !844, size: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !821, line: 119, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DISubroutineType(types: !847)
!847 = !{!55, !828}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !820, file: !821, line: 137, baseType: !849, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !821, line: 125, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DISubroutineType(types: !852)
!852 = !{!55, !828, !853}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !821, line: 88, size: 128, elements: !856)
!856 = !{!857, !862, !867}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !855, file: !821, line: 90, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !821, line: 72, size: 64, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !858, file: !821, line: 74, baseType: !40, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !858, file: !821, line: 76, baseType: !40, size: 32, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !855, file: !821, line: 92, baseType: !863, size: 32, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !821, line: 85, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !828, !55}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !855, file: !821, line: 104, baseType: !143, size: 8, offset: 96)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !820, file: !821, line: 138, baseType: !869, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !821, line: 132, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DISubroutineType(types: !872)
!872 = !{!55, !828, !55}
!873 = !{!874, !878, !880, !887, !813, !889, !891, !899}
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !815, file: !876, line: 256, type: !877, isLocal: false, isDefinition: true, align: 16)
!876 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 80, elements: !331)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !815, file: !876, line: 256, type: !829, isLocal: false, isDefinition: true, align: 32)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !815, file: !876, line: 256, type: !882, isLocal: true, isDefinition: true, align: 32)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !355, line: 51, size: 64, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !883, file: !355, line: 60, baseType: !845, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !883, file: !355, line: 65, baseType: !828, size: 32, offset: 32)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !815, file: !876, line: 256, type: !837, isLocal: true, isDefinition: true, align: 8)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !815, file: !876, line: 227, type: !819, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !815, file: !876, line: 45, type: !893, isLocal: true, isDefinition: true)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !876, line: 38, size: 96, elements: !894)
!894 = !{!895, !896, !897, !898}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !893, file: !876, line: 39, baseType: !863, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !893, file: !876, line: 40, baseType: !40, size: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !893, file: !876, line: 41, baseType: !377, size: 8, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !893, file: !876, line: 42, baseType: !377, size: 8, offset: 72)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !901, file: !876, line: 240, type: !905, isLocal: true, isDefinition: true, align: 32)
!901 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !876, file: !876, line: 238, type: !902, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !815, retainedNodes: !904)
!902 = !DISubroutineType(types: !903)
!903 = !{null}
!904 = !{}
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !906)
!906 = !{!907, !909, !910, !911}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !905, file: !10, line: 55, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !55)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !905, file: !10, line: 57, baseType: !908, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !905, file: !10, line: 59, baseType: !39, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !905, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !876, line: 34, size: 32, elements: !914)
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !913, file: !876, line: 35, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !918, line: 45, baseType: !919)
!918 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 41, size: 96, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !919, file: !918, line: 42, baseType: !296, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !919, file: !918, line: 43, baseType: !296, size: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !919, file: !918, line: 44, baseType: !299, size: 32, offset: 64)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !926, file: !1014, line: 494, type: !1061, isLocal: true, isDefinition: true)
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !928, retainedTypes: !961, globals: !1011, splitDebugInlining: false, nameTableKind: None)
!927 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/cpp/cpp_synchronization")
!928 = !{!929, !936, !942, !949, !954}
!929 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !746, line: 47, baseType: !41, size: 32, elements: !930)
!930 = !{!931, !932, !933, !934, !935}
!931 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!932 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!933 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!934 = !DIEnumerator(name: "UART_BREAK", value: 8)
!935 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!936 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !746, line: 84, baseType: !41, size: 32, elements: !937)
!937 = !{!938, !939, !940, !941}
!938 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!939 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!940 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!941 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!942 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !746, line: 92, baseType: !41, size: 32, elements: !943)
!943 = !{!944, !945, !946, !947, !948}
!944 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!945 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!946 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!947 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!948 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!949 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !746, line: 107, baseType: !41, size: 32, elements: !950)
!950 = !{!951, !952, !953}
!951 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!952 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!953 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!954 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !746, line: 75, baseType: !41, size: 32, elements: !955)
!955 = !{!956, !957, !958, !959, !960}
!956 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!957 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!958 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!959 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!960 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!961 = !{!962, !39, !144, !40}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !746, line: 336, size: 160, elements: !965)
!965 = !{!966, !985, !989, !993, !1006}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !964, file: !746, line: 365, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{!55, !970, !767}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !364, line: 378, size: 192, elements: !973)
!973 = !{!974, !975, !976, !977, !983, !984}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !972, file: !364, line: 380, baseType: !367, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !972, file: !364, line: 382, baseType: !13, size: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !972, file: !364, line: 384, baseType: !13, size: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !972, file: !364, line: 386, baseType: !978, size: 32, offset: 96)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !364, line: 351, size: 16, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !979, file: !364, line: 359, baseType: !143, size: 8)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !979, file: !364, line: 364, baseType: !377, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !972, file: !364, line: 388, baseType: !39, size: 32, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !972, file: !364, line: 396, baseType: !380, size: 32, offset: 160)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !964, file: !746, line: 366, baseType: !986, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !970, !144}
