; ModuleID = 'build/actinius_icarus_som/subsys/zbus/hello_world/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.version_msg = type { i8, i8, i16 }
%struct.zbus_observer = type { i8*, i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !27, file: !114, line: 25, type: !141, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !295, !297, !299, !301, !303, !305, !307, !309, !340, !344, !349, !354, !356, !358, !365, !370, !377, !382, !384}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "version_chan", scope: !27, file: !114, line: 25, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 224, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !124, !128, !130, !131, !139, !264}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !117, line: 32, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !125, size: 16, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !127)
!127 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !129, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !129, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !132, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !13, !137}
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 214, baseType: !32)
!138 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !142, line: 2720, size: 160, elements: !143)
!142 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !165, !262, !263}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !141, file: !142, line: 2722, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !147, file: !146, line: 232, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !153)
!153 = !{!154, !160}
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 38, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 38, size: 32, elements: !156)
!156 = !{!157, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !155, file: !151, line: 39, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !151, line: 40, baseType: !158, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 42, baseType: !161, size: 32, offset: 32)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 42, size: 32, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !161, file: !151, line: 43, baseType: !158, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !151, line: 44, baseType: !158, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !141, file: !142, line: 2724, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 1024, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170, !217, !230, !231, !232, !233, !239, !257}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !167, file: !168, line: 247, baseType: !171, size: 384)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !172)
!172 = !{!173, !187, !189, !192, !193, !204, !205, !206}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 60, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 60, size: 64, elements: !175)
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !174, file: !168, line: 61, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !174, file: !168, line: 62, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !179, file: !180, line: 50, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !185)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!185 = !{!186}
!186 = !DISubrange(count: 2)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !171, file: !168, line: 68, baseType: !188, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !171, file: !168, line: 71, baseType: !190, size: 8, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !191)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !171, file: !168, line: 74, baseType: !190, size: 8, offset: 104)
!193 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 90, baseType: !194, size: 16, offset: 112)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 90, size: 16, elements: !195)
!195 = !{!196, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, scope: !194, file: !168, line: 91, baseType: !197, size: 16)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !194, file: !168, line: 91, size: 16, elements: !198)
!198 = !{!199, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !197, file: !168, line: 96, baseType: !200, size: 8)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !201)
!201 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !197, file: !168, line: 97, baseType: !190, size: 8, offset: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !194, file: !168, line: 100, baseType: !126, size: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !171, file: !168, line: 107, baseType: !108, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !171, file: !168, line: 127, baseType: !106, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !171, file: !168, line: 131, baseType: !207, size: 192, offset: 192)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !208)
!208 = !{!209, !210, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !207, file: !146, line: 245, baseType: !177, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !207, file: !146, line: 246, baseType: !211, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !207, file: !146, line: 249, baseType: !104, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !167, file: !168, line: 250, baseType: !218, size: 288, offset: 384)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !219, line: 25, size: 288, elements: !220)
!219 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !218, file: !219, line: 26, baseType: !108, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !218, file: !219, line: 27, baseType: !108, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !218, file: !219, line: 28, baseType: !108, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !218, file: !219, line: 29, baseType: !108, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !218, file: !219, line: 30, baseType: !108, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !218, file: !219, line: 31, baseType: !108, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !218, file: !219, line: 32, baseType: !108, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !218, file: !219, line: 33, baseType: !108, size: 32, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !218, file: !219, line: 34, baseType: !108, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !167, file: !168, line: 253, baseType: !106, size: 32, offset: 672)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !167, file: !168, line: 256, baseType: !145, size: 64, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !167, file: !168, line: 294, baseType: !107, size: 32, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !167, file: !168, line: 300, baseType: !234, size: 96, offset: 800)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !168, line: 149, size: 96, elements: !235)
!235 = !{!236, !237, !238}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !234, file: !168, line: 153, baseType: !22, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !234, file: !168, line: 162, baseType: !137, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !234, file: !168, line: 168, baseType: !137, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !167, file: !168, line: 325, baseType: !240, size: 32, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 160, elements: !242)
!242 = !{!243, !252, !253}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !241, file: !142, line: 5074, baseType: !244, size: 96)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !245, line: 56, size: 96, elements: !246)
!245 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !{!247, !250, !251}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !244, file: !245, line: 57, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !245, line: 57, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !244, file: !245, line: 58, baseType: !106, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !244, file: !245, line: 59, baseType: !137, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !241, file: !142, line: 5075, baseType: !145, size: 64, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !241, file: !142, line: 5076, baseType: !254, offset: 160)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !255, line: 43, elements: !256)
!255 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!256 = !{}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !167, file: !168, line: 343, baseType: !258, size: 64, offset: 928)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !219, line: 60, size: 64, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !258, file: !219, line: 63, baseType: !108, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !258, file: !219, line: 66, baseType: !108, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !141, file: !142, line: 2727, baseType: !108, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !141, file: !142, line: 2730, baseType: !107, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !265, size: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 128, elements: !270)
!270 = !{!271, !272, !273, !289}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !117, line: 88, baseType: !120, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !269, file: !117, line: 91, baseType: !136, size: 8, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !269, file: !117, line: 93, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !142, line: 4204, size: 320, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !284, !285, !286, !287, !288}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !276, file: !142, line: 4206, baseType: !145, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !276, file: !142, line: 4208, baseType: !254, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !276, file: !142, line: 4210, baseType: !137, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !276, file: !142, line: 4212, baseType: !108, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !276, file: !142, line: 4214, baseType: !283, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !276, file: !142, line: 4216, baseType: !283, size: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !276, file: !142, line: 4218, baseType: !283, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !276, file: !142, line: 4220, baseType: !283, size: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !276, file: !142, line: 4222, baseType: !108, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !276, file: !142, line: 4227, baseType: !190, size: 8, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !269, file: !117, line: 96, baseType: !290, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "_zbus_mutex_acc_data_chan", scope: !27, file: !114, line: 35, type: !141, isLocal: true, isDefinition: true, align: 32)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "acc_data_chan", scope: !27, file: !114, line: 35, type: !115, isLocal: false, isDefinition: true, align: 32)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "_zbus_mutex_simple_chan", scope: !27, file: !114, line: 57, type: !141, isLocal: true, isDefinition: true, align: 32)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "simple_chan", scope: !27, file: !114, line: 57, type: !115, isLocal: false, isDefinition: true, align: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "foo_lis", scope: !27, file: !114, line: 73, type: !269, isLocal: false, isDefinition: true, align: 32)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !276, isLocal: false, isDefinition: true, align: 32)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "bar_sub", scope: !27, file: !114, line: 75, type: !269, isLocal: false, isDefinition: true, align: 32)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "_k_thread_data_subscriber_task_id", scope: !27, file: !114, line: 92, type: !311, isLocal: false, isDefinition: true, align: 32)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !142, line: 620, size: 384, elements: !312)
!312 = !{!313, !314, !322, !323, !328, !329, !330, !331, !332, !333, !335, !339}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !311, file: !142, line: 621, baseType: !166, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !311, file: !142, line: 622, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !317, line: 44, baseType: !318)
!317 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !319, line: 47, size: 8, elements: !320)
!319 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !319, line: 48, baseType: !123, size: 8)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !311, file: !142, line: 623, baseType: !32, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !311, file: !142, line: 624, baseType: !324, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !317, line: 46, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !106, !106, !106}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !311, file: !142, line: 625, baseType: !106, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !311, file: !142, line: 626, baseType: !106, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !311, file: !142, line: 627, baseType: !106, size: 32, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !311, file: !142, line: 628, baseType: !107, size: 32, offset: 224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !311, file: !142, line: 629, baseType: !108, size: 32, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !311, file: !142, line: 630, baseType: !334, size: 32, offset: 288)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !311, file: !142, line: 631, baseType: !336, size: 32, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DISubroutineType(types: !338)
!338 = !{null}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !311, file: !142, line: 632, baseType: !121, size: 32, offset: 352)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "subscriber_task_id", scope: !27, file: !114, line: 92, type: !342, isLocal: false, isDefinition: true)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !168, line: 347, baseType: !166)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !346, isLocal: true, isDefinition: true, align: 32)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 16)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "_k_thread_stack_subscriber_task_id", scope: !27, file: !114, line: 92, type: !351, isLocal: false, isDefinition: true, align: 64)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 4096, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 512)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "_k_thread_obj_subscriber_task_id", scope: !27, file: !114, line: 92, type: !167, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 95, type: !107, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !27, file: !114, line: 25, type: !360, isLocal: true, isDefinition: true)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !114, line: 13, size: 32, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !360, file: !114, line: 14, baseType: !190, size: 8)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !360, file: !114, line: 15, baseType: !190, size: 8, offset: 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !360, file: !114, line: 16, baseType: !126, size: 16, offset: 16)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !27, file: !114, line: 25, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 32, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 1)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "_zbus_message_acc_data_chan", scope: !27, file: !114, line: 35, type: !372, isLocal: true, isDefinition: true)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acc_msg", file: !114, line: 19, size: 96, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !372, file: !114, line: 20, baseType: !107, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !372, file: !114, line: 21, baseType: !107, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !372, file: !114, line: 22, baseType: !107, size: 32, offset: 64)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "_zbus_observers_acc_data_chan", scope: !27, file: !114, line: 35, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 96, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 3)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "_zbus_message_simple_chan", scope: !27, file: !114, line: 57, type: !107, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "_zbus_observers_simple_chan", scope: !27, file: !114, line: 57, type: !367, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !388, file: !403, line: 18, type: !404, isLocal: false, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, globals: !402, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!390 = !{!22, !106, !24, !391, !393, !395, !137, !107, !396, !397, !399, !400, !283, !401, !126, !121}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!402 = !{!386}
!403 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !407)
!406 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !406, line: 17, baseType: !121, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !405, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "_char_out", scope: !412, file: !416, line: 54, type: !417, isLocal: false, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !414, globals: !415, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!414 = !{!106, !107}
!415 = !{!410}
!416 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DISubroutineType(types: !419)
!419 = !{!107, !107}
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !422, file: !477, line: 35, type: !493, isLocal: false, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !424, globals: !474, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!424 = !{!106, !107, !425, !108, !436}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !427, file: !426, line: 167, baseType: !435)
!426 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!427 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !426, file: !426, line: 134, type: !428, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !422, retainedNodes: !430)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !108}
!430 = !{!431, !432, !434}
!431 = !DILocalVariable(name: "time_us", arg: 1, scope: !427, file: !426, line: 134, type: !108)
!432 = !DILocalVariable(name: "delay_cycles", scope: !427, file: !426, line: 168, type: !433)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!434 = !DILocalVariable(name: "cycles", scope: !427, file: !426, line: 171, type: !108)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !438, line: 1928, baseType: !439)
!438 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 1909, size: 11360, elements: !440)
!440 = !{!441, !447, !448, !449, !450, !454, !455, !456, !457, !459, !460, !464, !465, !466, !467, !468, !472, !473}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !439, file: !438, line: 1910, baseType: !442, size: 8192)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 8192, elements: !445)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!445 = !{!446}
!446 = !DISubrange(count: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !439, file: !438, line: 1911, baseType: !443, size: 32, offset: 8192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !439, file: !438, line: 1912, baseType: !443, size: 32, offset: 8224)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !439, file: !438, line: 1913, baseType: !443, size: 32, offset: 8256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !439, file: !438, line: 1914, baseType: !451, size: 1984, offset: 8288)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 1984, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 62)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !439, file: !438, line: 1915, baseType: !444, size: 32, offset: 10272)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !439, file: !438, line: 1916, baseType: !443, size: 32, offset: 10304)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !439, file: !438, line: 1917, baseType: !444, size: 32, offset: 10336)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !439, file: !438, line: 1918, baseType: !458, size: 96, offset: 10368)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 96, elements: !380)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !439, file: !438, line: 1919, baseType: !444, size: 32, offset: 10464)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !439, file: !438, line: 1920, baseType: !461, size: 256, offset: 10496)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 256, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 8)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !439, file: !438, line: 1921, baseType: !444, size: 32, offset: 10752)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !439, file: !438, line: 1922, baseType: !443, size: 32, offset: 10784)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !439, file: !438, line: 1923, baseType: !444, size: 32, offset: 10816)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !439, file: !438, line: 1924, baseType: !444, size: 32, offset: 10848)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !439, file: !438, line: 1925, baseType: !469, size: 416, offset: 10880)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 416, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 13)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !439, file: !438, line: 1926, baseType: !444, size: 32, offset: 11296)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !439, file: !438, line: 1927, baseType: !444, size: 32, offset: 11328)
!474 = !{!420, !475, !490}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !422, file: !477, line: 65, type: !478, isLocal: true, isDefinition: true, align: 32)
!477 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !480, line: 51, size: 64, elements: !481)
!480 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!481 = !{!482, !489}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !479, file: !480, line: 60, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DISubroutineType(types: !485)
!485 = !{!107, !486}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !480, line: 48, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !479, file: !480, line: 65, baseType: !486, size: 32, offset: 32)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !427, file: !426, line: 161, type: !492, isLocal: true, isDefinition: true, align: 128)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 48, elements: !380)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !494, file: !406, line: 17, baseType: !121, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !494, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !500, file: !534, line: 22, type: !562, isLocal: false, isDefinition: true)
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !502, retainedTypes: !514, globals: !531, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!502 = !{!503, !30}
!503 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !504, line: 27, baseType: !32, size: 32, elements: !505)
!504 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513}
!506 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!507 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!508 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!509 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!510 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!511 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!512 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!513 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!514 = !{!106, !102, !107, !24, !515, !283, !108, !109}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !517, line: 54, size: 96, elements: !518)
!517 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = !{!519, !526, !530}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !516, file: !517, line: 55, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !521, line: 33, baseType: !522)
!521 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !521, line: 29, size: 32, elements: !523)
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !522, file: !521, line: 30, baseType: !525, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !516, file: !517, line: 60, baseType: !527, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !503}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !516, file: !517, line: 65, baseType: !527, size: 32, offset: 64)
!531 = !{!498, !532, !538, !541, !543, !552, !554}
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !500, file: !534, line: 27, type: !535, isLocal: true, isDefinition: true)
!534 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 32, elements: !368)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !537, line: 22, baseType: !398)
!537 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !500, file: !534, line: 44, type: !540, isLocal: true, isDefinition: true)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !255, line: 43, elements: !256)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !500, file: !534, line: 49, type: !540, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !500, file: !534, line: 36, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 128, elements: !368)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !504, line: 114, size: 128, elements: !547)
!547 = !{!548, !549, !550, !551}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !546, file: !504, line: 115, baseType: !503, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !546, file: !504, line: 141, baseType: !190, size: 8, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !546, file: !504, line: 149, baseType: !108, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !546, file: !504, line: 156, baseType: !108, size: 32, offset: 96)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !500, file: !534, line: 40, type: !545, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !500, file: !534, line: 28, type: !556, isLocal: true, isDefinition: true)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !521, line: 40, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !521, line: 35, size: 64, elements: !558)
!558 = !{!559, !561}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !557, file: !521, line: 36, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !557, file: !521, line: 37, baseType: !560, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !563, file: !406, line: 17, baseType: !121, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !563, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!567 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!568 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !571, file: !599, line: 50, type: !334, isLocal: true, isDefinition: true)
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !502, retainedTypes: !573, globals: !596, splitDebugInlining: false, nameTableKind: None)
!572 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!573 = !{!574, !102, !137, !107, !106, !108, !109, !576, !283, !334, !587}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !575)
!575 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !578, line: 45, size: 64, elements: !579)
!578 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = !{!580, !586}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !577, file: !578, line: 46, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !521, line: 33, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !521, line: 29, size: 32, elements: !583)
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !582, file: !521, line: 30, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !577, file: !578, line: 48, baseType: !108, size: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 32)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !578, line: 38, size: 64, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !588, file: !578, line: 39, baseType: !581, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !588, file: !578, line: 41, baseType: !592, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !578, line: 35, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !334}
!596 = !{!597, !601, !609, !569, !611, !621}
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "latency_lock", scope: !571, file: !599, line: 44, type: !600, isLocal: true, isDefinition: true)
!599 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !255, line: 43, elements: !256)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !571, file: !599, line: 46, type: !603, isLocal: true, isDefinition: true)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !521, line: 40, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !521, line: 35, size: 64, elements: !605)
!605 = !{!606, !608}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !604, file: !521, line: 36, baseType: !607, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !604, file: !521, line: 37, baseType: !607, size: 32, offset: 32)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "latency_subs", scope: !571, file: !599, line: 52, type: !603, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !571, file: !599, line: 39, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, elements: !619)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !599, line: 35, size: 96, elements: !615)
!615 = !{!616, !617, !618}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !614, file: !599, line: 36, baseType: !503, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !614, file: !599, line: 37, baseType: !190, size: 8, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !614, file: !599, line: 38, baseType: !536, size: 32, offset: 64)
!619 = !{!620}
!620 = !DISubrange(count: 0)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !571, file: !599, line: 48, type: !334, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !625, file: !632, line: 47, type: !646, isLocal: true, isDefinition: true)
!625 = distinct !DICompileUnit(language: DW_LANG_C99, file: !626, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !627, retainedTypes: !628, globals: !629, splitDebugInlining: false, nameTableKind: None)
!626 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!627 = !{!503}
!628 = !{!137, !107}
!629 = !{!630, !623, !642}
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "cpus_states", scope: !625, file: !632, line: 50, type: !633, isLocal: true, isDefinition: true)
!632 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 32, elements: !368)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !504, line: 114, size: 128, elements: !637)
!637 = !{!638, !639, !640, !641}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !636, file: !504, line: 115, baseType: !503, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !636, file: !504, line: 141, baseType: !190, size: 8, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !636, file: !504, line: 149, baseType: !108, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !636, file: !504, line: 156, baseType: !108, size: 32, offset: 96)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !625, file: !632, line: 55, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 8, elements: !368)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, elements: !619)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !649, file: !656, line: 17, type: !779, isLocal: false, isDefinition: true)
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !651, globals: !652, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!651 = !{!137, !107, !108, !106}
!652 = !{!647, !653, !775}
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !655, file: !656, line: 198, type: !762, isLocal: true, isDefinition: true)
!655 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !656, file: !656, line: 175, type: !657, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !649, retainedNodes: !759)
!656 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!657 = !DISubroutineType(types: !658)
!658 = !{null, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 1024, elements: !661)
!661 = !{!662, !720, !732, !733, !734, !735, !741, !754}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !660, file: !168, line: 247, baseType: !663, size: 384)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !664)
!664 = !{!665, !689, !696, !697, !698, !707, !708, !709}
!665 = !DIDerivedType(tag: DW_TAG_member, scope: !663, file: !168, line: 60, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !663, file: !168, line: 60, size: 64, elements: !667)
!667 = !{!668, !683}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !666, file: !168, line: 61, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !671)
!671 = !{!672, !678}
!672 = !DIDerivedType(tag: DW_TAG_member, scope: !670, file: !151, line: 38, baseType: !673, size: 32)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !670, file: !151, line: 38, size: 32, elements: !674)
!674 = !{!675, !677}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !673, file: !151, line: 39, baseType: !676, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !673, file: !151, line: 40, baseType: !676, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, scope: !670, file: !151, line: 42, baseType: !679, size: 32, offset: 32)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !670, file: !151, line: 42, size: 32, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !679, file: !151, line: 43, baseType: !676, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !679, file: !151, line: 44, baseType: !676, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !666, file: !168, line: 62, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !685)
!685 = !{!686}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !684, file: !180, line: 50, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 64, elements: !185)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !663, file: !168, line: 68, baseType: !690, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !692, file: !146, line: 232, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !670)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !663, file: !168, line: 71, baseType: !190, size: 8, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !663, file: !168, line: 74, baseType: !190, size: 8, offset: 104)
!698 = !DIDerivedType(tag: DW_TAG_member, scope: !663, file: !168, line: 90, baseType: !699, size: 16, offset: 112)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !663, file: !168, line: 90, size: 16, elements: !700)
!700 = !{!701, !706}
!701 = !DIDerivedType(tag: DW_TAG_member, scope: !699, file: !168, line: 91, baseType: !702, size: 16)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !699, file: !168, line: 91, size: 16, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !702, file: !168, line: 96, baseType: !200, size: 8)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !702, file: !168, line: 97, baseType: !190, size: 8, offset: 8)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !699, file: !168, line: 100, baseType: !126, size: 16)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !663, file: !168, line: 107, baseType: !108, size: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !663, file: !168, line: 127, baseType: !106, size: 32, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !663, file: !168, line: 131, baseType: !710, size: 192, offset: 192)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !711)
!711 = !{!712, !713, !719}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !710, file: !146, line: 245, baseType: !669, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !710, file: !146, line: 246, baseType: !714, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !718}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !710, file: !146, line: 249, baseType: !104, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !660, file: !168, line: 250, baseType: !721, size: 288, offset: 384)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !219, line: 25, size: 288, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !721, file: !219, line: 26, baseType: !108, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !721, file: !219, line: 27, baseType: !108, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !721, file: !219, line: 28, baseType: !108, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !721, file: !219, line: 29, baseType: !108, size: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !721, file: !219, line: 30, baseType: !108, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !721, file: !219, line: 31, baseType: !108, size: 32, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !721, file: !219, line: 32, baseType: !108, size: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !721, file: !219, line: 33, baseType: !108, size: 32, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !721, file: !219, line: 34, baseType: !108, size: 32, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !660, file: !168, line: 253, baseType: !106, size: 32, offset: 672)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !660, file: !168, line: 256, baseType: !691, size: 64, offset: 704)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !660, file: !168, line: 294, baseType: !107, size: 32, offset: 768)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !660, file: !168, line: 300, baseType: !736, size: 96, offset: 800)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !168, line: 149, size: 96, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !736, file: !168, line: 153, baseType: !22, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !736, file: !168, line: 162, baseType: !137, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !736, file: !168, line: 168, baseType: !137, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !660, file: !168, line: 325, baseType: !742, size: 32, offset: 896)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 160, elements: !744)
!744 = !{!745, !751, !752}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !743, file: !142, line: 5074, baseType: !746, size: 96)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !245, line: 56, size: 96, elements: !747)
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !746, file: !245, line: 57, baseType: !248, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !746, file: !245, line: 58, baseType: !106, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !746, file: !245, line: 59, baseType: !137, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !743, file: !142, line: 5075, baseType: !691, size: 64, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !743, file: !142, line: 5076, baseType: !753, offset: 160)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !255, line: 43, elements: !256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !660, file: !168, line: 343, baseType: !755, size: 64, offset: 928)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !219, line: 60, size: 64, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !755, file: !219, line: 63, baseType: !108, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !755, file: !219, line: 66, baseType: !108, size: 32, offset: 32)
!759 = !{!760, !761}
!760 = !DILocalVariable(name: "thread", arg: 1, scope: !655, file: !656, line: 175, type: !659)
!761 = !DILocalVariable(name: "region_num", scope: !655, file: !656, line: 200, type: !190)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, elements: !619)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !764, line: 52, size: 96, elements: !765)
!764 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !763, file: !764, line: 53, baseType: !22, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !763, file: !764, line: 54, baseType: !137, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !763, file: !764, line: 55, baseType: !769, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !770, line: 304, baseType: !771)
!770 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !770, line: 301, size: 32, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !771, file: !770, line: 302, baseType: !126, size: 16)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !771, file: !770, line: 303, baseType: !126, size: 16, offset: 16)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "static_regions", scope: !649, file: !656, line: 62, type: !777, isLocal: true, isDefinition: true)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 96, elements: !368)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !780, file: !406, line: 17, baseType: !121, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !780, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !786, file: !840, line: 39, type: !190, isLocal: true, isDefinition: true)
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !788, globals: !831, splitDebugInlining: false, nameTableKind: None)
!787 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!788 = !{!789, !106, !107, !817}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !791, line: 1495, baseType: !792)
!791 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !791, line: 1474, size: 448, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !807}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !792, file: !791, line: 1476, baseType: !443, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !792, file: !791, line: 1477, baseType: !444, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !792, file: !791, line: 1478, baseType: !444, size: 32, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !792, file: !791, line: 1479, baseType: !444, size: 32, offset: 96)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !792, file: !791, line: 1480, baseType: !444, size: 32, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !792, file: !791, line: 1481, baseType: !444, size: 32, offset: 160)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !792, file: !791, line: 1482, baseType: !444, size: 32, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !792, file: !791, line: 1483, baseType: !444, size: 32, offset: 224)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !792, file: !791, line: 1484, baseType: !444, size: 32, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !792, file: !791, line: 1485, baseType: !444, size: 32, offset: 288)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !792, file: !791, line: 1486, baseType: !444, size: 32, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !792, file: !791, line: 1487, baseType: !806, size: 32, offset: 352)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 32, elements: !368)
!807 = !DIDerivedType(tag: DW_TAG_member, scope: !792, file: !791, line: 1488, baseType: !808, size: 64, offset: 384)
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !792, file: !791, line: 1488, size: 64, elements: !809)
!809 = !{!810, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !808, file: !791, line: 1489, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 64, elements: !185)
!812 = !DIDerivedType(tag: DW_TAG_member, scope: !808, file: !791, line: 1490, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !808, file: !791, line: 1490, size: 64, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !813, file: !791, line: 1491, baseType: !444, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !813, file: !791, line: 1492, baseType: !444, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !820, line: 27, size: 128, elements: !821)
!820 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!821 = !{!822, !823, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !819, file: !820, line: 29, baseType: !108, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !819, file: !820, line: 31, baseType: !121, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !819, file: !820, line: 37, baseType: !825, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !770, line: 298, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !770, line: 289, size: 64, elements: !827)
!827 = !{!828, !829, !830}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !826, file: !770, line: 291, baseType: !190, size: 5, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !826, file: !770, line: 293, baseType: !190, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !826, file: !770, line: 295, baseType: !108, size: 32, offset: 32)
!831 = !{!784, !832}
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !786, file: !834, line: 31, type: !835, isLocal: true, isDefinition: true)
!834 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 160, elements: !368)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !834, line: 21, size: 160, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !836, file: !834, line: 22, baseType: !107, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !836, file: !834, line: 23, baseType: !819, size: 128, offset: 32)
!840 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !843, file: !850, line: 21, type: !417, isLocal: true, isDefinition: true)
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !844, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !845, globals: !849, splitDebugInlining: false, nameTableKind: None)
!844 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!845 = !{!846, !107, !106}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !848, line: 22, baseType: !107)
!848 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!849 = !{!841}
!850 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !853, file: !858, line: 13, type: !877, isLocal: true, isDefinition: true)
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !855, splitDebugInlining: false, nameTableKind: None)
!854 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!855 = !{!856, !851}
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "mpu_config", scope: !853, file: !858, line: 37, type: !859, isLocal: false, isDefinition: true)
!858 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !820, line: 41, size: 64, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !860, file: !820, line: 43, baseType: !108, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !860, file: !820, line: 45, baseType: !864, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !820, line: 27, size: 128, elements: !867)
!867 = !{!868, !869, !870}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !866, file: !820, line: 29, baseType: !108, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !866, file: !820, line: 31, baseType: !121, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !866, file: !820, line: 37, baseType: !871, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !770, line: 298, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !770, line: 289, size: 64, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !872, file: !770, line: 291, baseType: !190, size: 5, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !872, file: !770, line: 293, baseType: !190, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !872, file: !770, line: 295, baseType: !108, size: 32, offset: 32)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 256, elements: !185)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !880, file: !884, line: 10, type: !885, isLocal: false, isDefinition: true)
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !882, globals: !883, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!882 = !{!102, !106, !107}
!883 = !{!878}
!884 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !886, file: !406, line: 17, baseType: !121, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !886, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !892, file: !1093, line: 18, type: !1324, isLocal: false, isDefinition: true)
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !894, retainedTypes: !1012, globals: !1089, splitDebugInlining: false, nameTableKind: None)
!893 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som/subsys/zbus/hello_world")
!894 = !{!895, !901, !30, !906, !911, !915, !919, !923, !929, !933, !977, !984, !1003}
!895 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !896, line: 23, baseType: !32, size: 32, elements: !897)
!896 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!897 = !{!898, !899, !900}
!898 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!899 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!900 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !896, line: 48, baseType: !32, size: 32, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!904 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!905 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 167, baseType: !32, size: 32, elements: !908)
!907 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!908 = !{!909, !910}
!909 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!910 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 107, baseType: !32, size: 32, elements: !912)
!912 = !{!913, !914}
!913 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!914 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 208, baseType: !32, size: 32, elements: !916)
!916 = !{!917, !918}
!917 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!918 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 261, baseType: !32, size: 32, elements: !920)
!920 = !{!921, !922}
!921 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!922 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 237, baseType: !32, size: 32, elements: !924)
!924 = !{!925, !926, !927, !928}
!925 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!926 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!927 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!928 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!929 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 152, baseType: !32, size: 32, elements: !930)
!930 = !{!931, !932}
!931 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!932 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !438, line: 71, baseType: !107, size: 32, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976}
!935 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!936 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!937 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!938 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!939 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!940 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!941 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!942 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!943 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!944 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!945 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!946 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!947 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!948 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!949 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!950 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!951 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!952 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!953 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!954 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!955 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!956 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!957 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!958 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!959 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!960 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!961 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!962 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!963 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!964 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!965 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!966 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!967 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!968 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!969 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!970 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!971 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!972 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!973 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!974 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!975 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!976 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!977 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !978, line: 44, baseType: !32, size: 32, elements: !979)
!978 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!979 = !{!980, !981, !982, !983}
!980 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!981 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!982 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!983 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!984 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !985, line: 54, baseType: !32, size: 32, elements: !986)
!985 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!986 = !{!987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002}
!987 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!988 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!989 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!990 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!991 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!992 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!993 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!994 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!995 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!996 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!997 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!998 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!999 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!1000 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!1001 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!1002 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!1003 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1004, line: 53, baseType: !32, size: 32, elements: !1005)
!1004 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011}
!1006 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!1007 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!1008 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!1009 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!1010 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!1011 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!1012 = !{!895, !106, !107, !1013, !1055, !1056, !1057, !1058, !102, !108, !109, !136, !1059, !401, !334, !1060, !1088, !137}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !438, line: 923, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 883, size: 10464, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1036, !1037, !1038, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !1015, file: !438, line: 884, baseType: !444, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !1015, file: !438, line: 885, baseType: !444, size: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !1015, file: !438, line: 886, baseType: !444, size: 32, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !1015, file: !438, line: 887, baseType: !444, size: 32, offset: 96)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !1015, file: !438, line: 888, baseType: !1022, size: 896, offset: 128)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 896, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 28)
