; ModuleID = './main.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (%struct._reent*, i8*, i8*, i32)*, i32 (%struct._reent*, i8*, i8*, i32)*, i32 (%struct._reent*, i8*, i32, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i32, %struct._reent*, %struct.__lock*, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct.__lock = type opaque
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon, [32 x i8] }
%struct.anon = type { i32, i8*, [26 x i8], %struct.__tm, i32, i64, %struct._rand48, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, [8 x i8], [24 x i8], i32, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GPIO_InitStruct", scope: !2, file: !89, line: 51, type: !90, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !88, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/src/main.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "6abae0dd70445183569c6109a9828502")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 39, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "components/STM32F4xx_HAL_Driver/Inc/stm32f4xx_hal_def.h", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "53425c2c922b747a5882ff8e41badc34")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "HAL_OK", value: 0)
!10 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!11 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!12 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!13 = !{!14, !36, !39, !41, !38, !78, !79, !85}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !16, line: 602, baseType: !17)
!16 = !DIFile(filename: "include/STM32F4xx/Include/stm32f429xx.h", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "c6d3c6b2f5b9e084704dda73702120b9")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 591, size: 320, elements: !18)
!18 = !{!19, !25, !26, !27, !28, !29, !30, !31, !32}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !17, file: !16, line: 593, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 48, baseType: !23)
!22 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ab914e287601b2385e57880e6599aa6b")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !24, line: 79, baseType: !7)
!24 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f7024d0682a918b41f94e8be9cd90461")
!25 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !17, file: !16, line: 594, baseType: !20, size: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !17, file: !16, line: 595, baseType: !20, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !17, file: !16, line: 596, baseType: !20, size: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !17, file: !16, line: 597, baseType: !20, size: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !17, file: !16, line: 598, baseType: !20, size: 32, offset: 160)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !17, file: !16, line: 599, baseType: !20, size: 32, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !17, file: !16, line: 600, baseType: !20, size: 32, offset: 224)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !17, file: !16, line: 601, baseType: !33, size: 64, offset: 256)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 64, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 2)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !22, line: 36, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !24, line: 57, baseType: !38)
!38 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "TickType_t", file: !40, line: 63, baseType: !21)
!40 = !DIFile(filename: "components/FreeRTOS-Kernel/portable/GCC/ARM_CM4F/portmacro.h", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "2f588c676c107f3d951beafdb8be240c")
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !16, line: 742, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 708, size: 1152, elements: !44)
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !43, file: !16, line: 710, baseType: !20, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !43, file: !16, line: 711, baseType: !20, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !43, file: !16, line: 712, baseType: !20, size: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !43, file: !16, line: 713, baseType: !20, size: 32, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !43, file: !16, line: 714, baseType: !20, size: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !43, file: !16, line: 715, baseType: !20, size: 32, offset: 160)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !43, file: !16, line: 716, baseType: !20, size: 32, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !43, file: !16, line: 717, baseType: !21, size: 32, offset: 224)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !43, file: !16, line: 718, baseType: !20, size: 32, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !43, file: !16, line: 719, baseType: !20, size: 32, offset: 288)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !43, file: !16, line: 720, baseType: !56, size: 64, offset: 320)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 64, elements: !34)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !43, file: !16, line: 721, baseType: !20, size: 32, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !43, file: !16, line: 722, baseType: !20, size: 32, offset: 416)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !43, file: !16, line: 723, baseType: !20, size: 32, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !43, file: !16, line: 724, baseType: !21, size: 32, offset: 480)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !43, file: !16, line: 725, baseType: !20, size: 32, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !43, file: !16, line: 726, baseType: !20, size: 32, offset: 544)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !43, file: !16, line: 727, baseType: !56, size: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !43, file: !16, line: 728, baseType: !20, size: 32, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !43, file: !16, line: 729, baseType: !20, size: 32, offset: 672)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !43, file: !16, line: 730, baseType: !20, size: 32, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !43, file: !16, line: 731, baseType: !21, size: 32, offset: 736)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !43, file: !16, line: 732, baseType: !20, size: 32, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !43, file: !16, line: 733, baseType: !20, size: 32, offset: 800)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !43, file: !16, line: 734, baseType: !56, size: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !43, file: !16, line: 735, baseType: !20, size: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !43, file: !16, line: 736, baseType: !20, size: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !43, file: !16, line: 737, baseType: !56, size: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !43, file: !16, line: 738, baseType: !20, size: 32, offset: 1024)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !43, file: !16, line: 739, baseType: !20, size: 32, offset: 1056)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSAICFGR", scope: !43, file: !16, line: 740, baseType: !20, size: 32, offset: 1088)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !43, file: !16, line: 741, baseType: !20, size: 32, offset: 1120)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !16, line: 702, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 698, size: 64, elements: !82)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !81, file: !16, line: 700, baseType: !20, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !81, file: !16, line: 701, baseType: !20, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 24, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !24, line: 43, baseType: !87)
!87 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!88 = !{!0}
!89 = !DIFile(filename: "src/main.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "6abae0dd70445183569c6109a9828502")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_InitTypeDef", file: !91, line: 63, baseType: !92)
!91 = !DIFile(filename: "components/STM32F4xx_HAL_Driver/Inc/stm32f4xx_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "3deaed60d9879341cdc54a9e866f7bcb")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 47, size: 160, elements: !93)
!93 = !{!94, !95, !96, !97, !98}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Pin", scope: !92, file: !91, line: 49, baseType: !21, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !92, file: !91, line: 52, baseType: !21, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Pull", scope: !92, file: !91, line: 55, baseType: !21, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Speed", scope: !92, file: !91, line: 58, baseType: !21, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Alternate", scope: !92, file: !91, line: 61, baseType: !21, size: 32, offset: 128)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "pxCurrentTCB", scope: !101, file: !125, line: 337, type: !234, isLocal: false, isDefinition: true)
!101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !102, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !103, retainedTypes: !120, globals: !187, splitDebugInlining: false, nameTableKind: None)
!102 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/components/FreeRTOS-Kernel/tasks.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "3077f31cd8847126f862071429f26fca")
!103 = !{!104, !113}
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 79, baseType: !7, size: 32, elements: !106)
!105 = !DIFile(filename: "components/FreeRTOS-Kernel/include/task.h", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "d32690b14c9d0468891bf5e050752363")
!106 = !{!107, !108, !109, !110, !111, !112}
!107 = !DIEnumerator(name: "eRunning", value: 0)
!108 = !DIEnumerator(name: "eReady", value: 1)
!109 = !DIEnumerator(name: "eBlocked", value: 2)
!110 = !DIEnumerator(name: "eSuspended", value: 3)
!111 = !DIEnumerator(name: "eDeleted", value: 4)
!112 = !DIEnumerator(name: "eInvalid", value: 5)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 90, baseType: !7, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119}
!115 = !DIEnumerator(name: "eNoAction", value: 0)
!116 = !DIEnumerator(name: "eSetBits", value: 1)
!117 = !DIEnumerator(name: "eIncrement", value: 2)
!118 = !DIEnumerator(name: "eSetValueWithOverwrite", value: 3)
!119 = !DIEnumerator(name: "eSetValueWithoutOverwrite", value: 4)
!120 = !{!121, !78, !123, !21, !176, !149, !178, !39, !85, !38, !179, !181, !183, !185, !186, !163, !166, !36}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 209, baseType: !7)
!122 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/include/stddef.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "862bb94651e55628ab3700c73b0fcc15")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCB_t", file: !125, line: 333, baseType: !126)
!125 = !DIFile(filename: "components/FreeRTOS-Kernel/tasks.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "3077f31cd8847126f862071429f26fca")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "tskTCB", file: !125, line: 329, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tskTaskControlBlock", file: !125, line: 252, size: 704, elements: !128)
!128 = !{!129, !133, !160, !161, !162, !164, !169, !170, !171, !172, !173, !174}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pxTopOfStack", scope: !127, file: !125, line: 254, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "StackType_t", file: !40, line: 55, baseType: !21)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "xStateListItem", scope: !127, file: !125, line: 260, baseType: !134, size: 160, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !135, line: 150, baseType: !136)
!135 = !DIFile(filename: "components/FreeRTOS-Kernel/include/list.h", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "32966c16d63cc02c3c2085bb611d99cf")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !135, line: 140, size: 160, elements: !137)
!137 = !{!138, !139, !141, !142, !143}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !136, file: !135, line: 143, baseType: !39, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !136, file: !135, line: 144, baseType: !140, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !136, file: !135, line: 145, baseType: !140, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !136, file: !135, line: 146, baseType: !78, size: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !136, file: !135, line: 147, baseType: !144, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !135, line: 164, size: 160, elements: !146)
!146 = !{!147, !151, !153}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !145, file: !135, line: 167, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "UBaseType_t", file: !40, line: 57, baseType: !150)
!150 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !145, file: !135, line: 168, baseType: !152, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !145, file: !135, line: 169, baseType: !154, size: 96, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !135, line: 159, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !135, line: 152, size: 96, elements: !156)
!156 = !{!157, !158, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !155, file: !135, line: 155, baseType: !39, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !155, file: !135, line: 156, baseType: !140, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !155, file: !135, line: 157, baseType: !140, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "xEventListItem", scope: !127, file: !125, line: 261, baseType: !134, size: 160, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "uxPriority", scope: !127, file: !125, line: 262, baseType: !149, size: 32, offset: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pxStack", scope: !127, file: !125, line: 263, baseType: !163, size: 32, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pcTaskName", scope: !127, file: !125, line: 264, baseType: !165, size: 80, offset: 416)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 80, elements: !167)
!166 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!167 = !{!168}
!168 = !DISubrange(count: 10)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "uxTCBNumber", scope: !127, file: !125, line: 275, baseType: !149, size: 32, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "uxTaskNumber", scope: !127, file: !125, line: 276, baseType: !149, size: 32, offset: 544)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "uxBasePriority", scope: !127, file: !125, line: 280, baseType: !149, size: 32, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "uxMutexesHeld", scope: !127, file: !125, line: 281, baseType: !149, size: 32, offset: 608)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ulNotifiedValue", scope: !127, file: !125, line: 311, baseType: !20, size: 32, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ucNotifyState", scope: !127, file: !125, line: 312, baseType: !175, size: 8, offset: 672)
!175 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !85)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "BaseType_t", file: !40, line: 56, baseType: !177)
!177 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "List_t", file: !135, line: 171, baseType: !145)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskHandle_t", file: !105, line: 70, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!186 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!187 = !{!99, !188, !193, !196, !198, !200, !202, !204, !206, !208, !210, !212, !214, !216, !219, !221, !224, !226, !228, !230, !232}
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "pxReadyTasksLists", scope: !101, file: !125, line: 343, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 800, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 5)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "pxDelayedTaskList", scope: !101, file: !125, line: 346, type: !195, isLocal: true, isDefinition: true)
!195 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !179)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "pxOverflowDelayedTaskList", scope: !101, file: !125, line: 347, type: !195, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "xPendingReadyList", scope: !101, file: !125, line: 348, type: !180, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "xTasksWaitingTermination", scope: !101, file: !125, line: 352, type: !180, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "xSuspendedTaskList", scope: !101, file: !125, line: 359, type: !180, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "xDelayedTaskList1", scope: !101, file: !125, line: 344, type: !180, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "xDelayedTaskList2", scope: !101, file: !125, line: 345, type: !180, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "uxTopReadyPriority", scope: !101, file: !125, line: 372, type: !148, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "uxTaskNumber", scope: !101, file: !125, line: 377, type: !149, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "uxDeletedTasksWaitingCleanUp", scope: !101, file: !125, line: 353, type: !148, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "uxCurrentNumberOfTasks", scope: !101, file: !125, line: 370, type: !148, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "xSchedulerRunning", scope: !101, file: !125, line: 373, type: !218, isLocal: true, isDefinition: true)
!218 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !176)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "uxSchedulerSuspended", scope: !101, file: !125, line: 389, type: !148, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "xTickCount", scope: !101, file: !125, line: 371, type: !223, isLocal: true, isDefinition: true)
!223 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "xIdleTaskHandle", scope: !101, file: !125, line: 379, type: !181, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "xNextTaskUnblockTime", scope: !101, file: !125, line: 378, type: !223, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "xYieldPending", scope: !101, file: !125, line: 375, type: !218, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "xPendedTicks", scope: !101, file: !125, line: 374, type: !223, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "xNumOfOverflows", scope: !101, file: !125, line: 376, type: !218, isLocal: true, isDefinition: true)
!234 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !123)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "xTimerQueue", scope: !237, file: !242, line: 141, type: !308, isLocal: true, isDefinition: true)
!237 = distinct !DICompileUnit(language: DW_LANG_C99, file: !238, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !239, globals: !282, splitDebugInlining: false, nameTableKind: None)
!238 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/components/FreeRTOS-Kernel/timers.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "5a863362583252b1bb248767fbee5205")
!239 = !{!176, !78, !38, !149, !240, !39, !85, !178, !278}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer_t", file: !242, line: 88, baseType: !243)
!242 = !DIFile(filename: "components/FreeRTOS-Kernel/timers.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "5a863362583252b1bb248767fbee5205")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "xTIMER", file: !242, line: 84, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tmrTimerControl", file: !242, line: 73, size: 352, elements: !245)
!245 = !{!246, !247, !270, !271, !272, !280, !281}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pcTimerName", scope: !244, file: !242, line: 75, baseType: !183, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "xTimerListItem", scope: !244, file: !242, line: 76, baseType: !248, size: 160, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !135, line: 150, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !135, line: 140, size: 160, elements: !250)
!250 = !{!251, !252, !254, !255, !256}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !249, file: !135, line: 143, baseType: !39, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !249, file: !135, line: 144, baseType: !253, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !249, file: !135, line: 145, baseType: !253, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !249, file: !135, line: 146, baseType: !78, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !249, file: !135, line: 147, baseType: !257, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !135, line: 164, size: 160, elements: !259)
!259 = !{!260, !261, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !258, file: !135, line: 167, baseType: !148, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !258, file: !135, line: 168, baseType: !262, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !258, file: !135, line: 169, baseType: !264, size: 96, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !135, line: 159, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !135, line: 152, size: 96, elements: !266)
!266 = !{!267, !268, !269}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !265, file: !135, line: 155, baseType: !39, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !265, file: !135, line: 156, baseType: !253, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !265, file: !135, line: 157, baseType: !253, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "xTimerPeriodInTicks", scope: !244, file: !242, line: 77, baseType: !39, size: 32, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pvTimerID", scope: !244, file: !242, line: 78, baseType: !78, size: 32, offset: 224)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pxCallbackFunction", scope: !244, file: !242, line: 79, baseType: !273, size: 32, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerCallbackFunction_t", file: !274, line: 82, baseType: !275)
!274 = !DIFile(filename: "components/FreeRTOS-Kernel/include/timers.h", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "6c03cb4f5c43f4e8195fac8aa7087e34")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !278}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerHandle_t", file: !274, line: 77, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "uxTimerNumber", scope: !244, file: !242, line: 81, baseType: !149, size: 32, offset: 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ucStatus", scope: !244, file: !242, line: 83, baseType: !85, size: 8, offset: 320)
!282 = !{!235, !283, !288, !292, !302, !304, !306}
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "xTimerTaskHandle", scope: !237, file: !242, line: 142, type: !285, isLocal: true, isDefinition: true)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskHandle_t", file: !105, line: 70, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "tskTaskControlBlock", file: !105, line: 69, flags: DIFlagFwdDecl)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "pxCurrentTimerList", scope: !237, file: !242, line: 137, type: !290, isLocal: true, isDefinition: true)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "List_t", file: !135, line: 171, baseType: !258)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "xLastTime", scope: !294, file: !242, line: 673, type: !39, isLocal: true, isDefinition: true)
!294 = distinct !DISubprogram(name: "prvSampleTimeNow", scope: !242, file: !242, line: 670, type: !295, scopeLine: 671, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !237, retainedNodes: !299)
!295 = !DISubroutineType(types: !296)
!296 = !{!39, !297}
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!299 = !{!300, !301}
!300 = !DILocalVariable(name: "pxTimerListsWereSwitched", arg: 1, scope: !294, file: !242, line: 670, type: !297)
!301 = !DILocalVariable(name: "xTimeNow", scope: !294, file: !242, line: 672, type: !39)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "pxOverflowTimerList", scope: !237, file: !242, line: 138, type: !290, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "xActiveTimerList1", scope: !237, file: !242, line: 135, type: !291, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "xActiveTimerList2", scope: !237, file: !242, line: 136, type: !291, isLocal: true, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueueHandle_t", file: !309, line: 48, baseType: !310)
!309 = !DIFile(filename: "components/FreeRTOS-Kernel/include/queue.h", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "9ae99e0593f6fb04bc9aa05c6a5d4566")
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueDefinition", file: !309, line: 47, flags: DIFlagFwdDecl)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "ucMaxSysCallPriority", scope: !314, file: !321, line: 177, type: !85, isLocal: true, isDefinition: true)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !316, globals: !318, splitDebugInlining: false, nameTableKind: None)
!315 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/components/FreeRTOS-Kernel/portable/GCC/ARM_CM4F/port.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "1aa31963b59d374ee2096bbebeac12d0")
!316 = !{!132, !178, !317, !85, !21, !176, !39}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!318 = !{!319, !312, !325, !327}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "pcInterruptPriorityRegisters", scope: !314, file: !321, line: 179, type: !322, isLocal: true, isDefinition: true)
!321 = !DIFile(filename: "components/FreeRTOS-Kernel/portable/GCC/ARM_CM4F/port.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "1aa31963b59d374ee2096bbebeac12d0")
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "ulMaxPRIGROUPValue", scope: !314, file: !321, line: 178, type: !21, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "uxCriticalNesting", scope: !314, file: !321, line: 146, type: !149, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "pxEnd", scope: !331, file: !336, line: 98, type: !334, isLocal: true, isDefinition: true)
!331 = distinct !DICompileUnit(language: DW_LANG_C99, file: !332, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !333, globals: !342, splitDebugInlining: false, nameTableKind: None)
!332 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/components/FreeRTOS-Kernel/portable/MemMang/heap_4.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "d99d733b61c082b91d4b48dfb4c17242")
!333 = !{!78, !185, !121, !334, !39}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockLink_t", file: !336, line: 73, baseType: !337)
!336 = !DIFile(filename: "components/FreeRTOS-Kernel/portable/MemMang/heap_4.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "d99d733b61c082b91d4b48dfb4c17242")
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "A_BLOCK_LINK", file: !336, line: 69, size: 64, elements: !338)
!338 = !{!339, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pxNextFreeBlock", scope: !337, file: !336, line: 71, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "xBlockSize", scope: !337, file: !336, line: 72, baseType: !121, size: 32, offset: 32)
!342 = !{!343, !346, !329, !348, !350, !352, !354, !356, !358}
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!344 = distinct !DIGlobalVariable(name: "xHeapStructSize", scope: !331, file: !336, line: 95, type: !345, isLocal: true, isDefinition: true)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "xStart", scope: !331, file: !336, line: 98, type: !335, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "xBlockAllocatedBit", scope: !331, file: !336, line: 111, type: !121, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "xFreeBytesRemaining", scope: !331, file: !336, line: 102, type: !121, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "xMinimumEverFreeBytesRemaining", scope: !331, file: !336, line: 103, type: !121, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "xNumberOfSuccessfulAllocations", scope: !331, file: !336, line: 104, type: !121, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "xNumberOfSuccessfulFrees", scope: !331, file: !336, line: 105, type: !121, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "ucHeap", scope: !331, file: !336, line: 64, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 614400, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 76800)
!363 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 2147483648, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "xQueueRegistry", scope: !366, file: !374, line: 162, type: !432, isLocal: false, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !368, globals: !431, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/components/FreeRTOS-Kernel/queue.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "09d9203a1eed33c92b33443d5d63bae9")
!368 = !{!149, !369, !176, !178, !121, !372, !78, !185, !39, !85, !429, !379}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !22, line: 20, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !24, line: 41, baseType: !371)
!371 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "Queue_t", file: !374, line: 135, baseType: !375)
!374 = !DIFile(filename: "components/FreeRTOS-Kernel/queue.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "09d9203a1eed33c92b33443d5d63bae9")
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "xQUEUE", file: !374, line: 131, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QueueDefinition", file: !374, line: 97, size: 640, elements: !377)
!377 = !{!378, !380, !381, !396, !420, !421, !422, !423, !424, !426, !427, !428}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pcHead", scope: !376, file: !374, line: 99, baseType: !379, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pcWriteTo", scope: !376, file: !374, line: 100, baseType: !379, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !376, file: !374, line: 106, baseType: !382, size: 64, offset: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !376, file: !374, line: 102, size: 64, elements: !383)
!383 = !{!384, !390}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "xQueue", scope: !382, file: !374, line: 104, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueuePointers_t", file: !374, line: 71, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QueuePointers", file: !374, line: 67, size: 64, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pcTail", scope: !386, file: !374, line: 69, baseType: !379, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pcReadFrom", scope: !386, file: !374, line: 70, baseType: !379, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "xSemaphore", scope: !382, file: !374, line: 105, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreData_t", file: !374, line: 77, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreData", file: !374, line: 73, size: 64, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "xMutexHolder", scope: !392, file: !374, line: 75, baseType: !285, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "uxRecursiveCallCount", scope: !392, file: !374, line: 76, baseType: !149, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "xTasksWaitingToSend", scope: !376, file: !374, line: 108, baseType: !397, size: 160, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "List_t", file: !135, line: 171, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !135, line: 164, size: 160, elements: !399)
!399 = !{!400, !401, !413}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !398, file: !135, line: 167, baseType: !148, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !398, file: !135, line: 168, baseType: !402, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !135, line: 150, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !135, line: 140, size: 160, elements: !405)
!405 = !{!406, !407, !409, !410, !411}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !404, file: !135, line: 143, baseType: !39, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !404, file: !135, line: 144, baseType: !408, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !404, file: !135, line: 145, baseType: !408, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !404, file: !135, line: 146, baseType: !78, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !404, file: !135, line: 147, baseType: !412, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !398, file: !135, line: 169, baseType: !414, size: 96, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !135, line: 159, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !135, line: 152, size: 96, elements: !416)
!416 = !{!417, !418, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !415, file: !135, line: 155, baseType: !39, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !415, file: !135, line: 156, baseType: !408, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !415, file: !135, line: 157, baseType: !408, size: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "xTasksWaitingToReceive", scope: !376, file: !374, line: 109, baseType: !397, size: 160, offset: 288)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "uxMessagesWaiting", scope: !376, file: !374, line: 111, baseType: !148, size: 32, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "uxLength", scope: !376, file: !374, line: 112, baseType: !149, size: 32, offset: 480)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "uxItemSize", scope: !376, file: !374, line: 113, baseType: !149, size: 32, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cRxLock", scope: !376, file: !374, line: 115, baseType: !425, size: 8, offset: 544)
!425 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !369)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cTxLock", scope: !376, file: !374, line: 116, baseType: !425, size: 8, offset: 552)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "uxQueueNumber", scope: !376, file: !374, line: 127, baseType: !149, size: 32, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ucQueueType", scope: !376, file: !374, line: 128, baseType: !85, size: 8, offset: 608)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueueHandle_t", file: !309, line: 48, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!431 = !{!364}
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 512, elements: !439)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueueRegistryItem_t", file: !374, line: 157, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "xQueueRegistryItem", file: !374, line: 152, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QUEUE_REGISTRY_ITEM", file: !374, line: 148, size: 64, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pcQueueName", scope: !435, file: !374, line: 150, baseType: !183, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "xHandle", scope: !435, file: !374, line: 151, baseType: !429, size: 32, offset: 32)
!439 = !{!440}
!440 = !DISubrange(count: 8)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "uwTickFreq", scope: !443, file: !628, line: 96, type: !631, isLocal: false, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !445, retainedTypes: !558, globals: !625, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/components/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "a0b1e5cec8052b8fc102170a42173ec7")
!445 = !{!446, !5, !453, !553}
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 50, baseType: !7, size: 32, elements: !448)
!447 = !DIFile(filename: "components/STM32F4xx_HAL_Driver/Inc/stm32f4xx_hal.h", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "722ee5c6882a57d23314df368dea592d")
!448 = !{!449, !450, !451, !452}
!449 = !DIEnumerator(name: "HAL_TICK_FREQ_10HZ", value: 100)
!450 = !DIEnumerator(name: "HAL_TICK_FREQ_100HZ", value: 10)
!451 = !DIEnumerator(name: "HAL_TICK_FREQ_1KHZ", value: 1)
!452 = !DIEnumerator(name: "HAL_TICK_FREQ_DEFAULT", value: 1)
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 82, baseType: !186, size: 32, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552}
!455 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!456 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!457 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!458 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!459 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!460 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!461 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!462 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!463 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!464 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!465 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!466 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!467 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!468 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!469 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!470 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!471 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!472 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!473 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!474 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!475 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!476 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!477 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!478 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!479 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!480 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!481 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!482 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!483 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!484 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!485 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!486 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!487 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!488 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!489 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!490 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!491 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!492 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!493 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!494 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!495 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!496 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!497 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!498 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!499 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!500 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!501 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!502 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!503 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!504 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!505 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!506 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!507 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!508 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!509 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!510 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!511 = !DIEnumerator(name: "FMC_IRQn", value: 48)
!512 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!513 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!514 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!515 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!516 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!517 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!518 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!519 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!520 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!521 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!522 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!523 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!524 = !DIEnumerator(name: "ETH_IRQn", value: 61)
!525 = !DIEnumerator(name: "ETH_WKUP_IRQn", value: 62)
!526 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!527 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!528 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!529 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!530 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!531 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!532 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!533 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!534 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!535 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!536 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!537 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!538 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!539 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!540 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!541 = !DIEnumerator(name: "DCMI_IRQn", value: 78)
!542 = !DIEnumerator(name: "HASH_RNG_IRQn", value: 80)
!543 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!544 = !DIEnumerator(name: "UART7_IRQn", value: 82)
!545 = !DIEnumerator(name: "UART8_IRQn", value: 83)
!546 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!547 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!548 = !DIEnumerator(name: "SPI6_IRQn", value: 86)
!549 = !DIEnumerator(name: "SAI1_IRQn", value: 87)
!550 = !DIEnumerator(name: "LTDC_IRQn", value: 88)
!551 = !DIEnumerator(name: "LTDC_ER_IRQn", value: 89)
!552 = !DIEnumerator(name: "DMA2D_IRQn", value: 90)
!553 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !554, line: 207, baseType: !7, size: 32, elements: !555)
!554 = !DIFile(filename: "include/STM32F4xx/Include/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "51afb6c510901ccc4bc88b495bfa7464")
!555 = !{!556, !557}
!556 = !DIEnumerator(name: "DISABLE", value: 0)
!557 = !DIEnumerator(name: "ENABLE", value: 1)
!558 = !{!559, !21, !570, !606, !616, !178, !624}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !16, line: 520, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 511, size: 224, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !561, file: !16, line: 513, baseType: !20, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !561, file: !16, line: 514, baseType: !20, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !561, file: !16, line: 515, baseType: !20, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !561, file: !16, line: 516, baseType: !20, size: 32, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !561, file: !16, line: 517, baseType: !20, size: 32, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !561, file: !16, line: 518, baseType: !20, size: 32, offset: 160)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !561, file: !16, line: 519, baseType: !20, size: 32, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !16, line: 742, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 708, size: 1152, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !572, file: !16, line: 710, baseType: !20, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !572, file: !16, line: 711, baseType: !20, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !572, file: !16, line: 712, baseType: !20, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !572, file: !16, line: 713, baseType: !20, size: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !572, file: !16, line: 714, baseType: !20, size: 32, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !572, file: !16, line: 715, baseType: !20, size: 32, offset: 160)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !572, file: !16, line: 716, baseType: !20, size: 32, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !572, file: !16, line: 717, baseType: !21, size: 32, offset: 224)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !572, file: !16, line: 718, baseType: !20, size: 32, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !572, file: !16, line: 719, baseType: !20, size: 32, offset: 288)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !572, file: !16, line: 720, baseType: !56, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !572, file: !16, line: 721, baseType: !20, size: 32, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !572, file: !16, line: 722, baseType: !20, size: 32, offset: 416)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !572, file: !16, line: 723, baseType: !20, size: 32, offset: 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !572, file: !16, line: 724, baseType: !21, size: 32, offset: 480)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !572, file: !16, line: 725, baseType: !20, size: 32, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !572, file: !16, line: 726, baseType: !20, size: 32, offset: 544)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !572, file: !16, line: 727, baseType: !56, size: 64, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !572, file: !16, line: 728, baseType: !20, size: 32, offset: 640)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !572, file: !16, line: 729, baseType: !20, size: 32, offset: 672)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !572, file: !16, line: 730, baseType: !20, size: 32, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !572, file: !16, line: 731, baseType: !21, size: 32, offset: 736)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !572, file: !16, line: 732, baseType: !20, size: 32, offset: 768)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !572, file: !16, line: 733, baseType: !20, size: 32, offset: 800)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !572, file: !16, line: 734, baseType: !56, size: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !572, file: !16, line: 735, baseType: !20, size: 32, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !572, file: !16, line: 736, baseType: !20, size: 32, offset: 928)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !572, file: !16, line: 737, baseType: !56, size: 64, offset: 960)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !572, file: !16, line: 738, baseType: !20, size: 32, offset: 1024)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !572, file: !16, line: 739, baseType: !20, size: 32, offset: 1056)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSAICFGR", scope: !572, file: !16, line: 740, baseType: !20, size: 32, offset: 1088)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !572, file: !16, line: 741, baseType: !20, size: 32, offset: 1120)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !608, line: 765, baseType: !609)
!608 = !DIFile(filename: "components/CMSIS/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project")
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !608, line: 759, size: 128, elements: !610)
!610 = !{!611, !612, !613, !614}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !609, file: !608, line: 761, baseType: !20, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !609, file: !608, line: 762, baseType: !20, size: 32, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !609, file: !608, line: 763, baseType: !20, size: 32, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !609, file: !608, line: 764, baseType: !615, size: 32, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBGMCU_TypeDef", file: !16, line: 344, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 338, size: 128, elements: !619)
!619 = !{!620, !621, !622, !623}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "IDCODE", scope: !618, file: !16, line: 340, baseType: !20, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !618, file: !16, line: 341, baseType: !20, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "APB1FZ", scope: !618, file: !16, line: 342, baseType: !20, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "APB2FZ", scope: !618, file: !16, line: 343, baseType: !20, size: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!625 = !{!626, !441, !629}
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "uwTickPrio", scope: !443, file: !628, line: 95, type: !21, isLocal: false, isDefinition: true)
!628 = !DIFile(filename: "components/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "a0b1e5cec8052b8fc102170a42173ec7")
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "uwTick", scope: !443, file: !628, line: 94, type: !20, isLocal: false, isDefinition: true)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_TickFreqTypeDef", file: !447, line: 56, baseType: !446)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "AHBPrescTable", scope: !634, file: !710, line: 137, type: !715, isLocal: false, isDefinition: true)
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !636, globals: !707, splitDebugInlining: false, nameTableKind: None)
!635 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/include/STM32F4xx/Source/Templates/system_stm32f4xx.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "a84c873534ac98c6282618dead273457")
!636 = !{!637, !671, !21}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !608, line: 463, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !608, line: 440, size: 1120, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !651, !652, !653, !654, !655, !656, !657, !658, !660, !661, !662, !666, !668, !670}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !639, file: !608, line: 442, baseType: !615, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !639, file: !608, line: 443, baseType: !20, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !639, file: !608, line: 444, baseType: !20, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !639, file: !608, line: 445, baseType: !20, size: 32, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !639, file: !608, line: 446, baseType: !20, size: 32, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !639, file: !608, line: 447, baseType: !20, size: 32, offset: 160)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !639, file: !608, line: 448, baseType: !648, size: 96, offset: 192)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 96, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 12)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !639, file: !608, line: 449, baseType: !20, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !639, file: !608, line: 450, baseType: !20, size: 32, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !639, file: !608, line: 451, baseType: !20, size: 32, offset: 352)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !639, file: !608, line: 452, baseType: !20, size: 32, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !639, file: !608, line: 453, baseType: !20, size: 32, offset: 416)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !639, file: !608, line: 454, baseType: !20, size: 32, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !639, file: !608, line: 455, baseType: !20, size: 32, offset: 480)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !639, file: !608, line: 456, baseType: !659, size: 64, offset: 512)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 64, elements: !34)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !639, file: !608, line: 457, baseType: !615, size: 32, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !639, file: !608, line: 458, baseType: !615, size: 32, offset: 608)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !639, file: !608, line: 459, baseType: !663, size: 128, offset: 640)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 128, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 4)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !639, file: !608, line: 460, baseType: !667, size: 160, offset: 768)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 160, elements: !191)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !639, file: !608, line: 461, baseType: !669, size: 160, offset: 928)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, elements: !191)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !639, file: !608, line: 462, baseType: !20, size: 32, offset: 1088)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !16, line: 742, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 708, size: 1152, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !673, file: !16, line: 710, baseType: !20, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !673, file: !16, line: 711, baseType: !20, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !673, file: !16, line: 712, baseType: !20, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !673, file: !16, line: 713, baseType: !20, size: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !673, file: !16, line: 714, baseType: !20, size: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !673, file: !16, line: 715, baseType: !20, size: 32, offset: 160)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !673, file: !16, line: 716, baseType: !20, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !673, file: !16, line: 717, baseType: !21, size: 32, offset: 224)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !673, file: !16, line: 718, baseType: !20, size: 32, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !673, file: !16, line: 719, baseType: !20, size: 32, offset: 288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !673, file: !16, line: 720, baseType: !56, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !673, file: !16, line: 721, baseType: !20, size: 32, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !673, file: !16, line: 722, baseType: !20, size: 32, offset: 416)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !673, file: !16, line: 723, baseType: !20, size: 32, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !673, file: !16, line: 724, baseType: !21, size: 32, offset: 480)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !673, file: !16, line: 725, baseType: !20, size: 32, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !673, file: !16, line: 726, baseType: !20, size: 32, offset: 544)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !673, file: !16, line: 727, baseType: !56, size: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !673, file: !16, line: 728, baseType: !20, size: 32, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !673, file: !16, line: 729, baseType: !20, size: 32, offset: 672)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !673, file: !16, line: 730, baseType: !20, size: 32, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !673, file: !16, line: 731, baseType: !21, size: 32, offset: 736)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !673, file: !16, line: 732, baseType: !20, size: 32, offset: 768)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !673, file: !16, line: 733, baseType: !20, size: 32, offset: 800)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !673, file: !16, line: 734, baseType: !56, size: 64, offset: 832)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !673, file: !16, line: 735, baseType: !20, size: 32, offset: 896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !673, file: !16, line: 736, baseType: !20, size: 32, offset: 928)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !673, file: !16, line: 737, baseType: !56, size: 64, offset: 960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !673, file: !16, line: 738, baseType: !20, size: 32, offset: 1024)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !673, file: !16, line: 739, baseType: !20, size: 32, offset: 1056)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSAICFGR", scope: !673, file: !16, line: 740, baseType: !20, size: 32, offset: 1088)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !673, file: !16, line: 741, baseType: !20, size: 32, offset: 1120)
!707 = !{!708, !632, !711}
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !634, file: !710, line: 136, type: !21, isLocal: false, isDefinition: true)
!710 = !DIFile(filename: "include/STM32F4xx/Source/Templates/system_stm32f4xx.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project", checksumkind: CSK_MD5, checksum: "a84c873534ac98c6282618dead273457")
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "APBPrescTable", scope: !634, file: !710, line: 138, type: !713, isLocal: false, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 64, elements: !439)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 128, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 16)
!718 = distinct !DICompileUnit(language: DW_LANG_C99, file: !719, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/src/utilities.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "b85bee0dcdfb15e8d13f14dead690039")
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !722, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/components/FreeRTOS-Kernel/list.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "37dd2e62432352aebec83527568c6a95")
!722 = !{!723, !39, !149}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !135, line: 150, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !135, line: 140, size: 160, elements: !726)
!726 = !{!727, !728, !730, !731, !732}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !725, file: !135, line: 143, baseType: !39, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !725, file: !135, line: 144, baseType: !729, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !725, file: !135, line: 145, baseType: !729, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !725, file: !135, line: 146, baseType: !78, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !725, file: !135, line: 147, baseType: !733, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !135, line: 164, size: 160, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !734, file: !135, line: 167, baseType: !148, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !734, file: !135, line: 168, baseType: !723, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !734, file: !135, line: 169, baseType: !739, size: 96, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !135, line: 159, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !135, line: 152, size: 96, elements: !741)
!741 = !{!742, !743, !744}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !740, file: !135, line: 155, baseType: !39, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !740, file: !135, line: 156, baseType: !729, size: 32, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !740, file: !135, line: 157, baseType: !729, size: 32, offset: 64)
!745 = distinct !DICompileUnit(language: DW_LANG_C99, file: !746, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !747, retainedTypes: !752, splitDebugInlining: false, nameTableKind: None)
!746 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/components/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_cortex.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "05ece9f7e15369346852cc9b0bea67a2")
!747 = !{!453, !748}
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !554, line: 201, baseType: !7, size: 32, elements: !749)
!749 = !{!750, !751}
!750 = !DIEnumerator(name: "RESET", value: 0)
!751 = !DIEnumerator(name: "SET", value: 1)
!752 = !{!753, !778, !21, !793, !801, !85, !803}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !608, line: 463, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !608, line: 440, size: 1120, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !755, file: !608, line: 442, baseType: !615, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !755, file: !608, line: 443, baseType: !20, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !755, file: !608, line: 444, baseType: !20, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !755, file: !608, line: 445, baseType: !20, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !755, file: !608, line: 446, baseType: !20, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !755, file: !608, line: 447, baseType: !20, size: 32, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !755, file: !608, line: 448, baseType: !648, size: 96, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !755, file: !608, line: 449, baseType: !20, size: 32, offset: 288)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !755, file: !608, line: 450, baseType: !20, size: 32, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !755, file: !608, line: 451, baseType: !20, size: 32, offset: 352)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !755, file: !608, line: 452, baseType: !20, size: 32, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !755, file: !608, line: 453, baseType: !20, size: 32, offset: 416)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !755, file: !608, line: 454, baseType: !20, size: 32, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !755, file: !608, line: 455, baseType: !20, size: 32, offset: 480)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !755, file: !608, line: 456, baseType: !659, size: 64, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !755, file: !608, line: 457, baseType: !615, size: 32, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !755, file: !608, line: 458, baseType: !615, size: 32, offset: 608)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !755, file: !608, line: 459, baseType: !663, size: 128, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !755, file: !608, line: 460, baseType: !667, size: 160, offset: 768)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !755, file: !608, line: 461, baseType: !669, size: 160, offset: 928)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !755, file: !608, line: 462, baseType: !20, size: 32, offset: 1088)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !608, line: 1221, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !608, line: 1208, size: 352, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !780, file: !608, line: 1210, baseType: !615, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !780, file: !608, line: 1211, baseType: !20, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !780, file: !608, line: 1212, baseType: !20, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !780, file: !608, line: 1213, baseType: !20, size: 32, offset: 96)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !780, file: !608, line: 1214, baseType: !20, size: 32, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !780, file: !608, line: 1215, baseType: !20, size: 32, offset: 160)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !780, file: !608, line: 1216, baseType: !20, size: 32, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !780, file: !608, line: 1217, baseType: !20, size: 32, offset: 224)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !780, file: !608, line: 1218, baseType: !20, size: 32, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !780, file: !608, line: 1219, baseType: !20, size: 32, offset: 288)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !780, file: !608, line: 1220, baseType: !20, size: 32, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !608, line: 765, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !608, line: 759, size: 128, elements: !796)
!796 = !{!797, !798, !799, !800}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !795, file: !608, line: 761, baseType: !20, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !795, file: !608, line: 762, baseType: !20, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !795, file: !608, line: 763, baseType: !20, size: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !795, file: !608, line: 764, baseType: !615, size: 32, offset: 96)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !22, line: 44, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !24, line: 77, baseType: !186)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !608, line: 421, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !608, line: 406, size: 28704, elements: !806)
!806 = !{!807, !809, !813, !814, !815, !816, !817, !818, !819, !820, !824, !828, !832}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !805, file: !608, line: 408, baseType: !808, size: 256)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 256, elements: !439)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !805, file: !608, line: 409, baseType: !810, size: 768, offset: 256)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 768, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 24)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !805, file: !608, line: 410, baseType: !808, size: 256, offset: 1024)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !805, file: !608, line: 411, baseType: !810, size: 768, offset: 1280)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !805, file: !608, line: 412, baseType: !808, size: 256, offset: 2048)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !805, file: !608, line: 413, baseType: !810, size: 768, offset: 2304)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !805, file: !608, line: 414, baseType: !808, size: 256, offset: 3072)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !805, file: !608, line: 415, baseType: !810, size: 768, offset: 3328)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !805, file: !608, line: 416, baseType: !808, size: 256, offset: 4096)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !805, file: !608, line: 417, baseType: !821, size: 1792, offset: 4352)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1792, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 56)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !805, file: !608, line: 418, baseType: !825, size: 1920, offset: 6144)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 1920, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 240)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !805, file: !608, line: 419, baseType: !829, size: 20608, offset: 8064)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 20608, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 644)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !805, file: !608, line: 420, baseType: !20, size: 32, offset: 28672)
!833 = distinct !DICompileUnit(language: DW_LANG_C99, file: !834, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !835, retainedTypes: !840, splitDebugInlining: false, nameTableKind: None)
!834 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/components/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_gpio.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "4ea3e82eda82f1384803ff9f4a532511")
!835 = !{!836, !5, !748}
!836 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !91, line: 68, baseType: !7, size: 32, elements: !837)
!837 = !{!838, !839}
!838 = !DIEnumerator(name: "GPIO_PIN_RESET", value: 0)
!839 = !DIEnumerator(name: "GPIO_PIN_SET", value: 1)
!840 = !{!21, !841, !877, !85, !887, !900}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !16, line: 742, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 708, size: 1152, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !843, file: !16, line: 710, baseType: !20, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !843, file: !16, line: 711, baseType: !20, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !843, file: !16, line: 712, baseType: !20, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !843, file: !16, line: 713, baseType: !20, size: 32, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !843, file: !16, line: 714, baseType: !20, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !843, file: !16, line: 715, baseType: !20, size: 32, offset: 160)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !843, file: !16, line: 716, baseType: !20, size: 32, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !843, file: !16, line: 717, baseType: !21, size: 32, offset: 224)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !843, file: !16, line: 718, baseType: !20, size: 32, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !843, file: !16, line: 719, baseType: !20, size: 32, offset: 288)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !843, file: !16, line: 720, baseType: !56, size: 64, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !843, file: !16, line: 721, baseType: !20, size: 32, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !843, file: !16, line: 722, baseType: !20, size: 32, offset: 416)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !843, file: !16, line: 723, baseType: !20, size: 32, offset: 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !843, file: !16, line: 724, baseType: !21, size: 32, offset: 480)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !843, file: !16, line: 725, baseType: !20, size: 32, offset: 512)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !843, file: !16, line: 726, baseType: !20, size: 32, offset: 544)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !843, file: !16, line: 727, baseType: !56, size: 64, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !843, file: !16, line: 728, baseType: !20, size: 32, offset: 640)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !843, file: !16, line: 729, baseType: !20, size: 32, offset: 672)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !843, file: !16, line: 730, baseType: !20, size: 32, offset: 704)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !843, file: !16, line: 731, baseType: !21, size: 32, offset: 736)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !843, file: !16, line: 732, baseType: !20, size: 32, offset: 768)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !843, file: !16, line: 733, baseType: !20, size: 32, offset: 800)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !843, file: !16, line: 734, baseType: !56, size: 64, offset: 832)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !843, file: !16, line: 735, baseType: !20, size: 32, offset: 896)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !843, file: !16, line: 736, baseType: !20, size: 32, offset: 928)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !843, file: !16, line: 737, baseType: !56, size: 64, offset: 960)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !843, file: !16, line: 738, baseType: !20, size: 32, offset: 1024)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !843, file: !16, line: 739, baseType: !20, size: 32, offset: 1056)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSAICFGR", scope: !843, file: !16, line: 740, baseType: !20, size: 32, offset: 1088)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !843, file: !16, line: 741, baseType: !20, size: 32, offset: 1120)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !16, line: 615, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 608, size: 288, elements: !880)
!880 = !{!881, !882, !883, !885, !886}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !879, file: !16, line: 610, baseType: !20, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !879, file: !16, line: 611, baseType: !20, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !879, file: !16, line: 612, baseType: !884, size: 128, offset: 64)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !664)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !879, file: !16, line: 613, baseType: !56, size: 64, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !879, file: !16, line: 614, baseType: !20, size: 32, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !16, line: 602, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 591, size: 320, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !899}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !889, file: !16, line: 593, baseType: !20, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !889, file: !16, line: 594, baseType: !20, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !889, file: !16, line: 595, baseType: !20, size: 32, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !889, file: !16, line: 596, baseType: !20, size: 32, offset: 96)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !889, file: !16, line: 597, baseType: !20, size: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !889, file: !16, line: 598, baseType: !20, size: 32, offset: 160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !889, file: !16, line: 599, baseType: !20, size: 32, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !889, file: !16, line: 600, baseType: !20, size: 32, offset: 224)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !889, file: !16, line: 601, baseType: !33, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !16, line: 505, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 497, size: 192, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !902, file: !16, line: 499, baseType: !20, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !902, file: !16, line: 500, baseType: !20, size: 32, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !902, file: !16, line: 501, baseType: !20, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !902, file: !16, line: 502, baseType: !20, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !902, file: !16, line: 503, baseType: !20, size: 32, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !902, file: !16, line: 504, baseType: !20, size: 32, offset: 160)
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !912, retainedTypes: !913, splitDebugInlining: false, nameTableKind: None)
!911 = !DIFile(filename: "/home/mjshen/RTOSExploration/STM32_Base_Project/components/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_rcc.c", directory: "/home/mjshen/RTOSExploration/STM32_Base_Project/build", checksumkind: CSK_MD5, checksum: "ef16e68bea181c9d4db7aec75a83c72a")
!912 = !{!5, !748, !553}
!913 = !{!78, !914, !85, !21, !178, !950, !956, !317, !36, !967, !980}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !16, line: 742, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 708, size: 1152, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !916, file: !16, line: 710, baseType: !20, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !916, file: !16, line: 711, baseType: !20, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !916, file: !16, line: 712, baseType: !20, size: 32, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !916, file: !16, line: 713, baseType: !20, size: 32, offset: 96)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !916, file: !16, line: 714, baseType: !20, size: 32, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !916, file: !16, line: 715, baseType: !20, size: 32, offset: 160)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !916, file: !16, line: 716, baseType: !20, size: 32, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !916, file: !16, line: 717, baseType: !21, size: 32, offset: 224)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !916, file: !16, line: 718, baseType: !20, size: 32, offset: 256)
