; ModuleID = './build/sleep_manager_power_mode.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.flash_info_t = type { i8*, i8, i32, i32, i32, i8, i8, i8 }
%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct._IOT_CM4_RGU_MEM_CTRL_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_cache_region_config_t = type { i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }

!79 = distinct !DIGlobalVariable(name: "sf_Mutex", scope: !2, file: !3, line: 78, type: !7, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !83, file: !84, line: 71, type: !158, isLocal: false, isDefinition: true)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !84, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !85, retainedTypes: !136, globals: !141, splitDebugInlining: false, nameTableKind: None)
!84 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!85 = !{!86, !91}
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 121, baseType: !30, size: 32, elements: !88)
!87 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!90 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !92, line: 47, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!94 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!95 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!96 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!97 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!98 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!99 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!100 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!101 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!102 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!103 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!104 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!105 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!106 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!107 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!108 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!109 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!110 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!111 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!112 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!113 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!114 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!115 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!116 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!117 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!118 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!119 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!120 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!121 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!122 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!123 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!124 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!125 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!126 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!127 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!128 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!129 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!130 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!131 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!132 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!133 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!134 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!135 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!136 = !{!137, !140}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !87, line: 116, baseType: !30)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !92, line: 95, baseType: !91)
!141 = !{!81, !142}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !83, file: !84, line: 67, type: !144, isLocal: true, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !145, line: 111, baseType: !146)
!145 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 109, size: 96, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !146, file: !145, line: 110, baseType: !149, size: 96)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !145, line: 106, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 102, size: 96, elements: !151)
!151 = !{!152, !156, !157}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !150, file: !145, line: 103, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{null}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !150, file: !145, line: 104, baseType: !153, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !150, file: !145, line: 105, baseType: !153, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !87, line: 62, baseType: !30)
!160 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!161 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "ptr_lp_connsys_get_own_enable_int", scope: !164, file: !165, line: 86, type: !214, isLocal: false, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !166, retainedTypes: !175, globals: !211, splitDebugInlining: false, nameTableKind: None)
!165 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_lp.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!166 = !{!167, !91}
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 75, baseType: !30, size: 32, elements: !169)
!168 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_lp.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!169 = !{!170, !171, !172, !173, !174}
!170 = !DIEnumerator(name: "LHAL_LP_CM4_HCLK_XTAL", value: 0)
!171 = !DIEnumerator(name: "LHAL_LP_CM4_HCLK_F32K", value: 1)
!172 = !DIEnumerator(name: "LHAL_LP_CM4_HCLK_PLL1_64M", value: 2)
!173 = !DIEnumerator(name: "LHAL_LP_CM4_HCLK_PLL_CK", value: 3)
!174 = !DIEnumerator(name: "LHAL_LP_CM4_HCLK_NUM", value: 4)
!175 = !{!51, !176, !159, !208, !210}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "P_IOT_CM4_RGU_MEM_CTRL_TypeDef", file: !177, line: 951, baseType: !178)
!177 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687_cm4_hw_memmap.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IOT_CM4_RGU_MEM_CTRL_TypeDef", file: !177, line: 923, size: 864, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_FPGA_RGU_DUMMY_CR", scope: !179, file: !177, line: 924, baseType: !158, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_POS_S_EN", scope: !179, file: !177, line: 925, baseType: !158, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_PWR_ACK_ST", scope: !179, file: !177, line: 926, baseType: !158, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM_DLY_CTL", scope: !179, file: !177, line: 927, baseType: !158, size: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_RESV0", scope: !179, file: !177, line: 928, baseType: !158, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM0_PDN_EN", scope: !179, file: !177, line: 929, baseType: !158, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM1_PDN_EN", scope: !179, file: !177, line: 930, baseType: !158, size: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM0_SLP_EN", scope: !179, file: !177, line: 931, baseType: !158, size: 32, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM1_SLP_EN", scope: !179, file: !177, line: 932, baseType: !158, size: 32, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM0_PDN", scope: !179, file: !177, line: 933, baseType: !158, size: 32, offset: 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM1_PDN", scope: !179, file: !177, line: 934, baseType: !158, size: 32, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM0_SLP", scope: !179, file: !177, line: 935, baseType: !158, size: 32, offset: 352)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM1_SLP", scope: !179, file: !177, line: 936, baseType: !158, size: 32, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM0_ISO", scope: !179, file: !177, line: 937, baseType: !158, size: 32, offset: 416)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM1_ISO", scope: !179, file: !177, line: 938, baseType: !158, size: 32, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_RESV1", scope: !179, file: !177, line: 939, baseType: !158, size: 32, offset: 480)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_RESV2", scope: !179, file: !177, line: 940, baseType: !158, size: 32, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_ROM_PD_EN", scope: !179, file: !177, line: 941, baseType: !158, size: 32, offset: 544)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_ROM_PD", scope: !179, file: !177, line: 942, baseType: !158, size: 32, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_ROM_RSTB", scope: !179, file: !177, line: 943, baseType: !158, size: 32, offset: 608)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_RESV3", scope: !179, file: !177, line: 944, baseType: !158, size: 32, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM0_PDN_STAT", scope: !179, file: !177, line: 945, baseType: !158, size: 32, offset: 672)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM1_PDN_STAT", scope: !179, file: !177, line: 946, baseType: !158, size: 32, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM0_SLP_STAT", scope: !179, file: !177, line: 947, baseType: !158, size: 32, offset: 736)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM1_SLP_STAT", scope: !179, file: !177, line: 948, baseType: !158, size: 32, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM0_ISO_STAT", scope: !179, file: !177, line: 949, baseType: !158, size: 32, offset: 800)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "CM4_MEM1_ISO_STAT", scope: !179, file: !177, line: 950, baseType: !158, size: 32, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !92, line: 97, baseType: !140)
!211 = !{!162, !212, !220, !225}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "ptr_lp_connsys_give_n9_own", scope: !164, file: !165, line: 87, type: !214, isLocal: false, isDefinition: true)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !55, line: 20, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !57, line: 41, baseType: !219)
!219 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "ptr_connsys_get_ownership", scope: !164, file: !165, line: 88, type: !222, isLocal: false, isDefinition: true)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DISubroutineType(types: !224)
!224 = !{!54}
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "hal_lp_wic_wakeup", scope: !164, file: !165, line: 71, type: !54, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "g_sfc_security_enable", scope: !230, file: !231, line: 58, type: !30, isLocal: false, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !239, globals: !244, splitDebugInlining: false, nameTableKind: None)
!231 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/sfc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!232 = !{!233}
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 45, baseType: !30, size: 32, elements: !234)
!234 = !{!235, !236, !237, !238}
!235 = !DIEnumerator(name: "SF_UNDEF", value: 0)
!236 = !DIEnumerator(name: "SPI", value: 1)
!237 = !DIEnumerator(name: "SPIQ", value: 2)
!238 = !DIEnumerator(name: "QPI", value: 3)
!239 = !{!137, !240, !30, !208, !241, !242}
!240 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!244 = !{!228}
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "gSFC_max_data_size", scope: !247, file: !248, line: 67, type: !30, isLocal: false, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !256, globals: !275, splitDebugInlining: false, nameTableKind: None)
!248 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/spi_flash.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!249 = !{!35, !5, !233, !250}
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 66, baseType: !7, size: 32, elements: !251)
!251 = !{!252, !253, !254, !255}
!252 = !DIEnumerator(name: "FLASH_NOT_READY", value: -1)
!253 = !DIEnumerator(name: "FLASH_READY", value: 0)
!254 = !DIEnumerator(name: "FLASH_PROGRAMMING", value: 1)
!255 = !DIEnumerator(name: "FLASH_ERASING", value: 2)
!256 = !{!257, !259, !260, !30, !51, !274, !61, !139}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!259 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chip_info", file: !6, line: 137, size: 192, elements: !263)
!263 = !{!264, !267, !268, !269, !270, !271, !272, !273}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !6, line: 138, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !262, file: !6, line: 139, baseType: !58, size: 8, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !262, file: !6, line: 140, baseType: !259, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !262, file: !6, line: 141, baseType: !259, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !262, file: !6, line: 142, baseType: !30, size: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !262, file: !6, line: 144, baseType: !58, size: 8, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !262, file: !6, line: 145, baseType: !58, size: 8, offset: 168)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !262, file: !6, line: 146, baseType: !58, size: 8, offset: 176)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!275 = !{!245, !276, !281, !286, !291, !294, !296, !301, !303, !305, !307, !309, !311, !313, !315, !317, !319, !321, !323, !328, !330, !332, !334, !337}
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_winbond", scope: !247, file: !248, line: 70, type: !278, isLocal: false, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 96, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 12)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_winbond", scope: !247, file: !248, line: 73, type: !283, isLocal: false, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 32, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 4)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_winbond", scope: !247, file: !248, line: 76, type: !288, isLocal: false, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 72, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 9)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "cmdlist_suspend_winbond", scope: !247, file: !248, line: 79, type: !293, isLocal: false, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !284)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "cmdlist_resume_winbond", scope: !247, file: !248, line: 82, type: !293, isLocal: false, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_mxic", scope: !247, file: !248, line: 87, type: !298, isLocal: false, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 64, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 8)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_mxic", scope: !247, file: !248, line: 91, type: !298, isLocal: false, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_mxic", scope: !247, file: !248, line: 95, type: !298, isLocal: false, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd", scope: !247, file: !248, line: 100, type: !288, isLocal: false, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd", scope: !247, file: !248, line: 104, type: !288, isLocal: false, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd", scope: !247, file: !248, line: 108, type: !288, isLocal: false, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd25q32c", scope: !247, file: !248, line: 112, type: !298, isLocal: false, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd25q32c", scope: !247, file: !248, line: 115, type: !298, isLocal: false, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd25q32c", scope: !247, file: !248, line: 119, type: !298, isLocal: false, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_micron", scope: !247, file: !248, line: 123, type: !298, isLocal: false, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_micron", scope: !247, file: !248, line: 126, type: !298, isLocal: false, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_micron", scope: !247, file: !248, line: 130, type: !298, isLocal: false, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_spimode", scope: !247, file: !248, line: 135, type: !325, isLocal: false, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 56, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 7)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_qpimode", scope: !247, file: !248, line: 138, type: !325, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "spi_chip_info", scope: !247, file: !248, line: 142, type: !260, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "gd_write_sr2_1", scope: !247, file: !248, line: 161, type: !7, isLocal: false, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "support_flash_id", scope: !247, file: !248, line: 162, type: !336, isLocal: false, isDefinition: true)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_TYPT", file: !6, line: 81, baseType: !35)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "chips_data", scope: !247, file: !248, line: 144, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 2496, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 13)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !344, file: !345, line: 43, type: !61, isLocal: true, isDefinition: true)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !345, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !346, globals: !351, splitDebugInlining: false, nameTableKind: None)
!345 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!346 = !{!208, !159, !59, !347, !348, !350}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32", file: !87, line: 133, baseType: !30)
!351 = !{!342, !352}
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !344, file: !345, line: 44, type: !61, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !356, file: !357, line: 54, type: !61, isLocal: false, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !358, retainedTypes: !382, globals: !390, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!358 = !{!91, !359, !365}
!359 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 71, baseType: !30, size: 32, elements: !361)
!360 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!361 = !{!362, !363, !364}
!362 = !DIEnumerator(name: "UART_PORT0", value: 0)
!363 = !DIEnumerator(name: "UART_PORT1", value: 1)
!364 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !366, line: 129, baseType: !30, size: 32, elements: !367)
!366 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!368 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!369 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!370 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!371 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!372 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!373 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!374 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!375 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!376 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!377 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!378 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!379 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!380 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!381 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!382 = !{!208, !61, !383, !385, !387, !388, !159}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !87, line: 113, baseType: !386)
!386 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !87, line: 59, baseType: !58)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !387)
!390 = !{!391, !399, !354}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler_name", scope: !356, file: !357, line: 57, type: !393, isLocal: false, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 64, elements: !397)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!397 = !{!398}
!398 = !DISubrange(count: 2)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !356, file: !357, line: 58, type: !401, isLocal: false, isDefinition: true)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 64, elements: !397)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !405, file: !406, line: 51, type: !485, isLocal: false, isDefinition: true)
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !407, retainedTypes: !454, globals: !484, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!407 = !{!408, !419, !438, !445}
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !409, line: 163, baseType: !7, size: 32, elements: !410)
!409 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418}
!411 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!412 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!413 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!414 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!415 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!416 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!417 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!418 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !409, line: 186, baseType: !30, size: 32, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!421 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!422 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!423 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!424 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!425 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!426 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!427 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!428 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!429 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!430 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!431 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!432 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!433 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!434 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!435 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!436 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!437 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!438 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !409, line: 176, baseType: !30, size: 32, elements: !439)
!439 = !{!440, !441, !442, !443, !444}
!440 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!441 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!442 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!443 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!444 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!445 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !446, line: 99, baseType: !30, size: 32, elements: !447)
!446 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!447 = !{!448, !449, !450, !451, !452, !453}
!448 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!449 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!450 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!451 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!452 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!453 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!454 = !{!455, !51}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !457, line: 72, baseType: !458)
!457 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 56, size: 525312, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !474, !475, !479, !483}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !458, file: !457, line: 57, baseType: !60, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !458, file: !457, line: 58, baseType: !60, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !458, file: !457, line: 59, baseType: !60, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !458, file: !457, line: 60, baseType: !60, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !458, file: !457, line: 61, baseType: !60, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !458, file: !457, line: 62, baseType: !60, size: 32, offset: 160)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !458, file: !457, line: 63, baseType: !60, size: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !458, file: !457, line: 64, baseType: !60, size: 32, offset: 224)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !458, file: !457, line: 65, baseType: !60, size: 32, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !458, file: !457, line: 66, baseType: !60, size: 32, offset: 288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !458, file: !457, line: 67, baseType: !471, size: 32, offset: 320)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 1)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !458, file: !457, line: 68, baseType: !60, size: 32, offset: 352)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !458, file: !457, line: 69, baseType: !476, size: 523904, offset: 384)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 16372)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !458, file: !457, line: 70, baseType: !480, size: 512, offset: 524288)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 16)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !458, file: !457, line: 71, baseType: !480, size: 512, offset: 524800)
!484 = !{!403}
!485 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !69)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "g_cache_con", scope: !488, file: !489, line: 48, type: !523, isLocal: false, isDefinition: true)
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !490, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!490 = !{!486, !491, !494}
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "g_cache_region_en", scope: !488, file: !489, line: 49, type: !493, isLocal: false, isDefinition: true)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGION_EN_Type", file: !446, line: 66, baseType: !61)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "g_cache_entry", scope: !488, file: !489, line: 50, type: !496, isLocal: false, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 1024, elements: !481)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_Type", file: !446, line: 90, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 87, size: 64, elements: !499)
!499 = !{!500, !513}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "cache_entry_n", scope: !498, file: !446, line: 88, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_N_Type", file: !446, line: 77, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !446, line: 68, size: 32, elements: !503)
!503 = !{!504, !512}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !502, file: !446, line: 75, baseType: !505, size: 32)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !502, file: !446, line: 69, size: 32, elements: !506)
!506 = !{!507, !508, !509, !510, !511}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !505, file: !446, line: 70, baseType: !61, size: 5, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ATTR", scope: !505, file: !446, line: 71, baseType: !61, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !505, file: !446, line: 72, baseType: !61, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !505, file: !446, line: 73, baseType: !61, size: 3, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !505, file: !446, line: 74, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !502, file: !446, line: 76, baseType: !61, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cache_end_entry_n", scope: !498, file: !446, line: 89, baseType: !514, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_END_ENTRY_N_Type", file: !446, line: 85, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !446, line: 79, size: 32, elements: !516)
!516 = !{!517, !522}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !515, file: !446, line: 83, baseType: !518, size: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !515, file: !446, line: 80, size: 32, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !518, file: !446, line: 81, baseType: !61, size: 12, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !518, file: !446, line: 82, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !515, file: !446, line: 84, baseType: !61, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_CON_Type", file: !446, line: 64, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !446, line: 51, size: 32, elements: !525)
!525 = !{!526, !538}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !524, file: !446, line: 62, baseType: !527, size: 32)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !524, file: !446, line: 52, size: 32, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "MCEN", scope: !527, file: !446, line: 53, baseType: !61, size: 1, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "MPEN", scope: !527, file: !446, line: 54, baseType: !61, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN0", scope: !527, file: !446, line: 55, baseType: !61, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN1", scope: !527, file: !446, line: 56, baseType: !61, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "MPDEFEN", scope: !527, file: !446, line: 57, baseType: !61, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !527, file: !446, line: 58, baseType: !61, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "MDRF", scope: !527, file: !446, line: 59, baseType: !61, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "CACHESIZE", scope: !527, file: !446, line: 60, baseType: !61, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !527, file: !446, line: 61, baseType: !61, size: 22, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !524, file: !446, line: 63, baseType: !61, size: 32)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !541, file: !542, line: 53, type: !620, isLocal: false, isDefinition: true)
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !543, retainedTypes: !552, globals: !619, splitDebugInlining: false, nameTableKind: None)
!542 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!543 = !{!544, !91}
!544 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !545, line: 152, baseType: !7, size: 32, elements: !546)
!545 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!546 = !{!547, !548, !549, !550, !551}
!547 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!548 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!549 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!550 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!551 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!552 = !{!210, !51, !61, !553, !555, !586}
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !55, line: 44, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !57, line: 77, baseType: !7)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !557, line: 378, baseType: !558)
!557 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 363, size: 28704, elements: !559)
!559 = !{!560, !562, !566, !567, !568, !569, !570, !571, !572, !573, !577, !581, !585}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !558, file: !557, line: 365, baseType: !561, size: 256)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 256, elements: !299)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !558, file: !557, line: 366, baseType: !563, size: 768, offset: 256)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 768, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 24)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !558, file: !557, line: 367, baseType: !561, size: 256, offset: 1024)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !558, file: !557, line: 368, baseType: !563, size: 768, offset: 1280)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !558, file: !557, line: 369, baseType: !561, size: 256, offset: 2048)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !558, file: !557, line: 370, baseType: !563, size: 768, offset: 2304)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !558, file: !557, line: 371, baseType: !561, size: 256, offset: 3072)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !558, file: !557, line: 372, baseType: !563, size: 768, offset: 3328)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !558, file: !557, line: 373, baseType: !561, size: 256, offset: 4096)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !558, file: !557, line: 374, baseType: !574, size: 1792, offset: 4352)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1792, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 56)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !558, file: !557, line: 375, baseType: !578, size: 1920, offset: 6144)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 1920, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 240)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !558, file: !557, line: 376, baseType: !582, size: 20608, offset: 8064)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 20608, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 644)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !558, file: !557, line: 377, baseType: !60, size: 32, offset: 28672)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !557, line: 418, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 395, size: 1120, elements: !589)
!589 = !{!590, !592, !593, !594, !595, !596, !597, !599, !600, !601, !602, !603, !604, !605, !606, !608, !609, !610, !612, !616, !618}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !588, file: !557, line: 397, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !588, file: !557, line: 398, baseType: !60, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !588, file: !557, line: 399, baseType: !60, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !588, file: !557, line: 400, baseType: !60, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !588, file: !557, line: 401, baseType: !60, size: 32, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !588, file: !557, line: 402, baseType: !60, size: 32, offset: 160)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !588, file: !557, line: 403, baseType: !598, size: 96, offset: 192)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 96, elements: !279)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !588, file: !557, line: 404, baseType: !60, size: 32, offset: 288)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !588, file: !557, line: 405, baseType: !60, size: 32, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !588, file: !557, line: 406, baseType: !60, size: 32, offset: 352)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !588, file: !557, line: 407, baseType: !60, size: 32, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !588, file: !557, line: 408, baseType: !60, size: 32, offset: 416)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !588, file: !557, line: 409, baseType: !60, size: 32, offset: 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !588, file: !557, line: 410, baseType: !60, size: 32, offset: 480)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !588, file: !557, line: 411, baseType: !607, size: 64, offset: 512)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 64, elements: !397)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !588, file: !557, line: 412, baseType: !591, size: 32, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !588, file: !557, line: 413, baseType: !591, size: 32, offset: 608)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !588, file: !557, line: 414, baseType: !611, size: 128, offset: 640)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 128, elements: !284)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !588, file: !557, line: 415, baseType: !613, size: 160, offset: 768)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 160, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 5)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !588, file: !557, line: 416, baseType: !617, size: 160, offset: 928)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, elements: !614)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !588, file: !557, line: 417, baseType: !60, size: 32, offset: 1088)
!619 = !{!539}
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 6144, elements: !629)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !542, line: 50, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 47, size: 64, elements: !623)
!623 = !{!624, !628}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !622, file: !542, line: 48, baseType: !625, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !210}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !622, file: !542, line: 49, baseType: !61, size: 32, offset: 32)
!629 = !{!630}
!630 = !DISubrange(count: 96)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !633, file: !634, line: 61, type: !653, isLocal: true, isDefinition: true)
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !634, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !651, globals: !652, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!635 = !{!20, !636, !643, !28, !647}
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 657, baseType: !30, size: 32, elements: !637)
!637 = !{!638, !639, !640, !641, !642}
!638 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!639 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!640 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!641 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!642 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 397, baseType: !30, size: 32, elements: !644)
!644 = !{!645, !646}
!645 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!646 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 380, baseType: !30, size: 32, elements: !648)
!648 = !{!649, !650}
!649 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!650 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!651 = !{!51, !61}
!652 = !{!631}
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 640, elements: !614)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !634, line: 55, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 51, size: 128, elements: !656)
!656 = !{!657, !659, !669}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !655, file: !634, line: 52, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !21, line: 400, baseType: !643)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !655, file: !634, line: 53, baseType: !660, size: 64, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !634, line: 49, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 46, size: 64, elements: !662)
!662 = !{!663, !668}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !661, file: !634, line: 47, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !21, line: 371, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !51}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !661, file: !634, line: 48, baseType: !51, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !655, file: !634, line: 54, baseType: !69, size: 8, offset: 96)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "g_uart_frist_send_complete_interrupt", scope: !672, file: !673, line: 80, type: !774, isLocal: true, isDefinition: true)
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !674, retainedTypes: !724, globals: !725, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!674 = !{!359, !675, !683, !688, !704, !710, !714, !365, !719}
!675 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !676, line: 345, baseType: !7, size: 32, elements: !677)
!676 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!677 = !{!678, !679, !680, !681, !682}
!678 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!679 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!680 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!681 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!682 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!683 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 109, baseType: !30, size: 32, elements: !684)
!684 = !{!685, !686, !687}
!685 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!686 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!687 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !676, line: 302, baseType: !30, size: 32, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!690 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!691 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!692 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!693 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!694 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!695 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!696 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!697 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!698 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!699 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!700 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!701 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!702 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!703 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!704 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !676, line: 321, baseType: !30, size: 32, elements: !705)
!705 = !{!706, !707, !708, !709}
!706 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!707 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!708 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!709 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !676, line: 330, baseType: !30, size: 32, elements: !711)
!711 = !{!712, !713}
!712 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!713 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!714 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !676, line: 337, baseType: !30, size: 32, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!717 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!718 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !676, line: 355, baseType: !7, size: 32, elements: !720)
!720 = !{!721, !722, !723}
!721 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!722 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!723 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!724 = !{!265, !30, !51, !58, !266, !54}
!725 = !{!726, !769, !670, !772, !775}
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !672, file: !673, line: 77, type: !728, isLocal: true, isDefinition: true)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 1024, elements: !397)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !673, line: 75, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 68, size: 512, elements: !731)
!731 = !{!732, !733, !745, !746, !757, !758}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !730, file: !673, line: 69, baseType: !69, size: 8)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !730, file: !673, line: 70, baseType: !734, size: 128, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !676, line: 378, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !676, line: 373, size: 128, elements: !736)
!736 = !{!737, !739, !741, !743}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !735, file: !676, line: 374, baseType: !738, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !676, line: 317, baseType: !688)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !735, file: !676, line: 375, baseType: !740, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !676, line: 326, baseType: !704)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !735, file: !676, line: 376, baseType: !742, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !676, line: 333, baseType: !710)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !735, file: !676, line: 377, baseType: !744, size: 32, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !676, line: 341, baseType: !714)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !730, file: !673, line: 71, baseType: !69, size: 8, offset: 160)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !730, file: !673, line: 72, baseType: !747, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !673, line: 66, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 63, size: 64, elements: !749)
!749 = !{!750, !756}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !748, file: !673, line: 64, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !676, line: 410, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !755, !51}
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !676, line: 359, baseType: !719)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !748, file: !673, line: 65, baseType: !51, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !730, file: !673, line: 73, baseType: !69, size: 8, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !730, file: !673, line: 74, baseType: !759, size: 224, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !676, line: 390, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !676, line: 382, size: 224, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !760, file: !676, line: 383, baseType: !274, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !760, file: !676, line: 384, baseType: !61, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !760, file: !676, line: 385, baseType: !61, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !760, file: !676, line: 386, baseType: !274, size: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !760, file: !676, line: 387, baseType: !61, size: 32, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !760, file: !676, line: 388, baseType: !61, size: 32, offset: 160)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !760, file: !676, line: 389, baseType: !61, size: 32, offset: 192)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler", scope: !672, file: !673, line: 82, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 16, elements: !397)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "g_uart_send_lock_status", scope: !672, file: !673, line: 81, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 16, elements: !397)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "func_tbl", scope: !777, file: !673, line: 536, type: !784, isLocal: true, isDefinition: true)
!777 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !673, file: !673, line: 534, type: !778, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !672, retainedNodes: !782)
!778 = !DISubroutineType(types: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !366, line: 197, baseType: !153)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !29, line: 113, baseType: !683)
!782 = !{!783}
!783 = !DILocalVariable(name: "uart_port", arg: 1, scope: !777, file: !673, line: 534, type: !781)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 64, elements: !397)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_default", scope: !788, file: !789, line: 164, type: !278, isLocal: false, isDefinition: true)
!788 = distinct !DICompileUnit(language: DW_LANG_C99, file: !789, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !790, globals: !805, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "../../../../../driver/board/linkit7697_hdk/external_flash/src/bsp_flash_config.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!790 = !{!791, !51}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_info_t", file: !794, line: 48, baseType: !795)
!794 = !DIFile(filename: "../../../../../driver/board/linkit7697_hdk/external_flash/inc/bsp_flash_config.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !794, line: 38, size: 192, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !795, file: !794, line: 39, baseType: !265, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !795, file: !794, line: 40, baseType: !58, size: 8, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !795, file: !794, line: 41, baseType: !259, size: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !795, file: !794, line: 42, baseType: !259, size: 32, offset: 96)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !795, file: !794, line: 43, baseType: !30, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !795, file: !794, line: 45, baseType: !58, size: 8, offset: 160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !795, file: !794, line: 46, baseType: !58, size: 8, offset: 168)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !795, file: !794, line: 47, baseType: !58, size: 8, offset: 176)
!805 = !{!786, !806, !808, !810}
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_default", scope: !788, file: !789, line: 167, type: !283, isLocal: false, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_default", scope: !788, file: !789, line: 170, type: !288, isLocal: false, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "customer_flash_info", scope: !788, file: !789, line: 174, type: !792, isLocal: false, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !814, file: !815, line: 59, type: !61, isLocal: false, isDefinition: true)
!814 = distinct !DICompileUnit(language: DW_LANG_C99, file: !815, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !816, globals: !869, splitDebugInlining: false, nameTableKind: None)
!815 = !DIFile(filename: "../../../../../project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!816 = !{!817, !825, !850}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !557, line: 656, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 650, size: 128, elements: !820)
!820 = !{!821, !822, !823, !824}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !819, file: !557, line: 652, baseType: !60, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !819, file: !557, line: 653, baseType: !60, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !819, file: !557, line: 654, baseType: !60, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !819, file: !557, line: 655, baseType: !591, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !557, line: 418, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 395, size: 1120, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !827, file: !557, line: 397, baseType: !591, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !827, file: !557, line: 398, baseType: !60, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !827, file: !557, line: 399, baseType: !60, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !827, file: !557, line: 400, baseType: !60, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !827, file: !557, line: 401, baseType: !60, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !827, file: !557, line: 402, baseType: !60, size: 32, offset: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !827, file: !557, line: 403, baseType: !598, size: 96, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !827, file: !557, line: 404, baseType: !60, size: 32, offset: 288)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !827, file: !557, line: 405, baseType: !60, size: 32, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !827, file: !557, line: 406, baseType: !60, size: 32, offset: 352)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !827, file: !557, line: 407, baseType: !60, size: 32, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !827, file: !557, line: 408, baseType: !60, size: 32, offset: 416)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !827, file: !557, line: 409, baseType: !60, size: 32, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !827, file: !557, line: 410, baseType: !60, size: 32, offset: 480)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !827, file: !557, line: 411, baseType: !607, size: 64, offset: 512)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !827, file: !557, line: 412, baseType: !591, size: 32, offset: 576)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !827, file: !557, line: 413, baseType: !591, size: 32, offset: 608)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !827, file: !557, line: 414, baseType: !611, size: 128, offset: 640)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !827, file: !557, line: 415, baseType: !613, size: 160, offset: 768)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !827, file: !557, line: 416, baseType: !617, size: 160, offset: 928)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !827, file: !557, line: 417, baseType: !60, size: 32, offset: 1088)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !457, line: 72, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 56, size: 525312, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !852, file: !457, line: 57, baseType: !60, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !852, file: !457, line: 58, baseType: !60, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !852, file: !457, line: 59, baseType: !60, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !852, file: !457, line: 60, baseType: !60, size: 32, offset: 96)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !852, file: !457, line: 61, baseType: !60, size: 32, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !852, file: !457, line: 62, baseType: !60, size: 32, offset: 160)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !852, file: !457, line: 63, baseType: !60, size: 32, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !852, file: !457, line: 64, baseType: !60, size: 32, offset: 224)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !852, file: !457, line: 65, baseType: !60, size: 32, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !852, file: !457, line: 66, baseType: !60, size: 32, offset: 288)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !852, file: !457, line: 67, baseType: !471, size: 32, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !852, file: !457, line: 68, baseType: !60, size: 32, offset: 352)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !852, file: !457, line: 69, baseType: !476, size: 523904, offset: 384)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !852, file: !457, line: 70, baseType: !480, size: 512, offset: 524288)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !852, file: !457, line: 71, baseType: !480, size: 512, offset: 524800)
!869 = !{!812, !870}
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !814, file: !815, line: 61, type: !60, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "heap_end", scope: !874, file: !875, line: 101, type: !265, isLocal: true, isDefinition: true)
!874 = distinct !DISubprogram(name: "_sbrk_r", scope: !875, file: !875, line: 98, type: !876, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1065, retainedNodes: !1069)
!875 = !DIFile(filename: "../../../../../project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/sleep_manager_power_mode/GCC")
!876 = !DISubroutineType(types: !877)
!877 = !{!878, !880, !1064}
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !879, line: 123, baseType: !265)
!879 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !882, line: 377, size: 1920, elements: !883)
!882 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!883 = !{!884, !885, !954, !955, !956, !957, !958, !959, !960, !963, !983, !987, !988, !989, !990, !1000, !1013, !1014, !1019, !1038, !1039, !1046, !1047, !1063}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !881, file: !882, line: 381, baseType: !7, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !881, file: !882, line: 386, baseType: !886, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !882, line: 292, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !882, line: 186, size: 832, elements: !889)
!889 = !{!890, !891, !892, !893, !895, !896, !901, !902, !903, !904, !908, !912, !918, !922, !923, !924, !925, !929, !931, !932, !933, !935, !941, !953}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !888, file: !882, line: 187, baseType: !241, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !888, file: !882, line: 188, baseType: !7, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !888, file: !882, line: 189, baseType: !7, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !888, file: !882, line: 190, baseType: !894, size: 16, offset: 96)
!894 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !888, file: !882, line: 191, baseType: !894, size: 16, offset: 112)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !888, file: !882, line: 192, baseType: !897, size: 64, offset: 128)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !882, line: 122, size: 64, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !897, file: !882, line: 123, baseType: !241, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !897, file: !882, line: 124, baseType: !7, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !888, file: !882, line: 193, baseType: !7, size: 32, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !888, file: !882, line: 196, baseType: !880, size: 32, offset: 224)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !888, file: !882, line: 200, baseType: !51, size: 32, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !888, file: !882, line: 202, baseType: !905, size: 32, offset: 288)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DISubroutineType(types: !907)
!907 = !{!7, !880, !51, !265, !7}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !888, file: !882, line: 204, baseType: !909, size: 32, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DISubroutineType(types: !911)
!911 = !{!7, !880, !51, !395, !7}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !888, file: !882, line: 207, baseType: !913, size: 32, offset: 352)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DISubroutineType(types: !915)
!915 = !{!916, !880, !51, !916, !7}
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !917, line: 116, baseType: !240)
!917 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !888, file: !882, line: 208, baseType: !919, size: 32, offset: 384)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = !DISubroutineType(types: !921)
!921 = !{!7, !880, !51}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !888, file: !882, line: 211, baseType: !897, size: 64, offset: 416)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !888, file: !882, line: 212, baseType: !241, size: 32, offset: 480)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !888, file: !882, line: 213, baseType: !7, size: 32, offset: 512)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !888, file: !882, line: 216, baseType: !926, size: 24, offset: 544)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 24, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 3)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !888, file: !882, line: 217, baseType: !930, size: 8, offset: 568)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, elements: !472)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !888, file: !882, line: 220, baseType: !897, size: 64, offset: 576)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !888, file: !882, line: 223, baseType: !7, size: 32, offset: 640)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !888, file: !882, line: 224, baseType: !934, size: 32, offset: 672)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !917, line: 46, baseType: !240)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !888, file: !882, line: 231, baseType: !936, size: 32, offset: 704)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !882, line: 35, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !938, line: 34, baseType: !939)
!938 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !938, line: 33, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !888, file: !882, line: 233, baseType: !942, size: 64, offset: 736)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !917, line: 170, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !917, line: 162, size: 64, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !943, file: !917, line: 164, baseType: !7, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !943, file: !917, line: 169, baseType: !947, size: 32, offset: 32)
!947 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !943, file: !917, line: 165, size: 32, elements: !948)
!948 = !{!949, !952}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !947, file: !917, line: 167, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !951, line: 116, baseType: !7)
!951 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!952 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !947, file: !917, line: 168, baseType: !293, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !888, file: !882, line: 234, baseType: !7, size: 32, offset: 800)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !881, file: !882, line: 386, baseType: !886, size: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !881, file: !882, line: 386, baseType: !886, size: 32, offset: 96)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !881, file: !882, line: 388, baseType: !7, size: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !881, file: !882, line: 390, baseType: !265, size: 32, offset: 160)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !881, file: !882, line: 392, baseType: !7, size: 32, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !881, file: !882, line: 394, baseType: !7, size: 32, offset: 224)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !881, file: !882, line: 395, baseType: !961, size: 32, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !882, line: 45, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !881, file: !882, line: 397, baseType: !964, size: 32, offset: 288)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !882, line: 349, size: 128, elements: !966)
!966 = !{!967, !979, !980, !981}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !965, file: !882, line: 352, baseType: !968, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !882, line: 52, size: 192, elements: !970)
!970 = !{!971, !972, !973, !974, !975, !976}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !969, file: !882, line: 54, baseType: !968, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !969, file: !882, line: 55, baseType: !7, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !969, file: !882, line: 55, baseType: !7, size: 32, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !969, file: !882, line: 55, baseType: !7, size: 32, offset: 96)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !969, file: !882, line: 55, baseType: !7, size: 32, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !969, file: !882, line: 56, baseType: !977, size: 32, offset: 160)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 32, elements: !472)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !882, line: 22, baseType: !259)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !965, file: !882, line: 353, baseType: !7, size: 32, offset: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !965, file: !882, line: 354, baseType: !968, size: 32, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !965, file: !882, line: 355, baseType: !982, size: 32, offset: 96)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !881, file: !882, line: 399, baseType: !984, size: 32, offset: 320)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !880}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !881, file: !882, line: 401, baseType: !7, size: 32, offset: 352)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !881, file: !882, line: 404, baseType: !7, size: 32, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !881, file: !882, line: 405, baseType: !265, size: 32, offset: 416)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !881, file: !882, line: 407, baseType: !991, size: 32, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !882, line: 324, size: 192, elements: !993)
!993 = !{!994, !996, !997, !998}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !992, file: !882, line: 325, baseType: !995, size: 48)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 48, elements: !927)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !992, file: !882, line: 326, baseType: !995, size: 48, offset: 48)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !992, file: !882, line: 327, baseType: !386, size: 16, offset: 96)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !992, file: !882, line: 330, baseType: !999, size: 64, offset: 128)
!999 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !881, file: !882, line: 408, baseType: !1001, size: 32, offset: 480)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !882, line: 60, size: 288, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !1002, file: !882, line: 62, baseType: !7, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !1002, file: !882, line: 63, baseType: !7, size: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !1002, file: !882, line: 64, baseType: !7, size: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !1002, file: !882, line: 65, baseType: !7, size: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !1002, file: !882, line: 66, baseType: !7, size: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !1002, file: !882, line: 67, baseType: !7, size: 32, offset: 160)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !1002, file: !882, line: 68, baseType: !7, size: 32, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !1002, file: !882, line: 69, baseType: !7, size: 32, offset: 224)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !1002, file: !882, line: 70, baseType: !7, size: 32, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !881, file: !882, line: 409, baseType: !265, size: 32, offset: 512)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !881, file: !882, line: 412, baseType: !1015, size: 32, offset: 544)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !7}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !881, file: !882, line: 416, baseType: !1020, size: 32, offset: 576)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !882, line: 90, size: 1120, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1029}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1021, file: !882, line: 91, baseType: !1020, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !1021, file: !882, line: 92, baseType: !7, size: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !1021, file: !882, line: 93, baseType: !1026, size: 1024, offset: 64)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 1024, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !1021, file: !882, line: 94, baseType: !1030, size: 32, offset: 1088)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !882, line: 79, size: 2112, elements: !1032)
!1032 = !{!1033, !1035, !1036, !1037}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !1031, file: !882, line: 80, baseType: !1034, size: 1024)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 1024, elements: !1027)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !1031, file: !882, line: 81, baseType: !1034, size: 1024, offset: 1024)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !1031, file: !882, line: 83, baseType: !978, size: 32, offset: 2048)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !1031, file: !882, line: 86, baseType: !978, size: 32, offset: 2080)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !881, file: !882, line: 417, baseType: !1021, size: 1120, offset: 608)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !881, file: !882, line: 420, baseType: !1040, size: 96, offset: 1728)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !882, line: 296, size: 96, elements: !1041)
!1041 = !{!1042, !1044, !1045}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1040, file: !882, line: 298, baseType: !1043, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !1040, file: !882, line: 299, baseType: !7, size: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !1040, file: !882, line: 300, baseType: !886, size: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !881, file: !882, line: 421, baseType: !886, size: 32, offset: 1824)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !881, file: !882, line: 422, baseType: !1048, size: 32, offset: 1856)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 32)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !882, line: 359, size: 640, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1057, !1058, !1059, !1060, !1061, !1062}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !1049, file: !882, line: 362, baseType: !265, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !1049, file: !882, line: 363, baseType: !942, size: 64, offset: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !1049, file: !882, line: 364, baseType: !942, size: 64, offset: 96)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !1049, file: !882, line: 365, baseType: !942, size: 64, offset: 160)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !1049, file: !882, line: 366, baseType: !1056, size: 64, offset: 224)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 64, elements: !299)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !1049, file: !882, line: 367, baseType: !7, size: 32, offset: 288)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !1049, file: !882, line: 368, baseType: !942, size: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !1049, file: !882, line: 369, baseType: !942, size: 64, offset: 384)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !1049, file: !882, line: 370, baseType: !942, size: 64, offset: 448)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !1049, file: !882, line: 371, baseType: !942, size: 64, offset: 512)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !1049, file: !882, line: 372, baseType: !942, size: 64, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !881, file: !882, line: 423, baseType: !265, size: 32, offset: 1888)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !951, line: 46, baseType: !30)
