; ModuleID = './build/gpio_configure_pull_state.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.gpio_backup_restore_t = type { i32, i32 }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.__va_list = type { i8* }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (%struct._reent*)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque
%struct._mprec = type { %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint** }
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%struct._rand48 = type { [3 x i16], [3 x i16], i16, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "gpio_bakup_table", scope: !2, file: !3, line: 62, type: !53, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !47, globals: !52, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/low_hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!4 = !{!5, !37, !42}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 55, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!9 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!10 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!11 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!12 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!13 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!14 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!15 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!16 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!17 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!18 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!19 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!20 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!21 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!22 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!23 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!24 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!25 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!26 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!27 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!28 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!29 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!30 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!31 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!32 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!33 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!34 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!35 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!36 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 57, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "eDirection_IN", value: 0)
!41 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 1209, baseType: !7, size: 32, elements: !44)
!43 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!44 = !{!45, !46}
!45 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!46 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !51, line: 116, baseType: !7)
!51 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!52 = !{!0}
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1408, elements: !63)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_backup_restore_t", file: !3, line: 60, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 57, size: 64, elements: !56)
!56 = !{!57, !62}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "reg_data", scope: !55, file: !3, line: 58, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !59, line: 48, baseType: !60)
!59 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !61, line: 79, baseType: !7)
!61 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!62 = !DIDerivedType(tag: DW_TAG_member, name: "reg_addr", scope: !55, file: !3, line: 59, baseType: !58, size: 32, offset: 32)
!63 = !{!64}
!64 = !DISubrange(count: 22)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !67, file: !68, line: 43, type: !58, isLocal: true, isDefinition: true)
!67 = distinct !DICompileUnit(language: DW_LANG_C99, file: !68, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !69, globals: !77, splitDebugInlining: false, nameTableKind: None)
!68 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!69 = !{!70, !72, !73, !75}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !51, line: 62, baseType: !7)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !72)
!77 = !{!65, !78}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !67, file: !68, line: 44, type: !58, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !82, file: !83, line: 54, type: !58, isLocal: false, isDefinition: true)
!82 = distinct !DICompileUnit(language: DW_LANG_C99, file: !83, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !84, retainedTypes: !108, globals: !117, splitDebugInlining: false, nameTableKind: None)
!83 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!84 = !{!85, !91}
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 71, baseType: !7, size: 32, elements: !87)
!86 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!87 = !{!88, !89, !90}
!88 = !DIEnumerator(name: "UART_PORT0", value: 0)
!89 = !DIEnumerator(name: "UART_PORT1", value: 1)
!90 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !92, line: 129, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!94 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!95 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!96 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!97 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!98 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!99 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!100 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!101 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!102 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!103 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!104 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!105 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!106 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!107 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!108 = !{!70, !58, !109, !111, !113, !115, !72}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !51, line: 113, baseType: !112)
!112 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !51, line: 59, baseType: !114)
!114 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!117 = !{!80}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !120, file: !121, line: 53, type: !259, isLocal: false, isDefinition: true)
!120 = distinct !DICompileUnit(language: DW_LANG_C99, file: !121, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !122, retainedTypes: !177, globals: !258, splitDebugInlining: false, nameTableKind: None)
!121 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!122 = !{!123, !132}
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 152, baseType: !125, size: 32, elements: !126)
!124 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !{!127, !128, !129, !130, !131}
!127 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!128 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!129 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!130 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!131 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !133, line: 47, baseType: !125, size: 32, elements: !134)
!133 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!135 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!136 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!137 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!138 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!139 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!140 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!141 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!142 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!143 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!144 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!145 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!146 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!147 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!148 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!149 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!150 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!151 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!152 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!153 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!154 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!155 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!156 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!157 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!158 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!159 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!160 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!161 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!162 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!163 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!164 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!165 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!166 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!167 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!168 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!169 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!170 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!171 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!172 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!173 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!174 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!175 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!176 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!177 = !{!178, !180, !58, !181, !183, !219}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !133, line: 97, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !133, line: 95, baseType: !132)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !59, line: 44, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !61, line: 77, baseType: !125)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !185, line: 378, baseType: !186)
!185 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !185, line: 363, size: 28704, elements: !187)
!187 = !{!188, !192, !196, !197, !198, !199, !200, !201, !202, !203, !207, !214, !218}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !186, file: !185, line: 365, baseType: !189, size: 256)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 256, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !186, file: !185, line: 366, baseType: !193, size: 768, offset: 256)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 768, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 24)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !186, file: !185, line: 367, baseType: !189, size: 256, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !186, file: !185, line: 368, baseType: !193, size: 768, offset: 1280)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !186, file: !185, line: 369, baseType: !189, size: 256, offset: 2048)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !186, file: !185, line: 370, baseType: !193, size: 768, offset: 2304)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !186, file: !185, line: 371, baseType: !189, size: 256, offset: 3072)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !186, file: !185, line: 372, baseType: !193, size: 768, offset: 3328)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !186, file: !185, line: 373, baseType: !189, size: 256, offset: 4096)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !186, file: !185, line: 374, baseType: !204, size: 1792, offset: 4352)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 1792, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 56)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !186, file: !185, line: 375, baseType: !208, size: 1920, offset: 6144)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 1920, elements: !212)
!209 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !59, line: 24, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !61, line: 43, baseType: !114)
!212 = !{!213}
!213 = !DISubrange(count: 240)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !186, file: !185, line: 376, baseType: !215, size: 20608, offset: 8064)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 20608, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 644)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !186, file: !185, line: 377, baseType: !74, size: 32, offset: 28672)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !185, line: 418, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !185, line: 395, size: 1120, elements: !222)
!222 = !{!223, !225, !226, !227, !228, !229, !230, !234, !235, !236, !237, !238, !239, !240, !241, !245, !246, !247, !251, !255, !257}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !221, file: !185, line: 397, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !221, file: !185, line: 398, baseType: !74, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !221, file: !185, line: 399, baseType: !74, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !221, file: !185, line: 400, baseType: !74, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !221, file: !185, line: 401, baseType: !74, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !221, file: !185, line: 402, baseType: !74, size: 32, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !221, file: !185, line: 403, baseType: !231, size: 96, offset: 192)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 12)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !221, file: !185, line: 404, baseType: !74, size: 32, offset: 288)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !221, file: !185, line: 405, baseType: !74, size: 32, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !221, file: !185, line: 406, baseType: !74, size: 32, offset: 352)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !221, file: !185, line: 407, baseType: !74, size: 32, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !221, file: !185, line: 408, baseType: !74, size: 32, offset: 416)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !221, file: !185, line: 409, baseType: !74, size: 32, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !221, file: !185, line: 410, baseType: !74, size: 32, offset: 480)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !221, file: !185, line: 411, baseType: !242, size: 64, offset: 512)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 64, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 2)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !221, file: !185, line: 412, baseType: !224, size: 32, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !221, file: !185, line: 413, baseType: !224, size: 32, offset: 608)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !221, file: !185, line: 414, baseType: !248, size: 128, offset: 640)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 128, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 4)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !221, file: !185, line: 415, baseType: !252, size: 160, offset: 768)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 160, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 5)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !221, file: !185, line: 416, baseType: !256, size: 160, offset: 928)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 160, elements: !253)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !221, file: !185, line: 417, baseType: !74, size: 32, offset: 1088)
!258 = !{!118}
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 6144, elements: !268)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !121, line: 50, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !121, line: 47, size: 64, elements: !262)
!262 = !{!263, !267}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !261, file: !121, line: 48, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !178}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !261, file: !121, line: 49, baseType: !58, size: 32, offset: 32)
!268 = !{!269}
!269 = !DISubrange(count: 96)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !272, file: !273, line: 77, type: !342, isLocal: true, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !274, retainedTypes: !325, globals: !327, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!274 = !{!275, !283, !289, !305, !311, !315, !85, !91, !320}
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 345, baseType: !125, size: 32, elements: !277)
!276 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!277 = !{!278, !279, !280, !281, !282}
!278 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!279 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!280 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!281 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!282 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !284, line: 109, baseType: !7, size: 32, elements: !285)
!284 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!285 = !{!286, !287, !288}
!286 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!287 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!288 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 302, baseType: !7, size: 32, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304}
!291 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!292 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!293 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!294 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!295 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!296 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!297 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!298 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!299 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!300 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!301 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!302 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!303 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!304 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 321, baseType: !7, size: 32, elements: !306)
!306 = !{!307, !308, !309, !310}
!307 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!308 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!309 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!310 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 330, baseType: !7, size: 32, elements: !312)
!312 = !{!313, !314}
!313 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!314 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 337, baseType: !7, size: 32, elements: !316)
!316 = !{!317, !318, !319}
!317 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!318 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!319 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 355, baseType: !125, size: 32, elements: !321)
!321 = !{!322, !323, !324}
!322 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!323 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!324 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!325 = !{!7, !180, !114, !326, !210}
!326 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!327 = !{!270, !328}
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "func_tbl", scope: !330, file: !273, line: 536, type: !340, isLocal: true, isDefinition: true)
!330 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !273, file: !273, line: 534, type: !331, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !272, retainedNodes: !338)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !337}
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !92, line: 197, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{null}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !284, line: 113, baseType: !283)
!338 = !{!339}
!339 = !DILocalVariable(name: "uart_port", arg: 1, scope: !330, file: !273, line: 534, type: !337)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 64, elements: !243)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 1024, elements: !243)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !273, line: 75, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !273, line: 68, size: 512, elements: !345)
!345 = !{!346, !348, !360, !361, !372, !373}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !344, file: !273, line: 69, baseType: !347, size: 8)
!347 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !344, file: !273, line: 70, baseType: !349, size: 128, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !276, line: 378, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !276, line: 373, size: 128, elements: !351)
!351 = !{!352, !354, !356, !358}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !350, file: !276, line: 374, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !276, line: 317, baseType: !289)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !350, file: !276, line: 375, baseType: !355, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !276, line: 326, baseType: !305)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !350, file: !276, line: 376, baseType: !357, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !276, line: 333, baseType: !311)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !350, file: !276, line: 377, baseType: !359, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !276, line: 341, baseType: !315)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !344, file: !273, line: 71, baseType: !347, size: 8, offset: 160)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !344, file: !273, line: 72, baseType: !362, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !273, line: 66, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !273, line: 63, size: 64, elements: !364)
!364 = !{!365, !371}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !363, file: !273, line: 64, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !276, line: 410, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !370, !180}
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !276, line: 359, baseType: !320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !363, file: !273, line: 65, baseType: !180, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !344, file: !273, line: 73, baseType: !347, size: 8, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !344, file: !273, line: 74, baseType: !374, size: 224, offset: 288)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !276, line: 390, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !276, line: 382, size: 224, elements: !376)
!376 = !{!377, !379, !380, !381, !382, !383, !384}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !375, file: !276, line: 383, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !375, file: !276, line: 384, baseType: !58, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !375, file: !276, line: 385, baseType: !58, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !375, file: !276, line: 386, baseType: !378, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !375, file: !276, line: 387, baseType: !58, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !375, file: !276, line: 388, baseType: !58, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !375, file: !276, line: 389, baseType: !58, size: 32, offset: 192)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !387, file: !388, line: 59, type: !58, isLocal: false, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, globals: !452, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gpio_configure_pull_state/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!389 = !{!390, !398, !423}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !185, line: 656, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !185, line: 650, size: 128, elements: !393)
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !392, file: !185, line: 652, baseType: !74, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !392, file: !185, line: 653, baseType: !74, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !392, file: !185, line: 654, baseType: !74, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !392, file: !185, line: 655, baseType: !224, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !185, line: 418, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !185, line: 395, size: 1120, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !400, file: !185, line: 397, baseType: !224, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !400, file: !185, line: 398, baseType: !74, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !400, file: !185, line: 399, baseType: !74, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !400, file: !185, line: 400, baseType: !74, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !400, file: !185, line: 401, baseType: !74, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !400, file: !185, line: 402, baseType: !74, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !400, file: !185, line: 403, baseType: !231, size: 96, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !400, file: !185, line: 404, baseType: !74, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !400, file: !185, line: 405, baseType: !74, size: 32, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !400, file: !185, line: 406, baseType: !74, size: 32, offset: 352)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !400, file: !185, line: 407, baseType: !74, size: 32, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !400, file: !185, line: 408, baseType: !74, size: 32, offset: 416)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !400, file: !185, line: 409, baseType: !74, size: 32, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !400, file: !185, line: 410, baseType: !74, size: 32, offset: 480)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !400, file: !185, line: 411, baseType: !242, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !400, file: !185, line: 412, baseType: !224, size: 32, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !400, file: !185, line: 413, baseType: !224, size: 32, offset: 608)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !400, file: !185, line: 414, baseType: !248, size: 128, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !400, file: !185, line: 415, baseType: !252, size: 160, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !400, file: !185, line: 416, baseType: !256, size: 160, offset: 928)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !400, file: !185, line: 417, baseType: !74, size: 32, offset: 1088)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !425, line: 72, baseType: !426)
!425 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !425, line: 56, size: 525312, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !442, !443, !447, !451}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !426, file: !425, line: 57, baseType: !74, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !426, file: !425, line: 58, baseType: !74, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !426, file: !425, line: 59, baseType: !74, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !426, file: !425, line: 60, baseType: !74, size: 32, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !426, file: !425, line: 61, baseType: !74, size: 32, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !426, file: !425, line: 62, baseType: !74, size: 32, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !426, file: !425, line: 63, baseType: !74, size: 32, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !426, file: !425, line: 64, baseType: !74, size: 32, offset: 224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !426, file: !425, line: 65, baseType: !74, size: 32, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !426, file: !425, line: 66, baseType: !74, size: 32, offset: 288)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !426, file: !425, line: 67, baseType: !439, size: 32, offset: 320)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 1)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !426, file: !425, line: 68, baseType: !74, size: 32, offset: 352)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !426, file: !425, line: 69, baseType: !444, size: 523904, offset: 384)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 523904, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 16372)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !426, file: !425, line: 70, baseType: !448, size: 512, offset: 524288)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 512, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 16)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !426, file: !425, line: 71, baseType: !448, size: 512, offset: 524800)
!452 = !{!385, !453}
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !387, file: !388, line: 61, type: !74, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "heap_end", scope: !457, file: !458, line: 66, type: !463, isLocal: true, isDefinition: true)
!457 = distinct !DISubprogram(name: "_sbrk_r", scope: !458, file: !458, line: 63, type: !459, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !655, retainedNodes: !659)
!458 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !464, !654}
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !462, line: 123, baseType: !463)
!462 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !466, line: 377, size: 1920, elements: !467)
!466 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!467 = !{!468, !469, !543, !544, !545, !546, !547, !548, !549, !552, !573, !577, !578, !579, !580, !590, !603, !604, !609, !628, !629, !636, !637, !653}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !465, file: !466, line: 381, baseType: !125, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !465, file: !466, line: 386, baseType: !470, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !466, line: 292, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !466, line: 186, size: 832, elements: !473)
!473 = !{!474, !476, !477, !478, !480, !481, !486, !487, !488, !489, !493, !499, !506, !510, !511, !512, !513, !517, !519, !520, !521, !523, !529, !542}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !472, file: !466, line: 187, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !472, file: !466, line: 188, baseType: !125, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !472, file: !466, line: 189, baseType: !125, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !472, file: !466, line: 190, baseType: !479, size: 16, offset: 96)
!479 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !472, file: !466, line: 191, baseType: !479, size: 16, offset: 112)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !472, file: !466, line: 192, baseType: !482, size: 64, offset: 128)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !466, line: 122, size: 64, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !482, file: !466, line: 123, baseType: !475, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !482, file: !466, line: 124, baseType: !125, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !472, file: !466, line: 193, baseType: !125, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !472, file: !466, line: 196, baseType: !464, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !472, file: !466, line: 200, baseType: !180, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !472, file: !466, line: 202, baseType: !490, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = !DISubroutineType(types: !492)
!492 = !{!125, !464, !180, !463, !125}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !472, file: !466, line: 204, baseType: !494, size: 32, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DISubroutineType(types: !496)
!496 = !{!125, !464, !180, !497, !125}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !472, file: !466, line: 207, baseType: !500, size: 32, offset: 352)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DISubroutineType(types: !502)
!502 = !{!503, !464, !180, !503, !125}
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !504, line: 116, baseType: !505)
!504 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!505 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !472, file: !466, line: 208, baseType: !507, size: 32, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = !DISubroutineType(types: !509)
!509 = !{!125, !464, !180}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !472, file: !466, line: 211, baseType: !482, size: 64, offset: 416)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !472, file: !466, line: 212, baseType: !475, size: 32, offset: 480)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !472, file: !466, line: 213, baseType: !125, size: 32, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !472, file: !466, line: 216, baseType: !514, size: 24, offset: 544)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 24, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 3)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !472, file: !466, line: 217, baseType: !518, size: 8, offset: 568)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 8, elements: !440)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !472, file: !466, line: 220, baseType: !482, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !472, file: !466, line: 223, baseType: !125, size: 32, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !472, file: !466, line: 224, baseType: !522, size: 32, offset: 672)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !504, line: 46, baseType: !505)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !472, file: !466, line: 231, baseType: !524, size: 32, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !466, line: 35, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !526, line: 34, baseType: !527)
!526 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !526, line: 33, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !472, file: !466, line: 233, baseType: !530, size: 64, offset: 736)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !504, line: 170, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !504, line: 162, size: 64, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !531, file: !504, line: 164, baseType: !125, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !531, file: !504, line: 169, baseType: !535, size: 32, offset: 32)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !531, file: !504, line: 165, size: 32, elements: !536)
!536 = !{!537, !540}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !535, file: !504, line: 167, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !539, line: 116, baseType: !125)
!539 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !535, file: !504, line: 168, baseType: !541, size: 32)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 32, elements: !249)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !472, file: !466, line: 234, baseType: !125, size: 32, offset: 800)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !465, file: !466, line: 386, baseType: !470, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !465, file: !466, line: 386, baseType: !470, size: 32, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !465, file: !466, line: 388, baseType: !125, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !465, file: !466, line: 390, baseType: !463, size: 32, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !465, file: !466, line: 392, baseType: !125, size: 32, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !465, file: !466, line: 394, baseType: !125, size: 32, offset: 224)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !465, file: !466, line: 395, baseType: !550, size: 32, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !466, line: 45, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !465, file: !466, line: 397, baseType: !553, size: 32, offset: 288)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !466, line: 349, size: 128, elements: !555)
!555 = !{!556, !569, !570, !571}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !554, file: !466, line: 352, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !466, line: 52, size: 192, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !558, file: !466, line: 54, baseType: !557, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !558, file: !466, line: 55, baseType: !125, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !558, file: !466, line: 55, baseType: !125, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !558, file: !466, line: 55, baseType: !125, size: 32, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !558, file: !466, line: 55, baseType: !125, size: 32, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !558, file: !466, line: 56, baseType: !566, size: 32, offset: 160)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 32, elements: !440)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !466, line: 22, baseType: !568)
!568 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !554, file: !466, line: 353, baseType: !125, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !554, file: !466, line: 354, baseType: !557, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !554, file: !466, line: 355, baseType: !572, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !465, file: !466, line: 399, baseType: !574, size: 32, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !464}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !465, file: !466, line: 401, baseType: !125, size: 32, offset: 352)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !465, file: !466, line: 404, baseType: !125, size: 32, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !465, file: !466, line: 405, baseType: !463, size: 32, offset: 416)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !465, file: !466, line: 407, baseType: !581, size: 32, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !466, line: 324, size: 192, elements: !583)
!583 = !{!584, !586, !587, !588}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !582, file: !466, line: 325, baseType: !585, size: 48)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 48, elements: !515)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !582, file: !466, line: 326, baseType: !585, size: 48, offset: 48)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !582, file: !466, line: 327, baseType: !112, size: 16, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !582, file: !466, line: 330, baseType: !589, size: 64, offset: 128)
!589 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !465, file: !466, line: 408, baseType: !591, size: 32, offset: 480)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !466, line: 60, size: 288, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !592, file: !466, line: 62, baseType: !125, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !592, file: !466, line: 63, baseType: !125, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !592, file: !466, line: 64, baseType: !125, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !592, file: !466, line: 65, baseType: !125, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !592, file: !466, line: 66, baseType: !125, size: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !592, file: !466, line: 67, baseType: !125, size: 32, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !592, file: !466, line: 68, baseType: !125, size: 32, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !592, file: !466, line: 69, baseType: !125, size: 32, offset: 224)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !592, file: !466, line: 70, baseType: !125, size: 32, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !465, file: !466, line: 409, baseType: !463, size: 32, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !465, file: !466, line: 412, baseType: !605, size: 32, offset: 544)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !125}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !465, file: !466, line: 416, baseType: !610, size: 32, offset: 576)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !466, line: 90, size: 1120, elements: !612)
!612 = !{!613, !614, !615, !619}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !611, file: !466, line: 91, baseType: !610, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !611, file: !466, line: 92, baseType: !125, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !611, file: !466, line: 93, baseType: !616, size: 1024, offset: 64)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 1024, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !611, file: !466, line: 94, baseType: !620, size: 32, offset: 1088)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !466, line: 79, size: 2112, elements: !622)
!622 = !{!623, !625, !626, !627}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !621, file: !466, line: 80, baseType: !624, size: 1024)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 1024, elements: !617)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !621, file: !466, line: 81, baseType: !624, size: 1024, offset: 1024)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !621, file: !466, line: 83, baseType: !567, size: 32, offset: 2048)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !621, file: !466, line: 86, baseType: !567, size: 32, offset: 2080)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !465, file: !466, line: 417, baseType: !611, size: 1120, offset: 608)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !465, file: !466, line: 420, baseType: !630, size: 96, offset: 1728)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !466, line: 296, size: 96, elements: !631)
!631 = !{!632, !634, !635}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !630, file: !466, line: 298, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !630, file: !466, line: 299, baseType: !125, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !630, file: !466, line: 300, baseType: !470, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !465, file: !466, line: 421, baseType: !470, size: 32, offset: 1824)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !465, file: !466, line: 422, baseType: !638, size: 32, offset: 1856)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !466, line: 359, size: 640, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !647, !648, !649, !650, !651, !652}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !639, file: !466, line: 362, baseType: !463, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !639, file: !466, line: 363, baseType: !530, size: 64, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !639, file: !466, line: 364, baseType: !530, size: 64, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !639, file: !466, line: 365, baseType: !530, size: 64, offset: 160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !639, file: !466, line: 366, baseType: !646, size: 64, offset: 224)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 64, elements: !190)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !639, file: !466, line: 367, baseType: !125, size: 32, offset: 288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !639, file: !466, line: 368, baseType: !530, size: 64, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !639, file: !466, line: 369, baseType: !530, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !639, file: !466, line: 370, baseType: !530, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !639, file: !466, line: 371, baseType: !530, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !639, file: !466, line: 372, baseType: !530, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !465, file: !466, line: 423, baseType: !463, size: 32, offset: 1888)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !539, line: 46, baseType: !7)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !657, globals: !658, splitDebugInlining: false, nameTableKind: None)
!656 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!657 = !{!463, !461}
!658 = !{!455}
!659 = !{!660, !661, !662, !663}
!660 = !DILocalVariable(name: "r", arg: 1, scope: !457, file: !458, line: 63, type: !464)
!661 = !DILocalVariable(name: "nbytes", arg: 2, scope: !457, file: !458, line: 63, type: !654)
!662 = !DILocalVariable(name: "prev_heap_end", scope: !457, file: !458, line: 67, type: !463)
!663 = !DILocalVariable(name: "stack", scope: !457, file: !458, line: 68, type: !463)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !666, file: !671, line: 4, type: !677, isLocal: false, isDefinition: true)
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !668, splitDebugInlining: false, nameTableKind: None)
!667 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!668 = !{!664, !669, !675}
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !666, file: !671, line: 5, type: !672, isLocal: false, isDefinition: true)
!671 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 88, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 11)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !666, file: !671, line: 6, type: !672, isLocal: false, isDefinition: true)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 248, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 31)
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !681, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !683, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!682 = !{!42}
!683 = !{!48, !50}
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !686, retainedTypes: !764, splitDebugInlining: false, nameTableKind: None)
!685 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!686 = !{!687}
!687 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !688, line: 150, baseType: !7, size: 32, elements: !689)
!688 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!690 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!691 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!692 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!693 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!694 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!695 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!696 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!697 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!698 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!699 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!700 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!701 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!702 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!703 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!704 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!705 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!706 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!707 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!708 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!709 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!710 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!711 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!712 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!713 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!714 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!715 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!716 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!717 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!718 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!719 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!720 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!721 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!722 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!723 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!724 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!725 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!726 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!727 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!728 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!729 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!730 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!731 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!732 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!733 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!734 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!735 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!736 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!737 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!738 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!739 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!740 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!741 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!742 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!743 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!744 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!745 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!746 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!747 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!748 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!749 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!750 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!751 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!752 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!753 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!754 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!755 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!756 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!757 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!758 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!759 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!760 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!761 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!762 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!763 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!764 = !{!48, !72}
!765 = distinct !DICompileUnit(language: DW_LANG_C99, file: !766, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !767, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!767 = !{!768, !793}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !185, line: 418, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !185, line: 395, size: 1120, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !770, file: !185, line: 397, baseType: !224, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !770, file: !185, line: 398, baseType: !74, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !770, file: !185, line: 399, baseType: !74, size: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !770, file: !185, line: 400, baseType: !74, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !770, file: !185, line: 401, baseType: !74, size: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !770, file: !185, line: 402, baseType: !74, size: 32, offset: 160)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !770, file: !185, line: 403, baseType: !231, size: 96, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !770, file: !185, line: 404, baseType: !74, size: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !770, file: !185, line: 405, baseType: !74, size: 32, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !770, file: !185, line: 406, baseType: !74, size: 32, offset: 352)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !770, file: !185, line: 407, baseType: !74, size: 32, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !770, file: !185, line: 408, baseType: !74, size: 32, offset: 416)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !770, file: !185, line: 409, baseType: !74, size: 32, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !770, file: !185, line: 410, baseType: !74, size: 32, offset: 480)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !770, file: !185, line: 411, baseType: !242, size: 64, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !770, file: !185, line: 412, baseType: !224, size: 32, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !770, file: !185, line: 413, baseType: !224, size: 32, offset: 608)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !770, file: !185, line: 414, baseType: !248, size: 128, offset: 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !770, file: !185, line: 415, baseType: !252, size: 160, offset: 768)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !770, file: !185, line: 416, baseType: !256, size: 160, offset: 928)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !770, file: !185, line: 417, baseType: !74, size: 32, offset: 1088)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !185, line: 378, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !185, line: 363, size: 28704, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !795, file: !185, line: 365, baseType: !189, size: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !795, file: !185, line: 366, baseType: !193, size: 768, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !795, file: !185, line: 367, baseType: !189, size: 256, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !795, file: !185, line: 368, baseType: !193, size: 768, offset: 1280)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !795, file: !185, line: 369, baseType: !189, size: 256, offset: 2048)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !795, file: !185, line: 370, baseType: !193, size: 768, offset: 2304)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !795, file: !185, line: 371, baseType: !189, size: 256, offset: 3072)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !795, file: !185, line: 372, baseType: !193, size: 768, offset: 3328)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !795, file: !185, line: 373, baseType: !189, size: 256, offset: 4096)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !795, file: !185, line: 374, baseType: !204, size: 1792, offset: 4352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !795, file: !185, line: 375, baseType: !208, size: 1920, offset: 6144)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !795, file: !185, line: 376, baseType: !215, size: 20608, offset: 8064)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !795, file: !185, line: 377, baseType: !74, size: 32, offset: 28672)
!810 = distinct !DICompileUnit(language: DW_LANG_C99, file: !811, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !812, splitDebugInlining: false, nameTableKind: None)
!811 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!812 = !{!5, !687}
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !817, retainedTypes: !876, splitDebugInlining: false, nameTableKind: None)
!816 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!817 = !{!818, !825, !5, !856, !862, !866, !870, !37}
!818 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 233, baseType: !125, size: 32, elements: !820)
!819 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!820 = !{!821, !822, !823, !824}
!821 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!822 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!823 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!824 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!825 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !284, line: 249, baseType: !7, size: 32, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855}
!827 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!828 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!829 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!830 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!831 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!832 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!833 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!834 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!835 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!836 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!837 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!838 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!839 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!840 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!841 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!842 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!843 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!844 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!845 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!846 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!847 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!848 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!849 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!850 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!851 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!852 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!853 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!854 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!855 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!856 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 224, baseType: !125, size: 32, elements: !857)
!857 = !{!858, !859, !860, !861}
!858 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!859 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!860 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!861 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 217, baseType: !7, size: 32, elements: !863)
!863 = !{!864, !865}
!864 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!865 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 210, baseType: !7, size: 32, elements: !867)
!867 = !{!868, !869}
!868 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!869 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 242, baseType: !7, size: 32, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!873 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!874 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!875 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!876 = !{!877, !180, !878, !210, !879, !880}
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !6, line: 87, baseType: !5)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !819, line: 220, baseType: !862)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !819, line: 247, baseType: !870)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !38, line: 60, baseType: !37)
!881 = distinct !DICompileUnit(language: DW_LANG_C99, file: !882, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !883, splitDebugInlining: false, nameTableKind: None)
!882 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gpio_configure_pull_state/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpio_configure_pull_state/GCC")
!883 = !{!283, !289, !305, !311, !315, !825, !862, !856, !818, !866}
!884 = !{!"Ubuntu clang version 14.0.6"}
!885 = !{i32 7, !"Dwarf Version", i32 2}
!886 = !{i32 2, !"Debug Info Version", i32 3}
!887 = !{i32 1, !"wchar_size", i32 4}
!888 = !{i32 1, !"min_enum_size", i32 4}
!889 = !{i32 1, !"branch-target-enforcement", i32 0}
!890 = !{i32 1, !"sign-return-address", i32 0}
!891 = !{i32 1, !"sign-return-address-all", i32 0}
!892 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!893 = !{i32 7, !"frame-pointer", i32 2}
!894 = distinct !DISubprogram(name: "halGPIO_ConfDirection", scope: !681, file: !681, line: 54, type: !895, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !898)
!895 = !DISubroutineType(types: !896)
!896 = !{!897, !72, !113}
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !51, line: 56, baseType: !125)
!898 = !{!899, !900, !901, !903}
!899 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !894, file: !681, line: 54, type: !72)
!900 = !DILocalVariable(name: "outEnable", arg: 2, scope: !894, file: !681, line: 54, type: !113)
!901 = !DILocalVariable(name: "no", scope: !894, file: !681, line: 57, type: !902)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !51, line: 60, baseType: !112)
!903 = !DILocalVariable(name: "remainder", scope: !894, file: !681, line: 58, type: !902)
!904 = !DILocation(line: 0, scope: !894)
!905 = !DILocation(line: 59, column: 19, scope: !894)
!906 = !DILocation(line: 60, column: 17, scope: !894)
!907 = !DILocation(line: 61, column: 5, scope: !894)
!908 = !DILocation(line: 65, column: 27, scope: !909)
!909 = distinct !DILexicalBlock(scope: !910, file: !681, line: 65, column: 17)
!910 = distinct !DILexicalBlock(scope: !894, file: !681, line: 61, column: 17)
!911 = !DILocation(line: 0, scope: !909)
!912 = !DILocation(line: 65, column: 17, scope: !910)
!913 = !DILocation(line: 66, column: 21, scope: !914)
!914 = distinct !DILexicalBlock(scope: !909, file: !681, line: 65, column: 33)
!915 = !DILocation(line: 67, column: 73, scope: !916)
!916 = distinct !DILexicalBlock(scope: !917, file: !681, line: 66, column: 38)
!917 = distinct !DILexicalBlock(scope: !914, file: !681, line: 66, column: 21)
!918 = !DILocation(line: 67, column: 69, scope: !916)
!919 = !DILocation(line: 67, column: 66, scope: !916)
!920 = !DILocation(line: 68, column: 17, scope: !916)
!921 = !DILocation(line: 68, column: 28, scope: !917)
!922 = !DILocation(line: 69, column: 77, scope: !923)
!923 = distinct !DILexicalBlock(scope: !924, file: !681, line: 68, column: 45)
!924 = distinct !DILexicalBlock(scope: !917, file: !681, line: 68, column: 28)
!925 = !DILocation(line: 70, column: 77, scope: !923)
!926 = !DILocation(line: 71, column: 17, scope: !923)
!927 = !DILocation(line: 72, column: 77, scope: !928)
!928 = distinct !DILexicalBlock(scope: !929, file: !681, line: 71, column: 45)
!929 = distinct !DILexicalBlock(scope: !924, file: !681, line: 71, column: 28)
!930 = !DILocation(line: 73, column: 77, scope: !928)
!931 = !DILocation(line: 74, column: 17, scope: !928)
!932 = !DILocation(line: 75, column: 79, scope: !933)
!933 = distinct !DILexicalBlock(scope: !934, file: !681, line: 74, column: 45)
!934 = distinct !DILexicalBlock(scope: !929, file: !681, line: 74, column: 28)
!935 = !DILocation(line: 76, column: 79, scope: !933)
!936 = !DILocation(line: 77, column: 17, scope: !933)
!937 = !DILocation(line: 78, column: 79, scope: !938)
!938 = distinct !DILexicalBlock(scope: !939, file: !681, line: 77, column: 45)
!939 = distinct !DILexicalBlock(scope: !934, file: !681, line: 77, column: 28)
!940 = !DILocation(line: 79, column: 79, scope: !938)
!941 = !DILocation(line: 80, column: 17, scope: !938)
!942 = !DILocation(line: 81, column: 79, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !681, line: 80, column: 45)
!944 = distinct !DILexicalBlock(scope: !939, file: !681, line: 80, column: 28)
!945 = !DILocation(line: 82, column: 79, scope: !943)
!946 = !DILocation(line: 83, column: 17, scope: !943)
!947 = !DILocation(line: 85, column: 17, scope: !914)
!948 = !DILocation(line: 86, column: 13, scope: !914)
!949 = !DILocation(line: 88, column: 21, scope: !950)
!950 = distinct !DILexicalBlock(scope: !909, file: !681, line: 86, column: 20)
!951 = !DILocation(line: 89, column: 72, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !681, line: 88, column: 38)
!953 = distinct !DILexicalBlock(scope: !950, file: !681, line: 88, column: 21)
!954 = !DILocation(line: 89, column: 66, scope: !952)
!955 = !DILocation(line: 90, column: 17, scope: !952)
!956 = !DILocation(line: 90, column: 28, scope: !953)
!957 = !DILocation(line: 91, column: 77, scope: !958)
!958 = distinct !DILexicalBlock(scope: !959, file: !681, line: 90, column: 45)
!959 = distinct !DILexicalBlock(scope: !953, file: !681, line: 90, column: 28)
!960 = !DILocation(line: 92, column: 17, scope: !958)
!961 = !DILocation(line: 93, column: 77, scope: !962)
!962 = distinct !DILexicalBlock(scope: !963, file: !681, line: 92, column: 45)
!963 = distinct !DILexicalBlock(scope: !959, file: !681, line: 92, column: 28)
!964 = !DILocation(line: 94, column: 17, scope: !962)
!965 = !DILocation(line: 95, column: 79, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !681, line: 94, column: 45)
!967 = distinct !DILexicalBlock(scope: !963, file: !681, line: 94, column: 28)
!968 = !DILocation(line: 96, column: 17, scope: !966)
!969 = !DILocation(line: 97, column: 79, scope: !970)
!970 = distinct !DILexicalBlock(scope: !971, file: !681, line: 96, column: 45)
!971 = distinct !DILexicalBlock(scope: !967, file: !681, line: 96, column: 28)
!972 = !DILocation(line: 98, column: 17, scope: !970)
!973 = !DILocation(line: 99, column: 79, scope: !974)
!974 = distinct !DILexicalBlock(scope: !975, file: !681, line: 98, column: 45)
!975 = distinct !DILexicalBlock(scope: !971, file: !681, line: 98, column: 28)
!976 = !DILocation(line: 100, column: 17, scope: !974)
!977 = !DILocation(line: 103, column: 17, scope: !950)
!978 = !DILocation(line: 109, column: 27, scope: !979)
!979 = distinct !DILexicalBlock(scope: !910, file: !681, line: 109, column: 17)
!980 = !DILocation(line: 0, scope: !979)
!981 = !DILocation(line: 109, column: 17, scope: !910)
!982 = !DILocation(line: 110, column: 21, scope: !983)
!983 = distinct !DILexicalBlock(scope: !979, file: !681, line: 109, column: 33)
!984 = !DILocation(line: 111, column: 73, scope: !985)
!985 = distinct !DILexicalBlock(scope: !986, file: !681, line: 110, column: 36)
!986 = distinct !DILexicalBlock(scope: !983, file: !681, line: 110, column: 21)
!987 = !DILocation(line: 111, column: 69, scope: !985)
!988 = !DILocation(line: 111, column: 66, scope: !985)
!989 = !DILocation(line: 112, column: 17, scope: !985)
!990 = !DILocation(line: 113, column: 79, scope: !991)
!991 = distinct !DILexicalBlock(scope: !986, file: !681, line: 112, column: 24)
!992 = !DILocation(line: 114, column: 79, scope: !991)
!993 = !DILocation(line: 117, column: 17, scope: !983)
!994 = !DILocation(line: 118, column: 13, scope: !983)
!995 = !DILocation(line: 120, column: 21, scope: !996)
!996 = distinct !DILexicalBlock(scope: !979, file: !681, line: 118, column: 20)
!997 = !DILocation(line: 121, column: 72, scope: !998)
!998 = distinct !DILexicalBlock(scope: !999, file: !681, line: 120, column: 36)
!999 = distinct !DILexicalBlock(scope: !996, file: !681, line: 120, column: 21)
!1000 = !DILocation(line: 121, column: 66, scope: !998)
!1001 = !DILocation(line: 122, column: 17, scope: !998)
!1002 = !DILocation(line: 123, column: 79, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !999, file: !681, line: 122, column: 24)
!1004 = !DILocation(line: 126, column: 17, scope: !996)
!1005 = !DILocation(line: 133, column: 1, scope: !894)
!1006 = distinct !DISubprogram(name: "halGPO_Write", scope: !681, file: !681, line: 136, type: !895, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !1007)
!1007 = !{!1008, !1009, !1010, !1011}
!1008 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1006, file: !681, line: 136, type: !72)
!1009 = !DILocalVariable(name: "writeValue", arg: 2, scope: !1006, file: !681, line: 136, type: !113)
!1010 = !DILocalVariable(name: "no", scope: !1006, file: !681, line: 138, type: !902)
!1011 = !DILocalVariable(name: "remainder", scope: !1006, file: !681, line: 139, type: !902)
!1012 = !DILocation(line: 0, scope: !1006)
!1013 = !DILocation(line: 140, column: 19, scope: !1006)
!1014 = !DILocation(line: 141, column: 17, scope: !1006)
!1015 = !DILocation(line: 142, column: 5, scope: !1006)
!1016 = !DILocation(line: 145, column: 17, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !681, line: 145, column: 17)
!1018 = distinct !DILexicalBlock(scope: !1006, file: !681, line: 142, column: 17)
!1019 = !DILocation(line: 0, scope: !1017)
!1020 = !DILocation(line: 145, column: 17, scope: !1018)
!1021 = !DILocation(line: 146, column: 17, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1017, file: !681, line: 145, column: 29)
!1023 = !DILocation(line: 147, column: 13, scope: !1022)
!1024 = !DILocation(line: 148, column: 17, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1017, file: !681, line: 147, column: 20)
!1026 = !DILocation(line: 153, column: 17, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1018, file: !681, line: 153, column: 17)
!1028 = !DILocation(line: 0, scope: !1027)
!1029 = !DILocation(line: 153, column: 17, scope: !1018)
!1030 = !DILocation(line: 154, column: 17, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1027, file: !681, line: 153, column: 29)
!1032 = !DILocation(line: 155, column: 13, scope: !1031)
!1033 = !DILocation(line: 156, column: 17, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1027, file: !681, line: 155, column: 20)
!1035 = !DILocation(line: 163, column: 1, scope: !1006)
!1036 = distinct !DISubprogram(name: "halgetGPIO_DOUT", scope: !681, file: !681, line: 169, type: !1037, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !1039)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!113, !72}
!1039 = !{!1040, !1041, !1042, !1043}
!1040 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1036, file: !681, line: 169, type: !72)
!1041 = !DILocalVariable(name: "no", scope: !1036, file: !681, line: 171, type: !902)
!1042 = !DILocalVariable(name: "remainder", scope: !1036, file: !681, line: 172, type: !902)
!1043 = !DILocalVariable(name: "dout", scope: !1036, file: !681, line: 175, type: !113)
!1044 = !DILocation(line: 0, scope: !1036)
!1045 = !DILocation(line: 173, column: 19, scope: !1036)
!1046 = !DILocation(line: 174, column: 17, scope: !1036)
!1047 = !DILocation(line: 177, column: 5, scope: !1036)
!1048 = !DILocation(line: 183, column: 13, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1036, file: !681, line: 177, column: 17)
!1050 = !DILocation(line: 0, scope: !1049)
!1051 = !DILocation(line: 187, column: 5, scope: !1036)
!1052 = !DILocation(line: 188, column: 1, scope: !1036)
!1053 = distinct !DISubprogram(name: "halgetGPIO_DIN", scope: !681, file: !681, line: 189, type: !1037, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !1054)
!1054 = !{!1055, !1056, !1057, !1058}
!1055 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1053, file: !681, line: 189, type: !72)
!1056 = !DILocalVariable(name: "no", scope: !1053, file: !681, line: 191, type: !902)
!1057 = !DILocalVariable(name: "remainder", scope: !1053, file: !681, line: 192, type: !902)
!1058 = !DILocalVariable(name: "din", scope: !1053, file: !681, line: 195, type: !113)
!1059 = !DILocation(line: 0, scope: !1053)
!1060 = !DILocation(line: 193, column: 19, scope: !1053)
!1061 = !DILocation(line: 194, column: 17, scope: !1053)
!1062 = !DILocation(line: 196, column: 5, scope: !1053)
!1063 = !DILocation(line: 203, column: 13, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1053, file: !681, line: 196, column: 17)
!1065 = !DILocation(line: 0, scope: !1064)
!1066 = !DILocation(line: 208, column: 5, scope: !1053)
!1067 = !DILocation(line: 209, column: 1, scope: !1053)
!1068 = distinct !DISubprogram(name: "halgetGPIO_OutEnable", scope: !681, file: !681, line: 210, type: !1037, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !1069)
!1069 = !{!1070, !1071, !1072, !1073}
!1070 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1068, file: !681, line: 210, type: !72)
!1071 = !DILocalVariable(name: "no", scope: !1068, file: !681, line: 212, type: !902)
!1072 = !DILocalVariable(name: "remainder", scope: !1068, file: !681, line: 213, type: !902)
!1073 = !DILocalVariable(name: "outEnable", scope: !1068, file: !681, line: 216, type: !113)
!1074 = !DILocation(line: 0, scope: !1068)
!1075 = !DILocation(line: 214, column: 19, scope: !1068)
!1076 = !DILocation(line: 215, column: 17, scope: !1068)
!1077 = !DILocation(line: 218, column: 5, scope: !1068)
!1078 = !DILocation(line: 224, column: 13, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1068, file: !681, line: 218, column: 17)
!1080 = !DILocation(line: 0, scope: !1079)
!1081 = !DILocation(line: 228, column: 5, scope: !1068)
!1082 = !DILocation(line: 229, column: 1, scope: !1068)
!1083 = distinct !DISubprogram(name: "halGPIO_PullUp_SET", scope: !681, file: !681, line: 232, type: !1084, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !1086)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!897, !72}
!1086 = !{!1087, !1088, !1089}
!1087 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1083, file: !681, line: 232, type: !72)
!1088 = !DILocalVariable(name: "no", scope: !1083, file: !681, line: 234, type: !902)
!1089 = !DILocalVariable(name: "remainder", scope: !1083, file: !681, line: 235, type: !902)
!1090 = !DILocation(line: 0, scope: !1083)
!1091 = !DILocation(line: 236, column: 19, scope: !1083)
!1092 = !DILocation(line: 237, column: 17, scope: !1083)
!1093 = !DILocation(line: 238, column: 5, scope: !1083)
!1094 = !DILocation(line: 239, column: 5, scope: !1083)
!1095 = !DILocation(line: 241, column: 27, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !681, line: 241, column: 17)
!1097 = distinct !DILexicalBlock(scope: !1083, file: !681, line: 239, column: 17)
!1098 = !DILocation(line: 241, column: 17, scope: !1097)
!1099 = !DILocation(line: 241, column: 17, scope: !1096)
!1100 = !DILocation(line: 242, column: 17, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1096, file: !681, line: 241, column: 34)
!1102 = !DILocation(line: 243, column: 13, scope: !1101)
!1103 = !DILocation(line: 243, column: 24, scope: !1096)
!1104 = !DILocation(line: 244, column: 73, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !681, line: 243, column: 41)
!1106 = distinct !DILexicalBlock(scope: !1096, file: !681, line: 243, column: 24)
!1107 = !DILocation(line: 245, column: 73, scope: !1105)
!1108 = !DILocation(line: 246, column: 13, scope: !1105)
!1109 = !DILocation(line: 247, column: 73, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !681, line: 246, column: 41)
!1111 = distinct !DILexicalBlock(scope: !1106, file: !681, line: 246, column: 24)
!1112 = !DILocation(line: 248, column: 73, scope: !1110)
!1113 = !DILocation(line: 249, column: 13, scope: !1110)
