; ModuleID = 'build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16*, %struct.pm_device* }
%struct.device_state = type { i8, i8 }
%struct.pm_device = type { %struct.device*, %struct.k_mutex, i32, %struct.k_work_delayable, %struct.k_condvar, %struct.device*, i32, i32, i32 (%struct.device*, i32)* }
%struct.k_mutex = type { %union.anon, %struct.k_thread*, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 109, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 6208, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 97)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 3104, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 407, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f446xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 398, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 400, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 401, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 402, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 403, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 404, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 405, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 406, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !168}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 224, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159, !165}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !140, file: !141, line: 403, baseType: !166, size: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !141, line: 367, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !171, file: !174, line: 71, type: !175, isLocal: true, isDefinition: true, align: 32)
!171 = distinct !DICompileUnit(language: DW_LANG_C99, file: !172, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !173, splitDebugInlining: false, nameTableKind: None)
!172 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!173 = !{!169}
!174 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !177)
!177 = !{!178, !198}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !176, file: !132, line: 60, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!103, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 224, elements: !185)
!185 = !{!186, !187, !188, !189, !195, !196, !197}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !141, line: 380, baseType: !144, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !184, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !184, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !184, file: !141, line: 386, baseType: !190, size: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !191, file: !141, line: 359, baseType: !154, size: 8)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !191, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !184, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !184, file: !141, line: 403, baseType: !166, size: 32, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !176, file: !132, line: 65, baseType: !182, size: 32, offset: 32)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !201, file: !255, line: 27, type: !282, isLocal: true, isDefinition: true)
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !203, retainedTypes: !228, globals: !252, splitDebugInlining: false, nameTableKind: None)
!202 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!203 = !{!204, !215, !222, !30}
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !205, line: 27, baseType: !32, size: 32, elements: !206)
!205 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214}
!207 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!208 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!209 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!210 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!211 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!212 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!213 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!214 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!215 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_state", file: !216, line: 53, baseType: !32, size: 32, elements: !217)
!216 = !DIFile(filename: "zephyr/include/zephyr/pm/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!217 = !{!218, !219, !220, !221}
!218 = !DIEnumerator(name: "PM_DEVICE_STATE_ACTIVE", value: 0)
!219 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDED", value: 1)
!220 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDING", value: 2)
!221 = !DIEnumerator(name: "PM_DEVICE_STATE_OFF", value: 3)
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_action", file: !216, line: 75, baseType: !32, size: 32, elements: !223)
!223 = !{!224, !225, !226, !227}
!224 = !DIEnumerator(name: "PM_DEVICE_ACTION_SUSPEND", value: 0)
!225 = !DIEnumerator(name: "PM_DEVICE_ACTION_RESUME", value: 1)
!226 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_OFF", value: 2)
!227 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_ON", value: 3)
!228 = !{!102, !229, !103, !24, !233, !249, !121, !250}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !230, line: 46, baseType: !231)
!230 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !232)
!232 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !235, line: 54, size: 96, elements: !236)
!235 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = !{!237, !244, !248}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !234, file: !235, line: 55, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !239, line: 33, baseType: !240)
!239 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !239, line: 29, size: 32, elements: !241)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !239, line: 30, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !234, file: !235, line: 60, baseType: !245, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !204}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !234, file: !235, line: 65, baseType: !245, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !251)
!251 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!252 = !{!199, !253, !259, !261, !272, !274}
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !201, file: !255, line: 44, type: !256, isLocal: true, isDefinition: true)
!255 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !257, line: 43, elements: !258)
!257 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!258 = !{}
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !201, file: !255, line: 49, type: !256, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !201, file: !255, line: 36, type: !263, isLocal: true, isDefinition: true)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 128, elements: !270)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !205, line: 114, size: 128, elements: !265)
!265 = !{!266, !267, !268, !269}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !264, file: !205, line: 115, baseType: !204, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !264, file: !205, line: 141, baseType: !154, size: 8, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !264, file: !205, line: 149, baseType: !121, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !264, file: !205, line: 156, baseType: !121, size: 32, offset: 96)
!270 = !{!271}
!271 = !DISubrange(count: 1)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !201, file: !255, line: 40, type: !263, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !201, file: !255, line: 28, type: !276, isLocal: true, isDefinition: true)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !239, line: 40, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !239, line: 35, size: 64, elements: !278)
!278 = !{!279, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !277, file: !239, line: 36, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !277, file: !239, line: 37, baseType: !280, size: 32, offset: 32)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 32, elements: !270)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !284, line: 22, baseType: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!286 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!287 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !290, file: !320, line: 50, type: !307, isLocal: true, isDefinition: true)
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !292, retainedTypes: !293, globals: !317, splitDebugInlining: false, nameTableKind: None)
!291 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!292 = !{!204, !30}
!293 = !{!163, !229, !294, !103, !102, !121, !250, !296, !249, !307, !308}
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !295, line: 214, baseType: !32)
!295 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !298, line: 45, size: 64, elements: !299)
!298 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = !{!300, !306}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !297, file: !298, line: 46, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !239, line: 33, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !239, line: 29, size: 32, elements: !303)
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !239, line: 30, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !297, file: !298, line: 48, baseType: !121, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !298, line: 38, size: 64, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !309, file: !298, line: 39, baseType: !301, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !309, file: !298, line: 41, baseType: !313, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !298, line: 35, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !307}
!317 = !{!318, !322, !330, !288, !332, !342}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "latency_lock", scope: !290, file: !320, line: 44, type: !321, isLocal: true, isDefinition: true)
!320 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !257, line: 43, elements: !258)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !290, file: !320, line: 46, type: !324, isLocal: true, isDefinition: true)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !239, line: 40, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !239, line: 35, size: 64, elements: !326)
!326 = !{!327, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !325, file: !239, line: 36, baseType: !328, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !325, file: !239, line: 37, baseType: !328, size: 32, offset: 32)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "latency_subs", scope: !290, file: !320, line: 52, type: !324, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !290, file: !320, line: 39, type: !334, isLocal: true, isDefinition: true)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, elements: !340)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 35, size: 96, elements: !336)
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !335, file: !320, line: 36, baseType: !204, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !335, file: !320, line: 37, baseType: !154, size: 8, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !335, file: !320, line: 38, baseType: !283, size: 32, offset: 64)
!340 = !{!341}
!341 = !DISubrange(count: 0)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !290, file: !320, line: 48, type: !307, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !346, file: !353, line: 47, type: !367, isLocal: true, isDefinition: true)
!346 = distinct !DICompileUnit(language: DW_LANG_C99, file: !347, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !348, retainedTypes: !349, globals: !350, splitDebugInlining: false, nameTableKind: None)
!347 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!348 = !{!204}
!349 = !{!294, !103}
!350 = !{!351, !344, !363}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "cpus_states", scope: !346, file: !353, line: 50, type: !354, isLocal: true, isDefinition: true)
!353 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 32, elements: !270)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !205, line: 114, size: 128, elements: !358)
!358 = !{!359, !360, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !357, file: !205, line: 115, baseType: !204, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !357, file: !205, line: 141, baseType: !154, size: 8, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !357, file: !205, line: 149, baseType: !121, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !357, file: !205, line: 156, baseType: !121, size: 32, offset: 96)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !346, file: !353, line: 55, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 8, elements: !270)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, elements: !340)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "action_target_state", scope: !370, file: !386, line: 14, type: !387, isLocal: true, isDefinition: true)
!370 = distinct !DICompileUnit(language: DW_LANG_C99, file: !371, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !372, retainedTypes: !382, globals: !383, splitDebugInlining: false, nameTableKind: None)
!371 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!372 = !{!215, !222, !373, !30}
!373 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_flag", file: !216, line: 30, baseType: !32, size: 32, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380, !381}
!375 = !DIEnumerator(name: "PM_DEVICE_FLAG_BUSY", value: 0)
!376 = !DIEnumerator(name: "PM_DEVICE_FLAG_TURN_ON_FAILED", value: 1)
!377 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_CAPABLE", value: 2)
!378 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_ENABLED", value: 3)
!379 = !DIEnumerator(name: "PM_DEVICE_FLAG_RUNTIME_ENABLED", value: 4)
!380 = !DIEnumerator(name: "PM_DEVICE_FLAG_STATE_LOCKED", value: 5)
!381 = !DIEnumerator(name: "PM_DEVICE_FLAG_PD", value: 6)
!382 = !{!102, !103, !24, !294}
!383 = !{!368, !384}
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "action_expected_state", scope: !370, file: !386, line: 20, type: !387, isLocal: true, isDefinition: true)
!386 = !DIFile(filename: "zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 128, elements: !389)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!389 = !{!390}
!390 = !DISubrange(count: 4)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "static_regions", scope: !393, file: !400, line: 62, type: !535, isLocal: true, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !395, globals: !396, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!395 = !{!294, !103, !121, !102}
!396 = !{!397, !391}
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !399, file: !400, line: 198, type: !523, isLocal: true, isDefinition: true)
!399 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !400, file: !400, line: 175, type: !401, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !518)
!400 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !DISubroutineType(types: !402)
!402 = !{null, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !405, line: 245, size: 1024, elements: !406)
!405 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = !{!407, !474, !487, !488, !489, !490, !496, !513}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !404, file: !405, line: 247, baseType: !408, size: 384)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !405, line: 57, size: 384, elements: !409)
!409 = !{!410, !438, !446, !447, !448, !461, !462, !463}
!410 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !405, line: 60, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !408, file: !405, line: 60, size: 64, elements: !412)
!412 = !{!413, !429}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !411, file: !405, line: 61, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !415, line: 49, baseType: !416)
!415 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !415, line: 37, size: 64, elements: !417)
!417 = !{!418, !424}
!418 = !DIDerivedType(tag: DW_TAG_member, scope: !416, file: !415, line: 38, baseType: !419, size: 32)
!419 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !416, file: !415, line: 38, size: 32, elements: !420)
!420 = !{!421, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !419, file: !415, line: 39, baseType: !422, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !419, file: !415, line: 40, baseType: !422, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, scope: !416, file: !415, line: 42, baseType: !425, size: 32, offset: 32)
!425 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !416, file: !415, line: 42, size: 32, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !425, file: !415, line: 43, baseType: !422, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !425, file: !415, line: 44, baseType: !422, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !411, file: !405, line: 62, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !431, line: 49, size: 64, elements: !432)
!431 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !430, file: !431, line: 50, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 64, elements: !436)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!436 = !{!437}
!437 = !DISubrange(count: 2)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !408, file: !405, line: 68, baseType: !439, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !441, line: 233, baseType: !442)
!441 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 231, size: 64, elements: !443)
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !442, file: !441, line: 232, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !415, line: 48, baseType: !416)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !408, file: !405, line: 71, baseType: !154, size: 8, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !408, file: !405, line: 74, baseType: !154, size: 8, offset: 104)
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !405, line: 90, baseType: !449, size: 16, offset: 112)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !408, file: !405, line: 90, size: 16, elements: !450)
!450 = !{!451, !458}
!451 = !DIDerivedType(tag: DW_TAG_member, scope: !449, file: !405, line: 91, baseType: !452, size: 16)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !405, line: 91, size: 16, elements: !453)
!453 = !{!454, !457}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !452, file: !405, line: 96, baseType: !455, size: 8)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !456)
!456 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !452, file: !405, line: 97, baseType: !154, size: 8, offset: 8)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !449, file: !405, line: 100, baseType: !459, size: 16)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !460)
!460 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !408, file: !405, line: 107, baseType: !121, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !408, file: !405, line: 127, baseType: !102, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !408, file: !405, line: 131, baseType: !464, size: 192, offset: 192)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !441, line: 244, size: 192, elements: !465)
!465 = !{!466, !467, !473}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !464, file: !441, line: 245, baseType: !414, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !464, file: !441, line: 246, baseType: !468, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !441, line: 242, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !464, file: !441, line: 249, baseType: !231, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !404, file: !405, line: 250, baseType: !475, size: 288, offset: 384)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !476, line: 25, size: 288, elements: !477)
!476 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !475, file: !476, line: 26, baseType: !121, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !475, file: !476, line: 27, baseType: !121, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !475, file: !476, line: 28, baseType: !121, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !475, file: !476, line: 29, baseType: !121, size: 32, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !475, file: !476, line: 30, baseType: !121, size: 32, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !475, file: !476, line: 31, baseType: !121, size: 32, offset: 160)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !475, file: !476, line: 32, baseType: !121, size: 32, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !475, file: !476, line: 33, baseType: !121, size: 32, offset: 224)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !475, file: !476, line: 34, baseType: !121, size: 32, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !404, file: !405, line: 253, baseType: !102, size: 32, offset: 672)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !404, file: !405, line: 256, baseType: !440, size: 64, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !404, file: !405, line: 294, baseType: !103, size: 32, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !404, file: !405, line: 300, baseType: !491, size: 96, offset: 800)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !405, line: 149, size: 96, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !491, file: !405, line: 153, baseType: !22, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !491, file: !405, line: 162, baseType: !294, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !491, file: !405, line: 168, baseType: !294, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !404, file: !405, line: 325, baseType: !497, size: 32, offset: 896)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !499, line: 5073, size: 160, elements: !500)
!499 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!500 = !{!501, !510, !511}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !498, file: !499, line: 5074, baseType: !502, size: 96)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !503, line: 56, size: 96, elements: !504)
!503 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!504 = !{!505, !508, !509}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !502, file: !503, line: 57, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !503, line: 57, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !502, file: !503, line: 58, baseType: !102, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !502, file: !503, line: 59, baseType: !294, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !498, file: !499, line: 5075, baseType: !440, size: 64, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !498, file: !499, line: 5076, baseType: !512, offset: 160)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !257, line: 43, elements: !258)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !404, file: !405, line: 343, baseType: !514, size: 64, offset: 928)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !476, line: 60, size: 64, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !514, file: !476, line: 63, baseType: !121, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !514, file: !476, line: 66, baseType: !121, size: 32, offset: 32)
!518 = !{!519, !520, !521, !522}
!519 = !DILocalVariable(name: "thread", arg: 1, scope: !399, file: !400, line: 175, type: !403)
!520 = !DILocalVariable(name: "region_num", scope: !399, file: !400, line: 200, type: !154)
!521 = !DILocalVariable(name: "guard_start", scope: !399, file: !400, line: 265, type: !22)
!522 = !DILocalVariable(name: "guard_size", scope: !399, file: !400, line: 266, type: !294)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 96, elements: !270)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !525, line: 52, size: 96, elements: !526)
!525 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!526 = !{!527, !528, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !524, file: !525, line: 53, baseType: !22, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !524, file: !525, line: 54, baseType: !294, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !524, file: !525, line: 55, baseType: !530, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !531, line: 151, baseType: !532)
!531 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 149, size: 32, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !532, file: !531, line: 150, baseType: !121, size: 32)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 96, elements: !270)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !539, file: !572, line: 39, type: !154, isLocal: true, isDefinition: true)
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !541, globals: !571, splitDebugInlining: false, nameTableKind: None)
!540 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!541 = !{!542, !102, !103, !559, !154}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !544, line: 1226, baseType: !545)
!544 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !544, line: 1213, size: 352, elements: !546)
!546 = !{!547, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !545, file: !544, line: 1215, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !545, file: !544, line: 1216, baseType: !120, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !545, file: !544, line: 1217, baseType: !120, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !545, file: !544, line: 1218, baseType: !120, size: 32, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !545, file: !544, line: 1219, baseType: !120, size: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !545, file: !544, line: 1220, baseType: !120, size: 32, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !545, file: !544, line: 1221, baseType: !120, size: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !545, file: !544, line: 1222, baseType: !120, size: 32, offset: 224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !545, file: !544, line: 1223, baseType: !120, size: 32, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !545, file: !544, line: 1224, baseType: !120, size: 32, offset: 288)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !545, file: !544, line: 1225, baseType: !120, size: 32, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !562, line: 27, size: 96, elements: !563)
!562 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !561, file: !562, line: 29, baseType: !121, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !561, file: !562, line: 31, baseType: !144, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !561, file: !562, line: 37, baseType: !567, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !531, line: 146, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !531, line: 141, size: 32, elements: !569)
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !568, file: !531, line: 143, baseType: !121, size: 32)
!571 = !{!537}
!572 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !575, file: !582, line: 21, type: !106, isLocal: true, isDefinition: true)
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !577, globals: !581, splitDebugInlining: false, nameTableKind: None)
!576 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!577 = !{!578, !103, !102}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !580, line: 22, baseType: !103)
!580 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!581 = !{!573}
!582 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !585, file: !590, line: 13, type: !607, isLocal: true, isDefinition: true)
!585 = distinct !DICompileUnit(language: DW_LANG_C99, file: !586, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !587, splitDebugInlining: false, nameTableKind: None)
!586 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!587 = !{!588, !583}
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "mpu_config", scope: !585, file: !590, line: 37, type: !591, isLocal: false, isDefinition: true)
!590 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !562, line: 41, size: 64, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !592, file: !562, line: 43, baseType: !121, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !592, file: !562, line: 45, baseType: !596, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !562, line: 27, size: 96, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !598, file: !562, line: 29, baseType: !121, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !598, file: !562, line: 31, baseType: !144, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !598, file: !562, line: 37, baseType: !603, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !531, line: 146, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !531, line: 141, size: 32, elements: !605)
!605 = !{!606}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !604, file: !531, line: 143, baseType: !121, size: 32)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 192, elements: !436)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !610, file: !723, line: 72, type: !805, isLocal: true, isDefinition: true)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !612, retainedTypes: !709, globals: !720, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!612 = !{!30, !613}
!613 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!615 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!616 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!617 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!618 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!619 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!620 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!621 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!622 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!623 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!624 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!625 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!626 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!627 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!628 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!629 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!630 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!631 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!632 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!633 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!634 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!635 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!636 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!637 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!638 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!639 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!640 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!641 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!642 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!643 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!644 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!645 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!646 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!647 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!648 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!649 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!650 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!651 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!652 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!653 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!654 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!655 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!656 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!657 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!658 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!659 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!660 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!661 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!662 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!663 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!664 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!665 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!666 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!667 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!668 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!669 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!670 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!671 = !DIEnumerator(name: "FMC_IRQn", value: 48)
!672 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!673 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!674 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!675 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!676 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!677 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!678 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!679 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!680 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!681 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!682 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!683 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!684 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!685 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!686 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!687 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!688 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!689 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!690 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!691 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!692 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!693 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!694 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!695 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!696 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!697 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!698 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!699 = !DIEnumerator(name: "DCMI_IRQn", value: 78)
!700 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!701 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!702 = !DIEnumerator(name: "SAI1_IRQn", value: 87)
!703 = !DIEnumerator(name: "SAI2_IRQn", value: 91)
!704 = !DIEnumerator(name: "QUADSPI_IRQn", value: 92)
!705 = !DIEnumerator(name: "CEC_IRQn", value: 93)
!706 = !DIEnumerator(name: "SPDIF_RX_IRQn", value: 94)
!707 = !DIEnumerator(name: "FMPI2C1_EV_IRQn", value: 95)
!708 = !DIEnumerator(name: "FMPI2C1_ER_IRQn", value: 96)
!709 = !{!294, !103, !102, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 392, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 384, size: 192, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !712, file: !116, line: 386, baseType: !120, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !712, file: !116, line: 387, baseType: !120, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !712, file: !116, line: 388, baseType: !120, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !712, file: !116, line: 389, baseType: !120, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !712, file: !116, line: 390, baseType: !120, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !712, file: !116, line: 391, baseType: !120, size: 32, offset: 160)
!720 = !{!721, !725, !742, !753, !770, !608, !772, !785, !787, !789, !791, !793, !795, !797, !799, !801, !803}
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !610, file: !723, line: 424, type: !724, isLocal: false, isDefinition: true, align: 16)
!723 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !389)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "__device_dts_ord_36", scope: !610, file: !723, line: 424, type: !727, isLocal: false, isDefinition: true, align: 32)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 224, elements: !729)
!729 = !{!730, !731, !732, !733, !739, !740, !741}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !728, file: !141, line: 380, baseType: !144, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !728, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !728, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !728, file: !141, line: 386, baseType: !734, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !736)
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !735, file: !141, line: 359, baseType: !154, size: 8)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !735, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !728, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !728, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !728, file: !141, line: 403, baseType: !166, size: 32, offset: 192)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_36", scope: !610, file: !723, line: 424, type: !744, isLocal: true, isDefinition: true, align: 32)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !746)
!746 = !{!747, !752}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !745, file: !132, line: 60, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DISubroutineType(types: !750)
!750 = !{!103, !751}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !745, file: !132, line: 65, baseType: !751, size: 32, offset: 32)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "exti_data", scope: !610, file: !723, line: 423, type: !755, isLocal: true, isDefinition: true)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !723, line: 107, size: 1472, elements: !756)
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !755, file: !723, line: 109, baseType: !758, size: 1472)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 1472, elements: !768)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !723, line: 101, size: 64, elements: !760)
!760 = !{!761, !767}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !759, file: !723, line: 102, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !763, line: 63, baseType: !764)
!763 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !103, !102}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !759, file: !723, line: 103, baseType: !102, size: 32, offset: 32)
!768 = !{!769}
!769 = !DISubrange(count: 23)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_36", scope: !610, file: !723, line: 424, type: !735, isLocal: true, isDefinition: true, align: 8)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !774, file: !723, line: 493, type: !779, isLocal: true, isDefinition: true, align: 32)
!774 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !723, file: !723, line: 460, type: !775, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !610, retainedNodes: !777)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !751}
!777 = !{!778}
!778 = !DILocalVariable(name: "dev", arg: 1, scope: !774, file: !723, line: 460, type: !751)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !780)
!780 = !{!781, !782, !783, !784}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !779, file: !10, line: 55, baseType: !307, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !779, file: !10, line: 57, baseType: !307, size: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !779, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !779, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !774, file: !723, line: 497, type: !779, isLocal: true, isDefinition: true, align: 32)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !774, file: !723, line: 507, type: !779, isLocal: true, isDefinition: true, align: 32)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !774, file: !723, line: 512, type: !779, isLocal: true, isDefinition: true, align: 32)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !774, file: !723, line: 516, type: !779, isLocal: true, isDefinition: true, align: 32)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !774, file: !723, line: 523, type: !779, isLocal: true, isDefinition: true, align: 32)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !774, file: !723, line: 527, type: !779, isLocal: true, isDefinition: true, align: 32)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !774, file: !723, line: 581, type: !779, isLocal: true, isDefinition: true, align: 32)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !774, file: !723, line: 586, type: !779, isLocal: true, isDefinition: true, align: 32)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !774, file: !723, line: 591, type: !779, isLocal: true, isDefinition: true, align: 32)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !774, file: !723, line: 595, type: !779, isLocal: true, isDefinition: true, align: 32)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 736, elements: !768)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 163, baseType: !613)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !810, file: !815, line: 25, type: !843, isLocal: false, isDefinition: true, align: 16)
!810 = distinct !DICompileUnit(language: DW_LANG_C99, file: !811, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !812, splitDebugInlining: false, nameTableKind: None)
!811 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!812 = !{!813, !808, !819, !821, !823, !825, !827, !829, !831, !833, !835, !837, !839, !841}
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !810, file: !815, line: 20, type: !816, isLocal: false, isDefinition: true, align: 16)
!815 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 240, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 15)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_96", scope: !810, file: !815, line: 32, type: !724, isLocal: false, isDefinition: true, align: 16)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_95", scope: !810, file: !815, line: 39, type: !724, isLocal: false, isDefinition: true, align: 16)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_94", scope: !810, file: !815, line: 46, type: !724, isLocal: false, isDefinition: true, align: 16)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_93", scope: !810, file: !815, line: 53, type: !724, isLocal: false, isDefinition: true, align: 16)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !810, file: !815, line: 60, type: !724, isLocal: false, isDefinition: true, align: 16)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_92", scope: !810, file: !815, line: 67, type: !724, isLocal: false, isDefinition: true, align: 16)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_91", scope: !810, file: !815, line: 74, type: !724, isLocal: false, isDefinition: true, align: 16)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_90", scope: !810, file: !815, line: 81, type: !724, isLocal: false, isDefinition: true, align: 16)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_48", scope: !810, file: !815, line: 88, type: !724, isLocal: false, isDefinition: true, align: 16)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !810, file: !815, line: 95, type: !724, isLocal: false, isDefinition: true, align: 16)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !810, file: !815, line: 102, type: !724, isLocal: false, isDefinition: true, align: 16)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_52", scope: !810, file: !815, line: 109, type: !724, isLocal: false, isDefinition: true, align: 16)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 3)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !848, file: !913, line: 398, type: !947, isLocal: true, isDefinition: true)
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !850, retainedTypes: !863, globals: !910, splitDebugInlining: false, nameTableKind: None)
!849 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!850 = !{!851, !30, !856}
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !852, line: 197, baseType: !32, size: 32, elements: !853)
!852 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!853 = !{!854, !855}
!854 = !DIEnumerator(name: "SUCCESS", value: 0)
!855 = !DIEnumerator(name: "ERROR", value: 1)
!856 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !857, line: 44, baseType: !32, size: 32, elements: !858)
!857 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!858 = !{!859, !860, !861, !862}
!859 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!860 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!861 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!862 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!863 = !{!102, !103, !121, !864, !903, !909}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 586, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 550, size: 1216, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !866, file: !116, line: 552, baseType: !120, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !866, file: !116, line: 553, baseType: !120, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !866, file: !116, line: 554, baseType: !120, size: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !866, file: !116, line: 555, baseType: !120, size: 32, offset: 96)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !866, file: !116, line: 556, baseType: !120, size: 32, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !866, file: !116, line: 557, baseType: !120, size: 32, offset: 160)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !866, file: !116, line: 558, baseType: !120, size: 32, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !866, file: !116, line: 559, baseType: !121, size: 32, offset: 224)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !866, file: !116, line: 560, baseType: !120, size: 32, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !866, file: !116, line: 561, baseType: !120, size: 32, offset: 288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !866, file: !116, line: 562, baseType: !879, size: 64, offset: 320)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !436)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !866, file: !116, line: 563, baseType: !120, size: 32, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !866, file: !116, line: 564, baseType: !120, size: 32, offset: 416)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !866, file: !116, line: 565, baseType: !120, size: 32, offset: 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !866, file: !116, line: 566, baseType: !121, size: 32, offset: 480)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !866, file: !116, line: 567, baseType: !120, size: 32, offset: 512)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !866, file: !116, line: 568, baseType: !120, size: 32, offset: 544)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !866, file: !116, line: 569, baseType: !879, size: 64, offset: 576)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !866, file: !116, line: 570, baseType: !120, size: 32, offset: 640)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !866, file: !116, line: 571, baseType: !120, size: 32, offset: 672)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !866, file: !116, line: 572, baseType: !120, size: 32, offset: 704)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !866, file: !116, line: 573, baseType: !121, size: 32, offset: 736)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !866, file: !116, line: 574, baseType: !120, size: 32, offset: 768)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !866, file: !116, line: 575, baseType: !120, size: 32, offset: 800)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !866, file: !116, line: 576, baseType: !879, size: 64, offset: 832)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !866, file: !116, line: 577, baseType: !120, size: 32, offset: 896)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !866, file: !116, line: 578, baseType: !120, size: 32, offset: 928)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !866, file: !116, line: 579, baseType: !879, size: 64, offset: 960)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !866, file: !116, line: 580, baseType: !120, size: 32, offset: 1024)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !866, file: !116, line: 581, baseType: !120, size: 32, offset: 1056)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSAICFGR", scope: !866, file: !116, line: 582, baseType: !120, size: 32, offset: 1088)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !866, file: !116, line: 583, baseType: !120, size: 32, offset: 1120)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "CKGATENR", scope: !866, file: !116, line: 584, baseType: !120, size: 32, offset: 1152)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR2", scope: !866, file: !116, line: 585, baseType: !120, size: 32, offset: 1184)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !905, line: 343, size: 64, elements: !906)
!905 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !904, file: !905, line: 344, baseType: !121, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !904, file: !905, line: 345, baseType: !121, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!910 = !{!911, !917, !934, !945, !846}
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !848, file: !913, line: 752, type: !914, isLocal: false, isDefinition: true, align: 16)
!913 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 800, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 50)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !848, file: !913, line: 752, type: !919, isLocal: false, isDefinition: true, align: 32)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 224, elements: !921)
!921 = !{!922, !923, !924, !925, !931, !932, !933}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !920, file: !141, line: 380, baseType: !144, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !920, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !920, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !920, file: !141, line: 386, baseType: !926, size: 32, offset: 96)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !927, file: !141, line: 359, baseType: !154, size: 8)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !927, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !920, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !920, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !920, file: !141, line: 403, baseType: !166, size: 32, offset: 192)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !848, file: !913, line: 752, type: !936, isLocal: true, isDefinition: true, align: 32)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !938)
!938 = !{!939, !944}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !937, file: !132, line: 60, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(types: !942)
!942 = !{!103, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !937, file: !132, line: 65, baseType: !943, size: 32, offset: 32)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !848, file: !913, line: 752, type: !927, isLocal: true, isDefinition: true, align: 8)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !857, line: 100, size: 224, elements: !948)
!948 = !{!949, !955, !956, !965, !970, !975, !981}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !947, file: !857, line: 101, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !857, line: 76, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{!103, !943, !954}
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !857, line: 56, baseType: !102)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !947, file: !857, line: 102, baseType: !950, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !947, file: !857, line: 103, baseType: !957, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !857, line: 83, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = !DISubroutineType(types: !960)
!960 = !{!103, !943, !954, !961, !102}
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !857, line: 72, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !943, !954, !102}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !947, file: !857, line: 104, baseType: !966, size: 32, offset: 96)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !857, line: 79, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{!103, !943, !954, !909}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !947, file: !857, line: 105, baseType: !971, size: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !857, line: 88, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DISubroutineType(types: !974)
!974 = !{!856, !943, !954}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !947, file: !857, line: 106, baseType: !976, size: 32, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !857, line: 92, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DISubroutineType(types: !979)
!979 = !{!103, !943, !954, !980}
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !857, line: 64, baseType: !102)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !947, file: !857, line: 107, baseType: !982, size: 32, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !857, line: 96, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = !DISubroutineType(types: !985)
!985 = !{!103, !943, !954, !102}
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !988, file: !1046, line: 603, type: !1048, isLocal: true, isDefinition: true, align: 32)
!988 = distinct !DICompileUnit(language: DW_LANG_C99, file: !989, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !990, globals: !1043, splitDebugInlining: false, nameTableKind: None)
!989 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_stm32_sensor_mez/boards/stm32/power_mgmt/blinky")
!990 = !{!102, !103, !991}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !994, line: 336, size: 160, elements: !995)
!994 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!995 = !{!996, !1017, !1021, !1025, !1038}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !993, file: !994, line: 365, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!998 = !DISubroutineType(types: !999)
!999 = !{!103, !1000, !1016}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 224, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1013, !1014, !1015}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1002, file: !141, line: 380, baseType: !144, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1002, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1002, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1002, file: !141, line: 386, baseType: !1008, size: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1009, file: !141, line: 359, baseType: !154, size: 8)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1009, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1002, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1002, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !1002, file: !141, line: 403, baseType: !166, size: 32, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !993, file: !994, line: 366, baseType: !1018, size: 32, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{null, !1000, !155}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !993, file: !994, line: 374, baseType: !1022, size: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!103, !1000}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !993, file: !994, line: 377, baseType: !1026, size: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 32)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!103, !1000, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !994, line: 122, size: 64, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1031, file: !994, line: 123, baseType: !121, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1031, file: !994, line: 124, baseType: !154, size: 8, offset: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1031, file: !994, line: 125, baseType: !154, size: 8, offset: 40)
