; ModuleID = './build/spi_slave_from_master.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_cache_region_config_t = type { i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (%struct._reent*)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque

!41 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!42 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!43 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!44 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!45 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!46 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!47 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!48 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!49 = !{!5, !12, !50, !52, !54, !56, !8}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !9, line: 113, baseType: !53)
!53 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !9, line: 59, baseType: !55)
!55 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!58 = !{!21}
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !61, file: !62, line: 51, type: !143, isLocal: false, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !63, retainedTypes: !111, globals: !142, splitDebugInlining: false, nameTableKind: None)
!62 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!63 = !{!64, !76, !95, !102}
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 163, baseType: !66, size: 32, elements: !67)
!65 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75}
!68 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!69 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!70 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!71 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!72 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!73 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!74 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!75 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 186, baseType: !7, size: 32, elements: !77)
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!78 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!79 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!80 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!81 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!82 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!83 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!84 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!85 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!86 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!87 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!88 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!89 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!90 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!91 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!92 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!93 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!94 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 176, baseType: !7, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101}
!97 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!98 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!99 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!100 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!101 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 99, baseType: !7, size: 32, elements: !104)
!103 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!104 = !{!105, !106, !107, !108, !109, !110}
!105 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!106 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!107 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!108 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!109 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!110 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!111 = !{!112, !141}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !114, line: 72, baseType: !115)
!114 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 56, size: 525312, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !131, !132, !136, !140}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !115, file: !114, line: 57, baseType: !11, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !115, file: !114, line: 58, baseType: !11, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !115, file: !114, line: 59, baseType: !11, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !115, file: !114, line: 60, baseType: !11, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !115, file: !114, line: 61, baseType: !11, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !115, file: !114, line: 62, baseType: !11, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !115, file: !114, line: 63, baseType: !11, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !115, file: !114, line: 64, baseType: !11, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !115, file: !114, line: 65, baseType: !11, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !115, file: !114, line: 66, baseType: !11, size: 32, offset: 288)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !115, file: !114, line: 67, baseType: !128, size: 32, offset: 320)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 1)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !115, file: !114, line: 68, baseType: !11, size: 32, offset: 352)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !115, file: !114, line: 69, baseType: !133, size: 523904, offset: 384)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 523904, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 16372)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !115, file: !114, line: 70, baseType: !137, size: 512, offset: 524288)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 512, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 16)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !115, file: !114, line: 71, baseType: !137, size: 512, offset: 524800)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!142 = !{!59}
!143 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !144)
!144 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !147, file: !148, line: 53, type: !284, isLocal: false, isDefinition: true)
!147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !148, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !203, globals: !283, splitDebugInlining: false, nameTableKind: None)
!148 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!149 = !{!150, !158}
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !151, line: 152, baseType: !66, size: 32, elements: !152)
!151 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!152 = !{!153, !154, !155, !156, !157}
!153 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!154 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!155 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!156 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!157 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !159, line: 47, baseType: !66, size: 32, elements: !160)
!159 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!161 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!162 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!163 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!164 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!165 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!166 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!167 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!168 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!169 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!170 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!171 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!172 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!173 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!174 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!175 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!176 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!177 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!178 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!179 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!180 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!181 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!182 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!183 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!184 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!185 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!186 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!187 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!188 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!189 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!190 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!191 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!192 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!193 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!194 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!195 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!196 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!197 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!198 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!199 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!200 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!201 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!202 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!203 = !{!204, !141, !12, !206, !208, !244}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !159, line: 97, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !159, line: 95, baseType: !158)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !13, line: 44, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !15, line: 77, baseType: !66)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !210, line: 378, baseType: !211)
!210 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 363, size: 28704, elements: !212)
!212 = !{!213, !217, !221, !222, !223, !224, !225, !226, !227, !228, !232, !239, !243}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !211, file: !210, line: 365, baseType: !214, size: 256)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 8)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !211, file: !210, line: 366, baseType: !218, size: 768, offset: 256)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 24)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !211, file: !210, line: 367, baseType: !214, size: 256, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !211, file: !210, line: 368, baseType: !218, size: 768, offset: 1280)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !211, file: !210, line: 369, baseType: !214, size: 256, offset: 2048)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !211, file: !210, line: 370, baseType: !218, size: 768, offset: 2304)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !211, file: !210, line: 371, baseType: !214, size: 256, offset: 3072)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !211, file: !210, line: 372, baseType: !218, size: 768, offset: 3328)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !211, file: !210, line: 373, baseType: !214, size: 256, offset: 4096)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !211, file: !210, line: 374, baseType: !229, size: 1792, offset: 4352)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1792, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 56)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !211, file: !210, line: 375, baseType: !233, size: 1920, offset: 6144)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 1920, elements: !237)
!234 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 43, baseType: !55)
!237 = !{!238}
!238 = !DISubrange(count: 240)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !211, file: !210, line: 376, baseType: !240, size: 20608, offset: 8064)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 20608, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 644)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !211, file: !210, line: 377, baseType: !11, size: 32, offset: 28672)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !210, line: 418, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 395, size: 1120, elements: !247)
!247 = !{!248, !250, !251, !252, !253, !254, !255, !259, !260, !261, !262, !263, !264, !265, !266, !270, !271, !272, !276, !280, !282}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !246, file: !210, line: 397, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !246, file: !210, line: 398, baseType: !11, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !246, file: !210, line: 399, baseType: !11, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !246, file: !210, line: 400, baseType: !11, size: 32, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !246, file: !210, line: 401, baseType: !11, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !246, file: !210, line: 402, baseType: !11, size: 32, offset: 160)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !246, file: !210, line: 403, baseType: !256, size: 96, offset: 192)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 96, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 12)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !246, file: !210, line: 404, baseType: !11, size: 32, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !246, file: !210, line: 405, baseType: !11, size: 32, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !246, file: !210, line: 406, baseType: !11, size: 32, offset: 352)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !246, file: !210, line: 407, baseType: !11, size: 32, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !246, file: !210, line: 408, baseType: !11, size: 32, offset: 416)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !246, file: !210, line: 409, baseType: !11, size: 32, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !246, file: !210, line: 410, baseType: !11, size: 32, offset: 480)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !246, file: !210, line: 411, baseType: !267, size: 64, offset: 512)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 64, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 2)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !246, file: !210, line: 412, baseType: !249, size: 32, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !246, file: !210, line: 413, baseType: !249, size: 32, offset: 608)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !246, file: !210, line: 414, baseType: !273, size: 128, offset: 640)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 128, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 4)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !246, file: !210, line: 415, baseType: !277, size: 160, offset: 768)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 160, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 5)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !246, file: !210, line: 416, baseType: !281, size: 160, offset: 928)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !278)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !246, file: !210, line: 417, baseType: !11, size: 32, offset: 1088)
!283 = !{!145}
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 6144, elements: !293)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !148, line: 50, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 47, size: 64, elements: !287)
!287 = !{!288, !292}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !286, file: !148, line: 48, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !204}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !286, file: !148, line: 49, baseType: !12, size: 32, offset: 32)
!293 = !{!294}
!294 = !DISubrange(count: 96)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "g_spis_callback", scope: !297, file: !298, line: 42, type: !326, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !299, retainedTypes: !321, globals: !323, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_spi_slave.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!299 = !{!300, !308, !313, !317, !158}
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 528, baseType: !66, size: 32, elements: !302)
!301 = !DIFile(filename: "../../../../../driver/chip/inc/hal_spi_slave.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!302 = !{!303, !304, !305, !306, !307}
!303 = !DIEnumerator(name: "HAL_SPI_SLAVE_STATUS_ERROR", value: -4)
!304 = !DIEnumerator(name: "HAL_SPI_SLAVE_STATUS_ERROR_BUSY", value: -3)
!305 = !DIEnumerator(name: "HAL_SPI_SLAVE_STATUS_ERROR_PORT", value: -2)
!306 = !DIEnumerator(name: "HAL_SPI_SLAVE_STATUS_INVALID_PARAMETER", value: -1)
!307 = !DIEnumerator(name: "HAL_SPI_SLAVE_STATUS_OK", value: 0)
!308 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !309, line: 518, baseType: !7, size: 32, elements: !310)
!309 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!310 = !{!311, !312}
!311 = !DIEnumerator(name: "HAL_SPI_SLAVE_0", value: 0)
!312 = !DIEnumerator(name: "HAL_SPI_SLAVE_MAX", value: 1)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !309, line: 524, baseType: !7, size: 32, elements: !314)
!314 = !{!315, !316}
!315 = !DIEnumerator(name: "HAL_SPI_SLAVE_CLOCK_POLARITY0", value: 0)
!316 = !DIEnumerator(name: "HAL_SPI_SLAVE_CLOCK_POLARITY1", value: 1)
!317 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !309, line: 531, baseType: !7, size: 32, elements: !318)
!318 = !{!319, !320}
!319 = !DIEnumerator(name: "HAL_SPI_SLAVE_CLOCK_PHASE0", value: 0)
!320 = !DIEnumerator(name: "HAL_SPI_SLAVE_CLOCK_PHASE1", value: 1)
!321 = !{!322, !12, !141}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!323 = !{!295, !324}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "g_spis_user_data", scope: !297, file: !298, line: 43, type: !141, isLocal: true, isDefinition: true)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_spi_slave_callback_t", file: !301, line: 590, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !141}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !332, file: !333, line: 77, type: !401, isLocal: true, isDefinition: true)
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !334, retainedTypes: !384, globals: !386, splitDebugInlining: false, nameTableKind: None)
!333 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!334 = !{!335, !343, !348, !364, !370, !374, !26, !32, !379}
!335 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 345, baseType: !66, size: 32, elements: !337)
!336 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!337 = !{!338, !339, !340, !341, !342}
!338 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!339 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!340 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!341 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!342 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !309, line: 109, baseType: !7, size: 32, elements: !344)
!344 = !{!345, !346, !347}
!345 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!346 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!347 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 302, baseType: !7, size: 32, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!350 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!351 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!352 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!353 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!354 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!355 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!356 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!357 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!358 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!359 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!360 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!361 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!362 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!363 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 321, baseType: !7, size: 32, elements: !365)
!365 = !{!366, !367, !368, !369}
!366 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!367 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!368 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!369 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 330, baseType: !7, size: 32, elements: !371)
!371 = !{!372, !373}
!372 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!373 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 337, baseType: !7, size: 32, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!377 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!378 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 355, baseType: !66, size: 32, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!382 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!383 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!384 = !{!7, !141, !55, !385, !235}
!385 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!386 = !{!330, !387}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "func_tbl", scope: !389, file: !333, line: 536, type: !399, isLocal: true, isDefinition: true)
!389 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !333, file: !333, line: 534, type: !390, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !332, retainedNodes: !397)
!390 = !DISubroutineType(types: !391)
!391 = !{!392, !396}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !33, line: 197, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DISubroutineType(types: !395)
!395 = !{null}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !309, line: 113, baseType: !343)
!397 = !{!398}
!398 = !DILocalVariable(name: "uart_port", arg: 1, scope: !389, file: !333, line: 534, type: !396)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 64, elements: !268)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 1024, elements: !268)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !333, line: 75, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 68, size: 512, elements: !404)
!404 = !{!405, !406, !418, !419, !430, !431}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !403, file: !333, line: 69, baseType: !144, size: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !403, file: !333, line: 70, baseType: !407, size: 128, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !336, line: 378, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 373, size: 128, elements: !409)
!409 = !{!410, !412, !414, !416}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !408, file: !336, line: 374, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !336, line: 317, baseType: !348)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !408, file: !336, line: 375, baseType: !413, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !336, line: 326, baseType: !364)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !408, file: !336, line: 376, baseType: !415, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !336, line: 333, baseType: !370)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !408, file: !336, line: 377, baseType: !417, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !336, line: 341, baseType: !374)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !403, file: !333, line: 71, baseType: !144, size: 8, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !403, file: !333, line: 72, baseType: !420, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !333, line: 66, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 63, size: 64, elements: !422)
!422 = !{!423, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !421, file: !333, line: 64, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !336, line: 410, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !428, !141}
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !336, line: 359, baseType: !379)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !421, file: !333, line: 65, baseType: !141, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !403, file: !333, line: 73, baseType: !144, size: 8, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !403, file: !333, line: 74, baseType: !432, size: 224, offset: 288)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !336, line: 390, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 382, size: 224, elements: !434)
!434 = !{!435, !437, !438, !439, !440, !441, !442}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !433, file: !336, line: 383, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !433, file: !336, line: 384, baseType: !12, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !433, file: !336, line: 385, baseType: !12, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !433, file: !336, line: 386, baseType: !436, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !433, file: !336, line: 387, baseType: !12, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !433, file: !336, line: 388, baseType: !12, size: 32, offset: 160)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !433, file: !336, line: 389, baseType: !12, size: 32, offset: 192)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "slaver_data_buffer", scope: !445, file: !446, line: 91, type: !483, isLocal: true, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !447, retainedTypes: !479, globals: !480, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/spi_slave_from_master/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!447 = !{!343, !348, !364, !370, !374, !448, !313, !317, !300, !308}
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !309, line: 249, baseType: !7, size: 32, elements: !449)
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!450 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!451 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!452 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!453 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!454 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!455 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!456 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!457 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!458 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!459 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!460 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!461 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!462 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!463 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!464 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!465 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!466 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!467 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!468 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!469 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!470 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!471 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!472 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!473 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!474 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!475 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!476 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!477 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!478 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!479 = !{!141, !322, !66, !7}
!480 = !{!443, !481}
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "transfer_data_finished", scope: !445, file: !446, line: 70, type: !143, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 163904, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 20488)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !488, file: !489, line: 59, type: !12, isLocal: false, isDefinition: true)
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !490, globals: !543, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/spi_slave_from_master/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!490 = !{!491, !499, !524}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !210, line: 656, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 650, size: 128, elements: !494)
!494 = !{!495, !496, !497, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !493, file: !210, line: 652, baseType: !11, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !493, file: !210, line: 653, baseType: !11, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !493, file: !210, line: 654, baseType: !11, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !493, file: !210, line: 655, baseType: !249, size: 32, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !210, line: 418, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 395, size: 1120, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !501, file: !210, line: 397, baseType: !249, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !501, file: !210, line: 398, baseType: !11, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !501, file: !210, line: 399, baseType: !11, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !501, file: !210, line: 400, baseType: !11, size: 32, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !501, file: !210, line: 401, baseType: !11, size: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !501, file: !210, line: 402, baseType: !11, size: 32, offset: 160)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !501, file: !210, line: 403, baseType: !256, size: 96, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !501, file: !210, line: 404, baseType: !11, size: 32, offset: 288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !501, file: !210, line: 405, baseType: !11, size: 32, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !501, file: !210, line: 406, baseType: !11, size: 32, offset: 352)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !501, file: !210, line: 407, baseType: !11, size: 32, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !501, file: !210, line: 408, baseType: !11, size: 32, offset: 416)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !501, file: !210, line: 409, baseType: !11, size: 32, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !501, file: !210, line: 410, baseType: !11, size: 32, offset: 480)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !501, file: !210, line: 411, baseType: !267, size: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !501, file: !210, line: 412, baseType: !249, size: 32, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !501, file: !210, line: 413, baseType: !249, size: 32, offset: 608)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !501, file: !210, line: 414, baseType: !273, size: 128, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !501, file: !210, line: 415, baseType: !277, size: 160, offset: 768)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !501, file: !210, line: 416, baseType: !281, size: 160, offset: 928)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !501, file: !210, line: 417, baseType: !11, size: 32, offset: 1088)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !114, line: 72, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 56, size: 525312, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !526, file: !114, line: 57, baseType: !11, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !526, file: !114, line: 58, baseType: !11, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !526, file: !114, line: 59, baseType: !11, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !526, file: !114, line: 60, baseType: !11, size: 32, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !526, file: !114, line: 61, baseType: !11, size: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !526, file: !114, line: 62, baseType: !11, size: 32, offset: 160)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !526, file: !114, line: 63, baseType: !11, size: 32, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !526, file: !114, line: 64, baseType: !11, size: 32, offset: 224)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !526, file: !114, line: 65, baseType: !11, size: 32, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !526, file: !114, line: 66, baseType: !11, size: 32, offset: 288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !526, file: !114, line: 67, baseType: !128, size: 32, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !526, file: !114, line: 68, baseType: !11, size: 32, offset: 352)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !526, file: !114, line: 69, baseType: !133, size: 523904, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !526, file: !114, line: 70, baseType: !137, size: 512, offset: 524288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !526, file: !114, line: 71, baseType: !137, size: 512, offset: 524800)
!543 = !{!486, !544}
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !488, file: !489, line: 61, type: !11, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "heap_end", scope: !548, file: !549, line: 66, type: !554, isLocal: true, isDefinition: true)
!548 = distinct !DISubprogram(name: "_sbrk_r", scope: !549, file: !549, line: 63, type: !550, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !746, retainedNodes: !750)
!549 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!550 = !DISubroutineType(types: !551)
!551 = !{!552, !555, !745}
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !553, line: 123, baseType: !554)
!553 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !557, line: 377, size: 1920, elements: !558)
!557 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!558 = !{!559, !560, !634, !635, !636, !637, !638, !639, !640, !643, !664, !668, !669, !670, !671, !681, !694, !695, !700, !719, !720, !727, !728, !744}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !556, file: !557, line: 381, baseType: !66, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !556, file: !557, line: 386, baseType: !561, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !557, line: 292, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !557, line: 186, size: 832, elements: !564)
!564 = !{!565, !567, !568, !569, !571, !572, !577, !578, !579, !580, !584, !590, !597, !601, !602, !603, !604, !608, !610, !611, !612, !614, !620, !633}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !563, file: !557, line: 187, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !563, file: !557, line: 188, baseType: !66, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !563, file: !557, line: 189, baseType: !66, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !563, file: !557, line: 190, baseType: !570, size: 16, offset: 96)
!570 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !563, file: !557, line: 191, baseType: !570, size: 16, offset: 112)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !563, file: !557, line: 192, baseType: !573, size: 64, offset: 128)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !557, line: 122, size: 64, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !573, file: !557, line: 123, baseType: !566, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !573, file: !557, line: 124, baseType: !66, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !563, file: !557, line: 193, baseType: !66, size: 32, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !563, file: !557, line: 196, baseType: !555, size: 32, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !563, file: !557, line: 200, baseType: !141, size: 32, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !563, file: !557, line: 202, baseType: !581, size: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = !DISubroutineType(types: !583)
!583 = !{!66, !555, !141, !554, !66}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !563, file: !557, line: 204, baseType: !585, size: 32, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{!66, !555, !141, !588, !66}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !563, file: !557, line: 207, baseType: !591, size: 32, offset: 352)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DISubroutineType(types: !593)
!593 = !{!594, !555, !141, !594, !66}
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !595, line: 116, baseType: !596)
!595 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!596 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !563, file: !557, line: 208, baseType: !598, size: 32, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 32)
!599 = !DISubroutineType(types: !600)
!600 = !{!66, !555, !141}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !563, file: !557, line: 211, baseType: !573, size: 64, offset: 416)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !563, file: !557, line: 212, baseType: !566, size: 32, offset: 480)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !563, file: !557, line: 213, baseType: !66, size: 32, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !563, file: !557, line: 216, baseType: !605, size: 24, offset: 544)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 24, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 3)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !563, file: !557, line: 217, baseType: !609, size: 8, offset: 568)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, elements: !129)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !563, file: !557, line: 220, baseType: !573, size: 64, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !563, file: !557, line: 223, baseType: !66, size: 32, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !563, file: !557, line: 224, baseType: !613, size: 32, offset: 672)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !595, line: 46, baseType: !596)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !563, file: !557, line: 231, baseType: !615, size: 32, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !557, line: 35, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !617, line: 34, baseType: !618)
!617 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !617, line: 33, flags: DIFlagFwdDecl)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !563, file: !557, line: 233, baseType: !621, size: 64, offset: 736)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !595, line: 170, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !595, line: 162, size: 64, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !622, file: !595, line: 164, baseType: !66, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !622, file: !595, line: 169, baseType: !626, size: 32, offset: 32)
!626 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !622, file: !595, line: 165, size: 32, elements: !627)
!627 = !{!628, !631}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !626, file: !595, line: 167, baseType: !629, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !630, line: 116, baseType: !66)
!630 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!631 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !626, file: !595, line: 168, baseType: !632, size: 32)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !274)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !563, file: !557, line: 234, baseType: !66, size: 32, offset: 800)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !556, file: !557, line: 386, baseType: !561, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !556, file: !557, line: 386, baseType: !561, size: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !556, file: !557, line: 388, baseType: !66, size: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !556, file: !557, line: 390, baseType: !554, size: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !556, file: !557, line: 392, baseType: !66, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !556, file: !557, line: 394, baseType: !66, size: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !556, file: !557, line: 395, baseType: !641, size: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !557, line: 45, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !556, file: !557, line: 397, baseType: !644, size: 32, offset: 288)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !557, line: 349, size: 128, elements: !646)
!646 = !{!647, !660, !661, !662}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !645, file: !557, line: 352, baseType: !648, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !557, line: 52, size: 192, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !649, file: !557, line: 54, baseType: !648, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !649, file: !557, line: 55, baseType: !66, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !649, file: !557, line: 55, baseType: !66, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !649, file: !557, line: 55, baseType: !66, size: 32, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !649, file: !557, line: 55, baseType: !66, size: 32, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !649, file: !557, line: 56, baseType: !657, size: 32, offset: 160)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 32, elements: !129)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !557, line: 22, baseType: !659)
!659 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !645, file: !557, line: 353, baseType: !66, size: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !645, file: !557, line: 354, baseType: !648, size: 32, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !645, file: !557, line: 355, baseType: !663, size: 32, offset: 96)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !556, file: !557, line: 399, baseType: !665, size: 32, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !555}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !556, file: !557, line: 401, baseType: !66, size: 32, offset: 352)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !556, file: !557, line: 404, baseType: !66, size: 32, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !556, file: !557, line: 405, baseType: !554, size: 32, offset: 416)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !556, file: !557, line: 407, baseType: !672, size: 32, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !557, line: 324, size: 192, elements: !674)
!674 = !{!675, !677, !678, !679}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !673, file: !557, line: 325, baseType: !676, size: 48)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 48, elements: !606)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !673, file: !557, line: 326, baseType: !676, size: 48, offset: 48)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !673, file: !557, line: 327, baseType: !53, size: 16, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !673, file: !557, line: 330, baseType: !680, size: 64, offset: 128)
!680 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !556, file: !557, line: 408, baseType: !682, size: 32, offset: 480)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !557, line: 60, size: 288, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !683, file: !557, line: 62, baseType: !66, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !683, file: !557, line: 63, baseType: !66, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !683, file: !557, line: 64, baseType: !66, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !683, file: !557, line: 65, baseType: !66, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !683, file: !557, line: 66, baseType: !66, size: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !683, file: !557, line: 67, baseType: !66, size: 32, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !683, file: !557, line: 68, baseType: !66, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !683, file: !557, line: 69, baseType: !66, size: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !683, file: !557, line: 70, baseType: !66, size: 32, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !556, file: !557, line: 409, baseType: !554, size: 32, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !556, file: !557, line: 412, baseType: !696, size: 32, offset: 544)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !66}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !556, file: !557, line: 416, baseType: !701, size: 32, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !557, line: 90, size: 1120, elements: !703)
!703 = !{!704, !705, !706, !710}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !702, file: !557, line: 91, baseType: !701, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !702, file: !557, line: 92, baseType: !66, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !702, file: !557, line: 93, baseType: !707, size: 1024, offset: 64)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 1024, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !702, file: !557, line: 94, baseType: !711, size: 32, offset: 1088)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !557, line: 79, size: 2112, elements: !713)
!713 = !{!714, !716, !717, !718}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !712, file: !557, line: 80, baseType: !715, size: 1024)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 1024, elements: !708)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !712, file: !557, line: 81, baseType: !715, size: 1024, offset: 1024)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !712, file: !557, line: 83, baseType: !658, size: 32, offset: 2048)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !712, file: !557, line: 86, baseType: !658, size: 32, offset: 2080)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !556, file: !557, line: 417, baseType: !702, size: 1120, offset: 608)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !556, file: !557, line: 420, baseType: !721, size: 96, offset: 1728)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !557, line: 296, size: 96, elements: !722)
!722 = !{!723, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !721, file: !557, line: 298, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !721, file: !557, line: 299, baseType: !66, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !721, file: !557, line: 300, baseType: !561, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !556, file: !557, line: 421, baseType: !561, size: 32, offset: 1824)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !556, file: !557, line: 422, baseType: !729, size: 32, offset: 1856)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !557, line: 359, size: 640, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !738, !739, !740, !741, !742, !743}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !730, file: !557, line: 362, baseType: !554, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !730, file: !557, line: 363, baseType: !621, size: 64, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !730, file: !557, line: 364, baseType: !621, size: 64, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !730, file: !557, line: 365, baseType: !621, size: 64, offset: 160)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !730, file: !557, line: 366, baseType: !737, size: 64, offset: 224)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 64, elements: !215)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !730, file: !557, line: 367, baseType: !66, size: 32, offset: 288)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !730, file: !557, line: 368, baseType: !621, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !730, file: !557, line: 369, baseType: !621, size: 64, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !730, file: !557, line: 370, baseType: !621, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !730, file: !557, line: 371, baseType: !621, size: 64, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !730, file: !557, line: 372, baseType: !621, size: 64, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !556, file: !557, line: 423, baseType: !554, size: 32, offset: 1888)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !630, line: 46, baseType: !7)
!746 = distinct !DICompileUnit(language: DW_LANG_C99, file: !747, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !748, globals: !749, splitDebugInlining: false, nameTableKind: None)
!747 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!748 = !{!554, !552}
!749 = !{!546}
!750 = !{!751, !752, !753, !754}
!751 = !DILocalVariable(name: "r", arg: 1, scope: !548, file: !549, line: 63, type: !555)
!752 = !DILocalVariable(name: "nbytes", arg: 2, scope: !548, file: !549, line: 63, type: !745)
!753 = !DILocalVariable(name: "prev_heap_end", scope: !548, file: !549, line: 67, type: !554)
!754 = !DILocalVariable(name: "stack", scope: !548, file: !549, line: 68, type: !554)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !757, file: !762, line: 4, type: !768, isLocal: false, isDefinition: true)
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !759, splitDebugInlining: false, nameTableKind: None)
!758 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!759 = !{!755, !760, !766}
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !757, file: !762, line: 5, type: !763, isLocal: false, isDefinition: true)
!762 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 88, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 11)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !757, file: !762, line: 6, type: !763, isLocal: false, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 248, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 31)
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !773, retainedTypes: !779, splitDebugInlining: false, nameTableKind: None)
!772 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!773 = !{!774}
!774 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !775, line: 1209, baseType: !7, size: 32, elements: !776)
!775 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!776 = !{!777, !778}
!777 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!778 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!779 = !{!780, !782}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !9, line: 116, baseType: !7)
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !785, retainedTypes: !863, splitDebugInlining: false, nameTableKind: None)
!784 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!785 = !{!786}
!786 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !787, line: 150, baseType: !7, size: 32, elements: !788)
!787 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862}
!789 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!790 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!791 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!792 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!793 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!794 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!795 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!796 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!797 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!798 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!799 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!800 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!801 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!802 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!803 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!804 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!805 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!806 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!807 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!808 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!809 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!810 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!811 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!812 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!813 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!814 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!815 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!816 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!817 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!818 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!819 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!820 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!821 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!822 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!823 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!824 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!825 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!826 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!827 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!828 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!829 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!830 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!831 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!832 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!833 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!834 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!835 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!836 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!837 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!838 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!839 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!840 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!841 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!842 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!843 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!844 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!845 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!846 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!847 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!848 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!849 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!850 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!851 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!852 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!853 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!854 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!855 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!856 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!857 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!858 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!859 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!860 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!861 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!862 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!863 = !{!780, !8}
!864 = distinct !DICompileUnit(language: DW_LANG_C99, file: !865, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !866, splitDebugInlining: false, nameTableKind: None)
!865 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!866 = !{!867, !892}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !210, line: 418, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 395, size: 1120, elements: !870)
!870 = !{!871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !869, file: !210, line: 397, baseType: !249, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !869, file: !210, line: 398, baseType: !11, size: 32, offset: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !869, file: !210, line: 399, baseType: !11, size: 32, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !869, file: !210, line: 400, baseType: !11, size: 32, offset: 96)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !869, file: !210, line: 401, baseType: !11, size: 32, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !869, file: !210, line: 402, baseType: !11, size: 32, offset: 160)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !869, file: !210, line: 403, baseType: !256, size: 96, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !869, file: !210, line: 404, baseType: !11, size: 32, offset: 288)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !869, file: !210, line: 405, baseType: !11, size: 32, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !869, file: !210, line: 406, baseType: !11, size: 32, offset: 352)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !869, file: !210, line: 407, baseType: !11, size: 32, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !869, file: !210, line: 408, baseType: !11, size: 32, offset: 416)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !869, file: !210, line: 409, baseType: !11, size: 32, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !869, file: !210, line: 410, baseType: !11, size: 32, offset: 480)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !869, file: !210, line: 411, baseType: !267, size: 64, offset: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !869, file: !210, line: 412, baseType: !249, size: 32, offset: 576)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !869, file: !210, line: 413, baseType: !249, size: 32, offset: 608)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !869, file: !210, line: 414, baseType: !273, size: 128, offset: 640)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !869, file: !210, line: 415, baseType: !277, size: 160, offset: 768)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !869, file: !210, line: 416, baseType: !281, size: 160, offset: 928)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !869, file: !210, line: 417, baseType: !11, size: 32, offset: 1088)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !210, line: 378, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 363, size: 28704, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !894, file: !210, line: 365, baseType: !214, size: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !894, file: !210, line: 366, baseType: !218, size: 768, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !894, file: !210, line: 367, baseType: !214, size: 256, offset: 1024)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !894, file: !210, line: 368, baseType: !218, size: 768, offset: 1280)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !894, file: !210, line: 369, baseType: !214, size: 256, offset: 2048)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !894, file: !210, line: 370, baseType: !218, size: 768, offset: 2304)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !894, file: !210, line: 371, baseType: !214, size: 256, offset: 3072)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !894, file: !210, line: 372, baseType: !218, size: 768, offset: 3328)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !894, file: !210, line: 373, baseType: !214, size: 256, offset: 4096)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !894, file: !210, line: 374, baseType: !229, size: 1792, offset: 4352)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !894, file: !210, line: 375, baseType: !233, size: 1920, offset: 6144)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !894, file: !210, line: 376, baseType: !240, size: 20608, offset: 8064)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !894, file: !210, line: 377, baseType: !11, size: 32, offset: 28672)
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !911, splitDebugInlining: false, nameTableKind: None)
!910 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!911 = !{!912, !786}
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !913, line: 55, baseType: !7, size: 32, elements: !914)
!913 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!914 = !{!915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942}
!915 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!916 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!917 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!918 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!919 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!920 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!921 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!922 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!923 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!924 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!925 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!926 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!927 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!928 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!929 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!930 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!931 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!932 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!933 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!934 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!935 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!936 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!937 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!938 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!939 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!940 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!941 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!942 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!944 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!945 = distinct !DICompileUnit(language: DW_LANG_C99, file: !946, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !947, retainedTypes: !980, splitDebugInlining: false, nameTableKind: None)
!946 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!947 = !{!948, !448, !912, !955, !961, !965, !969, !975}
!948 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !949, line: 233, baseType: !66, size: 32, elements: !950)
!949 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!950 = !{!951, !952, !953, !954}
!951 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!952 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!953 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!954 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!955 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !949, line: 224, baseType: !66, size: 32, elements: !956)
!956 = !{!957, !958, !959, !960}
!957 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!958 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!959 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!960 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!961 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !949, line: 217, baseType: !7, size: 32, elements: !962)
!962 = !{!963, !964}
!963 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!964 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!965 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !949, line: 210, baseType: !7, size: 32, elements: !966)
!966 = !{!967, !968}
!967 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!968 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !949, line: 242, baseType: !7, size: 32, elements: !970)
!970 = !{!971, !972, !973, !974}
!971 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!972 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!973 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!974 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!975 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !976, line: 57, baseType: !7, size: 32, elements: !977)
!976 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/spi_slave_from_master/GCC")
!977 = !{!978, !979}
!978 = !DIEnumerator(name: "eDirection_IN", value: 0)
!979 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!980 = !{!981, !141, !982, !235, !983, !984}
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !913, line: 87, baseType: !912)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !949, line: 220, baseType: !961)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !949, line: 247, baseType: !969)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !976, line: 60, baseType: !975)
!985 = !{!"Ubuntu clang version 14.0.6"}
!986 = !{i32 7, !"Dwarf Version", i32 2}
!987 = !{i32 2, !"Debug Info Version", i32 3}
!988 = !{i32 1, !"wchar_size", i32 4}
!989 = !{i32 1, !"min_enum_size", i32 4}
!990 = !{i32 1, !"branch-target-enforcement", i32 0}
!991 = !{i32 1, !"sign-return-address", i32 0}
!992 = !{i32 1, !"sign-return-address-all", i32 0}
!993 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!994 = !{i32 7, !"frame-pointer", i32 2}
!995 = distinct !DISubprogram(name: "halGPIO_ConfDirection", scope: !772, file: !772, line: 54, type: !996, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !771, retainedNodes: !999)
!996 = !DISubroutineType(types: !997)
!997 = !{!998, !8, !54}
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !9, line: 56, baseType: !66)
!999 = !{!1000, !1001, !1002, !1004}
!1000 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !995, file: !772, line: 54, type: !8)
!1001 = !DILocalVariable(name: "outEnable", arg: 2, scope: !995, file: !772, line: 54, type: !54)
!1002 = !DILocalVariable(name: "no", scope: !995, file: !772, line: 57, type: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !9, line: 60, baseType: !53)
!1004 = !DILocalVariable(name: "remainder", scope: !995, file: !772, line: 58, type: !1003)
!1005 = !DILocation(line: 0, scope: !995)
!1006 = !DILocation(line: 59, column: 19, scope: !995)
!1007 = !DILocation(line: 60, column: 17, scope: !995)
!1008 = !DILocation(line: 61, column: 5, scope: !995)
!1009 = !DILocation(line: 65, column: 27, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !772, line: 65, column: 17)
!1011 = distinct !DILexicalBlock(scope: !995, file: !772, line: 61, column: 17)
!1012 = !DILocation(line: 0, scope: !1010)
!1013 = !DILocation(line: 65, column: 17, scope: !1011)
!1014 = !DILocation(line: 66, column: 21, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1010, file: !772, line: 65, column: 33)
!1016 = !DILocation(line: 67, column: 73, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !772, line: 66, column: 38)
!1018 = distinct !DILexicalBlock(scope: !1015, file: !772, line: 66, column: 21)
!1019 = !DILocation(line: 67, column: 69, scope: !1017)
!1020 = !DILocation(line: 67, column: 66, scope: !1017)
!1021 = !DILocation(line: 68, column: 17, scope: !1017)
!1022 = !DILocation(line: 68, column: 28, scope: !1018)
!1023 = !DILocation(line: 69, column: 77, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !772, line: 68, column: 45)
!1025 = distinct !DILexicalBlock(scope: !1018, file: !772, line: 68, column: 28)
!1026 = !DILocation(line: 70, column: 77, scope: !1024)
!1027 = !DILocation(line: 71, column: 17, scope: !1024)
!1028 = !DILocation(line: 72, column: 77, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !772, line: 71, column: 45)
!1030 = distinct !DILexicalBlock(scope: !1025, file: !772, line: 71, column: 28)
!1031 = !DILocation(line: 73, column: 77, scope: !1029)
!1032 = !DILocation(line: 74, column: 17, scope: !1029)
!1033 = !DILocation(line: 75, column: 79, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !772, line: 74, column: 45)
!1035 = distinct !DILexicalBlock(scope: !1030, file: !772, line: 74, column: 28)
!1036 = !DILocation(line: 76, column: 79, scope: !1034)
!1037 = !DILocation(line: 77, column: 17, scope: !1034)
!1038 = !DILocation(line: 78, column: 79, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !772, line: 77, column: 45)
!1040 = distinct !DILexicalBlock(scope: !1035, file: !772, line: 77, column: 28)
!1041 = !DILocation(line: 79, column: 79, scope: !1039)
!1042 = !DILocation(line: 80, column: 17, scope: !1039)
!1043 = !DILocation(line: 81, column: 79, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !772, line: 80, column: 45)
!1045 = distinct !DILexicalBlock(scope: !1040, file: !772, line: 80, column: 28)
!1046 = !DILocation(line: 82, column: 79, scope: !1044)
!1047 = !DILocation(line: 83, column: 17, scope: !1044)
!1048 = !DILocation(line: 85, column: 17, scope: !1015)
!1049 = !DILocation(line: 86, column: 13, scope: !1015)
!1050 = !DILocation(line: 88, column: 21, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1010, file: !772, line: 86, column: 20)
!1052 = !DILocation(line: 89, column: 72, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !772, line: 88, column: 38)
!1054 = distinct !DILexicalBlock(scope: !1051, file: !772, line: 88, column: 21)
!1055 = !DILocation(line: 89, column: 66, scope: !1053)
!1056 = !DILocation(line: 90, column: 17, scope: !1053)
!1057 = !DILocation(line: 90, column: 28, scope: !1054)
!1058 = !DILocation(line: 91, column: 77, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !772, line: 90, column: 45)
!1060 = distinct !DILexicalBlock(scope: !1054, file: !772, line: 90, column: 28)
!1061 = !DILocation(line: 92, column: 17, scope: !1059)
!1062 = !DILocation(line: 93, column: 77, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !772, line: 92, column: 45)
!1064 = distinct !DILexicalBlock(scope: !1060, file: !772, line: 92, column: 28)
!1065 = !DILocation(line: 94, column: 17, scope: !1063)
!1066 = !DILocation(line: 95, column: 79, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !772, line: 94, column: 45)
!1068 = distinct !DILexicalBlock(scope: !1064, file: !772, line: 94, column: 28)
!1069 = !DILocation(line: 96, column: 17, scope: !1067)
!1070 = !DILocation(line: 97, column: 79, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !772, line: 96, column: 45)
!1072 = distinct !DILexicalBlock(scope: !1068, file: !772, line: 96, column: 28)
!1073 = !DILocation(line: 98, column: 17, scope: !1071)
!1074 = !DILocation(line: 99, column: 79, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !772, line: 98, column: 45)
!1076 = distinct !DILexicalBlock(scope: !1072, file: !772, line: 98, column: 28)
!1077 = !DILocation(line: 100, column: 17, scope: !1075)
!1078 = !DILocation(line: 103, column: 17, scope: !1051)
!1079 = !DILocation(line: 109, column: 27, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1011, file: !772, line: 109, column: 17)
!1081 = !DILocation(line: 0, scope: !1080)
!1082 = !DILocation(line: 109, column: 17, scope: !1011)
!1083 = !DILocation(line: 110, column: 21, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1080, file: !772, line: 109, column: 33)
!1085 = !DILocation(line: 111, column: 73, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !772, line: 110, column: 36)
!1087 = distinct !DILexicalBlock(scope: !1084, file: !772, line: 110, column: 21)
!1088 = !DILocation(line: 111, column: 69, scope: !1086)
!1089 = !DILocation(line: 111, column: 66, scope: !1086)
!1090 = !DILocation(line: 112, column: 17, scope: !1086)
!1091 = !DILocation(line: 113, column: 79, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1087, file: !772, line: 112, column: 24)
!1093 = !DILocation(line: 114, column: 79, scope: !1092)
!1094 = !DILocation(line: 117, column: 17, scope: !1084)
!1095 = !DILocation(line: 118, column: 13, scope: !1084)
!1096 = !DILocation(line: 120, column: 21, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1080, file: !772, line: 118, column: 20)
!1098 = !DILocation(line: 121, column: 72, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !772, line: 120, column: 36)
!1100 = distinct !DILexicalBlock(scope: !1097, file: !772, line: 120, column: 21)
!1101 = !DILocation(line: 121, column: 66, scope: !1099)
!1102 = !DILocation(line: 122, column: 17, scope: !1099)
!1103 = !DILocation(line: 123, column: 79, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1100, file: !772, line: 122, column: 24)
!1105 = !DILocation(line: 126, column: 17, scope: !1097)
!1106 = !DILocation(line: 133, column: 1, scope: !995)
!1107 = distinct !DISubprogram(name: "halGPO_Write", scope: !772, file: !772, line: 136, type: !996, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !771, retainedNodes: !1108)
!1108 = !{!1109, !1110, !1111, !1112}
!1109 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1107, file: !772, line: 136, type: !8)
!1110 = !DILocalVariable(name: "writeValue", arg: 2, scope: !1107, file: !772, line: 136, type: !54)
!1111 = !DILocalVariable(name: "no", scope: !1107, file: !772, line: 138, type: !1003)
!1112 = !DILocalVariable(name: "remainder", scope: !1107, file: !772, line: 139, type: !1003)
!1113 = !DILocation(line: 0, scope: !1107)
!1114 = !DILocation(line: 140, column: 19, scope: !1107)
!1115 = !DILocation(line: 141, column: 17, scope: !1107)
!1116 = !DILocation(line: 142, column: 5, scope: !1107)
!1117 = !DILocation(line: 145, column: 17, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !772, line: 145, column: 17)
!1119 = distinct !DILexicalBlock(scope: !1107, file: !772, line: 142, column: 17)
!1120 = !DILocation(line: 0, scope: !1118)
!1121 = !DILocation(line: 145, column: 17, scope: !1119)
!1122 = !DILocation(line: 146, column: 17, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1118, file: !772, line: 145, column: 29)
!1124 = !DILocation(line: 147, column: 13, scope: !1123)
!1125 = !DILocation(line: 148, column: 17, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1118, file: !772, line: 147, column: 20)
!1127 = !DILocation(line: 153, column: 17, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1119, file: !772, line: 153, column: 17)
!1129 = !DILocation(line: 0, scope: !1128)
!1130 = !DILocation(line: 153, column: 17, scope: !1119)
!1131 = !DILocation(line: 154, column: 17, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1128, file: !772, line: 153, column: 29)
!1133 = !DILocation(line: 155, column: 13, scope: !1132)
!1134 = !DILocation(line: 156, column: 17, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1128, file: !772, line: 155, column: 20)
!1136 = !DILocation(line: 163, column: 1, scope: !1107)
!1137 = distinct !DISubprogram(name: "halgetGPIO_DOUT", scope: !772, file: !772, line: 169, type: !1138, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !771, retainedNodes: !1140)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!54, !8}
!1140 = !{!1141, !1142, !1143, !1144}
!1141 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1137, file: !772, line: 169, type: !8)
!1142 = !DILocalVariable(name: "no", scope: !1137, file: !772, line: 171, type: !1003)
!1143 = !DILocalVariable(name: "remainder", scope: !1137, file: !772, line: 172, type: !1003)
!1144 = !DILocalVariable(name: "dout", scope: !1137, file: !772, line: 175, type: !54)
!1145 = !DILocation(line: 0, scope: !1137)
!1146 = !DILocation(line: 173, column: 19, scope: !1137)
!1147 = !DILocation(line: 174, column: 17, scope: !1137)
!1148 = !DILocation(line: 177, column: 5, scope: !1137)
!1149 = !DILocation(line: 183, column: 13, scope: !1150)
