; ModuleID = './Build/mt7697_bootloader.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.flash_info_t = type { i8*, i8, i32, i32, i32, i8, i8, i8 }
%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.lzma_alloc_t = type { i8* (i8*, i32)*, void (i8*, i8*)* }
%struct.fota_header_info_t = type { i32, i32, [4 x %struct.fota_bin_info_t] }
%struct.fota_bin_info_t = type { i32, i32, i32, i32, i32, i32, i32, [4 x i8] }
%struct.fota_flash_s = type { %struct.hal_uart_config_t*, i8, i32 }
%struct._IOT_WDT_TypeDef = type { i32, i32, i32, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_aes_buffer_t = type { i8*, i32 }
%struct.hal_cache_region_config_t = type { i32, i32 }

!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "sf_Mutex", scope: !2, file: !3, line: 78, type: !7, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !83, file: !84, line: 71, type: !158, isLocal: false, isDefinition: true)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !84, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !85, retainedTypes: !136, globals: !141, splitDebugInlining: false, nameTableKind: None)
!84 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!85 = !{!86, !91}
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 121, baseType: !30, size: 32, elements: !88)
!87 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!90 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !92, line: 47, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!94 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!95 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!96 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!97 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!98 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!99 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!100 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!101 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!102 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!103 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!104 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!105 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!106 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!107 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!108 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!109 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!110 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!111 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!112 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!113 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!114 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!115 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!116 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!117 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!118 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!119 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!120 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!121 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!122 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!123 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!124 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!125 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!126 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!127 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!128 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!129 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!130 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!131 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!132 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!133 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!134 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!135 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!136 = !{!137, !140}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !87, line: 116, baseType: !30)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !92, line: 95, baseType: !91)
!141 = !{!81, !142}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !83, file: !84, line: 67, type: !144, isLocal: true, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !145, line: 111, baseType: !146)
!145 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 109, size: 96, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !146, file: !145, line: 110, baseType: !149, size: 96)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !145, line: 106, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 102, size: 96, elements: !151)
!151 = !{!152, !156, !157}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !150, file: !145, line: 103, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{null}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !150, file: !145, line: 104, baseType: !153, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !150, file: !145, line: 105, baseType: !153, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !87, line: 62, baseType: !30)
!160 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!161 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "g_sfc_security_enable", scope: !164, file: !165, line: 58, type: !30, isLocal: false, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !166, retainedTypes: !173, globals: !180, splitDebugInlining: false, nameTableKind: None)
!165 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/sfc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!166 = !{!167}
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 45, baseType: !30, size: 32, elements: !168)
!168 = !{!169, !170, !171, !172}
!169 = !DIEnumerator(name: "SF_UNDEF", value: 0)
!170 = !DIEnumerator(name: "SPI", value: 1)
!171 = !DIEnumerator(name: "SPIQ", value: 2)
!172 = !DIEnumerator(name: "QPI", value: 3)
!173 = !{!137, !174, !30, !175, !177, !178}
!174 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!180 = !{!162}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "gSFC_max_data_size", scope: !183, file: !184, line: 67, type: !30, isLocal: false, isDefinition: true)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !192, globals: !211, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/spi_flash.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!185 = !{!35, !5, !167, !186}
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 66, baseType: !7, size: 32, elements: !187)
!187 = !{!188, !189, !190, !191}
!188 = !DIEnumerator(name: "FLASH_NOT_READY", value: -1)
!189 = !DIEnumerator(name: "FLASH_READY", value: 0)
!190 = !DIEnumerator(name: "FLASH_PROGRAMMING", value: 1)
!191 = !DIEnumerator(name: "FLASH_ERASING", value: 2)
!192 = !{!193, !195, !196, !30, !51, !210, !61, !139}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!195 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chip_info", file: !6, line: 137, size: 192, elements: !199)
!199 = !{!200, !203, !204, !205, !206, !207, !208, !209}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !6, line: 138, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !6, line: 139, baseType: !58, size: 8, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !198, file: !6, line: 140, baseType: !195, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !198, file: !6, line: 141, baseType: !195, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !198, file: !6, line: 142, baseType: !30, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !198, file: !6, line: 144, baseType: !58, size: 8, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !198, file: !6, line: 145, baseType: !58, size: 8, offset: 168)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !198, file: !6, line: 146, baseType: !58, size: 8, offset: 176)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!211 = !{!181, !212, !217, !222, !227, !230, !232, !237, !239, !241, !243, !245, !247, !249, !251, !253, !255, !257, !259, !264, !266, !268, !270, !273}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_winbond", scope: !183, file: !184, line: 70, type: !214, isLocal: false, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 96, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 12)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_winbond", scope: !183, file: !184, line: 73, type: !219, isLocal: false, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 32, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 4)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_winbond", scope: !183, file: !184, line: 76, type: !224, isLocal: false, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 72, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 9)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "cmdlist_suspend_winbond", scope: !183, file: !184, line: 79, type: !229, isLocal: false, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !220)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "cmdlist_resume_winbond", scope: !183, file: !184, line: 82, type: !229, isLocal: false, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_mxic", scope: !183, file: !184, line: 87, type: !234, isLocal: false, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 64, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 8)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_mxic", scope: !183, file: !184, line: 91, type: !234, isLocal: false, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_mxic", scope: !183, file: !184, line: 95, type: !234, isLocal: false, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd", scope: !183, file: !184, line: 100, type: !224, isLocal: false, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd", scope: !183, file: !184, line: 104, type: !224, isLocal: false, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd", scope: !183, file: !184, line: 108, type: !224, isLocal: false, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd25q32c", scope: !183, file: !184, line: 112, type: !234, isLocal: false, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd25q32c", scope: !183, file: !184, line: 115, type: !234, isLocal: false, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd25q32c", scope: !183, file: !184, line: 119, type: !234, isLocal: false, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_micron", scope: !183, file: !184, line: 123, type: !234, isLocal: false, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_micron", scope: !183, file: !184, line: 126, type: !234, isLocal: false, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_micron", scope: !183, file: !184, line: 130, type: !234, isLocal: false, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_spimode", scope: !183, file: !184, line: 135, type: !261, isLocal: false, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 56, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 7)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_qpimode", scope: !183, file: !184, line: 138, type: !261, isLocal: false, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "spi_chip_info", scope: !183, file: !184, line: 142, type: !196, isLocal: false, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "gd_write_sr2_1", scope: !183, file: !184, line: 161, type: !7, isLocal: false, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "support_flash_id", scope: !183, file: !184, line: 162, type: !272, isLocal: false, isDefinition: true)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_TYPT", file: !6, line: 81, baseType: !35)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "chips_data", scope: !183, file: !184, line: 144, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 2496, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 13)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !280, file: !281, line: 43, type: !61, isLocal: true, isDefinition: true)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !282, globals: !287, splitDebugInlining: false, nameTableKind: None)
!281 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!282 = !{!175, !159, !59, !283, !284, !286}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32", file: !87, line: 133, baseType: !30)
!287 = !{!278, !288}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !280, file: !281, line: 44, type: !61, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !292, file: !293, line: 54, type: !61, isLocal: false, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !294, retainedTypes: !318, globals: !326, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!294 = !{!295, !301}
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !296, line: 71, baseType: !30, size: 32, elements: !297)
!296 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!297 = !{!298, !299, !300}
!298 = !DIEnumerator(name: "UART_PORT0", value: 0)
!299 = !DIEnumerator(name: "UART_PORT1", value: 1)
!300 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !302, line: 129, baseType: !30, size: 32, elements: !303)
!302 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317}
!304 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!305 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!306 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!307 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!308 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!309 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!310 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!311 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!312 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!313 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!314 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!315 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!316 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!317 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!318 = !{!175, !61, !319, !321, !323, !324, !159}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !87, line: 113, baseType: !322)
!322 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !87, line: 59, baseType: !58)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !323)
!326 = !{!290}
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "g_crypt_lock", scope: !329, file: !330, line: 48, type: !69, isLocal: false, isDefinition: true)
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !331, retainedTypes: !337, globals: !338, splitDebugInlining: false, nameTableKind: None)
!330 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_aes.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!331 = !{!332, !91}
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 290, baseType: !7, size: 32, elements: !334)
!333 = !DIFile(filename: "../../../../../driver/chip/inc/hal_aes.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!334 = !{!335, !336}
!335 = !DIEnumerator(name: "HAL_AES_STATUS_ERROR", value: -1)
!336 = !DIEnumerator(name: "HAL_AES_STATUS_OK", value: 0)
!337 = !{!51, !140, !54}
!338 = !{!327, !339}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "g_aes_op_done", scope: !329, file: !330, line: 71, type: !341, isLocal: true, isDefinition: true)
!341 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !69)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !344, file: !345, line: 51, type: !341, isLocal: false, isDefinition: true)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !345, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !346, retainedTypes: !393, globals: !423, splitDebugInlining: false, nameTableKind: None)
!345 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!346 = !{!347, !358, !377, !384}
!347 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !348, line: 163, baseType: !7, size: 32, elements: !349)
!348 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357}
!350 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!351 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!352 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!353 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!354 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!355 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!356 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!357 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!358 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !348, line: 186, baseType: !30, size: 32, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376}
!360 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!361 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!362 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!363 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!364 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!365 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!366 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!367 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!368 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!369 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!370 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!371 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!372 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!373 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!374 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!375 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!376 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !348, line: 176, baseType: !30, size: 32, elements: !378)
!378 = !{!379, !380, !381, !382, !383}
!379 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!380 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!381 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!382 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!383 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!384 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !385, line: 99, baseType: !30, size: 32, elements: !386)
!385 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!386 = !{!387, !388, !389, !390, !391, !392}
!387 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!388 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!389 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!390 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!391 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!392 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!393 = !{!394, !51}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !396, line: 72, baseType: !397)
!396 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 56, size: 525312, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !413, !414, !418, !422}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !397, file: !396, line: 57, baseType: !60, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !397, file: !396, line: 58, baseType: !60, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !397, file: !396, line: 59, baseType: !60, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !397, file: !396, line: 60, baseType: !60, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !397, file: !396, line: 61, baseType: !60, size: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !397, file: !396, line: 62, baseType: !60, size: 32, offset: 160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !397, file: !396, line: 63, baseType: !60, size: 32, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !397, file: !396, line: 64, baseType: !60, size: 32, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !397, file: !396, line: 65, baseType: !60, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !397, file: !396, line: 66, baseType: !60, size: 32, offset: 288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !397, file: !396, line: 67, baseType: !410, size: 32, offset: 320)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 1)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !397, file: !396, line: 68, baseType: !60, size: 32, offset: 352)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !397, file: !396, line: 69, baseType: !415, size: 523904, offset: 384)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 16372)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !397, file: !396, line: 70, baseType: !419, size: 512, offset: 524288)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 16)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !397, file: !396, line: 71, baseType: !419, size: 512, offset: 524800)
!423 = !{!342}
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "g_cache_con", scope: !426, file: !427, line: 48, type: !461, isLocal: false, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !428, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!428 = !{!424, !429, !432}
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "g_cache_region_en", scope: !426, file: !427, line: 49, type: !431, isLocal: false, isDefinition: true)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGION_EN_Type", file: !385, line: 66, baseType: !61)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "g_cache_entry", scope: !426, file: !427, line: 50, type: !434, isLocal: false, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 1024, elements: !420)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_Type", file: !385, line: 90, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 87, size: 64, elements: !437)
!437 = !{!438, !451}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cache_entry_n", scope: !436, file: !385, line: 88, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_N_Type", file: !385, line: 77, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !385, line: 68, size: 32, elements: !441)
!441 = !{!442, !450}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !440, file: !385, line: 75, baseType: !443, size: 32)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !385, line: 69, size: 32, elements: !444)
!444 = !{!445, !446, !447, !448, !449}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !443, file: !385, line: 70, baseType: !61, size: 5, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ATTR", scope: !443, file: !385, line: 71, baseType: !61, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !443, file: !385, line: 72, baseType: !61, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !443, file: !385, line: 73, baseType: !61, size: 3, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !443, file: !385, line: 74, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !440, file: !385, line: 76, baseType: !61, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "cache_end_entry_n", scope: !436, file: !385, line: 89, baseType: !452, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_END_ENTRY_N_Type", file: !385, line: 85, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !385, line: 79, size: 32, elements: !454)
!454 = !{!455, !460}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !453, file: !385, line: 83, baseType: !456, size: 32)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !385, line: 80, size: 32, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !456, file: !385, line: 81, baseType: !61, size: 12, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !456, file: !385, line: 82, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !453, file: !385, line: 84, baseType: !61, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_CON_Type", file: !385, line: 64, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !385, line: 51, size: 32, elements: !463)
!463 = !{!464, !476}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !462, file: !385, line: 62, baseType: !465, size: 32)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !462, file: !385, line: 52, size: 32, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !475}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "MCEN", scope: !465, file: !385, line: 53, baseType: !61, size: 1, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "MPEN", scope: !465, file: !385, line: 54, baseType: !61, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN0", scope: !465, file: !385, line: 55, baseType: !61, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN1", scope: !465, file: !385, line: 56, baseType: !61, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "MPDEFEN", scope: !465, file: !385, line: 57, baseType: !61, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !465, file: !385, line: 58, baseType: !61, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "MDRF", scope: !465, file: !385, line: 59, baseType: !61, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "CACHESIZE", scope: !465, file: !385, line: 60, baseType: !61, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !465, file: !385, line: 61, baseType: !61, size: 22, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !462, file: !385, line: 63, baseType: !61, size: 32)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !479, file: !480, line: 53, type: !561, isLocal: false, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !481, retainedTypes: !490, globals: !560, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!481 = !{!482, !91}
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !483, line: 152, baseType: !7, size: 32, elements: !484)
!483 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!484 = !{!485, !486, !487, !488, !489}
!485 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!486 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!487 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!488 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!489 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!490 = !{!491, !51, !61, !492, !494, !525}
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !92, line: 97, baseType: !140)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !55, line: 44, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !57, line: 77, baseType: !7)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !496, line: 378, baseType: !497)
!496 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 363, size: 28704, elements: !498)
!498 = !{!499, !501, !505, !506, !507, !508, !509, !510, !511, !512, !516, !520, !524}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !497, file: !496, line: 365, baseType: !500, size: 256)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 256, elements: !235)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !497, file: !496, line: 366, baseType: !502, size: 768, offset: 256)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 768, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 24)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !497, file: !496, line: 367, baseType: !500, size: 256, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !497, file: !496, line: 368, baseType: !502, size: 768, offset: 1280)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !497, file: !496, line: 369, baseType: !500, size: 256, offset: 2048)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !497, file: !496, line: 370, baseType: !502, size: 768, offset: 2304)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !497, file: !496, line: 371, baseType: !500, size: 256, offset: 3072)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !497, file: !496, line: 372, baseType: !502, size: 768, offset: 3328)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !497, file: !496, line: 373, baseType: !500, size: 256, offset: 4096)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !497, file: !496, line: 374, baseType: !513, size: 1792, offset: 4352)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1792, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 56)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !497, file: !496, line: 375, baseType: !517, size: 1920, offset: 6144)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 1920, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 240)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !497, file: !496, line: 376, baseType: !521, size: 20608, offset: 8064)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 20608, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 644)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !497, file: !496, line: 377, baseType: !60, size: 32, offset: 28672)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !496, line: 418, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 395, size: 1120, elements: !528)
!528 = !{!529, !531, !532, !533, !534, !535, !536, !538, !539, !540, !541, !542, !543, !544, !545, !549, !550, !551, !553, !557, !559}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !527, file: !496, line: 397, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !527, file: !496, line: 398, baseType: !60, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !527, file: !496, line: 399, baseType: !60, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !527, file: !496, line: 400, baseType: !60, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !527, file: !496, line: 401, baseType: !60, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !527, file: !496, line: 402, baseType: !60, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !527, file: !496, line: 403, baseType: !537, size: 96, offset: 192)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 96, elements: !215)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !527, file: !496, line: 404, baseType: !60, size: 32, offset: 288)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !527, file: !496, line: 405, baseType: !60, size: 32, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !527, file: !496, line: 406, baseType: !60, size: 32, offset: 352)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !527, file: !496, line: 407, baseType: !60, size: 32, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !527, file: !496, line: 408, baseType: !60, size: 32, offset: 416)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !527, file: !496, line: 409, baseType: !60, size: 32, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !527, file: !496, line: 410, baseType: !60, size: 32, offset: 480)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !527, file: !496, line: 411, baseType: !546, size: 64, offset: 512)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 64, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 2)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !527, file: !496, line: 412, baseType: !530, size: 32, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !527, file: !496, line: 413, baseType: !530, size: 32, offset: 608)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !527, file: !496, line: 414, baseType: !552, size: 128, offset: 640)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 128, elements: !220)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !527, file: !496, line: 415, baseType: !554, size: 160, offset: 768)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 160, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 5)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !527, file: !496, line: 416, baseType: !558, size: 160, offset: 928)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, elements: !555)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !527, file: !496, line: 417, baseType: !60, size: 32, offset: 1088)
!560 = !{!477}
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 6144, elements: !570)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !480, line: 50, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !480, line: 47, size: 64, elements: !564)
!564 = !{!565, !569}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !563, file: !480, line: 48, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !491}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !563, file: !480, line: 49, baseType: !61, size: 32, offset: 32)
!570 = !{!571}
!571 = !DISubrange(count: 96)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !574, file: !575, line: 61, type: !594, isLocal: true, isDefinition: true)
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !576, retainedTypes: !592, globals: !593, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!576 = !{!20, !577, !584, !28, !588}
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 657, baseType: !30, size: 32, elements: !578)
!578 = !{!579, !580, !581, !582, !583}
!579 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!580 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!581 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!582 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!583 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!584 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 397, baseType: !30, size: 32, elements: !585)
!585 = !{!586, !587}
!586 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!587 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!588 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 380, baseType: !30, size: 32, elements: !589)
!589 = !{!590, !591}
!590 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!591 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!592 = !{!51, !61}
!593 = !{!572}
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 640, elements: !555)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !575, line: 55, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !575, line: 51, size: 128, elements: !597)
!597 = !{!598, !600, !610}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !596, file: !575, line: 52, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !21, line: 400, baseType: !584)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !596, file: !575, line: 53, baseType: !601, size: 64, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !575, line: 49, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !575, line: 46, size: 64, elements: !603)
!603 = !{!604, !609}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !602, file: !575, line: 47, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !21, line: 371, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !51}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !602, file: !575, line: 48, baseType: !51, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !596, file: !575, line: 54, baseType: !69, size: 8, offset: 96)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !613, file: !614, line: 77, type: !678, isLocal: true, isDefinition: true)
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !615, retainedTypes: !665, globals: !666, splitDebugInlining: false, nameTableKind: None)
!614 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!615 = !{!616, !624, !629, !645, !651, !655, !295, !301, !660}
!616 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !617, line: 345, baseType: !7, size: 32, elements: !618)
!617 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!618 = !{!619, !620, !621, !622, !623}
!619 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!620 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!621 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!622 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!623 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!624 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 109, baseType: !30, size: 32, elements: !625)
!625 = !{!626, !627, !628}
!626 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!627 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!628 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !617, line: 302, baseType: !30, size: 32, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!631 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!632 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!633 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!634 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!635 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!636 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!637 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!638 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!639 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!640 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!641 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!642 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!643 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!644 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !617, line: 321, baseType: !30, size: 32, elements: !646)
!646 = !{!647, !648, !649, !650}
!647 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!648 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!649 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!650 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !617, line: 330, baseType: !30, size: 32, elements: !652)
!652 = !{!653, !654}
!653 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!654 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!655 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !617, line: 337, baseType: !30, size: 32, elements: !656)
!656 = !{!657, !658, !659}
!657 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!658 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!659 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !617, line: 355, baseType: !7, size: 32, elements: !661)
!661 = !{!662, !663, !664}
!662 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!663 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!664 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!665 = !{!30, !51, !58, !202, !54}
!666 = !{!611, !667}
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "func_tbl", scope: !669, file: !614, line: 536, type: !676, isLocal: true, isDefinition: true)
!669 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !614, file: !614, line: 534, type: !670, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !613, retainedNodes: !674)
!670 = !DISubroutineType(types: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !302, line: 197, baseType: !153)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !29, line: 113, baseType: !624)
!674 = !{!675}
!675 = !DILocalVariable(name: "uart_port", arg: 1, scope: !669, file: !614, line: 534, type: !673)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 64, elements: !547)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 1024, elements: !547)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !614, line: 75, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 68, size: 512, elements: !681)
!681 = !{!682, !683, !695, !696, !707, !708}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !680, file: !614, line: 69, baseType: !69, size: 8)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !680, file: !614, line: 70, baseType: !684, size: 128, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !617, line: 378, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 373, size: 128, elements: !686)
!686 = !{!687, !689, !691, !693}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !685, file: !617, line: 374, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !617, line: 317, baseType: !629)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !685, file: !617, line: 375, baseType: !690, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !617, line: 326, baseType: !645)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !685, file: !617, line: 376, baseType: !692, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !617, line: 333, baseType: !651)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !685, file: !617, line: 377, baseType: !694, size: 32, offset: 96)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !617, line: 341, baseType: !655)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !680, file: !614, line: 71, baseType: !69, size: 8, offset: 160)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !680, file: !614, line: 72, baseType: !697, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !614, line: 66, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 63, size: 64, elements: !699)
!699 = !{!700, !706}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !698, file: !614, line: 64, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !617, line: 410, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !705, !51}
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !617, line: 359, baseType: !660)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !698, file: !614, line: 65, baseType: !51, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !680, file: !614, line: 73, baseType: !69, size: 8, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !680, file: !614, line: 74, baseType: !709, size: 224, offset: 288)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !617, line: 390, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 382, size: 224, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !710, file: !617, line: 383, baseType: !210, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !710, file: !617, line: 384, baseType: !61, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !710, file: !617, line: 385, baseType: !61, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !710, file: !617, line: 386, baseType: !210, size: 32, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !710, file: !617, line: 387, baseType: !61, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !710, file: !617, line: 388, baseType: !61, size: 32, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !710, file: !617, line: 389, baseType: !61, size: 32, offset: 192)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "s_hal_mode", scope: !721, file: !722, line: 44, type: !750, isLocal: true, isDefinition: true)
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !723, retainedTypes: !739, globals: !740, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_wdt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!723 = !{!724, !730, !734, !91}
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !725, line: 194, baseType: !7, size: 32, elements: !726)
!725 = !DIFile(filename: "../../../../../driver/chip/inc/hal_wdt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!726 = !{!727, !728, !729}
!727 = !DIEnumerator(name: "HAL_WDT_STATUS_INVALID_PARAMETER", value: -2)
!728 = !DIEnumerator(name: "HAL_WDT_STATUS_INVALID_MAGIC", value: -1)
!729 = !DIEnumerator(name: "HAL_WDT_STATUS_OK", value: 0)
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !725, line: 210, baseType: !30, size: 32, elements: !731)
!731 = !{!732, !733}
!732 = !DIEnumerator(name: "HAL_WDT_MODE_RESET", value: 0)
!733 = !DIEnumerator(name: "HAL_WDT_MODE_INTERRUPT", value: 1)
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !725, line: 202, baseType: !30, size: 32, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIEnumerator(name: "HAL_WDT_TIMEOUT_RESET", value: 0)
!737 = !DIEnumerator(name: "HAL_WDT_SOFTWARE_RESET", value: 1)
!738 = !DIEnumerator(name: "HAL_WDT_NONE_RESET", value: 2)
!739 = !{!140, !61}
!740 = !{!741, !748, !719}
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "s_hal_wdt_callback", scope: !721, file: !722, line: 42, type: !743, isLocal: true, isDefinition: true)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_wdt_callback_t", file: !725, line: 246, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !747}
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_wdt_reset_status_t", file: !725, line: 206, baseType: !734)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "s_hal_enable", scope: !721, file: !722, line: 43, type: !69, isLocal: true, isDefinition: true)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_wdt_mode_t", file: !725, line: 213, baseType: !730)
!751 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_default", scope: !754, file: !755, line: 164, type: !214, isLocal: false, isDefinition: true)
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !755, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !756, globals: !771, splitDebugInlining: false, nameTableKind: None)
!755 = !DIFile(filename: "../../../../../driver/board/linkit7697_hdk/external_flash/src/bsp_flash_config.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!756 = !{!757, !51}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_info_t", file: !760, line: 48, baseType: !761)
!760 = !DIFile(filename: "../../../../../driver/board/linkit7697_hdk/external_flash/inc/bsp_flash_config.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !760, line: 38, size: 192, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !761, file: !760, line: 39, baseType: !201, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !761, file: !760, line: 40, baseType: !58, size: 8, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !761, file: !760, line: 41, baseType: !195, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !761, file: !760, line: 42, baseType: !195, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !761, file: !760, line: 43, baseType: !30, size: 32, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !761, file: !760, line: 45, baseType: !58, size: 8, offset: 160)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !761, file: !760, line: 46, baseType: !58, size: 8, offset: 168)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !761, file: !760, line: 47, baseType: !58, size: 8, offset: 176)
!771 = !{!752, !772, !774, !776}
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_default", scope: !754, file: !755, line: 167, type: !219, isLocal: false, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_default", scope: !754, file: !755, line: 170, type: !224, isLocal: false, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "customer_flash_info", scope: !754, file: !755, line: 174, type: !758, isLocal: false, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "KernelStack", scope: !780, file: !781, line: 118, type: !835, isLocal: true, isDefinition: true)
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !782, retainedTypes: !795, globals: !822, splitDebugInlining: false, nameTableKind: None)
!781 = !DIFile(filename: "../../../../../driver/board/linkit7697_hdk/bootloader/src/mt7687/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!782 = !{!730, !724, !167, !783}
!783 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !784, line: 49, baseType: !30, size: 32, elements: !785)
!784 = !DIFile(filename: "../../../../../middleware/MTK/fota/inc/internal/fota_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793, !794}
!786 = !DIEnumerator(name: "FOTA_STATUS_OK", value: 0)
!787 = !DIEnumerator(name: "FOTA_STATUS_IS_EMPTY", value: 1)
!788 = !DIEnumerator(name: "FOTA_STATUS_IS_FULL", value: 2)
!789 = !DIEnumerator(name: "FOTA_STATUS_ERROR_INVALD_PARAMETER", value: 3)
!790 = !DIEnumerator(name: "FOTA_STATUS_ERROR_BLOCK_ALIGN", value: 4)
!791 = !DIEnumerator(name: "FOTA_STATUS_ERROR_OUT_OF_RANGE", value: 5)
!792 = !DIEnumerator(name: "FOTA_STATUS_ERROR_UNKNOWN_ID", value: 6)
!793 = !DIEnumerator(name: "FOTA_STATUS_ERROR_NOT_INITIALIZED", value: 7)
!794 = !DIEnumerator(name: "FOTA_STATUS_ERROR_FLASH_OP", value: 8)
!795 = !{!59, !195, !796, !177, !797, !175, !159}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !496, line: 418, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 395, size: 1120, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !799, file: !496, line: 397, baseType: !530, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !799, file: !496, line: 398, baseType: !60, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !799, file: !496, line: 399, baseType: !60, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !799, file: !496, line: 400, baseType: !60, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !799, file: !496, line: 401, baseType: !60, size: 32, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !799, file: !496, line: 402, baseType: !60, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !799, file: !496, line: 403, baseType: !537, size: 96, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !799, file: !496, line: 404, baseType: !60, size: 32, offset: 288)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !799, file: !496, line: 405, baseType: !60, size: 32, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !799, file: !496, line: 406, baseType: !60, size: 32, offset: 352)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !799, file: !496, line: 407, baseType: !60, size: 32, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !799, file: !496, line: 408, baseType: !60, size: 32, offset: 416)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !799, file: !496, line: 409, baseType: !60, size: 32, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !799, file: !496, line: 410, baseType: !60, size: 32, offset: 480)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !799, file: !496, line: 411, baseType: !546, size: 64, offset: 512)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !799, file: !496, line: 412, baseType: !530, size: 32, offset: 576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !799, file: !496, line: 413, baseType: !530, size: 32, offset: 608)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !799, file: !496, line: 414, baseType: !552, size: 128, offset: 640)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !799, file: !496, line: 415, baseType: !554, size: 160, offset: 768)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !799, file: !496, line: 416, baseType: !558, size: 160, offset: 928)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !799, file: !496, line: 417, baseType: !60, size: 32, offset: 1088)
!822 = !{!823, !778, !828}
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "__isr_vector", scope: !780, file: !781, line: 123, type: !825, isLocal: false, isDefinition: true)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 1024, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 32)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "buffer", scope: !830, file: !781, line: 316, type: !832, isLocal: true, isDefinition: true)
!830 = distinct !DISubprogram(name: "process_fota", scope: !781, file: !781, line: 314, type: !154, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !780, retainedNodes: !831)
!831 = !{}
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32768, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 4096)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 65536, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 2048)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "buf", scope: !840, file: !841, line: 54, type: !874, isLocal: true, isDefinition: true)
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !842, retainedTypes: !843, globals: !847, splitDebugInlining: false, nameTableKind: None)
!841 = !DIFile(filename: "../../../../../driver/board/linkit7697_hdk/bootloader/src/mt7687/hw_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!842 = !{!624, !629, !645, !651, !655}
!843 = !{!492, !844, !51}
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !55, line: 56, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !57, line: 103, baseType: !846)
!846 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!847 = !{!838, !848, !863}
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "rev", scope: !850, file: !841, line: 68, type: !860, isLocal: true, isDefinition: true)
!850 = distinct !DISubprogram(name: "bl_itoa", scope: !841, file: !841, line: 63, type: !851, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !840, retainedNodes: !854)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !853, !61, !61}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!854 = !{!855, !856, !857, !858, !859}
!855 = !DILocalVariable(name: "buf", arg: 1, scope: !850, file: !841, line: 63, type: !853)
!856 = !DILocalVariable(name: "i", arg: 2, scope: !850, file: !841, line: 63, type: !61)
!857 = !DILocalVariable(name: "base", arg: 3, scope: !850, file: !841, line: 63, type: !61)
!858 = !DILocalVariable(name: "s", scope: !850, file: !841, line: 65, type: !201)
!859 = !DILocalVariable(name: "rem", scope: !850, file: !841, line: 67, type: !61)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 168, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 21)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "rev", scope: !865, file: !841, line: 103, type: !860, isLocal: true, isDefinition: true)
!865 = distinct !DISubprogram(name: "bl_itof", scope: !841, file: !841, line: 98, type: !866, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !840, retainedNodes: !868)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !853, !492}
!868 = !{!869, !870, !871, !872, !873}
!869 = !DILocalVariable(name: "buf", arg: 1, scope: !865, file: !841, line: 98, type: !853)
!870 = !DILocalVariable(name: "i", arg: 2, scope: !865, file: !841, line: 98, type: !492)
!871 = !DILocalVariable(name: "s", scope: !865, file: !841, line: 100, type: !201)
!872 = !DILocalVariable(name: "rem", scope: !865, file: !841, line: 102, type: !492)
!873 = !DILocalVariable(name: "j", scope: !865, file: !841, line: 102, type: !492)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 4096, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 512)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "lzma_alloc_count", scope: !879, file: !880, line: 163, type: !7, isLocal: true, isDefinition: true)
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !881, retainedTypes: !887, globals: !889, splitDebugInlining: false, nameTableKind: None)
!880 = !DIFile(filename: "../../../../../middleware/MTK/fota/src/internal/fota_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!881 = !{!783, !44, !882}
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !883, line: 162, baseType: !7, size: 32, elements: !884)
!883 = !DIFile(filename: "../../../../../driver/chip/inc/hal_sha.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!884 = !{!885, !886}
!885 = !DIEnumerator(name: "HAL_SHA_STATUS_ERROR", value: -1)
!886 = !DIEnumerator(name: "HAL_SHA_STATUS_OK", value: 0)
!887 = !{!51, !210, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!889 = !{!890, !908, !925, !946, !951, !953, !955, !877}
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "lzma_alloc", scope: !879, file: !880, line: 194, type: !892, isLocal: false, isDefinition: true)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_alloc_t", file: !893, line: 69, baseType: !894)
!893 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_lzma_decode_interface.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !893, line: 66, size: 64, elements: !895)
!895 = !{!896, !904}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Alloc", scope: !894, file: !893, line: 67, baseType: !897, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DISubroutineType(types: !899)
!899 = !{!51, !51, !900}
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !901, line: 40, baseType: !902)
!901 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/strings.h", directory: "/home/mjshen/RTOSExploration")
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !903, line: 131, baseType: !30)
!903 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !894, file: !893, line: 68, baseType: !905, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !51, !51}
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "flash_s", scope: !879, file: !880, line: 128, type: !910, isLocal: true, isDefinition: true)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "fota_flash_t", file: !784, line: 123, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fota_flash_s", file: !784, line: 119, size: 96, elements: !913)
!913 = !{!914, !923, !924}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !912, file: !784, line: 120, baseType: !915, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "fota_partition_t", file: !784, line: 116, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fota_partition_s", file: !784, line: 110, size: 128, elements: !918)
!918 = !{!919, !920, !921, !922}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !917, file: !784, line: 111, baseType: !61, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !917, file: !784, line: 112, baseType: !61, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !917, file: !784, line: 113, baseType: !61, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !917, file: !784, line: 114, baseType: !61, size: 32, offset: 96)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "table_entries", scope: !912, file: !784, line: 121, baseType: !54, size: 8, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !912, file: !784, line: 122, baseType: !61, size: 32, offset: 64)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "fota_head", scope: !879, file: !880, line: 160, type: !927, isLocal: true, isDefinition: true)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "fota_header_info_t", file: !880, line: 126, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !880, line: 122, size: 1088, elements: !929)
!929 = !{!930, !931, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "m_magic_ver", scope: !928, file: !880, line: 123, baseType: !61, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_num", scope: !928, file: !880, line: 124, baseType: !61, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_info", scope: !928, file: !880, line: 125, baseType: !933, size: 1024, offset: 64)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 1024, elements: !220)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "fota_bin_info_t", file: !880, line: 120, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !880, line: 111, size: 256, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_offset", scope: !935, file: !880, line: 112, baseType: !61, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_start_addr", scope: !935, file: !880, line: 113, baseType: !61, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_length", scope: !935, file: !880, line: 114, baseType: !61, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "m_partition_length", scope: !935, file: !880, line: 115, baseType: !61, size: 32, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "m_sig_offset", scope: !935, file: !880, line: 116, baseType: !61, size: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "m_sig_length", scope: !935, file: !880, line: 117, baseType: !61, size: 32, offset: 160)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "m_is_compressed", scope: !935, file: !880, line: 118, baseType: !61, size: 32, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "m_bin_reserved", scope: !935, file: !880, line: 119, baseType: !945, size: 32, offset: 224)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32, elements: !220)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "lzma_buf_0", scope: !879, file: !880, line: 164, type: !948, isLocal: true, isDefinition: true)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 131072, elements: !949)
!949 = !{!950}
!950 = !DISubrange(count: 16384)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "lzma_buf_1", scope: !879, file: !880, line: 165, type: !948, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "lzma_buf_2", scope: !879, file: !880, line: 166, type: !832, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "lzma_buf_3", scope: !879, file: !880, line: 167, type: !832, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "s_flash_table", scope: !959, file: !960, line: 72, type: !978, isLocal: true, isDefinition: true)
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !961, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "../../../../../middleware/MTK/fota/src/internal/fota_config.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!961 = !{!962, !957}
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "fota_flash_default_config", scope: !959, file: !960, line: 132, type: !964, isLocal: false, isDefinition: true)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "fota_flash_t", file: !784, line: 123, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fota_flash_s", file: !784, line: 119, size: 96, elements: !966)
!966 = !{!967, !976, !977}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !965, file: !784, line: 120, baseType: !968, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "fota_partition_t", file: !784, line: 116, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fota_partition_s", file: !784, line: 110, size: 128, elements: !971)
!971 = !{!972, !973, !974, !975}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !970, file: !784, line: 111, baseType: !61, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !970, file: !784, line: 112, baseType: !61, size: 32, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !970, file: !784, line: 113, baseType: !61, size: 32, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !970, file: !784, line: 114, baseType: !61, size: 32, offset: 96)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "table_entries", scope: !965, file: !784, line: 121, baseType: !54, size: 8, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !965, file: !784, line: 122, baseType: !61, size: 32, offset: 64)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 512, elements: !220)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !981, file: !982, line: 57, type: !61, isLocal: false, isDefinition: true)
!981 = distinct !DICompileUnit(language: DW_LANG_C99, file: !982, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !983, globals: !1017, splitDebugInlining: false, nameTableKind: None)
!982 = !DIFile(filename: "../../../../../project/linkit7697_hdk/apps/bootloader/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!983 = !{!984, !992}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !496, line: 656, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 650, size: 128, elements: !987)
!987 = !{!988, !989, !990, !991}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !986, file: !496, line: 652, baseType: !60, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !986, file: !496, line: 653, baseType: !60, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !986, file: !496, line: 654, baseType: !60, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !986, file: !496, line: 655, baseType: !530, size: 32, offset: 96)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !496, line: 418, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 395, size: 1120, elements: !995)
!995 = !{!996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !994, file: !496, line: 397, baseType: !530, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !994, file: !496, line: 398, baseType: !60, size: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !994, file: !496, line: 399, baseType: !60, size: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !994, file: !496, line: 400, baseType: !60, size: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !994, file: !496, line: 401, baseType: !60, size: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !994, file: !496, line: 402, baseType: !60, size: 32, offset: 160)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !994, file: !496, line: 403, baseType: !537, size: 96, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !994, file: !496, line: 404, baseType: !60, size: 32, offset: 288)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !994, file: !496, line: 405, baseType: !60, size: 32, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !994, file: !496, line: 406, baseType: !60, size: 32, offset: 352)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !994, file: !496, line: 407, baseType: !60, size: 32, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !994, file: !496, line: 408, baseType: !60, size: 32, offset: 416)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !994, file: !496, line: 409, baseType: !60, size: 32, offset: 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !994, file: !496, line: 410, baseType: !60, size: 32, offset: 480)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !994, file: !496, line: 411, baseType: !546, size: 64, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !994, file: !496, line: 412, baseType: !530, size: 32, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !994, file: !496, line: 413, baseType: !530, size: 32, offset: 608)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !994, file: !496, line: 414, baseType: !552, size: 128, offset: 640)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !994, file: !496, line: 415, baseType: !554, size: 160, offset: 768)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !994, file: !496, line: 416, baseType: !558, size: 160, offset: 928)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !994, file: !496, line: 417, baseType: !60, size: 32, offset: 1088)
!1017 = !{!979}
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "heap_end", scope: !1020, file: !1021, line: 61, type: !201, isLocal: true, isDefinition: true)
!1020 = distinct !DISubprogram(name: "_sbrk_r", scope: !1021, file: !1021, line: 58, type: !1022, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1210, retainedNodes: !1216)
!1021 = !DIFile(filename: "../../../../../project/linkit7697_hdk/apps/bootloader/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/apps/bootloader/GCC")
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!1024, !1026, !1209}
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !1025, line: 123, baseType: !201)
!1025 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 32)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !1028, line: 377, size: 1920, elements: !1029)
!1028 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!1029 = !{!1030, !1031, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1110, !1130, !1134, !1135, !1136, !1137, !1147, !1160, !1161, !1166, !1183, !1184, !1191, !1192, !1208}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !1027, file: !1028, line: 381, baseType: !7, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !1027, file: !1028, line: 386, baseType: !1032, size: 32, offset: 32)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !1028, line: 292, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !1028, line: 186, size: 832, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039, !1041, !1042, !1047, !1048, !1049, !1050, !1054, !1060, !1065, !1069, !1070, !1071, !1072, !1076, !1078, !1079, !1080, !1082, !1088, !1100}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !1034, file: !1028, line: 187, baseType: !177, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !1034, file: !1028, line: 188, baseType: !7, size: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !1034, file: !1028, line: 189, baseType: !7, size: 32, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1034, file: !1028, line: 190, baseType: !1040, size: 16, offset: 96)
!1040 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !1034, file: !1028, line: 191, baseType: !1040, size: 16, offset: 112)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !1034, file: !1028, line: 192, baseType: !1043, size: 64, offset: 128)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !1028, line: 122, size: 64, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !1043, file: !1028, line: 123, baseType: !177, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1043, file: !1028, line: 124, baseType: !7, size: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !1034, file: !1028, line: 193, baseType: !7, size: 32, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !1034, file: !1028, line: 196, baseType: !1026, size: 32, offset: 224)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !1034, file: !1028, line: 200, baseType: !51, size: 32, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !1034, file: !1028, line: 202, baseType: !1051, size: 32, offset: 288)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 32)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!7, !1026, !51, !201, !7}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !1034, file: !1028, line: 204, baseType: !1055, size: 32, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 32)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!7, !1026, !51, !1058, !7}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 32)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !1034, file: !1028, line: 207, baseType: !1061, size: 32, offset: 352)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 32)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!1064, !1026, !51, !1064, !7}
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !903, line: 116, baseType: !174)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !1034, file: !1028, line: 208, baseType: !1066, size: 32, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 32)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!7, !1026, !51}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !1034, file: !1028, line: 211, baseType: !1043, size: 64, offset: 416)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !1034, file: !1028, line: 212, baseType: !177, size: 32, offset: 480)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !1034, file: !1028, line: 213, baseType: !7, size: 32, offset: 512)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !1034, file: !1028, line: 216, baseType: !1073, size: 24, offset: 544)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 24, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 3)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !1034, file: !1028, line: 217, baseType: !1077, size: 8, offset: 568)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, elements: !411)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !1034, file: !1028, line: 220, baseType: !1043, size: 64, offset: 576)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !1034, file: !1028, line: 223, baseType: !7, size: 32, offset: 640)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1034, file: !1028, line: 224, baseType: !1081, size: 32, offset: 672)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !903, line: 46, baseType: !174)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1034, file: !1028, line: 231, baseType: !1083, size: 32, offset: 704)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !1028, line: 35, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !1085, line: 34, baseType: !1086)
!1085 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 32)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !1085, line: 33, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !1034, file: !1028, line: 233, baseType: !1089, size: 64, offset: 736)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !903, line: 170, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !903, line: 162, size: 64, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1090, file: !903, line: 164, baseType: !7, size: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1090, file: !903, line: 169, baseType: !1094, size: 32, offset: 32)
!1094 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1090, file: !903, line: 165, size: 32, elements: !1095)
!1095 = !{!1096, !1099}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1094, file: !903, line: 167, baseType: !1097, size: 32)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1098, line: 116, baseType: !7)
!1098 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1094, file: !903, line: 168, baseType: !229, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1034, file: !1028, line: 234, baseType: !7, size: 32, offset: 800)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !1027, file: !1028, line: 386, baseType: !1032, size: 32, offset: 64)
