; ModuleID = 'build/adafruit_feather_m0_basic_proto/philosophers/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__thread_entry = type { void (i8*, i8*, i8*)*, i8*, i8*, i8* }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/philosophers/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/philosophers")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/philosophers")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "forks", scope: !27, file: !116, line: 149, type: !272, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/philosophers")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !108, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !103)
!103 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!114, !25, !260, !263}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "fork_objs", scope: !27, file: !116, line: 146, type: !117, isLocal: false, isDefinition: true)
!116 = !DIFile(filename: "zephyr/samples/philosophers/src/phil_obj_abstract.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 960, elements: !258)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !119, line: 2720, size: 160, elements: !120)
!119 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121, !142, !256, !257}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !118, file: !119, line: 2722, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !123, line: 233, baseType: !124)
!123 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 231, size: 64, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !124, file: !123, line: 232, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !128, line: 48, baseType: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !128, line: 37, size: 64, elements: !130)
!130 = !{!131, !137}
!131 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !128, line: 38, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !128, line: 38, size: 32, elements: !133)
!133 = !{!134, !136}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !132, file: !128, line: 39, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !128, line: 40, baseType: !135, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !128, line: 42, baseType: !138, size: 32, offset: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !128, line: 42, size: 32, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !138, file: !128, line: 43, baseType: !135, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !128, line: 44, baseType: !135, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !118, file: !119, line: 2724, baseType: !143, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !145, line: 245, size: 1344, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !196, !209, !210, !211, !223, !224, !229, !230, !251}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !144, file: !145, line: 247, baseType: !148, size: 384)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !145, line: 57, size: 384, elements: !149)
!149 = !{!150, !164, !166, !169, !170, !183, !184, !185}
!150 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !145, line: 60, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !145, line: 60, size: 64, elements: !152)
!152 = !{!153, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !151, file: !145, line: 61, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !128, line: 49, baseType: !129)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !151, file: !145, line: 62, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !156, file: !157, line: 50, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!162 = !{!163}
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !148, file: !145, line: 68, baseType: !165, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !148, file: !145, line: 71, baseType: !167, size: 8, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !148, file: !145, line: 74, baseType: !167, size: 8, offset: 104)
!170 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !145, line: 90, baseType: !171, size: 16, offset: 112)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !145, line: 90, size: 16, elements: !172)
!172 = !{!173, !180}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !145, line: 91, baseType: !174, size: 16)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !145, line: 91, size: 16, elements: !175)
!175 = !{!176, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !174, file: !145, line: 96, baseType: !177, size: 8)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !178)
!178 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !174, file: !145, line: 97, baseType: !167, size: 8, offset: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !171, file: !145, line: 100, baseType: !181, size: 16)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !182)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !148, file: !145, line: 107, baseType: !110, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !148, file: !145, line: 127, baseType: !108, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !148, file: !145, line: 131, baseType: !186, size: 192, offset: 192)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !123, line: 244, size: 192, elements: !187)
!187 = !{!188, !189, !195}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !186, file: !123, line: 245, baseType: !154, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !186, file: !123, line: 246, baseType: !190, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !123, line: 242, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !186, file: !123, line: 249, baseType: !106, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !144, file: !145, line: 250, baseType: !197, size: 288, offset: 384)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !198, line: 25, size: 288, elements: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !197, file: !198, line: 26, baseType: !110, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !197, file: !198, line: 27, baseType: !110, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !197, file: !198, line: 28, baseType: !110, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !197, file: !198, line: 29, baseType: !110, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !197, file: !198, line: 30, baseType: !110, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !197, file: !198, line: 31, baseType: !110, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !197, file: !198, line: 32, baseType: !110, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !197, file: !198, line: 33, baseType: !110, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !197, file: !198, line: 34, baseType: !110, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !144, file: !145, line: 253, baseType: !108, size: 32, offset: 672)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !144, file: !145, line: 256, baseType: !122, size: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !144, file: !145, line: 271, baseType: !212, size: 128, offset: 768)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !145, line: 34, size: 128, elements: !213)
!213 = !{!214, !220, !221, !222}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !212, file: !145, line: 35, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !216, line: 46, baseType: !217)
!216 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !108, !108, !108}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !212, file: !145, line: 36, baseType: !108, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !212, file: !145, line: 37, baseType: !108, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !212, file: !145, line: 38, baseType: !108, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !144, file: !145, line: 274, baseType: !143, size: 32, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !145, line: 279, baseType: !225, size: 256, offset: 928)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 256, elements: !227)
!226 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!227 = !{!228}
!228 = !DISubrange(count: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !144, file: !145, line: 294, baseType: !109, size: 32, offset: 1184)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !144, file: !145, line: 325, baseType: !231, size: 32, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !119, line: 5073, size: 192, elements: !233)
!233 = !{!234, !245, !246}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !232, file: !119, line: 5074, baseType: !235, size: 96)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !236, line: 56, size: 96, elements: !237)
!236 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !{!238, !241, !242}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !235, file: !236, line: 57, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !236, line: 57, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !235, file: !236, line: 58, baseType: !108, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !235, file: !236, line: 59, baseType: !243, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !244, line: 214, baseType: !32)
!244 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !232, file: !119, line: 5075, baseType: !122, size: 64, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !232, file: !119, line: 5076, baseType: !247, size: 32, offset: 160)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !248, line: 43, size: 32, elements: !249)
!248 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !247, file: !248, line: 52, baseType: !22, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !144, file: !145, line: 343, baseType: !252, size: 64, offset: 1248)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !198, line: 60, size: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !252, file: !198, line: 63, baseType: !110, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !252, file: !198, line: 66, baseType: !110, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !118, file: !119, line: 2727, baseType: !110, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !118, file: !119, line: 2730, baseType: !109, size: 32, offset: 128)
!258 = !{!259}
!259 = !DISubrange(count: 6)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "threads", scope: !27, file: !116, line: 160, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8064, elements: !258)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "stacks", scope: !27, file: !116, line: 159, type: !265, isLocal: true, isDefinition: true, align: 64)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 98304, elements: !270)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !267, line: 47, size: 8, elements: !268)
!267 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !267, line: 48, baseType: !226, size: 8)
!270 = !{!259, !271}
!271 = !DISubrange(count: 2048)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 192, elements: !258)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "_char_out", scope: !276, file: !280, line: 54, type: !281, isLocal: false, isDefinition: true)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !278, globals: !279, splitDebugInlining: false, nameTableKind: None)
!277 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/philosophers")
!278 = !{!108, !109}
!279 = !{!274}
!280 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DISubroutineType(types: !283)
!283 = !{!109, !109}
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !286, file: !1018, line: 202, type: !1019, isLocal: true, isDefinition: true, align: 32)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !288, globals: !1017, splitDebugInlining: false, nameTableKind: None)
!287 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/philosophers")
!288 = !{!108, !109, !289, !411, !750, !751, !818}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !291, line: 335, baseType: !292)
!291 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !291, line: 320, size: 288, elements: !293)
!293 = !{!294, !305, !311, !325, !336, !347, !351, !362, !363, !374, !375, !390, !391, !401}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !292, file: !291, line: 321, baseType: !295, size: 16)
!295 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !291, line: 50, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !291, line: 43, size: 16, elements: !298)
!298 = !{!299, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !297, file: !291, line: 48, baseType: !300, size: 16)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !297, file: !291, line: 44, size: 16, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !300, file: !291, line: 45, baseType: !181, size: 7, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !300, file: !291, line: 47, baseType: !181, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !297, file: !291, line: 49, baseType: !181, size: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !292, file: !291, line: 322, baseType: !306, size: 16, offset: 16)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 16, elements: !162)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !308, line: 52, baseType: !309)
!308 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !167)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !292, file: !291, line: 323, baseType: !312, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !291, line: 107, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !291, line: 94, size: 32, elements: !315)
!315 = !{!316, !324}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !314, file: !291, line: 105, baseType: !317, size: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !314, file: !291, line: 95, size: 32, elements: !318)
!318 = !{!319, !320, !321, !322, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !317, file: !291, line: 97, baseType: !110, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !317, file: !291, line: 99, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !317, file: !291, line: 100, baseType: !110, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !317, file: !291, line: 102, baseType: !110, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !317, file: !291, line: 103, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !314, file: !291, line: 106, baseType: !110, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !292, file: !291, line: 324, baseType: !326, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !291, line: 155, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !291, line: 148, size: 32, elements: !329)
!329 = !{!330, !335}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !328, file: !291, line: 153, baseType: !331, size: 32)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !291, line: 149, size: 32, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !331, file: !291, line: 150, baseType: !110, size: 16, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !331, file: !291, line: 151, baseType: !110, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !328, file: !291, line: 154, baseType: !110, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !292, file: !291, line: 325, baseType: !337, size: 8, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !291, line: 194, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !291, line: 187, size: 8, elements: !340)
!340 = !{!341, !346}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !339, file: !291, line: 192, baseType: !342, size: 8)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !339, file: !291, line: 188, size: 8, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !342, file: !291, line: 189, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !342, file: !291, line: 190, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !339, file: !291, line: 193, baseType: !167, size: 8)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !292, file: !291, line: 326, baseType: !348, size: 24, offset: 104)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 24, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 3)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !292, file: !291, line: 327, baseType: !352, size: 8, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !291, line: 215, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !291, line: 208, size: 8, elements: !355)
!355 = !{!356, !361}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !354, file: !291, line: 213, baseType: !357, size: 8)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !354, file: !291, line: 209, size: 8, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !357, file: !291, line: 210, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !357, file: !291, line: 211, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !354, file: !291, line: 214, baseType: !167, size: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !292, file: !291, line: 328, baseType: !348, size: 24, offset: 136)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !292, file: !291, line: 329, baseType: !364, size: 8, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !291, line: 236, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !291, line: 229, size: 8, elements: !367)
!367 = !{!368, !373}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !366, file: !291, line: 234, baseType: !369, size: 8)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !366, file: !291, line: 230, size: 8, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !369, file: !291, line: 231, baseType: !309, size: 1, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !369, file: !291, line: 232, baseType: !309, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !366, file: !291, line: 235, baseType: !167, size: 8)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !292, file: !291, line: 330, baseType: !348, size: 24, offset: 168)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !292, file: !291, line: 331, baseType: !376, size: 16, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !291, line: 262, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !291, line: 250, size: 16, elements: !379)
!379 = !{!380, !389}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !378, file: !291, line: 260, baseType: !381, size: 16)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !378, file: !291, line: 251, size: 16, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !381, file: !291, line: 252, baseType: !181, size: 1, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !381, file: !291, line: 253, baseType: !181, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !381, file: !291, line: 254, baseType: !181, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !381, file: !291, line: 255, baseType: !181, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !381, file: !291, line: 256, baseType: !181, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !381, file: !291, line: 258, baseType: !181, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !378, file: !291, line: 261, baseType: !181, size: 16)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !292, file: !291, line: 332, baseType: !306, size: 16, offset: 208)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !292, file: !291, line: 333, baseType: !392, size: 32, offset: 224)
!392 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !291, line: 290, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !291, line: 284, size: 32, elements: !395)
!395 = !{!396, !400}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !394, file: !291, line: 288, baseType: !397, size: 32)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !291, line: 285, size: 32, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !397, file: !291, line: 286, baseType: !110, size: 22, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !394, file: !291, line: 289, baseType: !110, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !292, file: !291, line: 334, baseType: !402, size: 16, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !291, line: 308, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !291, line: 303, size: 16, elements: !405)
!405 = !{!406, !410}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !404, file: !291, line: 306, baseType: !407, size: 16)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !404, file: !291, line: 304, size: 16, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !407, file: !291, line: 305, baseType: !181, size: 16, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !404, file: !291, line: 307, baseType: !181, size: 16)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !413, line: 928, baseType: !414)
!413 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 899, size: 672, elements: !415)
!415 = !{!416, !440, !464, !490, !515, !531, !532, !550, !551, !568, !579, !580, !595, !615, !616, !628, !640, !650, !651, !668, !672, !683, !684, !696, !708, !709, !720, !736}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !414, file: !413, line: 900, baseType: !417, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !413, line: 64, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 43, size: 32, elements: !420)
!420 = !{!421, !439}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !419, file: !413, line: 62, baseType: !422, size: 32)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !419, file: !413, line: 44, size: 32, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !422, file: !413, line: 45, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !422, file: !413, line: 46, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !422, file: !413, line: 47, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !422, file: !413, line: 48, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !422, file: !413, line: 49, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !422, file: !413, line: 50, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !422, file: !413, line: 51, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !422, file: !413, line: 52, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !422, file: !413, line: 53, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !422, file: !413, line: 54, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !422, file: !413, line: 55, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !422, file: !413, line: 56, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !422, file: !413, line: 58, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !422, file: !413, line: 59, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !422, file: !413, line: 60, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !419, file: !413, line: 63, baseType: !110, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !414, file: !413, line: 901, baseType: !441, size: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !413, line: 125, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 104, size: 32, elements: !444)
!444 = !{!445, !463}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !443, file: !413, line: 123, baseType: !446, size: 32)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !443, file: !413, line: 105, size: 32, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !446, file: !413, line: 106, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !446, file: !413, line: 107, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !446, file: !413, line: 108, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !446, file: !413, line: 109, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !446, file: !413, line: 110, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !446, file: !413, line: 111, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !446, file: !413, line: 112, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !446, file: !413, line: 113, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !446, file: !413, line: 114, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !446, file: !413, line: 115, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !446, file: !413, line: 116, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !446, file: !413, line: 117, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !446, file: !413, line: 119, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !446, file: !413, line: 120, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !446, file: !413, line: 121, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !443, file: !413, line: 124, baseType: !110, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !414, file: !413, line: 902, baseType: !465, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !413, line: 186, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 165, size: 32, elements: !468)
!468 = !{!469, !489}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !467, file: !413, line: 184, baseType: !470, size: 32)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !467, file: !413, line: 166, size: 32, elements: !471)
!471 = !{!472, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !470, file: !413, line: 167, baseType: !473, size: 1, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !470, file: !413, line: 168, baseType: !473, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !470, file: !413, line: 169, baseType: !473, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !470, file: !413, line: 170, baseType: !473, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !470, file: !413, line: 171, baseType: !473, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !470, file: !413, line: 172, baseType: !473, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !470, file: !413, line: 173, baseType: !473, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !470, file: !413, line: 174, baseType: !473, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !470, file: !413, line: 175, baseType: !473, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !470, file: !413, line: 176, baseType: !473, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !470, file: !413, line: 177, baseType: !473, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !470, file: !413, line: 178, baseType: !473, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !470, file: !413, line: 180, baseType: !473, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !470, file: !413, line: 181, baseType: !473, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !470, file: !413, line: 182, baseType: !473, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !467, file: !413, line: 185, baseType: !110, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !414, file: !413, line: 903, baseType: !491, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !413, line: 247, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 226, size: 32, elements: !495)
!495 = !{!496, !514}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !494, file: !413, line: 245, baseType: !497, size: 32)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !413, line: 227, size: 32, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !497, file: !413, line: 228, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !497, file: !413, line: 229, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !497, file: !413, line: 230, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !497, file: !413, line: 231, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !497, file: !413, line: 232, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !497, file: !413, line: 233, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !497, file: !413, line: 234, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !497, file: !413, line: 235, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !497, file: !413, line: 236, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !497, file: !413, line: 237, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !497, file: !413, line: 238, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !497, file: !413, line: 239, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !497, file: !413, line: 241, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !497, file: !413, line: 242, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !497, file: !413, line: 243, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !494, file: !413, line: 246, baseType: !110, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !414, file: !413, line: 904, baseType: !516, size: 16, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !413, line: 300, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 287, size: 16, elements: !519)
!519 = !{!520, !530}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !518, file: !413, line: 298, baseType: !521, size: 16)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !518, file: !413, line: 288, size: 16, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !521, file: !413, line: 290, baseType: !181, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !521, file: !413, line: 291, baseType: !181, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !521, file: !413, line: 293, baseType: !181, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !521, file: !413, line: 294, baseType: !181, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !521, file: !413, line: 295, baseType: !181, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !521, file: !413, line: 296, baseType: !181, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !521, file: !413, line: 297, baseType: !181, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !518, file: !413, line: 299, baseType: !181, size: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !414, file: !413, line: 905, baseType: !306, size: 16, offset: 144)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !414, file: !413, line: 906, baseType: !533, size: 16, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !413, line: 352, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 336, size: 16, elements: !536)
!536 = !{!537, !549}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !535, file: !413, line: 350, baseType: !538, size: 16)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !535, file: !413, line: 337, size: 16, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !538, file: !413, line: 339, baseType: !181, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !538, file: !413, line: 340, baseType: !181, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !538, file: !413, line: 341, baseType: !181, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !538, file: !413, line: 342, baseType: !181, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !538, file: !413, line: 343, baseType: !181, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !538, file: !413, line: 344, baseType: !181, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !538, file: !413, line: 345, baseType: !181, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !538, file: !413, line: 346, baseType: !181, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !538, file: !413, line: 348, baseType: !181, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !535, file: !413, line: 351, baseType: !181, size: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !414, file: !413, line: 907, baseType: !306, size: 16, offset: 176)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !414, file: !413, line: 908, baseType: !552, size: 32, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !413, line: 398, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 381, size: 32, elements: !555)
!555 = !{!556, !567}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !554, file: !413, line: 396, baseType: !557, size: 32)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !554, file: !413, line: 382, size: 32, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !557, file: !413, line: 384, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !557, file: !413, line: 385, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !557, file: !413, line: 386, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !557, file: !413, line: 388, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !557, file: !413, line: 389, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !557, file: !413, line: 390, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !557, file: !413, line: 392, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !557, file: !413, line: 394, baseType: !110, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !554, file: !413, line: 397, baseType: !110, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !414, file: !413, line: 909, baseType: !569, size: 8, offset: 224)
!569 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !413, line: 433, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 426, size: 8, elements: !572)
!572 = !{!573, !578}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !571, file: !413, line: 431, baseType: !574, size: 8)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !571, file: !413, line: 427, size: 8, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !574, file: !413, line: 428, baseType: !167, size: 5, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !574, file: !413, line: 430, baseType: !167, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !571, file: !413, line: 432, baseType: !167, size: 8)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !414, file: !413, line: 910, baseType: !348, size: 24, offset: 232)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !414, file: !413, line: 911, baseType: !581, size: 32, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !413, line: 462, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 448, size: 32, elements: !584)
!584 = !{!585, !594}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !583, file: !413, line: 460, baseType: !586, size: 32)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !413, line: 449, size: 32, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !586, file: !413, line: 451, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !586, file: !413, line: 453, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !586, file: !413, line: 454, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !586, file: !413, line: 455, baseType: !110, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !586, file: !413, line: 457, baseType: !110, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !586, file: !413, line: 459, baseType: !110, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !583, file: !413, line: 461, baseType: !110, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !414, file: !413, line: 912, baseType: !596, size: 16, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !413, line: 520, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 503, size: 16, elements: !599)
!599 = !{!600, !614}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !598, file: !413, line: 518, baseType: !601, size: 16)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !598, file: !413, line: 504, size: 16, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !601, file: !413, line: 506, baseType: !181, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !601, file: !413, line: 507, baseType: !181, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !601, file: !413, line: 508, baseType: !181, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !601, file: !413, line: 509, baseType: !181, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !601, file: !413, line: 510, baseType: !181, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !601, file: !413, line: 511, baseType: !181, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !601, file: !413, line: 512, baseType: !181, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !601, file: !413, line: 513, baseType: !181, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !601, file: !413, line: 514, baseType: !181, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !601, file: !413, line: 515, baseType: !181, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !601, file: !413, line: 516, baseType: !181, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !598, file: !413, line: 519, baseType: !181, size: 16)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !414, file: !413, line: 913, baseType: !306, size: 16, offset: 304)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !414, file: !413, line: 914, baseType: !617, size: 32, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !413, line: 559, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 552, size: 32, elements: !620)
!620 = !{!621, !627}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !619, file: !413, line: 557, baseType: !622, size: 32)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !619, file: !413, line: 553, size: 32, elements: !623)
!623 = !{!624, !625, !626}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !622, file: !413, line: 554, baseType: !110, size: 10, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !622, file: !413, line: 555, baseType: !110, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !622, file: !413, line: 556, baseType: !110, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !619, file: !413, line: 558, baseType: !110, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !414, file: !413, line: 915, baseType: !629, size: 32, offset: 352)
!629 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !413, line: 585, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 578, size: 32, elements: !632)
!632 = !{!633, !639}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !631, file: !413, line: 583, baseType: !634, size: 32)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !631, file: !413, line: 579, size: 32, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !634, file: !413, line: 580, baseType: !110, size: 16, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !634, file: !413, line: 581, baseType: !110, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !634, file: !413, line: 582, baseType: !110, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !631, file: !413, line: 584, baseType: !110, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !414, file: !413, line: 916, baseType: !641, size: 8, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !413, line: 610, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 604, size: 8, elements: !644)
!644 = !{!645, !649}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !643, file: !413, line: 608, baseType: !646, size: 8)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !643, file: !413, line: 605, size: 8, elements: !647)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !646, file: !413, line: 607, baseType: !167, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !643, file: !413, line: 609, baseType: !167, size: 8)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !414, file: !413, line: 917, baseType: !348, size: 24, offset: 392)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !414, file: !413, line: 918, baseType: !652, size: 32, offset: 416)
!652 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !413, line: 639, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 622, size: 32, elements: !655)
!655 = !{!656, !667}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !654, file: !413, line: 637, baseType: !657, size: 32)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !654, file: !413, line: 623, size: 32, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !657, file: !413, line: 625, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !657, file: !413, line: 626, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !657, file: !413, line: 627, baseType: !110, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !657, file: !413, line: 629, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !657, file: !413, line: 631, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !657, file: !413, line: 632, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !657, file: !413, line: 634, baseType: !110, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !657, file: !413, line: 635, baseType: !110, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !654, file: !413, line: 638, baseType: !110, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !414, file: !413, line: 919, baseType: !669, size: 32, offset: 448)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 32, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 4)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !414, file: !413, line: 920, baseType: !673, size: 16, offset: 480)
!673 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !413, line: 715, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 706, size: 16, elements: !676)
!676 = !{!677, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !675, file: !413, line: 713, baseType: !678, size: 16)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !675, file: !413, line: 707, size: 16, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !678, file: !413, line: 709, baseType: !181, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !678, file: !413, line: 711, baseType: !181, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !675, file: !413, line: 714, baseType: !181, size: 16)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !414, file: !413, line: 921, baseType: !306, size: 16, offset: 496)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !414, file: !413, line: 922, baseType: !685, size: 32, offset: 512)
!685 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !413, line: 739, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 729, size: 32, elements: !688)
!688 = !{!689, !695}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !687, file: !413, line: 737, baseType: !690, size: 32)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !687, file: !413, line: 730, size: 32, elements: !691)
!691 = !{!692, !693, !694}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !690, file: !413, line: 732, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !690, file: !413, line: 733, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !690, file: !413, line: 735, baseType: !110, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !687, file: !413, line: 738, baseType: !110, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !414, file: !413, line: 923, baseType: !697, size: 8, offset: 544)
!697 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !413, line: 765, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 756, size: 8, elements: !700)
!700 = !{!701, !707}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !699, file: !413, line: 763, baseType: !702, size: 8)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !699, file: !413, line: 757, size: 8, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !702, file: !413, line: 759, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !702, file: !413, line: 761, baseType: !167, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !702, file: !413, line: 762, baseType: !167, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !699, file: !413, line: 764, baseType: !167, size: 8)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !414, file: !413, line: 924, baseType: !348, size: 24, offset: 552)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !414, file: !413, line: 925, baseType: !710, size: 32, offset: 576)
!710 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !413, line: 789, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 781, size: 32, elements: !713)
!713 = !{!714, !719}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !712, file: !413, line: 787, baseType: !715, size: 32)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !712, file: !413, line: 782, size: 32, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !715, file: !413, line: 783, baseType: !110, size: 12, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !715, file: !413, line: 785, baseType: !110, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !712, file: !413, line: 788, baseType: !110, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !414, file: !413, line: 926, baseType: !721, size: 32, offset: 608)
!721 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !413, line: 820, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 805, size: 32, elements: !724)
!724 = !{!725, !735}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !723, file: !413, line: 818, baseType: !726, size: 32)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !723, file: !413, line: 806, size: 32, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !726, file: !413, line: 807, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !726, file: !413, line: 808, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !726, file: !413, line: 809, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !726, file: !413, line: 810, baseType: !110, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !726, file: !413, line: 812, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !726, file: !413, line: 814, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !726, file: !413, line: 816, baseType: !110, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !723, file: !413, line: 819, baseType: !110, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !414, file: !413, line: 927, baseType: !737, size: 8, offset: 640)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !413, line: 881, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 872, size: 8, elements: !741)
!741 = !{!742, !749}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !740, file: !413, line: 879, baseType: !743, size: 8)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !740, file: !413, line: 873, size: 8, elements: !744)
!744 = !{!745, !746, !747, !748}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !743, file: !413, line: 874, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !743, file: !413, line: 875, baseType: !167, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !743, file: !413, line: 876, baseType: !167, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !743, file: !413, line: 877, baseType: !167, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !740, file: !413, line: 880, baseType: !167, size: 8)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !753, line: 290, baseType: !754)
!753 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !753, line: 284, size: 96, elements: !755)
!755 = !{!756, !766, !777, !790, !807}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !754, file: !753, line: 285, baseType: !757, size: 8)
!757 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !753, line: 49, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !753, line: 43, size: 8, elements: !760)
!760 = !{!761, !765}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !759, file: !753, line: 47, baseType: !762, size: 8)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !759, file: !753, line: 44, size: 8, elements: !763)
!763 = !{!764}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !762, file: !753, line: 45, baseType: !167, size: 1, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !759, file: !753, line: 48, baseType: !167, size: 8)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !754, file: !753, line: 286, baseType: !767, size: 8, offset: 8)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !753, line: 67, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !753, line: 61, size: 8, elements: !771)
!771 = !{!772, !776}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !770, file: !753, line: 65, baseType: !773, size: 8)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !770, file: !753, line: 62, size: 8, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !773, file: !753, line: 64, baseType: !167, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !770, file: !753, line: 66, baseType: !167, size: 8)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !754, file: !753, line: 287, baseType: !778, size: 16, offset: 16)
!778 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !753, line: 89, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !753, line: 79, size: 16, elements: !781)
!781 = !{!782, !789}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !780, file: !753, line: 87, baseType: !783, size: 16)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !780, file: !753, line: 80, size: 16, elements: !784)
!784 = !{!785, !786, !787, !788}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !783, file: !753, line: 81, baseType: !181, size: 6, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !783, file: !753, line: 83, baseType: !181, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !783, file: !753, line: 85, baseType: !181, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !783, file: !753, line: 86, baseType: !181, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !780, file: !753, line: 88, baseType: !181, size: 16)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !754, file: !753, line: 288, baseType: !791, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !753, line: 214, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !753, line: 199, size: 32, elements: !794)
!794 = !{!795, !806}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !793, file: !753, line: 212, baseType: !796, size: 32)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !793, file: !753, line: 200, size: 32, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !796, file: !753, line: 201, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !796, file: !753, line: 203, baseType: !110, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !796, file: !753, line: 205, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !796, file: !753, line: 206, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !796, file: !753, line: 207, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !796, file: !753, line: 208, baseType: !110, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !796, file: !753, line: 209, baseType: !110, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !796, file: !753, line: 210, baseType: !110, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !793, file: !753, line: 213, baseType: !110, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !754, file: !753, line: 289, baseType: !808, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !753, line: 268, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !753, line: 260, size: 32, elements: !811)
!811 = !{!812, !817}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !810, file: !753, line: 266, baseType: !813, size: 32)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !810, file: !753, line: 261, size: 32, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !813, file: !753, line: 262, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !813, file: !753, line: 264, baseType: !110, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !810, file: !753, line: 267, baseType: !110, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !820, line: 513, baseType: !821)
!820 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !820, line: 494, size: 480, elements: !822)
!822 = !{!823, !829, !839, !841, !851, !861, !871, !881, !885, !901, !917, !933, !963, !967, !977, !987, !997, !1001}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !821, file: !820, line: 495, baseType: !824, size: 8)
!824 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !820, line: 45, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !820, line: 43, size: 8, elements: !827)
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !826, file: !820, line: 44, baseType: !167, size: 8)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !821, file: !820, line: 496, baseType: !830, size: 8, offset: 8)
!830 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !820, line: 61, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !820, line: 55, size: 8, elements: !833)
!833 = !{!834, !838}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !832, file: !820, line: 59, baseType: !835, size: 8)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !832, file: !820, line: 56, size: 8, elements: !836)
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !835, file: !820, line: 57, baseType: !167, size: 2, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !832, file: !820, line: 60, baseType: !167, size: 8)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !821, file: !820, line: 497, baseType: !840, size: 48, offset: 16)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 48, elements: !258)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !821, file: !820, line: 498, baseType: !842, size: 8, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !820, line: 86, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !820, line: 80, size: 8, elements: !845)
!845 = !{!846, !850}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !844, file: !820, line: 84, baseType: !847, size: 8)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !844, file: !820, line: 81, size: 8, elements: !848)
!848 = !{!849}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !847, file: !820, line: 82, baseType: !167, size: 3, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !844, file: !820, line: 85, baseType: !167, size: 8)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !821, file: !820, line: 499, baseType: !852, size: 8, offset: 72)
!852 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !820, line: 121, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !820, line: 115, size: 8, elements: !855)
!855 = !{!856, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !854, file: !820, line: 119, baseType: !857, size: 8)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !854, file: !820, line: 116, size: 8, elements: !858)
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !857, file: !820, line: 117, baseType: !167, size: 3, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !854, file: !820, line: 120, baseType: !167, size: 8)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !821, file: !820, line: 500, baseType: !862, size: 8, offset: 80)
!862 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !820, line: 156, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !820, line: 150, size: 8, elements: !865)
!865 = !{!866, !870}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !864, file: !820, line: 154, baseType: !867, size: 8)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !864, file: !820, line: 151, size: 8, elements: !868)
!868 = !{!869}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !867, file: !820, line: 152, baseType: !167, size: 3, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !864, file: !820, line: 155, baseType: !167, size: 8)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !821, file: !820, line: 501, baseType: !872, size: 8, offset: 88)
!872 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !820, line: 191, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !820, line: 185, size: 8, elements: !875)
!875 = !{!876, !880}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !874, file: !820, line: 189, baseType: !877, size: 8)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !874, file: !820, line: 186, size: 8, elements: !878)
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !877, file: !820, line: 187, baseType: !167, size: 3, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !874, file: !820, line: 190, baseType: !167, size: 8)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !821, file: !820, line: 502, baseType: !882, size: 64, offset: 96)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 64, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 8)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !821, file: !820, line: 503, baseType: !886, size: 32, offset: 160)
!886 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !820, line: 232, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !820, line: 220, size: 32, elements: !889)
!889 = !{!890, !900}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !888, file: !820, line: 230, baseType: !891, size: 32)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !888, file: !820, line: 221, size: 32, elements: !892)
!892 = !{!893, !894, !895, !896, !897, !898, !899}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !891, file: !820, line: 222, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !891, file: !820, line: 223, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !891, file: !820, line: 224, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !891, file: !820, line: 225, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !891, file: !820, line: 226, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !891, file: !820, line: 227, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !891, file: !820, line: 228, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !888, file: !820, line: 231, baseType: !110, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !821, file: !820, line: 504, baseType: !902, size: 32, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !820, line: 268, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !820, line: 256, size: 32, elements: !905)
!905 = !{!906, !916}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !904, file: !820, line: 266, baseType: !907, size: 32)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !904, file: !820, line: 257, size: 32, elements: !908)
!908 = !{!909, !910, !911, !912, !913, !914, !915}
