; ModuleID = 'build/arduino_nano_33_ble/drivers/uart/echo_bot/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.z_heap_bucket = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "uart_msgq", scope: !27, file: !209, line: 19, type: !223, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !206, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !111, line: 336, size: 608, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !145, !149, !153, !167, !172, !178, !184, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !110, file: !111, line: 365, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DISubroutineType(types: !116)
!116 = !{!107, !117, !144}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !121)
!120 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = !{!122, !126, !127, !128, !137, !138}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 380, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !119, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !119, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !119, file: !120, line: 386, baseType: !129, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !131)
!131 = !{!132, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !130, file: !120, line: 359, baseType: !133, size: 8)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !130, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !119, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !120, line: 43, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !143)
!143 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !110, file: !111, line: 366, baseType: !146, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !117, !134}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !110, file: !111, line: 374, baseType: !150, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DISubroutineType(types: !152)
!152 = !{!107, !117}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !110, file: !111, line: 377, baseType: !154, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DISubroutineType(types: !156)
!156 = !{!107, !117, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !111, line: 122, size: 64, elements: !160)
!160 = !{!161, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !159, file: !111, line: 123, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !159, file: !111, line: 124, baseType: !133, size: 8, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !159, file: !111, line: 125, baseType: !133, size: 8, offset: 40)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !159, file: !111, line: 126, baseType: !133, size: 8, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !159, file: !111, line: 127, baseType: !133, size: 8, offset: 56)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !110, file: !111, line: 379, baseType: !168, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{!107, !117, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !110, file: !111, line: 384, baseType: !173, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{!107, !117, !176, !107}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !110, file: !111, line: 393, baseType: !179, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!107, !117, !182, !183}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !110, file: !111, line: 402, baseType: !185, size: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !117}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !110, file: !111, line: 405, baseType: !185, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !110, file: !111, line: 408, baseType: !150, size: 32, offset: 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !110, file: !111, line: 411, baseType: !185, size: 32, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !110, file: !111, line: 414, baseType: !185, size: 32, offset: 352)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !110, file: !111, line: 417, baseType: !150, size: 32, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !110, file: !111, line: 420, baseType: !150, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !110, file: !111, line: 423, baseType: !185, size: 32, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !110, file: !111, line: 426, baseType: !185, size: 32, offset: 480)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !110, file: !111, line: 429, baseType: !150, size: 32, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !110, file: !111, line: 432, baseType: !150, size: 32, offset: 544)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !110, file: !111, line: 435, baseType: !199, size: 32, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !117, !202, !102}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !111, line: 142, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !117, !102}
!206 = !{!25, !207, !211, !216, !221}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "uart_dev", scope: !27, file: !209, line: 21, type: !210, isLocal: true, isDefinition: true)
!209 = !DIFile(filename: "zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "_k_fifo_buf_uart_msgq", scope: !27, file: !209, line: 19, type: !213, isLocal: true, isDefinition: true, align: 32)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 2560, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 320)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "rx_buf", scope: !27, file: !209, line: 24, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 256, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 32)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "rx_buf_pos", scope: !27, file: !209, line: 25, type: !107, isLocal: true, isDefinition: true)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !224, line: 4204, size: 320, elements: !225)
!224 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = !{!226, !247, !251, !254, !255, !257, !258, !259, !260, !261}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !223, file: !224, line: 4206, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !228, line: 233, baseType: !229)
!228 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 231, size: 64, elements: !230)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !229, file: !228, line: 232, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !233, line: 48, baseType: !234)
!233 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !233, line: 37, size: 64, elements: !235)
!235 = !{!236, !242}
!236 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 38, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 38, size: 32, elements: !238)
!238 = !{!239, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !237, file: !233, line: 39, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !233, line: 40, baseType: !240, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 42, baseType: !243, size: 32, offset: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 42, size: 32, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !243, file: !233, line: 43, baseType: !240, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !233, line: 44, baseType: !240, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !223, file: !224, line: 4208, baseType: !248, offset: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !223, file: !224, line: 4210, baseType: !252, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !253, line: 214, baseType: !32)
!253 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !223, file: !224, line: 4212, baseType: !162, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !223, file: !224, line: 4214, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !223, file: !224, line: 4216, baseType: !256, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !223, file: !224, line: 4218, baseType: !256, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !223, file: !224, line: 4220, baseType: !256, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !223, file: !224, line: 4222, baseType: !162, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !224, line: 4227, baseType: !133, size: 8, offset: 288)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "_char_out", scope: !264, file: !268, line: 54, type: !269, isLocal: false, isDefinition: true)
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !266, globals: !267, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!266 = !{!102, !107}
!267 = !{!262}
!268 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!107, !107}
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !274, file: !310, line: 27, type: !335, isLocal: true, isDefinition: true)
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !276, retainedTypes: !288, globals: !307, splitDebugInlining: false, nameTableKind: None)
!275 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!276 = !{!277, !30}
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !278, line: 27, baseType: !32, size: 32, elements: !279)
!278 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287}
!280 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!281 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!282 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!283 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!284 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!285 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!286 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!287 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!288 = !{!102, !103, !107, !24, !289, !256, !162, !305}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !291, line: 54, size: 96, elements: !292)
!291 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = !{!293, !300, !304}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !290, file: !291, line: 55, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !295, line: 33, baseType: !296)
!295 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !295, line: 29, size: 32, elements: !297)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !295, line: 30, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !290, file: !291, line: 60, baseType: !301, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !277}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !290, file: !291, line: 65, baseType: !301, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !306)
!306 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!307 = !{!272, !308, !312, !314, !325, !327}
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !274, file: !310, line: 44, type: !311, isLocal: true, isDefinition: true)
!310 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !274, file: !310, line: 49, type: !311, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !274, file: !310, line: 36, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 128, elements: !323)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !278, line: 114, size: 128, elements: !318)
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !317, file: !278, line: 115, baseType: !277, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !317, file: !278, line: 141, baseType: !133, size: 8, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !317, file: !278, line: 149, baseType: !162, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !317, file: !278, line: 156, baseType: !162, size: 32, offset: 96)
!323 = !{!324}
!324 = !DISubrange(count: 1)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !274, file: !310, line: 40, type: !316, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !274, file: !310, line: 28, type: !329, isLocal: true, isDefinition: true)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !295, line: 40, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !295, line: 35, size: 64, elements: !331)
!331 = !{!332, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !330, file: !295, line: 36, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !330, file: !295, line: 37, baseType: !333, size: 32, offset: 32)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 32, elements: !323)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !337, line: 22, baseType: !338)
!337 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!338 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!339 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!340 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !343, file: !370, line: 50, type: !357, isLocal: true, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !276, retainedTypes: !345, globals: !367, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!345 = !{!142, !103, !252, !107, !102, !162, !305, !346, !256, !357, !358}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !348, line: 45, size: 64, elements: !349)
!348 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350, !356}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !347, file: !348, line: 46, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !295, line: 33, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !295, line: 29, size: 32, elements: !353)
!353 = !{!354}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !352, file: !295, line: 30, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !347, file: !348, line: 48, baseType: !162, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !348, line: 38, size: 64, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !359, file: !348, line: 39, baseType: !351, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !359, file: !348, line: 41, baseType: !363, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !348, line: 35, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !357}
!367 = !{!368, !372, !380, !341, !382, !392}
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "latency_lock", scope: !343, file: !370, line: 44, type: !371, isLocal: true, isDefinition: true)
!370 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !343, file: !370, line: 46, type: !374, isLocal: true, isDefinition: true)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !295, line: 40, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !295, line: 35, size: 64, elements: !376)
!376 = !{!377, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !375, file: !295, line: 36, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !375, file: !295, line: 37, baseType: !378, size: 32, offset: 32)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "latency_subs", scope: !343, file: !370, line: 52, type: !374, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !343, file: !370, line: 39, type: !384, isLocal: true, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, elements: !390)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 35, size: 96, elements: !386)
!386 = !{!387, !388, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !385, file: !370, line: 36, baseType: !277, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !385, file: !370, line: 37, baseType: !133, size: 8, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !385, file: !370, line: 38, baseType: !336, size: 32, offset: 64)
!390 = !{!391}
!391 = !DISubrange(count: 0)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !343, file: !370, line: 48, type: !357, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !396, file: !403, line: 47, type: !416, isLocal: true, isDefinition: true)
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !398, retainedTypes: !399, globals: !400, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!398 = !{!277}
!399 = !{!252, !107}
!400 = !{!401, !394, !413}
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "cpus_states", scope: !396, file: !403, line: 50, type: !404, isLocal: true, isDefinition: true)
!403 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 32, elements: !323)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !278, line: 114, size: 128, elements: !408)
!408 = !{!409, !410, !411, !412}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !407, file: !278, line: 115, baseType: !277, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !407, file: !278, line: 141, baseType: !133, size: 8, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !407, file: !278, line: 149, baseType: !162, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !407, file: !278, line: 156, baseType: !162, size: 32, offset: 96)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !396, file: !403, line: 55, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 8, elements: !323)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, elements: !390)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "static_regions", scope: !419, file: !426, line: 62, type: !558, isLocal: true, isDefinition: true)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !421, globals: !422, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!421 = !{!252, !107, !162, !102}
!422 = !{!423, !417}
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !425, file: !426, line: 198, type: !546, isLocal: true, isDefinition: true)
!425 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !426, file: !426, line: 175, type: !427, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !419, retainedNodes: !541)
!426 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!427 = !DISubroutineType(types: !428)
!428 = !{null, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !431, line: 245, size: 1024, elements: !432)
!431 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!432 = !{!433, !498, !511, !512, !513, !514, !520, !536}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !430, file: !431, line: 247, baseType: !434, size: 384)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !431, line: 57, size: 384, elements: !435)
!435 = !{!436, !463, !470, !471, !472, !485, !486, !487}
!436 = !DIDerivedType(tag: DW_TAG_member, scope: !434, file: !431, line: 60, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !434, file: !431, line: 60, size: 64, elements: !438)
!438 = !{!439, !454}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !437, file: !431, line: 61, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !233, line: 49, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !233, line: 37, size: 64, elements: !442)
!442 = !{!443, !449}
!443 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !233, line: 38, baseType: !444, size: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !233, line: 38, size: 32, elements: !445)
!445 = !{!446, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !444, file: !233, line: 39, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !444, file: !233, line: 40, baseType: !447, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !233, line: 42, baseType: !450, size: 32, offset: 32)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !233, line: 42, size: 32, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !450, file: !233, line: 43, baseType: !447, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !450, file: !233, line: 44, baseType: !447, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !437, file: !431, line: 62, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !456, line: 49, size: 64, elements: !457)
!456 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !455, file: !456, line: 50, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 64, elements: !461)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!461 = !{!462}
!462 = !DISubrange(count: 2)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !434, file: !431, line: 68, baseType: !464, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !228, line: 233, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 231, size: 64, elements: !467)
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !466, file: !228, line: 232, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !233, line: 48, baseType: !441)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !434, file: !431, line: 71, baseType: !133, size: 8, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !434, file: !431, line: 74, baseType: !133, size: 8, offset: 104)
!472 = !DIDerivedType(tag: DW_TAG_member, scope: !434, file: !431, line: 90, baseType: !473, size: 16, offset: 112)
!473 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !434, file: !431, line: 90, size: 16, elements: !474)
!474 = !{!475, !482}
!475 = !DIDerivedType(tag: DW_TAG_member, scope: !473, file: !431, line: 91, baseType: !476, size: 16)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !473, file: !431, line: 91, size: 16, elements: !477)
!477 = !{!478, !481}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !476, file: !431, line: 96, baseType: !479, size: 8)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !480)
!480 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !476, file: !431, line: 97, baseType: !133, size: 8, offset: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !473, file: !431, line: 100, baseType: !483, size: 16)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !484)
!484 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !434, file: !431, line: 107, baseType: !162, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !434, file: !431, line: 127, baseType: !102, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !434, file: !431, line: 131, baseType: !488, size: 192, offset: 192)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !228, line: 244, size: 192, elements: !489)
!489 = !{!490, !491, !497}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !488, file: !228, line: 245, baseType: !440, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !488, file: !228, line: 246, baseType: !492, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !228, line: 242, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !488, file: !228, line: 249, baseType: !105, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !430, file: !431, line: 250, baseType: !499, size: 288, offset: 384)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !500, line: 25, size: 288, elements: !501)
!500 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !499, file: !500, line: 26, baseType: !162, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !499, file: !500, line: 27, baseType: !162, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !499, file: !500, line: 28, baseType: !162, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !499, file: !500, line: 29, baseType: !162, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !499, file: !500, line: 30, baseType: !162, size: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !499, file: !500, line: 31, baseType: !162, size: 32, offset: 160)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !499, file: !500, line: 32, baseType: !162, size: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !499, file: !500, line: 33, baseType: !162, size: 32, offset: 224)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !499, file: !500, line: 34, baseType: !162, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !430, file: !431, line: 253, baseType: !102, size: 32, offset: 672)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !430, file: !431, line: 256, baseType: !465, size: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !430, file: !431, line: 294, baseType: !107, size: 32, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !430, file: !431, line: 300, baseType: !515, size: 96, offset: 800)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !431, line: 149, size: 96, elements: !516)
!516 = !{!517, !518, !519}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !515, file: !431, line: 153, baseType: !22, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !515, file: !431, line: 162, baseType: !252, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !515, file: !431, line: 168, baseType: !252, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !430, file: !431, line: 325, baseType: !521, size: 32, offset: 896)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !224, line: 5073, size: 160, elements: !523)
!523 = !{!524, !533, !534}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !522, file: !224, line: 5074, baseType: !525, size: 96)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !526, line: 56, size: 96, elements: !527)
!526 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !{!528, !531, !532}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !525, file: !526, line: 57, baseType: !529, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !526, line: 57, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !525, file: !526, line: 58, baseType: !102, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !525, file: !526, line: 59, baseType: !252, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !522, file: !224, line: 5075, baseType: !465, size: 64, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !522, file: !224, line: 5076, baseType: !535, offset: 160)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !430, file: !431, line: 343, baseType: !537, size: 64, offset: 928)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !500, line: 60, size: 64, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !537, file: !500, line: 63, baseType: !162, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !537, file: !500, line: 66, baseType: !162, size: 32, offset: 32)
!541 = !{!542, !543, !544, !545}
!542 = !DILocalVariable(name: "thread", arg: 1, scope: !425, file: !426, line: 175, type: !429)
!543 = !DILocalVariable(name: "region_num", scope: !425, file: !426, line: 200, type: !133)
!544 = !DILocalVariable(name: "guard_start", scope: !425, file: !426, line: 265, type: !22)
!545 = !DILocalVariable(name: "guard_size", scope: !425, file: !426, line: 266, type: !252)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 96, elements: !323)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !548, line: 52, size: 96, elements: !549)
!548 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !547, file: !548, line: 53, baseType: !22, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !547, file: !548, line: 54, baseType: !252, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !547, file: !548, line: 55, baseType: !553, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !554, line: 151, baseType: !555)
!554 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 149, size: 32, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !555, file: !554, line: 150, baseType: !162, size: 32)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 96, elements: !323)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !562, file: !596, line: 39, type: !133, isLocal: true, isDefinition: true)
!562 = distinct !DICompileUnit(language: DW_LANG_C99, file: !563, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !564, globals: !595, splitDebugInlining: false, nameTableKind: None)
!563 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!564 = !{!565, !102, !107, !583, !133}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !567, line: 1226, baseType: !568)
!567 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 1213, size: 352, elements: !569)
!569 = !{!570, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !568, file: !567, line: 1215, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !162)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !568, file: !567, line: 1216, baseType: !572, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !568, file: !567, line: 1217, baseType: !572, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !568, file: !567, line: 1218, baseType: !572, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !568, file: !567, line: 1219, baseType: !572, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !568, file: !567, line: 1220, baseType: !572, size: 32, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !568, file: !567, line: 1221, baseType: !572, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !568, file: !567, line: 1222, baseType: !572, size: 32, offset: 224)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !568, file: !567, line: 1223, baseType: !572, size: 32, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !568, file: !567, line: 1224, baseType: !572, size: 32, offset: 288)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !568, file: !567, line: 1225, baseType: !572, size: 32, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !586, line: 27, size: 96, elements: !587)
!586 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !585, file: !586, line: 29, baseType: !162, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !585, file: !586, line: 31, baseType: !123, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !585, file: !586, line: 37, baseType: !591, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !554, line: 146, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !554, line: 141, size: 32, elements: !593)
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !592, file: !554, line: 143, baseType: !162, size: 32)
!595 = !{!560}
!596 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !599, file: !606, line: 21, type: !269, isLocal: true, isDefinition: true)
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !601, globals: !605, splitDebugInlining: false, nameTableKind: None)
!600 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!601 = !{!602, !107, !102}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !604, line: 22, baseType: !107)
!604 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!605 = !{!597}
!606 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !609, file: !614, line: 13, type: !631, isLocal: true, isDefinition: true)
!609 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !611, splitDebugInlining: false, nameTableKind: None)
!610 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!611 = !{!612, !607}
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "mpu_config", scope: !609, file: !614, line: 37, type: !615, isLocal: false, isDefinition: true)
!614 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !586, line: 41, size: 64, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !616, file: !586, line: 43, baseType: !162, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !616, file: !586, line: 45, baseType: !620, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !586, line: 27, size: 96, elements: !623)
!623 = !{!624, !625, !626}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !622, file: !586, line: 29, baseType: !162, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !622, file: !586, line: 31, baseType: !123, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !622, file: !586, line: 37, baseType: !627, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !554, line: 146, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !554, line: 141, size: 32, elements: !629)
!629 = !{!630}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !628, file: !554, line: 143, baseType: !162, size: 32)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 192, elements: !461)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !634, file: !804, line: 93, type: !805, isLocal: true, isDefinition: true, align: 32)
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !636, globals: !799, splitDebugInlining: false, nameTableKind: None)
!635 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!636 = !{!637, !133, !102, !107, !717, !162, !718, !754, !765}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !639, line: 1071, baseType: !640)
!639 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 1035, size: 19584, elements: !641)
!641 = !{!642, !646, !647, !648, !652, !653, !655, !656, !657, !658, !659, !660, !664, !665, !666, !670, !671, !675, !676, !680, !681, !685, !686, !687, !688, !689, !690, !691, !695, !696, !697, !698, !702, !703, !707}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !640, file: !639, line: 1036, baseType: !643, size: 960)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 960, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 30)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !640, file: !639, line: 1037, baseType: !572, size: 32, offset: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !640, file: !639, line: 1038, baseType: !572, size: 32, offset: 992)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !640, file: !639, line: 1039, baseType: !649, size: 1088, offset: 1024)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 1088, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 34)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !640, file: !639, line: 1040, baseType: !572, size: 32, offset: 2112)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !640, file: !639, line: 1041, baseType: !654, size: 64, offset: 2144)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 64, elements: !461)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !640, file: !639, line: 1042, baseType: !572, size: 32, offset: 2208)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !640, file: !639, line: 1043, baseType: !572, size: 32, offset: 2240)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !640, file: !639, line: 1044, baseType: !572, size: 32, offset: 2272)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !640, file: !639, line: 1045, baseType: !572, size: 32, offset: 2304)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !640, file: !639, line: 1046, baseType: !572, size: 32, offset: 2336)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !640, file: !639, line: 1047, baseType: !661, size: 3808, offset: 2368)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 3808, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 119)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !640, file: !639, line: 1048, baseType: !572, size: 32, offset: 6176)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !640, file: !639, line: 1049, baseType: !572, size: 32, offset: 6208)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !640, file: !639, line: 1050, baseType: !667, size: 1952, offset: 6240)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 1952, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 61)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !640, file: !639, line: 1051, baseType: !572, size: 32, offset: 8192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !640, file: !639, line: 1052, baseType: !672, size: 288, offset: 8224)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 288, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 9)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !640, file: !639, line: 1053, baseType: !571, size: 32, offset: 8512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !640, file: !639, line: 1054, baseType: !677, size: 96, offset: 8544)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 96, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 3)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !640, file: !639, line: 1055, baseType: !571, size: 32, offset: 8640)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !640, file: !639, line: 1056, baseType: !682, size: 1568, offset: 8672)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 1568, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 49)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !640, file: !639, line: 1057, baseType: !572, size: 32, offset: 10240)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !640, file: !639, line: 1058, baseType: !677, size: 96, offset: 10272)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !640, file: !639, line: 1059, baseType: !572, size: 32, offset: 10368)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !640, file: !639, line: 1060, baseType: !654, size: 64, offset: 10400)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !640, file: !639, line: 1061, baseType: !572, size: 32, offset: 10464)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !640, file: !639, line: 1062, baseType: !572, size: 32, offset: 10496)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !640, file: !639, line: 1063, baseType: !692, size: 672, offset: 10528)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 672, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 21)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !640, file: !639, line: 1064, baseType: !572, size: 32, offset: 11200)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !640, file: !639, line: 1065, baseType: !571, size: 32, offset: 11232)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !640, file: !639, line: 1066, baseType: !572, size: 32, offset: 11264)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !640, file: !639, line: 1067, baseType: !699, size: 1504, offset: 11296)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 1504, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 47)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !640, file: !639, line: 1068, baseType: !571, size: 32, offset: 12800)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !640, file: !639, line: 1069, baseType: !704, size: 5600, offset: 12832)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 5600, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 175)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !640, file: !639, line: 1070, baseType: !708, size: 1152, offset: 18432)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 1152, elements: !673)
!709 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !639, line: 278, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 272, size: 128, elements: !712)
!712 = !{!713, !714, !715, !716}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !711, file: !639, line: 273, baseType: !572, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !711, file: !639, line: 274, baseType: !572, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !711, file: !639, line: 275, baseType: !572, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !711, file: !639, line: 277, baseType: !571, size: 32, offset: 96)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !567, line: 468, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 445, size: 1120, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !747, !751, !753}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !720, file: !567, line: 447, baseType: !571, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !720, file: !567, line: 448, baseType: !572, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !720, file: !567, line: 449, baseType: !572, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !720, file: !567, line: 450, baseType: !572, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !720, file: !567, line: 451, baseType: !572, size: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !720, file: !567, line: 452, baseType: !572, size: 32, offset: 160)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !720, file: !567, line: 453, baseType: !729, size: 96, offset: 192)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 96, elements: !731)
!730 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!731 = !{!732}
!732 = !DISubrange(count: 12)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !720, file: !567, line: 454, baseType: !572, size: 32, offset: 288)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !720, file: !567, line: 455, baseType: !572, size: 32, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !720, file: !567, line: 456, baseType: !572, size: 32, offset: 352)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !720, file: !567, line: 457, baseType: !572, size: 32, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !720, file: !567, line: 458, baseType: !572, size: 32, offset: 416)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !720, file: !567, line: 459, baseType: !572, size: 32, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !720, file: !567, line: 460, baseType: !572, size: 32, offset: 480)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !720, file: !567, line: 461, baseType: !654, size: 64, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !720, file: !567, line: 462, baseType: !571, size: 32, offset: 576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !720, file: !567, line: 463, baseType: !571, size: 32, offset: 608)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !720, file: !567, line: 464, baseType: !744, size: 128, offset: 640)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 128, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 4)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !720, file: !567, line: 465, baseType: !748, size: 160, offset: 768)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 160, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 5)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !720, file: !567, line: 466, baseType: !752, size: 160, offset: 928)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 160, elements: !749)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !720, file: !567, line: 467, baseType: !572, size: 32, offset: 1088)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !756, file: !755, line: 167, baseType: !764)
!755 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!756 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !755, file: !755, line: 134, type: !757, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !634, retainedNodes: !759)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !162}
!759 = !{!760, !761, !763}
!760 = !DILocalVariable(name: "time_us", arg: 1, scope: !756, file: !755, line: 134, type: !162)
!761 = !DILocalVariable(name: "delay_cycles", scope: !756, file: !755, line: 168, type: !762)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!763 = !DILocalVariable(name: "cycles", scope: !756, file: !755, line: 171, type: !162)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !639, line: 2399, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 2373, size: 10880, elements: !768)
!768 = !{!769, !773, !774, !775, !776, !780, !781, !786, !787, !788, !789, !790, !791, !795, !796, !797, !798}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !767, file: !639, line: 2374, baseType: !770, size: 8192)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 8192, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !767, file: !639, line: 2375, baseType: !571, size: 32, offset: 8192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !767, file: !639, line: 2376, baseType: !571, size: 32, offset: 8224)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !767, file: !639, line: 2377, baseType: !571, size: 32, offset: 8256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !767, file: !639, line: 2378, baseType: !777, size: 1984, offset: 8288)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 1984, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 62)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !767, file: !639, line: 2379, baseType: !572, size: 32, offset: 10272)
!781 = !DIDerivedType(tag: DW_TAG_member, scope: !767, file: !639, line: 2381, baseType: !782, size: 32, offset: 10304)
!782 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !767, file: !639, line: 2381, size: 32, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !782, file: !639, line: 2382, baseType: !572, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !782, file: !639, line: 2383, baseType: !572, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !767, file: !639, line: 2386, baseType: !572, size: 32, offset: 10336)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !767, file: !639, line: 2387, baseType: !572, size: 32, offset: 10368)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !767, file: !639, line: 2389, baseType: !572, size: 32, offset: 10400)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !767, file: !639, line: 2391, baseType: !572, size: 32, offset: 10432)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !767, file: !639, line: 2393, baseType: !572, size: 32, offset: 10464)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !767, file: !639, line: 2394, baseType: !792, size: 256, offset: 10496)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 256, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 8)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !767, file: !639, line: 2395, baseType: !572, size: 32, offset: 10752)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !767, file: !639, line: 2396, baseType: !571, size: 32, offset: 10784)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !767, file: !639, line: 2397, baseType: !572, size: 32, offset: 10816)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !767, file: !639, line: 2398, baseType: !572, size: 32, offset: 10848)
!799 = !{!632, !800}
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !756, file: !755, line: 161, type: !802, isLocal: true, isDefinition: true, align: 128)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 48, elements: !678)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!804 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !807, line: 51, size: 64, elements: !808)
!807 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!808 = !{!809, !816}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !806, file: !807, line: 60, baseType: !810, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DISubroutineType(types: !812)
!812 = !{!107, !813}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !807, line: 48, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !806, file: !807, line: 65, baseType: !813, size: 32, offset: 32)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "__init_board_init", scope: !819, file: !918, line: 36, type: !933, isLocal: true, isDefinition: true, align: 32)
!819 = distinct !DICompileUnit(language: DW_LANG_C99, file: !820, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !821, retainedTypes: !833, globals: !914, splitDebugInlining: false, nameTableKind: None)
!820 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!821 = !{!822, !828}
!822 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !823, line: 506, baseType: !32, size: 32, elements: !824)
!823 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!824 = !{!825, !826, !827}
!825 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!826 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!827 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!828 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !823, line: 512, baseType: !32, size: 32, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!831 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!832 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!833 = !{!834, !903, !908, !869, !828, !822, !913, !102}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !823, line: 523, size: 288, elements: !837)
!837 = !{!838, !859, !865, !870, !874, !875, !876, !880, !899}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !836, file: !823, line: 524, baseType: !839, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{!107, !842, !857, !858}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !845)
!845 = !{!846, !847, !848, !849, !855, !856}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !844, file: !120, line: 380, baseType: !123, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !844, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !844, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !844, file: !120, line: 386, baseType: !850, size: 32, offset: 96)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !851, file: !120, line: 359, baseType: !133, size: 8)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !851, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !844, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !844, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !823, line: 237, baseType: !133)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !823, line: 257, baseType: !162)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !836, file: !823, line: 530, baseType: !860, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{!107, !842, !863}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !823, line: 229, baseType: !162)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !836, file: !823, line: 532, baseType: !866, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(types: !868)
!868 = !{!107, !842, !869, !864}
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !823, line: 216, baseType: !162)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !836, file: !823, line: 535, baseType: !871, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = !DISubroutineType(types: !873)
!873 = !{!107, !842, !869}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !836, file: !823, line: 537, baseType: !871, size: 32, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !836, file: !823, line: 539, baseType: !871, size: 32, offset: 160)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !836, file: !823, line: 541, baseType: !877, size: 32, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DISubroutineType(types: !879)
!879 = !{!107, !842, !857, !822, !828}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !836, file: !823, line: 544, baseType: !881, size: 32, offset: 224)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DISubroutineType(types: !883)
!883 = !{!107, !842, !884, !136}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !823, line: 478, size: 96, elements: !886)
!886 = !{!887, !893, !898}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !885, file: !823, line: 482, baseType: !888, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !295, line: 33, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !295, line: 29, size: 32, elements: !890)
!890 = !{!891}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !889, file: !295, line: 30, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !885, file: !823, line: 485, baseType: !894, size: 32, offset: 32)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !823, line: 464, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !842, !884, !869}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !885, file: !823, line: 493, baseType: !869, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !836, file: !823, line: 547, baseType: !900, size: 32, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DISubroutineType(types: !902)
!902 = !{!162, !842}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !823, line: 428, size: 32, elements: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !905, file: !823, line: 434, baseType: !869, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !823, line: 441, size: 32, elements: !911)
!911 = !{!912}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !910, file: !823, line: 447, baseType: !869, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!914 = !{!817, !915, !931}
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "pull_up", scope: !917, file: !918, line: 15, type: !924, isLocal: true, isDefinition: true)
!917 = distinct !DISubprogram(name: "board_init", scope: !918, file: !918, line: 10, type: !919, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !819, retainedNodes: !921)
!918 = !DIFile(filename: "zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!919 = !DISubroutineType(types: !920)
!920 = !{!107, !842}
!921 = !{!922, !923}
!922 = !DILocalVariable(name: "dev", arg: 1, scope: !917, file: !918, line: 10, type: !842)
!923 = !DILocalVariable(name: "res", scope: !917, file: !918, line: 14, type: !107)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !823, line: 271, size: 64, elements: !926)
!926 = !{!927, !928, !929}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !925, file: !823, line: 273, baseType: !842, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !925, file: !823, line: 275, baseType: !857, size: 8, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !925, file: !823, line: 277, baseType: !930, size: 16, offset: 48)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !823, line: 249, baseType: !483)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "user_led", scope: !917, file: !918, line: 17, type: !924, isLocal: true, isDefinition: true)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !807, line: 51, size: 64, elements: !935)
!935 = !{!936, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !934, file: !807, line: 60, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !934, file: !807, line: 65, baseType: !842, size: 32, offset: 32)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "__device_dts_ord_68", scope: !941, file: !1175, line: 733, type: !1276, isLocal: false, isDefinition: true, align: 32)
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !943, retainedTypes: !1086, globals: !1171, splitDebugInlining: false, nameTableKind: None)
!942 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/drivers/uart/echo_bot")
!943 = !{!944, !950, !30, !955, !960, !967, !975, !983, !992, !996, !1051, !1058, !1077}
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !945, line: 23, baseType: !32, size: 32, elements: !946)
!945 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!946 = !{!947, !948, !949}
!947 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!948 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!949 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!950 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !945, line: 48, baseType: !32, size: 32, elements: !951)
!951 = !{!952, !953, !954}
!952 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!953 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!954 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!955 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !956, line: 167, baseType: !32, size: 32, elements: !957)
!956 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!957 = !{!958, !959}
!958 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!959 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!960 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !956, line: 107, baseType: !32, size: 32, elements: !961)
!961 = !{!962, !963, !964, !965, !966}
!962 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!963 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!964 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!965 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!966 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!967 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !956, line: 208, baseType: !32, size: 32, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974}
!969 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!970 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!971 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!972 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!973 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!974 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!975 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !956, line: 261, baseType: !32, size: 32, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !982}
!977 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!978 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!979 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!980 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!981 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!982 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!983 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !956, line: 237, baseType: !32, size: 32, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991}
!985 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!986 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!987 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!988 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!989 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!990 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!991 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!992 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !956, line: 152, baseType: !32, size: 32, elements: !993)
!993 = !{!994, !995}
!994 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!995 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!996 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !639, line: 71, baseType: !107, size: 32, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050}
!998 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!999 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!1000 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!1001 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!1002 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!1003 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!1004 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!1005 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!1006 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!1007 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!1008 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!1009 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!1010 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!1011 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!1012 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!1013 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!1014 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!1015 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!1016 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!1017 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!1018 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!1019 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!1020 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!1021 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!1022 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!1023 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!1024 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!1025 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!1026 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!1027 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!1028 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!1029 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!1030 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!1031 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!1032 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!1033 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!1034 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!1035 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!1036 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!1037 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!1038 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!1039 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!1040 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!1041 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!1042 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!1043 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!1044 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!1045 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!1046 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!1047 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!1048 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!1049 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!1050 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!1051 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !1052, line: 44, baseType: !32, size: 32, elements: !1053)
!1052 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1053 = !{!1054, !1055, !1056, !1057}
!1054 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!1055 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!1056 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!1057 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!1058 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1059, line: 54, baseType: !32, size: 32, elements: !1060)
!1059 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076}
