; ModuleID = './build/spi_master_polling.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.gpio_backup_restore_t = type { i32, i32 }
%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_spi_master_config_t = type { i32, i32, i32, i32, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.__va_list = type { i8* }
%struct.hal_spi_master_send_and_receive_config_t = type { i8*, i32, i8*, i32 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }

!63 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !52, line: 62, baseType: !53)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !52, line: 116, baseType: !53)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !52, line: 59, baseType: !70)
!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !74, line: 48, baseType: !75)
!74 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !76, line: 79, baseType: !53)
!76 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!77 = !{!0}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "HALSPIM_ISR", file: !79, line: 45, baseType: !80)
!79 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_spim.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!81 = !DISubroutineType(types: !82)
!82 = !{null}
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "gpio_bakup_table", scope: !85, file: !86, line: 62, type: !131, isLocal: true, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !87, retainedTypes: !129, globals: !130, splitDebugInlining: false, nameTableKind: None)
!86 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/low_hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!87 = !{!88, !119, !124}
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 55, baseType: !53, size: 32, elements: !90)
!89 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!91 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!92 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!93 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!94 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!95 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!96 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!97 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!98 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!99 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!100 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!101 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!102 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!103 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!104 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!105 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!106 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!107 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!108 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!109 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!110 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!111 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!112 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!113 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!114 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!115 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!116 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!117 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!118 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 57, baseType: !53, size: 32, elements: !121)
!120 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!121 = !{!122, !123}
!122 = !DIEnumerator(name: "eDirection_IN", value: 0)
!123 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 1209, baseType: !53, size: 32, elements: !126)
!125 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!126 = !{!127, !128}
!127 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!128 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!129 = !{!65}
!130 = !{!83}
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 1408, elements: !137)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_backup_restore_t", file: !86, line: 60, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 57, size: 64, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reg_data", scope: !133, file: !86, line: 58, baseType: !73, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reg_addr", scope: !133, file: !86, line: 59, baseType: !73, size: 32, offset: 32)
!137 = !{!138}
!138 = !DISubrange(count: 22)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "spi_ok_cnt", scope: !141, file: !142, line: 51, type: !192, isLocal: true, isDefinition: true)
!141 = distinct !DICompileUnit(language: DW_LANG_C99, file: !142, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, retainedTypes: !153, globals: !156, splitDebugInlining: false, nameTableKind: None)
!142 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/spim.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!143 = !{!144, !149}
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !145, line: 217, baseType: !53, size: 32, elements: !146)
!145 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!146 = !{!147, !148}
!147 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!148 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !145, line: 210, baseType: !53, size: 32, elements: !150)
!150 = !{!151, !152}
!151 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!152 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!153 = !{!154, !65}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !74, line: 44, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !76, line: 77, baseType: !7)
!156 = !{!157, !174, !176, !139, !190}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "remainder", scope: !159, file: !142, line: 109, type: !73, isLocal: true, isDefinition: true)
!159 = distinct !DISubprogram(name: "spim_write", scope: !142, file: !142, line: 103, type: !160, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !141, retainedNodes: !166)
!160 = !DISubroutineType(types: !161)
!161 = !{!154, !162, !165}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !74, line: 24, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !76, line: 43, baseType: !70)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!166 = !{!167, !168, !169, !171, !172, !173}
!167 = !DILocalVariable(name: "buf", arg: 1, scope: !159, file: !142, line: 103, type: !162)
!168 = !DILocalVariable(name: "buf_cnt", arg: 2, scope: !159, file: !142, line: 103, type: !165)
!169 = !DILocalVariable(name: "ret", scope: !159, file: !142, line: 105, type: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !52, line: 56, baseType: !7)
!171 = !DILocalVariable(name: "op_addr", scope: !159, file: !142, line: 106, type: !73)
!172 = !DILocalVariable(name: "n_cmd_byte", scope: !159, file: !142, line: 107, type: !73)
!173 = !DILocalVariable(name: "i", scope: !159, file: !142, line: 108, type: !73)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "regVal", scope: !159, file: !142, line: 109, type: !73, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "remainder", scope: !178, file: !142, line: 152, type: !73, isLocal: true, isDefinition: true)
!178 = distinct !DISubprogram(name: "spim_read", scope: !142, file: !142, line: 146, type: !179, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !141, retainedNodes: !181)
!179 = !DISubroutineType(types: !180)
!180 = !{!154, !165, !165, !162, !165}
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189}
!182 = !DILocalVariable(name: "cmd", arg: 1, scope: !178, file: !142, line: 146, type: !165)
!183 = !DILocalVariable(name: "n_cmd_byte", arg: 2, scope: !178, file: !142, line: 146, type: !165)
!184 = !DILocalVariable(name: "buf", arg: 3, scope: !178, file: !142, line: 146, type: !162)
!185 = !DILocalVariable(name: "buf_cnt", arg: 4, scope: !178, file: !142, line: 146, type: !165)
!186 = !DILocalVariable(name: "ret", scope: !178, file: !142, line: 148, type: !170)
!187 = !DILocalVariable(name: "fake_op", scope: !178, file: !142, line: 149, type: !73)
!188 = !DILocalVariable(name: "fake_cmd_byte", scope: !178, file: !142, line: 150, type: !73)
!189 = !DILocalVariable(name: "i", scope: !178, file: !142, line: 151, type: !73)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "quotient", scope: !141, file: !142, line: 52, type: !73, isLocal: true, isDefinition: true)
!192 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !154)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !195, file: !196, line: 43, type: !73, isLocal: true, isDefinition: true)
!195 = distinct !DICompileUnit(language: DW_LANG_C99, file: !196, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !197, globals: !200, splitDebugInlining: false, nameTableKind: None)
!196 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!197 = !{!198, !64, !71, !62}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!200 = !{!193, !201}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !195, file: !196, line: 44, type: !73, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !205, file: !206, line: 54, type: !73, isLocal: false, isDefinition: true)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !207, retainedTypes: !231, globals: !238, splitDebugInlining: false, nameTableKind: None)
!206 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!207 = !{!208, !214}
!208 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !209, line: 71, baseType: !53, size: 32, elements: !210)
!209 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!210 = !{!211, !212, !213}
!211 = !DIEnumerator(name: "UART_PORT0", value: 0)
!212 = !DIEnumerator(name: "UART_PORT1", value: 1)
!213 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !215, line: 129, baseType: !53, size: 32, elements: !216)
!215 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!217 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!218 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!219 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!220 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!221 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!222 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!223 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!224 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!225 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!226 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!227 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!228 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!229 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!230 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!231 = !{!198, !73, !232, !234, !69, !236, !64}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !52, line: 113, baseType: !235)
!235 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !69)
!238 = !{!203}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !241, file: !242, line: 51, type: !321, isLocal: false, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !243, retainedTypes: !290, globals: !320, splitDebugInlining: false, nameTableKind: None)
!242 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!243 = !{!244, !255, !274, !281}
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !245, line: 163, baseType: !7, size: 32, elements: !246)
!245 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254}
!247 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!248 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!249 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!250 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!251 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!252 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!253 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!254 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !245, line: 186, baseType: !53, size: 32, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!257 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!258 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!259 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!260 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!261 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!262 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!263 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!264 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!265 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!266 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!267 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!268 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!269 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!270 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!271 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!272 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!273 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !245, line: 176, baseType: !53, size: 32, elements: !275)
!275 = !{!276, !277, !278, !279, !280}
!276 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!277 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!278 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!279 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!280 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !282, line: 99, baseType: !53, size: 32, elements: !283)
!282 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!283 = !{!284, !285, !286, !287, !288, !289}
!284 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!285 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!286 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!287 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!288 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!289 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!290 = !{!291, !68}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !293, line: 72, baseType: !294)
!293 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 56, size: 525312, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !310, !311, !315, !319}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !294, file: !293, line: 57, baseType: !72, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !294, file: !293, line: 58, baseType: !72, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !294, file: !293, line: 59, baseType: !72, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !294, file: !293, line: 60, baseType: !72, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !294, file: !293, line: 61, baseType: !72, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !294, file: !293, line: 62, baseType: !72, size: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !294, file: !293, line: 63, baseType: !72, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !294, file: !293, line: 64, baseType: !72, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !294, file: !293, line: 65, baseType: !72, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !294, file: !293, line: 66, baseType: !72, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !294, file: !293, line: 67, baseType: !307, size: 32, offset: 320)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 1)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !294, file: !293, line: 68, baseType: !72, size: 32, offset: 352)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !294, file: !293, line: 69, baseType: !312, size: 523904, offset: 384)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 523904, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 16372)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !294, file: !293, line: 70, baseType: !316, size: 512, offset: 524288)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 512, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 16)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !294, file: !293, line: 71, baseType: !316, size: 512, offset: 524800)
!320 = !{!239}
!321 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !322)
!322 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !325, file: !326, line: 53, type: !413, isLocal: false, isDefinition: true)
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !327, retainedTypes: !336, globals: !412, splitDebugInlining: false, nameTableKind: None)
!326 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!327 = !{!328, !5}
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !329, line: 152, baseType: !7, size: 32, elements: !330)
!329 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!330 = !{!331, !332, !333, !334, !335}
!331 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!332 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!333 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!334 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!335 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!336 = !{!337, !68, !73, !154, !339, !373}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !6, line: 97, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !6, line: 95, baseType: !5)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !341, line: 378, baseType: !342)
!341 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 363, size: 28704, elements: !343)
!343 = !{!344, !348, !352, !353, !354, !355, !356, !357, !358, !359, !363, !368, !372}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !342, file: !341, line: 365, baseType: !345, size: 256)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 8)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !342, file: !341, line: 366, baseType: !349, size: 768, offset: 256)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 768, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 24)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !342, file: !341, line: 367, baseType: !345, size: 256, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !342, file: !341, line: 368, baseType: !349, size: 768, offset: 1280)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !342, file: !341, line: 369, baseType: !345, size: 256, offset: 2048)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !342, file: !341, line: 370, baseType: !349, size: 768, offset: 2304)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !342, file: !341, line: 371, baseType: !345, size: 256, offset: 3072)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !342, file: !341, line: 372, baseType: !349, size: 768, offset: 3328)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !342, file: !341, line: 373, baseType: !345, size: 256, offset: 4096)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !342, file: !341, line: 374, baseType: !360, size: 1792, offset: 4352)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 1792, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 56)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !342, file: !341, line: 375, baseType: !364, size: 1920, offset: 6144)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 1920, elements: !366)
!365 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !163)
!366 = !{!367}
!367 = !DISubrange(count: 240)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !342, file: !341, line: 376, baseType: !369, size: 20608, offset: 8064)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 20608, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 644)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !342, file: !341, line: 377, baseType: !72, size: 32, offset: 28672)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !341, line: 418, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 395, size: 1120, elements: !376)
!376 = !{!377, !379, !380, !381, !382, !383, !384, !388, !389, !390, !391, !392, !393, !394, !395, !399, !400, !401, !405, !409, !411}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !375, file: !341, line: 397, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !375, file: !341, line: 398, baseType: !72, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !375, file: !341, line: 399, baseType: !72, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !375, file: !341, line: 400, baseType: !72, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !375, file: !341, line: 401, baseType: !72, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !375, file: !341, line: 402, baseType: !72, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !375, file: !341, line: 403, baseType: !385, size: 96, offset: 192)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 96, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 12)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !375, file: !341, line: 404, baseType: !72, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !375, file: !341, line: 405, baseType: !72, size: 32, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !375, file: !341, line: 406, baseType: !72, size: 32, offset: 352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !375, file: !341, line: 407, baseType: !72, size: 32, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !375, file: !341, line: 408, baseType: !72, size: 32, offset: 416)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !375, file: !341, line: 409, baseType: !72, size: 32, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !375, file: !341, line: 410, baseType: !72, size: 32, offset: 480)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !375, file: !341, line: 411, baseType: !396, size: 64, offset: 512)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 64, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 2)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !375, file: !341, line: 412, baseType: !378, size: 32, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !375, file: !341, line: 413, baseType: !378, size: 32, offset: 608)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !375, file: !341, line: 414, baseType: !402, size: 128, offset: 640)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 128, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 4)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !375, file: !341, line: 415, baseType: !406, size: 160, offset: 768)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 160, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 5)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !375, file: !341, line: 416, baseType: !410, size: 160, offset: 928)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 160, elements: !407)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !375, file: !341, line: 417, baseType: !72, size: 32, offset: 1088)
!412 = !{!323}
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 6144, elements: !422)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !326, line: 50, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 47, size: 64, elements: !416)
!416 = !{!417, !421}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !415, file: !326, line: 48, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 32)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !337}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !415, file: !326, line: 49, baseType: !73, size: 32, offset: 32)
!422 = !{!423}
!423 = !DISubrange(count: 96)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "g_spi_master_status", scope: !426, file: !427, line: 57, type: !365, isLocal: true, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !428, retainedTypes: !494, globals: !495, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_spi_master.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!428 = !{!429, !437, !442, !447, !451, !455, !144, !459, !463}
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !430, line: 550, baseType: !7, size: 32, elements: !431)
!430 = !DIFile(filename: "../../../../../driver/chip/inc/hal_spi_master.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!431 = !{!432, !433, !434, !435, !436}
!432 = !DIEnumerator(name: "HAL_SPI_MASTER_STATUS_ERROR", value: -4)
!433 = !DIEnumerator(name: "HAL_SPI_MASTER_STATUS_ERROR_BUSY", value: -3)
!434 = !DIEnumerator(name: "HAL_SPI_MASTER_STATUS_ERROR_PORT", value: -2)
!435 = !DIEnumerator(name: "HAL_SPI_MASTER_STATUS_INVALID_PARAMETER", value: -1)
!436 = !DIEnumerator(name: "HAL_SPI_MASTER_STATUS_OK", value: 0)
!437 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !438, line: 459, baseType: !53, size: 32, elements: !439)
!438 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!439 = !{!440, !441}
!440 = !DIEnumerator(name: "HAL_SPI_MASTER_0", value: 0)
!441 = !DIEnumerator(name: "HAL_SPI_MASTER_MAX", value: 1)
!442 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !438, line: 466, baseType: !53, size: 32, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIEnumerator(name: "HAL_SPI_MASTER_SLAVE_0", value: 0)
!445 = !DIEnumerator(name: "HAL_SPI_MASTER_SLAVE_1", value: 1)
!446 = !DIEnumerator(name: "HAL_SPI_MASTER_SLAVE_MAX", value: 2)
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !438, line: 487, baseType: !53, size: 32, elements: !448)
!448 = !{!449, !450}
!449 = !DIEnumerator(name: "HAL_SPI_MASTER_LSB_FIRST", value: 0)
!450 = !DIEnumerator(name: "HAL_SPI_MASTER_MSB_FIRST", value: 1)
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !438, line: 473, baseType: !53, size: 32, elements: !452)
!452 = !{!453, !454}
!453 = !DIEnumerator(name: "HAL_SPI_MASTER_CLOCK_POLARITY0", value: 0)
!454 = !DIEnumerator(name: "HAL_SPI_MASTER_CLOCK_POLARITY1", value: 1)
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !438, line: 480, baseType: !53, size: 32, elements: !456)
!456 = !{!457, !458}
!457 = !DIEnumerator(name: "HAL_SPI_MASTER_CLOCK_PHASE0", value: 0)
!458 = !DIEnumerator(name: "HAL_SPI_MASTER_CLOCK_PHASE1", value: 1)
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !430, line: 560, baseType: !53, size: 32, elements: !460)
!460 = !{!461, !462}
!461 = !DIEnumerator(name: "HAL_SPI_MASTER_BUSY", value: 0)
!462 = !DIEnumerator(name: "HAL_SPI_MASTER_IDLE", value: 1)
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !438, line: 249, baseType: !53, size: 32, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!465 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!466 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!467 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!468 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!469 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!470 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!471 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!472 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!473 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!474 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!475 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!476 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!477 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!478 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!479 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!480 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!481 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!482 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!483 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!484 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!485 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!486 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!487 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!488 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!489 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!490 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!491 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!492 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!493 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!494 = !{!68, !58, !71, !73}
!495 = !{!496, !424, !510, !513}
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "g_spi_master_context", scope: !426, file: !427, line: 49, type: !498, isLocal: true, isDefinition: true)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_spi_master_config_t", file: !430, line: 580, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 574, size: 160, elements: !500)
!500 = !{!501, !502, !504, !506, !508}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "clock_frequency", scope: !499, file: !430, line: 575, baseType: !73, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "slave_port", scope: !499, file: !430, line: 576, baseType: !503, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_spi_master_slave_port_t", file: !438, line: 470, baseType: !442)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "bit_order", scope: !499, file: !430, line: 577, baseType: !505, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_spi_master_bit_order_t", file: !438, line: 490, baseType: !447)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !499, file: !430, line: 578, baseType: !507, size: 32, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_spi_master_clock_polarity_t", file: !438, line: 476, baseType: !451)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !499, file: !430, line: 579, baseType: !509, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_spi_master_clock_phase_t", file: !438, line: 483, baseType: !455)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "g_spi_master_cs_n", scope: !426, file: !427, line: 58, type: !512, isLocal: false, isDefinition: true)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_pin_t", file: !438, line: 281, baseType: !463)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "hal_spi_source_clock", scope: !515, file: !427, line: 96, type: !165, isLocal: true, isDefinition: true)
!515 = distinct !DISubprogram(name: "hal_spi_master_calc_divisor", scope: !427, file: !427, line: 91, type: !516, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !426, retainedNodes: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{!73, !73}
!518 = !{!519}
!519 = !DILocalVariable(name: "frequency", arg: 1, scope: !515, file: !427, line: 91, type: !73)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !522, file: !523, line: 77, type: !588, isLocal: true, isDefinition: true)
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !524, retainedTypes: !574, globals: !576, splitDebugInlining: false, nameTableKind: None)
!523 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!524 = !{!525, !533, !538, !554, !560, !564, !208, !214, !569}
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 345, baseType: !7, size: 32, elements: !527)
!526 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!527 = !{!528, !529, !530, !531, !532}
!528 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!529 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!530 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!531 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!532 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !438, line: 109, baseType: !53, size: 32, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!536 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!537 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 302, baseType: !53, size: 32, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!540 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!541 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!542 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!543 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!544 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!545 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!546 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!547 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!548 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!549 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!550 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!551 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!552 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!553 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!554 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 321, baseType: !53, size: 32, elements: !555)
!555 = !{!556, !557, !558, !559}
!556 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!557 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!558 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!559 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!560 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 330, baseType: !53, size: 32, elements: !561)
!561 = !{!562, !563}
!562 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!563 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!564 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 337, baseType: !53, size: 32, elements: !565)
!565 = !{!566, !567, !568}
!566 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!567 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!568 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!569 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 355, baseType: !7, size: 32, elements: !570)
!570 = !{!571, !572, !573}
!571 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!572 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!573 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!574 = !{!53, !68, !70, !575, !163}
!575 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!576 = !{!520, !577}
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "func_tbl", scope: !579, file: !523, line: 536, type: !586, isLocal: true, isDefinition: true)
!579 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !523, file: !523, line: 534, type: !580, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !522, retainedNodes: !584)
!580 = !DISubroutineType(types: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !215, line: 197, baseType: !80)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !438, line: 113, baseType: !533)
!584 = !{!585}
!585 = !DILocalVariable(name: "uart_port", arg: 1, scope: !579, file: !523, line: 534, type: !583)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 64, elements: !397)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 1024, elements: !397)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !523, line: 75, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 68, size: 512, elements: !591)
!591 = !{!592, !593, !605, !606, !617, !618}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !590, file: !523, line: 69, baseType: !322, size: 8)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !590, file: !523, line: 70, baseType: !594, size: 128, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !526, line: 378, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 373, size: 128, elements: !596)
!596 = !{!597, !599, !601, !603}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !595, file: !526, line: 374, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !526, line: 317, baseType: !538)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !595, file: !526, line: 375, baseType: !600, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !526, line: 326, baseType: !554)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !595, file: !526, line: 376, baseType: !602, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !526, line: 333, baseType: !560)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !595, file: !526, line: 377, baseType: !604, size: 32, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !526, line: 341, baseType: !564)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !590, file: !523, line: 71, baseType: !322, size: 8, offset: 160)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !590, file: !523, line: 72, baseType: !607, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !523, line: 66, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 63, size: 64, elements: !609)
!609 = !{!610, !616}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !608, file: !523, line: 64, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !526, line: 410, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !615, !68}
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !526, line: 359, baseType: !569)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !608, file: !523, line: 65, baseType: !68, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !590, file: !523, line: 73, baseType: !322, size: 8, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !590, file: !523, line: 74, baseType: !619, size: 224, offset: 288)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !526, line: 390, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 382, size: 224, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !620, file: !526, line: 383, baseType: !162, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !620, file: !526, line: 384, baseType: !73, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !620, file: !526, line: 385, baseType: !73, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !620, file: !526, line: 386, baseType: !162, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !620, file: !526, line: 387, baseType: !73, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !620, file: !526, line: 388, baseType: !73, size: 32, offset: 160)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !620, file: !526, line: 389, baseType: !73, size: 32, offset: 192)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !631, file: !632, line: 59, type: !73, isLocal: false, isDefinition: true)
!631 = distinct !DICompileUnit(language: DW_LANG_C99, file: !632, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !633, globals: !686, splitDebugInlining: false, nameTableKind: None)
!632 = !DIFile(filename: "../../../../../project/linkit7697_hdk/hal_examples/spi_master_polling/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!633 = !{!634, !642, !667}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !341, line: 656, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 650, size: 128, elements: !637)
!637 = !{!638, !639, !640, !641}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !636, file: !341, line: 652, baseType: !72, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !636, file: !341, line: 653, baseType: !72, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !636, file: !341, line: 654, baseType: !72, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !636, file: !341, line: 655, baseType: !378, size: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !341, line: 418, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 395, size: 1120, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !644, file: !341, line: 397, baseType: !378, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !644, file: !341, line: 398, baseType: !72, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !644, file: !341, line: 399, baseType: !72, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !644, file: !341, line: 400, baseType: !72, size: 32, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !644, file: !341, line: 401, baseType: !72, size: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !644, file: !341, line: 402, baseType: !72, size: 32, offset: 160)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !644, file: !341, line: 403, baseType: !385, size: 96, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !644, file: !341, line: 404, baseType: !72, size: 32, offset: 288)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !644, file: !341, line: 405, baseType: !72, size: 32, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !644, file: !341, line: 406, baseType: !72, size: 32, offset: 352)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !644, file: !341, line: 407, baseType: !72, size: 32, offset: 384)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !644, file: !341, line: 408, baseType: !72, size: 32, offset: 416)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !644, file: !341, line: 409, baseType: !72, size: 32, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !644, file: !341, line: 410, baseType: !72, size: 32, offset: 480)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !644, file: !341, line: 411, baseType: !396, size: 64, offset: 512)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !644, file: !341, line: 412, baseType: !378, size: 32, offset: 576)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !644, file: !341, line: 413, baseType: !378, size: 32, offset: 608)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !644, file: !341, line: 414, baseType: !402, size: 128, offset: 640)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !644, file: !341, line: 415, baseType: !406, size: 160, offset: 768)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !644, file: !341, line: 416, baseType: !410, size: 160, offset: 928)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !644, file: !341, line: 417, baseType: !72, size: 32, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !293, line: 72, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 56, size: 525312, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !669, file: !293, line: 57, baseType: !72, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !669, file: !293, line: 58, baseType: !72, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !669, file: !293, line: 59, baseType: !72, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !669, file: !293, line: 60, baseType: !72, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !669, file: !293, line: 61, baseType: !72, size: 32, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !669, file: !293, line: 62, baseType: !72, size: 32, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !669, file: !293, line: 63, baseType: !72, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !669, file: !293, line: 64, baseType: !72, size: 32, offset: 224)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !669, file: !293, line: 65, baseType: !72, size: 32, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !669, file: !293, line: 66, baseType: !72, size: 32, offset: 288)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !669, file: !293, line: 67, baseType: !307, size: 32, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !669, file: !293, line: 68, baseType: !72, size: 32, offset: 352)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !669, file: !293, line: 69, baseType: !312, size: 523904, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !669, file: !293, line: 70, baseType: !316, size: 512, offset: 524288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !669, file: !293, line: 71, baseType: !316, size: 512, offset: 524800)
!686 = !{!629, !687}
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !631, file: !632, line: 61, type: !72, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "heap_end", scope: !691, file: !692, line: 66, type: !697, isLocal: true, isDefinition: true)
!691 = distinct !DISubprogram(name: "_sbrk_r", scope: !692, file: !692, line: 63, type: !693, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !888, retainedNodes: !892)
!692 = !DIFile(filename: "../../../../../project/linkit7697_hdk/hal_examples/spi_master_polling/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!693 = !DISubroutineType(types: !694)
!694 = !{!695, !698, !887}
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !696, line: 123, baseType: !697)
!696 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !700, line: 377, size: 1920, elements: !701)
!700 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!701 = !{!702, !703, !777, !778, !779, !780, !781, !782, !783, !786, !806, !810, !811, !812, !813, !823, !836, !837, !842, !861, !862, !869, !870, !886}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !699, file: !700, line: 381, baseType: !7, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !699, file: !700, line: 386, baseType: !704, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !700, line: 292, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !700, line: 186, size: 832, elements: !707)
!707 = !{!708, !710, !711, !712, !714, !715, !720, !721, !722, !723, !727, !733, !740, !744, !745, !746, !747, !751, !753, !754, !755, !757, !763, !776}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !706, file: !700, line: 187, baseType: !709, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !706, file: !700, line: 188, baseType: !7, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !706, file: !700, line: 189, baseType: !7, size: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !706, file: !700, line: 190, baseType: !713, size: 16, offset: 96)
!713 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !706, file: !700, line: 191, baseType: !713, size: 16, offset: 112)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !706, file: !700, line: 192, baseType: !716, size: 64, offset: 128)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !700, line: 122, size: 64, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !716, file: !700, line: 123, baseType: !709, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !716, file: !700, line: 124, baseType: !7, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !706, file: !700, line: 193, baseType: !7, size: 32, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !706, file: !700, line: 196, baseType: !698, size: 32, offset: 224)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !706, file: !700, line: 200, baseType: !68, size: 32, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !706, file: !700, line: 202, baseType: !724, size: 32, offset: 288)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DISubroutineType(types: !726)
!726 = !{!7, !698, !68, !697, !7}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !706, file: !700, line: 204, baseType: !728, size: 32, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DISubroutineType(types: !730)
!730 = !{!7, !698, !68, !731, !7}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !706, file: !700, line: 207, baseType: !734, size: 32, offset: 352)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DISubroutineType(types: !736)
!736 = !{!737, !698, !68, !737, !7}
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !738, line: 116, baseType: !739)
!738 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!739 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !706, file: !700, line: 208, baseType: !741, size: 32, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DISubroutineType(types: !743)
!743 = !{!7, !698, !68}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !706, file: !700, line: 211, baseType: !716, size: 64, offset: 416)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !706, file: !700, line: 212, baseType: !709, size: 32, offset: 480)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !706, file: !700, line: 213, baseType: !7, size: 32, offset: 512)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !706, file: !700, line: 216, baseType: !748, size: 24, offset: 544)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 24, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 3)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !706, file: !700, line: 217, baseType: !752, size: 8, offset: 568)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8, elements: !308)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !706, file: !700, line: 220, baseType: !716, size: 64, offset: 576)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !706, file: !700, line: 223, baseType: !7, size: 32, offset: 640)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !706, file: !700, line: 224, baseType: !756, size: 32, offset: 672)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !738, line: 46, baseType: !739)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !706, file: !700, line: 231, baseType: !758, size: 32, offset: 704)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !700, line: 35, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !760, line: 34, baseType: !761)
!760 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !760, line: 33, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !706, file: !700, line: 233, baseType: !764, size: 64, offset: 736)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !738, line: 170, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !738, line: 162, size: 64, elements: !766)
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !765, file: !738, line: 164, baseType: !7, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !765, file: !738, line: 169, baseType: !769, size: 32, offset: 32)
!769 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !765, file: !738, line: 165, size: 32, elements: !770)
!770 = !{!771, !774}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !769, file: !738, line: 167, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !773, line: 116, baseType: !7)
!773 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !769, file: !738, line: 168, baseType: !775, size: 32)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32, elements: !403)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !706, file: !700, line: 234, baseType: !7, size: 32, offset: 800)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !699, file: !700, line: 386, baseType: !704, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !699, file: !700, line: 386, baseType: !704, size: 32, offset: 96)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !699, file: !700, line: 388, baseType: !7, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !699, file: !700, line: 390, baseType: !697, size: 32, offset: 160)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !699, file: !700, line: 392, baseType: !7, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !699, file: !700, line: 394, baseType: !7, size: 32, offset: 224)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !699, file: !700, line: 395, baseType: !784, size: 32, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !700, line: 45, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !699, file: !700, line: 397, baseType: !787, size: 32, offset: 288)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !700, line: 349, size: 128, elements: !789)
!789 = !{!790, !802, !803, !804}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !788, file: !700, line: 352, baseType: !791, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !700, line: 52, size: 192, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !792, file: !700, line: 54, baseType: !791, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !792, file: !700, line: 55, baseType: !7, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !792, file: !700, line: 55, baseType: !7, size: 32, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !792, file: !700, line: 55, baseType: !7, size: 32, offset: 96)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !792, file: !700, line: 55, baseType: !7, size: 32, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !792, file: !700, line: 56, baseType: !800, size: 32, offset: 160)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 32, elements: !308)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !700, line: 22, baseType: !61)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !788, file: !700, line: 353, baseType: !7, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !788, file: !700, line: 354, baseType: !791, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !788, file: !700, line: 355, baseType: !805, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !699, file: !700, line: 399, baseType: !807, size: 32, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !698}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !699, file: !700, line: 401, baseType: !7, size: 32, offset: 352)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !699, file: !700, line: 404, baseType: !7, size: 32, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !699, file: !700, line: 405, baseType: !697, size: 32, offset: 416)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !699, file: !700, line: 407, baseType: !814, size: 32, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !700, line: 324, size: 192, elements: !816)
!816 = !{!817, !819, !820, !821}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !815, file: !700, line: 325, baseType: !818, size: 48)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 48, elements: !749)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !815, file: !700, line: 326, baseType: !818, size: 48, offset: 48)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !815, file: !700, line: 327, baseType: !235, size: 16, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !815, file: !700, line: 330, baseType: !822, size: 64, offset: 128)
!822 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !699, file: !700, line: 408, baseType: !824, size: 32, offset: 480)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !700, line: 60, size: 288, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !825, file: !700, line: 62, baseType: !7, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !825, file: !700, line: 63, baseType: !7, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !825, file: !700, line: 64, baseType: !7, size: 32, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !825, file: !700, line: 65, baseType: !7, size: 32, offset: 96)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !825, file: !700, line: 66, baseType: !7, size: 32, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !825, file: !700, line: 67, baseType: !7, size: 32, offset: 160)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !825, file: !700, line: 68, baseType: !7, size: 32, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !825, file: !700, line: 69, baseType: !7, size: 32, offset: 224)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !825, file: !700, line: 70, baseType: !7, size: 32, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !699, file: !700, line: 409, baseType: !697, size: 32, offset: 512)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !699, file: !700, line: 412, baseType: !838, size: 32, offset: 544)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !7}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !699, file: !700, line: 416, baseType: !843, size: 32, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !700, line: 90, size: 1120, elements: !845)
!845 = !{!846, !847, !848, !852}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !844, file: !700, line: 91, baseType: !843, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !844, file: !700, line: 92, baseType: !7, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !844, file: !700, line: 93, baseType: !849, size: 1024, offset: 64)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 1024, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !844, file: !700, line: 94, baseType: !853, size: 32, offset: 1088)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !700, line: 79, size: 2112, elements: !855)
!855 = !{!856, !858, !859, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !854, file: !700, line: 80, baseType: !857, size: 1024)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 1024, elements: !850)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !854, file: !700, line: 81, baseType: !857, size: 1024, offset: 1024)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !854, file: !700, line: 83, baseType: !801, size: 32, offset: 2048)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !854, file: !700, line: 86, baseType: !801, size: 32, offset: 2080)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !699, file: !700, line: 417, baseType: !844, size: 1120, offset: 608)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !699, file: !700, line: 420, baseType: !863, size: 96, offset: 1728)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !700, line: 296, size: 96, elements: !864)
!864 = !{!865, !867, !868}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !863, file: !700, line: 298, baseType: !866, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !863, file: !700, line: 299, baseType: !7, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !863, file: !700, line: 300, baseType: !704, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !699, file: !700, line: 421, baseType: !704, size: 32, offset: 1824)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !699, file: !700, line: 422, baseType: !871, size: 32, offset: 1856)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !700, line: 359, size: 640, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !880, !881, !882, !883, !884, !885}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !872, file: !700, line: 362, baseType: !697, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !872, file: !700, line: 363, baseType: !764, size: 64, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !872, file: !700, line: 364, baseType: !764, size: 64, offset: 96)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !872, file: !700, line: 365, baseType: !764, size: 64, offset: 160)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !872, file: !700, line: 366, baseType: !879, size: 64, offset: 224)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 64, elements: !346)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !872, file: !700, line: 367, baseType: !7, size: 32, offset: 288)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !872, file: !700, line: 368, baseType: !764, size: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !872, file: !700, line: 369, baseType: !764, size: 64, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !872, file: !700, line: 370, baseType: !764, size: 64, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !872, file: !700, line: 371, baseType: !764, size: 64, offset: 512)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !872, file: !700, line: 372, baseType: !764, size: 64, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !699, file: !700, line: 423, baseType: !697, size: 32, offset: 1888)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !773, line: 46, baseType: !53)
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !890, globals: !891, splitDebugInlining: false, nameTableKind: None)
!889 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!890 = !{!697, !695}
!891 = !{!689}
!892 = !{!893, !894, !895, !896}
!893 = !DILocalVariable(name: "r", arg: 1, scope: !691, file: !692, line: 63, type: !698)
!894 = !DILocalVariable(name: "nbytes", arg: 2, scope: !691, file: !692, line: 63, type: !887)
!895 = !DILocalVariable(name: "prev_heap_end", scope: !691, file: !692, line: 67, type: !697)
!896 = !DILocalVariable(name: "stack", scope: !691, file: !692, line: 68, type: !697)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !899, file: !904, line: 4, type: !913, isLocal: false, isDefinition: true)
!899 = distinct !DICompileUnit(language: DW_LANG_C99, file: !900, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !901, splitDebugInlining: false, nameTableKind: None)
!900 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!901 = !{!897, !902, !908}
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !899, file: !904, line: 5, type: !905, isLocal: false, isDefinition: true)
!904 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 88, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 11)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !899, file: !904, line: 6, type: !910, isLocal: false, isDefinition: true)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 120, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 15)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 248, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 31)
!916 = distinct !DICompileUnit(language: DW_LANG_C99, file: !917, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !918, retainedTypes: !919, splitDebugInlining: false, nameTableKind: None)
!917 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!918 = !{!124}
!919 = !{!65, !67}
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !922, retainedTypes: !1000, splitDebugInlining: false, nameTableKind: None)
!921 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!922 = !{!923}
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !924, line: 150, baseType: !53, size: 32, elements: !925)
!924 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!925 = !{!926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999}
!926 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!927 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!928 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!929 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!930 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!931 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!932 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!933 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!934 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!935 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!936 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!937 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!938 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!939 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!940 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!941 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!942 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!943 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!944 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!945 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!946 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!947 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!948 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!949 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!950 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!951 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!952 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!953 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!954 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!955 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!956 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!957 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!958 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!959 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!960 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!961 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!962 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!963 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!964 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!965 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!966 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!967 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!968 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!969 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!970 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!971 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!972 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!973 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!974 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!975 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!976 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!977 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!978 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!979 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!980 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!981 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!982 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!983 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!984 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!985 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!986 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!987 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!988 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!989 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!990 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!991 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!992 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!993 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!994 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!995 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!996 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!997 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!998 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!999 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!1000 = !{!65, !64}
!1001 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1002, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1003, splitDebugInlining: false, nameTableKind: None)
!1002 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!1003 = !{!1004, !1029}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !341, line: 418, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 395, size: 1120, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !1006, file: !341, line: 397, baseType: !378, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !1006, file: !341, line: 398, baseType: !72, size: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !1006, file: !341, line: 399, baseType: !72, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !1006, file: !341, line: 400, baseType: !72, size: 32, offset: 96)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !1006, file: !341, line: 401, baseType: !72, size: 32, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !1006, file: !341, line: 402, baseType: !72, size: 32, offset: 160)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !1006, file: !341, line: 403, baseType: !385, size: 96, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !1006, file: !341, line: 404, baseType: !72, size: 32, offset: 288)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !1006, file: !341, line: 405, baseType: !72, size: 32, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !1006, file: !341, line: 406, baseType: !72, size: 32, offset: 352)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !1006, file: !341, line: 407, baseType: !72, size: 32, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !1006, file: !341, line: 408, baseType: !72, size: 32, offset: 416)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !1006, file: !341, line: 409, baseType: !72, size: 32, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !1006, file: !341, line: 410, baseType: !72, size: 32, offset: 480)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !1006, file: !341, line: 411, baseType: !396, size: 64, offset: 512)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !1006, file: !341, line: 412, baseType: !378, size: 32, offset: 576)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !1006, file: !341, line: 413, baseType: !378, size: 32, offset: 608)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !1006, file: !341, line: 414, baseType: !402, size: 128, offset: 640)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !1006, file: !341, line: 415, baseType: !406, size: 160, offset: 768)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1006, file: !341, line: 416, baseType: !410, size: 160, offset: 928)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !1006, file: !341, line: 417, baseType: !72, size: 32, offset: 1088)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !341, line: 378, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 363, size: 28704, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1031, file: !341, line: 365, baseType: !345, size: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1031, file: !341, line: 366, baseType: !349, size: 768, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1031, file: !341, line: 367, baseType: !345, size: 256, offset: 1024)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !1031, file: !341, line: 368, baseType: !349, size: 768, offset: 1280)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1031, file: !341, line: 369, baseType: !345, size: 256, offset: 2048)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1031, file: !341, line: 370, baseType: !349, size: 768, offset: 2304)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1031, file: !341, line: 371, baseType: !345, size: 256, offset: 3072)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1031, file: !341, line: 372, baseType: !349, size: 768, offset: 3328)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1031, file: !341, line: 373, baseType: !345, size: 256, offset: 4096)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1031, file: !341, line: 374, baseType: !360, size: 1792, offset: 4352)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !1031, file: !341, line: 375, baseType: !364, size: 1920, offset: 6144)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1031, file: !341, line: 376, baseType: !369, size: 20608, offset: 8064)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !1031, file: !341, line: 377, baseType: !72, size: 32, offset: 28672)
!1046 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1047, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1048, splitDebugInlining: false, nameTableKind: None)
!1047 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!1048 = !{!88, !923}
!1049 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1050, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1050 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!1051 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1052, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1053, retainedTypes: !1072, splitDebugInlining: false, nameTableKind: None)
!1052 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!1053 = !{!1054, !463, !88, !1060, !144, !149, !1066, !119}
!1054 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !145, line: 233, baseType: !7, size: 32, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059}
!1056 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!1057 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!1058 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!1059 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!1060 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !145, line: 224, baseType: !7, size: 32, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065}
!1062 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!1063 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!1064 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!1065 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!1066 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !145, line: 242, baseType: !53, size: 32, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071}
!1068 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!1069 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!1070 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!1071 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!1072 = !{!1073, !68, !1074, !163, !1075, !1076}
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !89, line: 87, baseType: !88)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !145, line: 220, baseType: !144)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !145, line: 247, baseType: !1066)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !120, line: 60, baseType: !119)
!1077 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1078, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1079, splitDebugInlining: false, nameTableKind: None)
!1078 = !DIFile(filename: "../../../../../project/linkit7697_hdk/hal_examples/spi_master_polling/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/hal_examples/spi_master_polling/GCC")
!1079 = !{!533, !538, !554, !560, !564, !463, !442, !447, !451, !455, !429, !437}
!1080 = !{!"Ubuntu clang version 14.0.6"}
!1081 = !{i32 7, !"Dwarf Version", i32 2}
!1082 = !{i32 2, !"Debug Info Version", i32 3}
!1083 = !{i32 1, !"wchar_size", i32 4}
!1084 = !{i32 1, !"min_enum_size", i32 4}
!1085 = !{i32 1, !"branch-target-enforcement", i32 0}
!1086 = !{i32 1, !"sign-return-address", i32 0}
!1087 = !{i32 1, !"sign-return-address-all", i32 0}
!1088 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!1089 = !{i32 7, !"frame-pointer", i32 2}
!1090 = distinct !DISubprogram(name: "halGPIO_ConfDirection", scope: !917, file: !917, line: 54, type: !1091, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !916, retainedNodes: !1093)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!170, !64, !69}
!1093 = !{!1094, !1095, !1096, !1098}
!1094 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1090, file: !917, line: 54, type: !64)
!1095 = !DILocalVariable(name: "outEnable", arg: 2, scope: !1090, file: !917, line: 54, type: !69)
!1096 = !DILocalVariable(name: "no", scope: !1090, file: !917, line: 57, type: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !52, line: 60, baseType: !235)
!1098 = !DILocalVariable(name: "remainder", scope: !1090, file: !917, line: 58, type: !1097)
!1099 = !DILocation(line: 0, scope: !1090)
!1100 = !DILocation(line: 59, column: 19, scope: !1090)
!1101 = !DILocation(line: 60, column: 17, scope: !1090)
!1102 = !DILocation(line: 61, column: 5, scope: !1090)
!1103 = !DILocation(line: 65, column: 27, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !917, line: 65, column: 17)
!1105 = distinct !DILexicalBlock(scope: !1090, file: !917, line: 61, column: 17)
!1106 = !DILocation(line: 0, scope: !1104)
!1107 = !DILocation(line: 65, column: 17, scope: !1105)
!1108 = !DILocation(line: 66, column: 21, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1104, file: !917, line: 65, column: 33)
!1110 = !DILocation(line: 67, column: 73, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !917, line: 66, column: 38)
!1112 = distinct !DILexicalBlock(scope: !1109, file: !917, line: 66, column: 21)
!1113 = !DILocation(line: 67, column: 69, scope: !1111)
!1114 = !DILocation(line: 67, column: 66, scope: !1111)
!1115 = !DILocation(line: 68, column: 17, scope: !1111)
!1116 = !DILocation(line: 68, column: 28, scope: !1112)
