; ModuleID = './build/audio_play_1k_tone.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.audio_pcm2way_t = type { %struct.audio_pcm2way_config_t, i16, i32, i32, i32, i32, void ()* }
%struct.audio_pcm2way_config_t = type { i8, i8, i8, i8, i32, i32 }
%struct.pcm2way_internal_t = type { void (i32, i8*)*, void (i32, i8*)*, %struct.ring_buffer_information_t, i32, i8, i8, i8, i16, i32, i8, i8*, i8*, i8 }
%struct.ring_buffer_information_t = type { i32, i32, i32, i8* }
%struct.audio_isr_t = type { i16, [6 x i16], [6 x void (i8*)*], [6 x i8*] }
%struct.audio_pcm_route_isr_t = type { i32, i32, [4 x i32], [4 x void (i8*)*], [4 x i8*] }
%struct.cm4_topsm_mtcmos_control = type { i32, i32, i32 }
%struct._dvfs_notification_t = type { i8*, i8*, i8*, %struct.dvfs_notification_ops_t, %struct._dvfs_domain_t*, %struct._dvfs_opp_module_t*, %struct._dvfs_notification_t*, %struct._dvfs_notification_t* }
%struct.dvfs_notification_ops_t = type { i1 (i32, i32)*, void (i32, i32)* }
%struct._dvfs_domain_t = type { i8*, i8, %struct.dvfs_opp_t, %struct._dvfs_lock_t*, %struct._dvfs_lock_t*, %struct._dvfs_domain_t* }
%struct.dvfs_opp_t = type { i32, i32, i32, i32, i32*, i32*, %struct.dvfs_opp_ops_t, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !2, file: !3, line: 51, type: !90, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !53, globals: !89, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!4 = !{!5, !17, !37, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 163, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!10 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!11 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!12 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!13 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!14 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!15 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!16 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 186, baseType: !18, size: 32, elements: !19)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!20 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!21 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!22 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!23 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!24 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!25 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!26 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!27 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!28 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!29 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!30 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!31 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!32 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!33 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!34 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!35 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!36 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 176, baseType: !18, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!40 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!41 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!42 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!43 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 98, baseType: !18, size: 32, elements: !46)
!45 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!46 = !{!47, !48, !49, !50, !51, !52}
!47 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!48 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!49 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!50 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!51 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!52 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!53 = !{!54, !88}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !56, line: 276, baseType: !57)
!56 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 260, size: 525312, elements: !58)
!58 = !{!59, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !78, !79, !83, !87}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !57, file: !56, line: 261, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !62, line: 48, baseType: !63)
!62 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !64, line: 79, baseType: !18)
!64 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !57, file: !56, line: 262, baseType: !60, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !57, file: !56, line: 263, baseType: !60, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !57, file: !56, line: 264, baseType: !60, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !57, file: !56, line: 265, baseType: !60, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !57, file: !56, line: 266, baseType: !60, size: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !57, file: !56, line: 267, baseType: !60, size: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !57, file: !56, line: 268, baseType: !60, size: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !57, file: !56, line: 269, baseType: !60, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !57, file: !56, line: 270, baseType: !60, size: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !57, file: !56, line: 271, baseType: !75, size: 32, offset: 320)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !57, file: !56, line: 272, baseType: !60, size: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !57, file: !56, line: 273, baseType: !80, size: 523904, offset: 384)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 16372)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !57, file: !56, line: 274, baseType: !84, size: 512, offset: 524288)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !57, file: !56, line: 275, baseType: !84, size: 512, offset: 524800)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!89 = !{!0}
!90 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !91)
!91 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "audio_pcm2way", scope: !94, file: !95, line: 42, type: !243, isLocal: false, isDefinition: true)
!94 = distinct !DICompileUnit(language: DW_LANG_C99, file: !95, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !96, retainedTypes: !180, globals: !192, splitDebugInlining: false, nameTableKind: None)
!95 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_audio_internal_pcm2way.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!96 = !{!97, !105, !110, !116, !130, !135, !139, !147, !152, !164, !173}
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 107, baseType: !18, size: 32, elements: !99)
!98 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_audio_internal_service.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!99 = !{!100, !101, !102, !103, !104}
!100 = !DIEnumerator(name: "SPH_VOICE_NONE", value: 0)
!101 = !DIEnumerator(name: "SPH_VOICE_RECORD", value: 1)
!102 = !DIEnumerator(name: "SPH_VOICE_PCM2WAY_UL", value: 2)
!103 = !DIEnumerator(name: "SPH_VOICE_PCM2WAY_DL", value: 3)
!104 = !DIEnumerator(name: "SPH_BOTH_PATH", value: 65535)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 57, baseType: !18, size: 32, elements: !107)
!106 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_audio_internal_pcm2way.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!107 = !{!108, !109}
!108 = !DIEnumerator(name: "PCM2WAY_WIDEBAND", value: 0)
!109 = !DIEnumerator(name: "PCM2WAY_NARROWBAND", value: 1)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 73, baseType: !18, size: 32, elements: !111)
!111 = !{!112, !113, !114, !115}
!112 = !DIEnumerator(name: "PCM2WAY_FORMAT_NORMAL", value: 0)
!113 = !DIEnumerator(name: "PCM2WAY_FORMAT_WB_NORMAL", value: 1)
!114 = !DIEnumerator(name: "PCM2WAY_FORMAT_CAL", value: 2)
!115 = !DIEnumerator(name: "PCM2WAY_FORMAT_WB_CAL", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 212, baseType: !18, size: 32, elements: !118)
!117 = !DIFile(filename: "../../../../../driver/chip/inc/hal_audio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!119 = !DIEnumerator(name: "HAL_AUDIO_DEVICE_NONE", value: 0)
!120 = !DIEnumerator(name: "HAL_AUDIO_DEVICE_MAIN_MIC", value: 1)
!121 = !DIEnumerator(name: "HAL_AUDIO_DEVICE_HEADSET_MIC", value: 2)
!122 = !DIEnumerator(name: "HAL_AUDIO_DEVICE_HANDSET", value: 4)
!123 = !DIEnumerator(name: "HAL_AUDIO_DEVICE_HANDS_FREE_MONO", value: 8)
!124 = !DIEnumerator(name: "HAL_AUDIO_DEVICE_HANDS_FREE_STEREO", value: 16)
!125 = !DIEnumerator(name: "HAL_AUDIO_DEVICE_HEADSET", value: 32)
!126 = !DIEnumerator(name: "HAL_AUDIO_DEVICE_HEADSET_MONO", value: 64)
!127 = !DIEnumerator(name: "HAL_AUDIO_DEVICE_LINE_IN", value: 128)
!128 = !DIEnumerator(name: "HAL_AUDIO_DEVICE_DUAL_DIGITAL_MIC", value: 256)
!129 = !DIEnumerator(name: "HAL_AUDIO_DEVICE_SINGLE_DIGITAL_MIC", value: 512)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 62, baseType: !18, size: 32, elements: !131)
!131 = !{!132, !133, !134}
!132 = !DIEnumerator(name: "PCMEX_OFF", value: 0)
!133 = !DIEnumerator(name: "PCMEX_ON", value: 1)
!134 = !DIEnumerator(name: "PCMEX_READY", value: 2)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 68, baseType: !18, size: 32, elements: !136)
!136 = !{!137, !138}
!137 = !DIEnumerator(name: "UL_FIFO", value: 0)
!138 = !DIEnumerator(name: "I2S_FIFO", value: 1)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 202, baseType: !7, size: 32, elements: !140)
!140 = !{!141, !142, !143, !144, !145, !146}
!141 = !DIEnumerator(name: "HAL_AUDIO_EVENT_ERROR", value: -1)
!142 = !DIEnumerator(name: "HAL_AUDIO_EVENT_NONE", value: 0)
!143 = !DIEnumerator(name: "HAL_AUDIO_EVENT_UNDERFLOW", value: 1)
!144 = !DIEnumerator(name: "HAL_AUDIO_EVENT_DATA_REQUEST", value: 2)
!145 = !DIEnumerator(name: "HAL_AUDIO_EVENT_DATA_NOTIFICATION", value: 3)
!146 = !DIEnumerator(name: "HAL_AUDIO_EVENT_END", value: 4)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 195, baseType: !7, size: 32, elements: !148)
!148 = !{!149, !150, !151}
!149 = !DIEnumerator(name: "HAL_AUDIO_STATUS_INVALID_PARAMETER", value: -2)
!150 = !DIEnumerator(name: "HAL_AUDIO_STATUS_ERROR", value: -1)
!151 = !DIEnumerator(name: "HAL_AUDIO_STATUS_OK", value: 0)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 243, baseType: !18, size: 32, elements: !153)
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162, !163}
!154 = !DIEnumerator(name: "HAL_AUDIO_SAMPLING_RATE_8KHZ", value: 0)
!155 = !DIEnumerator(name: "HAL_AUDIO_SAMPLING_RATE_11_025KHZ", value: 1)
!156 = !DIEnumerator(name: "HAL_AUDIO_SAMPLING_RATE_12KHZ", value: 2)
!157 = !DIEnumerator(name: "HAL_AUDIO_SAMPLING_RATE_16KHZ", value: 3)
!158 = !DIEnumerator(name: "HAL_AUDIO_SAMPLING_RATE_22_05KHZ", value: 4)
!159 = !DIEnumerator(name: "HAL_AUDIO_SAMPLING_RATE_24KHZ", value: 5)
!160 = !DIEnumerator(name: "HAL_AUDIO_SAMPLING_RATE_32KHZ", value: 6)
!161 = !DIEnumerator(name: "HAL_AUDIO_SAMPLING_RATE_44_1KHZ", value: 7)
!162 = !DIEnumerator(name: "HAL_AUDIO_SAMPLING_RATE_48KHZ", value: 8)
!163 = !DIEnumerator(name: "HAL_AUDIO_SAMPLING_RATE_96KHZ", value: 9)
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !165, line: 97, baseType: !18, size: 32, elements: !166)
!165 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_audio_internal_pcm.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!166 = !{!167, !168, !169, !170, !171, !172}
!167 = !DIEnumerator(name: "PCM_STATE_IDLE", value: 0)
!168 = !DIEnumerator(name: "PCM_STATE_INIT", value: 1)
!169 = !DIEnumerator(name: "PCM_STATE_RUNNING", value: 2)
!170 = !DIEnumerator(name: "PCM_STATE_FLUSHED", value: 3)
!171 = !DIEnumerator(name: "PCM_STATE_STOP", value: 4)
!172 = !DIEnumerator(name: "PCM_STATE_ERROR", value: 5)
!173 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 272, baseType: !18, size: 32, elements: !174)
!174 = !{!175, !176, !177, !178, !179}
!175 = !DIEnumerator(name: "HAL_AUDIO_PLAYBACK_MUSIC", value: 0)
!176 = !DIEnumerator(name: "HAL_AUDIO_PLAYBACK_VOICE", value: 1)
!177 = !DIEnumerator(name: "HAL_AUDIO_RECORD_VOICE", value: 2)
!178 = !DIEnumerator(name: "HAL_AUDIO_TWO_WAY_VOICE", value: 3)
!179 = !DIEnumerator(name: "HAL_AUDIO_PLAYBACK_MUSIC_RECORD_VOICE", value: 4)
!180 = !{!181, !186, !187, !88, !191}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !62, line: 36, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !64, line: 57, baseType: !185)
!185 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "isr", file: !98, line: 61, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !88}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "speech_path_type_t", file: !98, line: 113, baseType: !97)
!192 = !{!92, !193, !229, !231, !233, !238}
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "voice_internal_handle", scope: !94, file: !95, line: 43, type: !195, isLocal: false, isDefinition: true)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcm2way_internal_t", file: !165, line: 149, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 135, size: 448, elements: !197)
!197 = !{!198, !204, !206, !218, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "out_callback", scope: !196, file: !165, line: 136, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_stream_out_callback_t", file: !117, line: 332, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !203, !88}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_event_t", file: !117, line: 209, baseType: !139)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "in_callback", scope: !196, file: !165, line: 137, baseType: !205, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_stream_in_callback_t", file: !117, line: 340, baseType: !200)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dsp_buffer_info", scope: !196, file: !165, line: 138, baseType: !207, size: 128, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ring_buffer_information_t", file: !98, line: 141, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 136, size: 128, elements: !209)
!209 = !{!210, !211, !212, !213}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "write_pointer", scope: !208, file: !98, line: 137, baseType: !61, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "read_pointer", scope: !208, file: !98, line: 138, baseType: !61, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_byte_count", scope: !208, file: !98, line: 139, baseType: !61, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_base_pointer", scope: !208, file: !98, line: 140, baseType: !214, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !62, line: 24, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !64, line: 43, baseType: !217)
!217 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !196, file: !165, line: 139, baseType: !219, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcm_state_t", file: !165, line: 104, baseType: !164)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "underflow", scope: !196, file: !165, line: 140, baseType: !91, size: 8, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "out_waiting", scope: !196, file: !165, line: 141, baseType: !91, size: 8, offset: 232)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "in_waiting", scope: !196, file: !165, line: 142, baseType: !91, size: 8, offset: 240)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "audio_id", scope: !196, file: !165, line: 143, baseType: !183, size: 16, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !196, file: !165, line: 144, baseType: !61, size: 32, offset: 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !196, file: !165, line: 145, baseType: !215, size: 8, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "out_user_data", scope: !196, file: !165, line: 146, baseType: !88, size: 32, offset: 352)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "in_user_data", scope: !196, file: !165, line: 147, baseType: !88, size: 32, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "presilence", scope: !196, file: !165, line: 148, baseType: !215, size: 8, offset: 416)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "voice_playback_buffer_pointer", scope: !94, file: !95, line: 45, type: !186, isLocal: false, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "voice_record_buffer_pointer", scope: !94, file: !95, line: 46, type: !186, isLocal: false, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "pcm2way_nb_stream_in_buffer", scope: !94, file: !95, line: 47, type: !235, isLocal: false, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 2560, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 160)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "pcm2way_wb_stream_in_buffer", scope: !94, file: !95, line: 48, type: !240, isLocal: false, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 5120, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 320)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_pcm2way_t", file: !106, line: 97, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 89, size: 288, elements: !245)
!245 = !{!246, !258, !259, !260, !261, !262, !264}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "audio_pcm2way_config", scope: !244, file: !106, line: 90, baseType: !247, size: 96)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_pcm2way_config_t", file: !106, line: 87, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 80, size: 96, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !256}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "stream_in_d2m_on", scope: !248, file: !106, line: 81, baseType: !91, size: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "stream_in_is_after_enhancement", scope: !248, file: !106, line: 82, baseType: !91, size: 8, offset: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stream_out_m2d_on", scope: !248, file: !106, line: 83, baseType: !91, size: 8, offset: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "stream_out_is_after_enhancement", scope: !248, file: !106, line: 84, baseType: !91, size: 8, offset: 24)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "band", scope: !248, file: !106, line: 85, baseType: !255, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_pcm2way_band_t", file: !106, line: 60, baseType: !105)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !248, file: !106, line: 86, baseType: !257, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_pcm2way_format_t", file: !106, line: 78, baseType: !110)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "audio_id", scope: !244, file: !106, line: 91, baseType: !183, size: 16, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "dsp_pcm_ex_rx_len", scope: !244, file: !106, line: 92, baseType: !61, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "dsp_pcm_ex_tx_len", scope: !244, file: !106, line: 93, baseType: !61, size: 32, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !244, file: !106, line: 94, baseType: !191, size: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pcm2way_uplink_fifo", scope: !244, file: !106, line: 95, baseType: !263, size: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_pcm2way_afe_uplink_fifo", file: !106, line: 71, baseType: !135)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "stream_in_callback", scope: !244, file: !106, line: 96, baseType: !265, size: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_pcm2way_stream_in_callback_t", file: !106, line: 55, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DISubroutineType(types: !268)
!268 = !{null}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "speech_src_filter_coefficient", scope: !271, file: !272, line: 110, type: !561, isLocal: false, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !273, retainedTypes: !402, globals: !404, splitDebugInlining: false, nameTableKind: None)
!272 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_audio_internal_service.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!273 = !{!274, !279, !356, !366, !152, !373, !116, !173, !377, !385, !397}
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 115, baseType: !18, size: 32, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIEnumerator(name: "AUDIO_DSP_ASSERT_NONE", value: 0)
!277 = !DIEnumerator(name: "AUDIO_DSP_ASSERT_FROM_MCU", value: 1)
!278 = !DIEnumerator(name: "AUDIO_DSP_ASSERT_FROM_DSP", value: 2)
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !56, line: 44, baseType: !7, size: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!281 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!282 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!283 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!284 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!285 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!286 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!287 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!288 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!289 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!290 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!291 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!292 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!293 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!294 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!295 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!296 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!297 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!298 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!299 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!300 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!301 = !DIEnumerator(name: "KP_IRQn", value: 10)
!302 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!303 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!304 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!305 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!306 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!307 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!308 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!309 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!310 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!311 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!312 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!313 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!314 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!315 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!316 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!317 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!318 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!319 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!320 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!321 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!322 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!323 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!324 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!325 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!326 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!327 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!328 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!329 = !DIEnumerator(name: "SF_IRQn", value: 38)
!330 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!331 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!332 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!333 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!334 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!335 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!336 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!337 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!338 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!339 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!340 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!341 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!342 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!343 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!344 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!345 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!346 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!347 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!348 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!349 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!350 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!351 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!352 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!353 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!354 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!355 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !357, line: 45, baseType: !18, size: 32, elements: !358)
!357 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_dsp_topsm.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!358 = !{!359, !360, !361, !362, !363, !364, !365}
!359 = !DIEnumerator(name: "RM_MCU_BASE", value: 0)
!360 = !DIEnumerator(name: "RM_MODEM_BASE", value: 10)
!361 = !DIEnumerator(name: "RM_MODEM_DSP_1", value: 11)
!362 = !DIEnumerator(name: "RM_MODEM_DSP_2", value: 12)
!363 = !DIEnumerator(name: "RM_MODEM_DSP_3", value: 13)
!364 = !DIEnumerator(name: "RM_MODEM_L2_COPRO", value: 14)
!365 = !DIEnumerator(name: "NUMBER_OF_RM_MODEM", value: 15)
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 263, baseType: !18, size: 32, elements: !367)
!367 = !{!368, !369, !370, !371, !372}
!368 = !DIEnumerator(name: "HAL_AUDIO_MONO", value: 0)
!369 = !DIEnumerator(name: "HAL_AUDIO_STEREO", value: 1)
!370 = !DIEnumerator(name: "HAL_AUDIO_STEREO_BOTH_L_CHANNEL", value: 2)
!371 = !DIEnumerator(name: "HAL_AUDIO_STEREO_BOTH_R_CHANNEL", value: 3)
!372 = !DIEnumerator(name: "HAL_AUDIO_STEREO_BOTH_L_R_SWAP", value: 4)
!373 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 257, baseType: !18, size: 32, elements: !374)
!374 = !{!375, !376}
!375 = !DIEnumerator(name: "HAL_AUDIO_BITS_PER_SAMPLING_16", value: 0)
!376 = !DIEnumerator(name: "HAL_AUDIO_BITS_PER_SAMPLING_24", value: 1)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 227, baseType: !18, size: 32, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384}
!379 = !DIEnumerator(name: "HAL_AUDIO_MUTE_MAIN_MIC", value: 1)
!380 = !DIEnumerator(name: "HAL_AUDIO_MUTE_EAR_MIC", value: 2)
!381 = !DIEnumerator(name: "HAL_AUDIO_MUTE_HANDSET", value: 4)
!382 = !DIEnumerator(name: "HAL_AUDIO_MUTE_HANDS_FREE", value: 8)
!383 = !DIEnumerator(name: "HAL_AUDIO_MUTE_HEADSET", value: 16)
!384 = !DIEnumerator(name: "HAL_AUDIO_MUTE_LINE_IN", value: 32)
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 94, baseType: !18, size: 32, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!387 = !DIEnumerator(name: "AUDIO_COMMON_SAMPLING_RATE_8KHZ", value: 0)
!388 = !DIEnumerator(name: "AUDIO_COMMON_SAMPLING_RATE_11_025KHZ", value: 1)
!389 = !DIEnumerator(name: "AUDIO_COMMON_SAMPLING_RATE_12KHZ", value: 2)
!390 = !DIEnumerator(name: "AUDIO_COMMON_SAMPLING_RATE_16KHZ", value: 3)
!391 = !DIEnumerator(name: "AUDIO_COMMON_SAMPLING_RATE_22_05KHZ", value: 4)
!392 = !DIEnumerator(name: "AUDIO_COMMON_SAMPLING_RATE_24KHZ", value: 5)
!393 = !DIEnumerator(name: "AUDIO_COMMON_SAMPLING_RATE_32KHZ", value: 6)
!394 = !DIEnumerator(name: "AUDIO_COMMON_SAMPLING_RATE_44_1KHZ", value: 7)
!395 = !DIEnumerator(name: "AUDIO_COMMON_SAMPLING_RATE_48KHZ", value: 8)
!396 = !DIEnumerator(name: "AUDIO_COMMON_SAMPLING_RATE_96KHZ", value: 9)
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !398, line: 101, baseType: !18, size: 32, elements: !399)
!398 = !DIFile(filename: "../../../../../driver/chip/inc/hal_dvfs.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!399 = !{!400, !401}
!400 = !DIEnumerator(name: "HAL_DVFS_FREQ_RELATION_L", value: 0)
!401 = !DIEnumerator(name: "HAL_DVFS_FREQ_RELATION_H", value: 1)
!402 = !{!181, !88, !403, !61, !18, !7}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!404 = !{!269, !405, !411, !417, !421, !435, !455, !470, !475}
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "audio_dsp_pcm_idle_delay_table", scope: !271, file: !272, line: 146, type: !407, isLocal: false, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 144, elements: !409)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!409 = !{!410, !410}
!410 = !DISubrange(count: 3)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "audio_dsp_pm_page_table", scope: !271, file: !272, line: 290, type: !413, isLocal: false, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 64, elements: !415)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!415 = !{!416}
!416 = !DISubrange(count: 2)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "audio_dsp_dm_page_table", scope: !271, file: !272, line: 291, type: !419, isLocal: false, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 96, elements: !420)
!420 = !{!410}
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "audio_isr", scope: !271, file: !272, line: 71, type: !423, isLocal: false, isDefinition: true)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_isr_t", file: !98, line: 126, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 121, size: 512, elements: !425)
!425 = !{!426, !427, !431, !433}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "audio_id", scope: !424, file: !98, line: 122, baseType: !183, size: 16)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !424, file: !98, line: 123, baseType: !428, size: 96, offset: 16)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 96, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 6)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !424, file: !98, line: 124, baseType: !432, size: 192, offset: 128)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 192, elements: !429)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !424, file: !98, line: 125, baseType: !434, size: 192, offset: 320)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 192, elements: !429)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "audio_common", scope: !271, file: !272, line: 72, type: !437, isLocal: false, isDefinition: true)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_common_t", file: !98, line: 199, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 162, size: 352, elements: !439)
!439 = !{!440, !441, !442, !444, !445, !448, !449, !450, !451, !452, !453, !454}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "running_state", scope: !438, file: !98, line: 163, baseType: !61, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_handle", scope: !438, file: !98, line: 164, baseType: !215, size: 8, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "assert_source", scope: !438, file: !98, line: 165, baseType: !443, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_dsp_assert_source_t", file: !98, line: 119, baseType: !274)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "active_type", scope: !438, file: !98, line: 166, baseType: !183, size: 16, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "apply_iir", scope: !438, file: !98, line: 168, baseType: !446, size: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !62, line: 44, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !64, line: 77, baseType: !7)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !438, file: !98, line: 170, baseType: !91, size: 8, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "is_dsp_codec", scope: !438, file: !98, line: 171, baseType: !91, size: 8, offset: 168)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mcu_sample_counter", scope: !438, file: !98, line: 172, baseType: !61, size: 32, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dsp_clock_counter", scope: !438, file: !98, line: 173, baseType: !183, size: 16, offset: 224)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_sample_count", scope: !438, file: !98, line: 174, baseType: !61, size: 32, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_frame_sample", scope: !438, file: !98, line: 175, baseType: !215, size: 8, offset: 288)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sd_frame_len", scope: !438, file: !98, line: 176, baseType: !61, size: 32, offset: 320)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "audio_pcm_route_isr", scope: !271, file: !272, line: 76, type: !457, isLocal: false, isDefinition: true)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_pcm_route_isr_t", file: !98, line: 134, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 128, size: 448, elements: !459)
!459 = !{!460, !461, !462, !466, !468}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pcm_route_id", scope: !458, file: !98, line: 129, baseType: !446, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !458, file: !98, line: 130, baseType: !61, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !458, file: !98, line: 131, baseType: !463, size: 128, offset: 64)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 128, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 4)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !458, file: !98, line: 132, baseType: !467, size: 128, offset: 192)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 128, elements: !464)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !458, file: !98, line: 133, baseType: !469, size: 128, offset: 320)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 128, elements: !464)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "pcm_sd_playback_frame_length_table", scope: !271, file: !272, line: 471, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 144, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 9)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "dsp_dvfs_desc", scope: !271, file: !272, line: 89, type: !477, isLocal: true, isDefinition: true)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "dvfs_notification_t", file: !478, line: 78, baseType: !479)
!478 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_dvfs_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dvfs_notification_t", file: !478, line: 69, size: 288, elements: !480)
!480 = !{!481, !485, !486, !487, !499, !556, !558, !560}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !479, file: !478, line: 70, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !479, file: !478, line: 71, baseType: !482, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "addressee", scope: !479, file: !478, line: 72, baseType: !482, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !479, file: !478, line: 73, baseType: !488, size: 64, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "dvfs_notification_ops_t", file: !478, line: 67, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !478, line: 64, size: 64, elements: !490)
!490 = !{!491, !495}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !489, file: !478, line: 65, baseType: !492, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DISubroutineType(types: !494)
!494 = !{!91, !61, !61}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !489, file: !478, line: 66, baseType: !496, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !61, !61}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !479, file: !478, line: 74, baseType: !500, size: 32, offset: 160)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dvfs_domain_t", file: !478, line: 113, size: 512, elements: !502)
!502 = !{!503, !504, !505, !542, !554, !555}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !501, file: !478, line: 114, baseType: !482, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !501, file: !478, line: 115, baseType: !91, size: 8, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "opp", scope: !501, file: !478, line: 116, baseType: !506, size: 352, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "dvfs_opp_t", file: !478, line: 111, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !478, line: 102, size: 352, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !515, !516, !541}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cur_opp", scope: !507, file: !478, line: 103, baseType: !18, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "opp_num", scope: !507, file: !478, line: 104, baseType: !61, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "module_num", scope: !507, file: !478, line: 105, baseType: !18, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "notification_num", scope: !507, file: !478, line: 106, baseType: !18, size: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !507, file: !478, line: 107, baseType: !514, size: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !507, file: !478, line: 108, baseType: !514, size: 32, offset: 160)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !507, file: !478, line: 109, baseType: !517, size: 128, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "dvfs_opp_ops_t", file: !478, line: 91, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !478, line: 86, size: 128, elements: !519)
!519 = !{!520, !524, !528, !529}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !518, file: !478, line: 87, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!522 = !DISubroutineType(types: !523)
!523 = !{!91, !500, !18, !18}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "switch_voltage", scope: !518, file: !478, line: 88, baseType: !525, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !500, !18, !18}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "switch_frequency", scope: !518, file: !478, line: 89, baseType: !525, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "get_next_module", scope: !518, file: !478, line: 90, baseType: !530, size: 32, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DISubroutineType(types: !532)
!532 = !{!533, !500, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "dvfs_opp_module_t", file: !478, line: 84, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dvfs_opp_module_t", file: !478, line: 80, size: 96, elements: !536)
!536 = !{!537, !538, !540}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !535, file: !478, line: 81, baseType: !482, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "notification", scope: !535, file: !478, line: 82, baseType: !539, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !535, file: !478, line: 83, baseType: !514, size: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !507, file: !478, line: 110, baseType: !88, size: 32, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "lock_head", scope: !501, file: !478, line: 117, baseType: !543, size: 32, offset: 416)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "dvfs_lock_t", file: !478, line: 100, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dvfs_lock_t", file: !478, line: 93, size: 192, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !553}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !545, file: !478, line: 94, baseType: !482, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "addressee", scope: !545, file: !478, line: 95, baseType: !482, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !545, file: !478, line: 96, baseType: !18, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !545, file: !478, line: 97, baseType: !500, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !545, file: !478, line: 98, baseType: !552, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !478, line: 99, baseType: !552, size: 32, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lock_end", scope: !501, file: !478, line: 118, baseType: !543, size: 32, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !501, file: !478, line: 119, baseType: !500, size: 32, offset: 480)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !479, file: !478, line: 75, baseType: !557, size: 32, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !479, file: !478, line: 76, baseType: !559, size: 32, offset: 224)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !479, file: !478, line: 77, baseType: !559, size: 32, offset: 256)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 1312, elements: !566)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !62, line: 32, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !64, line: 55, baseType: !565)
!565 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!566 = !{!567}
!567 = !DISubrange(count: 82)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "SPEECH_TX_INIT_GAIN", scope: !570, file: !571, line: 61, type: !408, isLocal: false, isDefinition: true)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !572, retainedTypes: !573, globals: !580, splitDebugInlining: false, nameTableKind: None)
!571 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_audio_internal_afe.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!572 = !{!173, !116, !97}
!573 = !{!574, !61, !7, !181, !446, !215, !183, !578, !563, !579}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "APBADDR", file: !575, line: 61, baseType: !576)
!575 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_audio_internal_afe.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !185)
!578 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_device_t", file: !117, line: 224, baseType: !116)
!580 = !{!568, !581, !583, !585, !588, !590, !648}
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "SPEECH_RX_INIT_GAIN", scope: !570, file: !571, line: 62, type: !408, isLocal: false, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "AUDIO_TX_INIT_GAIN", scope: !570, file: !571, line: 63, type: !408, isLocal: false, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "mic0_type_sel", scope: !570, file: !571, line: 65, type: !587, isLocal: false, isDefinition: true)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "mic1_type_sel", scope: !570, file: !571, line: 66, type: !587, isLocal: false, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "afe", scope: !570, file: !571, line: 52, type: !592, isLocal: false, isDefinition: true)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "afe_t", file: !575, line: 247, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !575, line: 213, size: 768, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !630, !632}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !593, file: !575, line: 214, baseType: !91, size: 8)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "audio_clock_enable", scope: !593, file: !575, line: 215, baseType: !91, size: 8, offset: 8)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "voice_clock_enable", scope: !593, file: !575, line: 216, baseType: !91, size: 8, offset: 16)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "audio_tx_enable", scope: !593, file: !575, line: 217, baseType: !91, size: 8, offset: 24)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !593, file: !575, line: 218, baseType: !91, size: 8, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pcmif_loopback", scope: !593, file: !575, line: 219, baseType: !91, size: 8, offset: 40)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "stream_out_mute", scope: !593, file: !575, line: 220, baseType: !91, size: 8, offset: 48)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "stream_in_mute", scope: !593, file: !575, line: 221, baseType: !91, size: 8, offset: 56)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "mic_bias", scope: !593, file: !575, line: 222, baseType: !91, size: 8, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sidetone_flag", scope: !593, file: !575, line: 223, baseType: !91, size: 8, offset: 72)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "headphone_on", scope: !593, file: !575, line: 224, baseType: !91, size: 8, offset: 80)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "handset_on", scope: !593, file: !575, line: 225, baseType: !91, size: 8, offset: 88)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "hp_hs_both_on", scope: !593, file: !575, line: 226, baseType: !91, size: 8, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "line_in_enable", scope: !593, file: !575, line: 227, baseType: !91, size: 8, offset: 104)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ext_pa_on", scope: !593, file: !575, line: 228, baseType: !91, size: 8, offset: 112)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "edi_on", scope: !593, file: !575, line: 229, baseType: !91, size: 8, offset: 120)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sidetone_volume", scope: !593, file: !575, line: 230, baseType: !61, size: 32, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "stream_out_analog_gain_index", scope: !593, file: !575, line: 231, baseType: !61, size: 32, offset: 160)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "stream_in_analog_gain_index", scope: !593, file: !575, line: 232, baseType: !61, size: 32, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "stream_out_digital_gain_index", scope: !593, file: !575, line: 233, baseType: !61, size: 32, offset: 224)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "stream_in_digital_gain_index", scope: !593, file: !575, line: 234, baseType: !61, size: 32, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "stream_out_analog_gain_in_01unit_db", scope: !593, file: !575, line: 235, baseType: !61, size: 32, offset: 288)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "stream_in_analog_gain_in_01unit_db", scope: !593, file: !575, line: 236, baseType: !61, size: 32, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "stream_out_digital_gain_in_01unit_db", scope: !593, file: !575, line: 237, baseType: !61, size: 32, offset: 352)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "stream_in_digital_gain_in_01unit_db", scope: !593, file: !575, line: 238, baseType: !61, size: 32, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "output_device", scope: !593, file: !575, line: 239, baseType: !579, size: 32, offset: 416)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "input_device", scope: !593, file: !575, line: 240, baseType: !579, size: 32, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dc_cali_data", scope: !593, file: !575, line: 241, baseType: !623, size: 64, offset: 480)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "afe_dc_calibration_t", file: !575, line: 211, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !575, line: 206, size: 64, elements: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "calibration_sta", scope: !624, file: !575, line: 207, baseType: !215, size: 8)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "hs_dc_compensate_value", scope: !624, file: !575, line: 208, baseType: !183, size: 16, offset: 16)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "hp_dc_compensate_value_r", scope: !624, file: !575, line: 209, baseType: !183, size: 16, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "hp_dc_compensate_value_l", scope: !624, file: !575, line: 210, baseType: !183, size: 16, offset: 48)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "audio_path_type", scope: !593, file: !575, line: 245, baseType: !631, size: 32, offset: 544)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_active_type_t", file: !117, line: 278, baseType: !173)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "register_backup", scope: !593, file: !575, line: 246, baseType: !633, size: 192, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "register_backup_t", file: !575, line: 204, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !575, line: 191, size: 192, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "VMCU_CON0", scope: !634, file: !575, line: 192, baseType: !183, size: 16)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "VDB_CON", scope: !634, file: !575, line: 193, baseType: !183, size: 16, offset: 16)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "VLB_CON", scope: !634, file: !575, line: 194, baseType: !183, size: 16, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "AMCU_CON0", scope: !634, file: !575, line: 195, baseType: !183, size: 16, offset: 48)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "AMCU_CON1", scope: !634, file: !575, line: 196, baseType: !183, size: 16, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "EDI_CON", scope: !634, file: !575, line: 197, baseType: !183, size: 16, offset: 80)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "AMCU_CON2", scope: !634, file: !575, line: 198, baseType: !183, size: 16, offset: 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_TEST", scope: !634, file: !575, line: 199, baseType: !183, size: 16, offset: 112)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "VMCU_CON1", scope: !634, file: !575, line: 200, baseType: !183, size: 16, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "VMCU_CON2", scope: !634, file: !575, line: 201, baseType: !183, size: 16, offset: 144)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_CON0", scope: !634, file: !575, line: 202, baseType: !183, size: 16, offset: 160)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_CON1", scope: !634, file: !575, line: 203, baseType: !183, size: 16, offset: 176)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "SideToneTable", scope: !570, file: !571, line: 67, type: !650, isLocal: true, isDefinition: true)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 768, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 48)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "pcm_record_internal_handle", scope: !655, file: !656, line: 52, type: !723, isLocal: false, isDefinition: true)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !657, retainedTypes: !667, globals: !668, splitDebugInlining: false, nameTableKind: None)
!656 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_audio_internal_pcm.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!657 = !{!147, !139, !164, !152, !658, !116}
!658 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !659, line: 122, baseType: !18, size: 32, elements: !660)
!659 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_audio_enhancement.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!660 = !{!661, !662, !663, !664, !665, !666}
!661 = !DIEnumerator(name: "SPH_MODE_EARPHONE", value: 0)
!662 = !DIEnumerator(name: "SPH_MODE_LOUDSPEAKER", value: 1)
!663 = !DIEnumerator(name: "SPH_MODE_BT_EARPHONE", value: 2)
!664 = !DIEnumerator(name: "SPH_MODE_BT_LOUDSPEAKER", value: 3)
!665 = !DIEnumerator(name: "SPH_MODE_RECORD", value: 4)
!666 = !DIEnumerator(name: "SPH_MODE_UNDEFINED", value: 5)
!667 = !{!88, !61, !214, !403, !181, !187, !574, !183}
!668 = !{!669, !653, !708, !711, !713, !715, !717, !719, !721}
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "pcm_playback_internal_handle", scope: !655, file: !656, line: 51, type: !671, isLocal: false, isDefinition: true)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcm_playback_internal_t", file: !165, line: 124, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 106, size: 576, elements: !673)
!673 = !{!674, !675, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !707}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !672, file: !165, line: 107, baseType: !199, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mcu_buffer_info", scope: !672, file: !165, line: 108, baseType: !676, size: 128, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "ring_buffer_information_t", file: !98, line: 141, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 136, size: 128, elements: !678)
!678 = !{!679, !680, !681, !682}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "write_pointer", scope: !677, file: !98, line: 137, baseType: !61, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "read_pointer", scope: !677, file: !98, line: 138, baseType: !61, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_byte_count", scope: !677, file: !98, line: 139, baseType: !61, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_base_pointer", scope: !677, file: !98, line: 140, baseType: !214, size: 32, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dsp_buffer_info", scope: !672, file: !165, line: 109, baseType: !676, size: 128, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !672, file: !165, line: 110, baseType: !219, size: 32, offset: 288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "underflow", scope: !672, file: !165, line: 111, baseType: !91, size: 8, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !672, file: !165, line: 112, baseType: !91, size: 8, offset: 328)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "end_of_data", scope: !672, file: !165, line: 113, baseType: !91, size: 8, offset: 336)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "audio_id", scope: !672, file: !165, line: 114, baseType: !183, size: 16, offset: 352)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !672, file: !165, line: 115, baseType: !61, size: 32, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !672, file: !165, line: 116, baseType: !215, size: 8, offset: 416)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !672, file: !165, line: 117, baseType: !88, size: 32, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "is_sd_task", scope: !672, file: !165, line: 119, baseType: !61, size: 32, offset: 480)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "copy_callback", scope: !672, file: !165, line: 122, baseType: !694, size: 32, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_stream_copy_callback_t", file: !117, line: 348, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !203, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_copy_stream_t", file: !117, line: 316, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 310, size: 160, elements: !701)
!701 = !{!702, !703, !704, !705, !706}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !700, file: !117, line: 311, baseType: !88, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !700, file: !117, line: 312, baseType: !214, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !700, file: !117, line: 313, baseType: !61, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !700, file: !117, line: 314, baseType: !61, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !700, file: !117, line: 315, baseType: !61, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "copy_user_data", scope: !672, file: !165, line: 123, baseType: !88, size: 32, offset: 544)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "lzma_working_buffer", scope: !655, file: !656, line: 55, type: !710, isLocal: false, isDefinition: true)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "pcm_nb_stream_in_buffer", scope: !655, file: !656, line: 56, type: !235, isLocal: false, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "pcm_wb_stream_in_buffer", scope: !655, file: !656, line: 57, type: !240, isLocal: false, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "pcm_nb_stream_in_buffer_sec_mic", scope: !655, file: !656, line: 58, type: !235, isLocal: false, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "pcm_wb_stream_in_buffer_sec_mic", scope: !655, file: !656, line: 59, type: !240, isLocal: false, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "last_sample", scope: !655, file: !656, line: 61, type: !183, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "second_last_sample", scope: !655, file: !656, line: 62, type: !183, isLocal: true, isDefinition: true)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcm_record_internal_t", file: !165, line: 133, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 126, size: 256, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !724, file: !165, line: 127, baseType: !205, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "mcu_buffer_info", scope: !724, file: !165, line: 128, baseType: !676, size: 128, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !724, file: !165, line: 129, baseType: !91, size: 8, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "audio_id", scope: !724, file: !165, line: 130, baseType: !183, size: 16, offset: 176)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !724, file: !165, line: 131, baseType: !88, size: 32, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "presilence", scope: !724, file: !165, line: 132, baseType: !215, size: 8, offset: 224)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "audio_config", scope: !734, file: !735, line: 59, type: !746, isLocal: false, isDefinition: true)
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !736, retainedTypes: !737, globals: !745, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_audio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!736 = !{!147, !356, !279, !139, !173, !152, !366, !116, !373, !377}
!737 = !{!738, !7}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_isr_t", file: !739, line: 175, baseType: !740)
!739 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !743}
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !56, line: 125, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !56, line: 123, baseType: !279)
!745 = !{!732}
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_stream_t", file: !117, line: 306, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 300, size: 480, elements: !748)
!748 = !{!749, !762, !763, !764, !766}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "stream_in", scope: !747, file: !117, line: 301, baseType: !750, size: 192)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_stream_mode_t", file: !117, line: 297, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 290, size: 192, elements: !752)
!752 = !{!753, !755, !757, !759, !760, !761}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "stream_sampling_rate", scope: !751, file: !117, line: 291, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_sampling_rate_t", file: !117, line: 254, baseType: !152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "stream_bit_rate", scope: !751, file: !117, line: 292, baseType: !756, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_bits_per_sample_t", file: !117, line: 260, baseType: !373)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "stream_channel", scope: !751, file: !117, line: 293, baseType: !758, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_channel_number_t", file: !117, line: 269, baseType: !366)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "audio_device", scope: !751, file: !117, line: 294, baseType: !579, size: 32, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "digital_gain_index", scope: !751, file: !117, line: 295, baseType: !61, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "analog_gain_index", scope: !751, file: !117, line: 296, baseType: !61, size: 32, offset: 160)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stream_out", scope: !747, file: !117, line: 302, baseType: !750, size: 192, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "audio_path_type", scope: !747, file: !117, line: 303, baseType: !631, size: 32, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mute_device", scope: !747, file: !117, line: 304, baseType: !765, size: 32, offset: 416)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_mute_t", file: !117, line: 234, baseType: !377)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !747, file: !117, line: 305, baseType: !91, size: 8, offset: 448)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "spe_table", scope: !769, file: !770, line: 43, type: !846, isLocal: false, isDefinition: true)
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !770, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !771, retainedTypes: !787, globals: !789, splitDebugInlining: false, nameTableKind: None)
!770 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_audio_enhancement.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!771 = !{!772, !658, !781}
!772 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !659, line: 112, baseType: !18, size: 32, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780}
!774 = !DIEnumerator(name: "SPH_SPE_DSP_FILTER_SIDETONE", value: 0)
!775 = !DIEnumerator(name: "SPH_SPE_DSP_FILTER_BKF_NB_UL", value: 1)
!776 = !DIEnumerator(name: "SPH_SPE_DSP_FILTER_BKF_NB_DL", value: 2)
!777 = !DIEnumerator(name: "SPH_SPE_DSP_FILTER_BKF_WB_UL", value: 3)
!778 = !DIEnumerator(name: "SPH_SPE_DSP_FILTER_BKF_WB_DL", value: 4)
!779 = !DIEnumerator(name: "SPH_SPE_DSP_FILTER_SRC", value: 5)
!780 = !DIEnumerator(name: "SPH_SPE_DSP_FILTER_AGC", value: 6)
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !659, line: 105, baseType: !18, size: 32, elements: !782)
!782 = !{!783, !784, !785, !786}
!783 = !DIEnumerator(name: "SPH_SPE_COMMON_PARAMETER", value: 0)
!784 = !DIEnumerator(name: "SPH_SPE_MODE_PARAMETER", value: 1)
!785 = !DIEnumerator(name: "SPH_SPE_MODE_PARAMETER_WB", value: 2)
!786 = !DIEnumerator(name: "SPH_SPE_VOL_PARAMETER", value: 3)
!787 = !{!181, !88, !788, !183}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!789 = !{!767, !790, !795, !797, !802, !807, !809, !811, !816, !821}
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "hal_sph_agc_hp_flt", scope: !769, file: !770, line: 65, type: !792, isLocal: false, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 640, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 40)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "hal_sph_src_flt", scope: !769, file: !770, line: 73, type: !561, isLocal: false, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "hal_sph_sidetone_flt", scope: !769, file: !770, line: 86, type: !799, isLocal: false, isDefinition: true)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 496, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 31)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "hal_sph_default_common", scope: !769, file: !770, line: 93, type: !804, isLocal: false, isDefinition: true)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 192, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 12)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "hal_sph_default_nb_mode", scope: !769, file: !770, line: 97, type: !650, isLocal: false, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "hal_sph_default_wb_mode", scope: !769, file: !770, line: 104, type: !650, isLocal: false, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "hal_sph_default_nb_fir", scope: !769, file: !770, line: 111, type: !813, isLocal: false, isDefinition: true)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 720, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 45)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "hal_sph_default_wb_fir", scope: !769, file: !770, line: 118, type: !818, isLocal: false, isDefinition: true)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 1440, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 90)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "speech_enh_handle", scope: !769, file: !770, line: 41, type: !823, isLocal: true, isDefinition: true)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_audio_spe_struct_t", file: !659, line: 146, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "speech_enh", file: !659, line: 131, size: 6208, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !832, !834, !835, !837, !839, !840, !842, !843, !844}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "spe_flag", scope: !824, file: !659, line: 132, baseType: !91, size: 8)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "spe_state", scope: !824, file: !659, line: 133, baseType: !215, size: 8, offset: 8)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "speech_band", scope: !824, file: !659, line: 134, baseType: !215, size: 8, offset: 16)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "spe_app_mask", scope: !824, file: !659, line: 135, baseType: !183, size: 16, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sph_common_para", scope: !824, file: !659, line: 136, baseType: !831, size: 192, offset: 48)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 192, elements: !805)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "sph_mode_para", scope: !824, file: !659, line: 137, baseType: !833, size: 768, offset: 240)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 768, elements: !651)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sph_mode_para_wb", scope: !824, file: !659, line: 138, baseType: !833, size: 768, offset: 1008)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "sph_vol_para", scope: !824, file: !659, line: 139, baseType: !836, size: 64, offset: 1776)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 64, elements: !464)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "sph_in_fir", scope: !824, file: !659, line: 140, baseType: !838, size: 720, offset: 1840)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 720, elements: !814)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "sph_out_fir", scope: !824, file: !659, line: 141, baseType: !838, size: 720, offset: 2560)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "sph_in_fir_wb", scope: !824, file: !659, line: 142, baseType: !841, size: 1440, offset: 3280)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 1440, elements: !819)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "sph_out_fir_wb", scope: !824, file: !659, line: 143, baseType: !841, size: 1440, offset: 4720)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "spe_audio_id", scope: !824, file: !659, line: 144, baseType: !183, size: 16, offset: 6160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "speech_mode", scope: !824, file: !659, line: 145, baseType: !845, size: 32, offset: 6176)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_speech_device_mode_t", file: !659, line: 129, baseType: !658)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 40, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 5)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "acf_handle", scope: !851, file: !852, line: 65, type: !856, isLocal: true, isDefinition: true)
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !853, globals: !855, splitDebugInlining: false, nameTableKind: None)
!852 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_audio_post_processing.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!853 = !{!181, !854, !183, !61}
!854 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!855 = !{!849}
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "acf_information_t", file: !857, line: 157, baseType: !858)
!857 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_audio_post_processing_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !857, line: 151, size: 4832, elements: !859)
!859 = !{!860, !861, !892, !908, !909}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "update_flag", scope: !858, file: !857, line: 152, baseType: !61, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !858, file: !857, line: 153, baseType: !862, size: 1760, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "acf_parameter_format_t", file: !857, line: 135, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !857, line: 118, size: 1760, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_ascii_naming", scope: !863, file: !857, line: 119, baseType: !61, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_bitlen_ver", scope: !863, file: !857, line: 120, baseType: !61, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_intver_sosnum", scope: !863, file: !857, line: 121, baseType: !61, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_hpf1_id_len", scope: !863, file: !857, line: 122, baseType: !61, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_hpf1_fc", scope: !863, file: !857, line: 123, baseType: !61, size: 32, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_hpf2_blank1", scope: !863, file: !857, line: 124, baseType: !61, size: 32, offset: 160)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_hpf2_blank2", scope: !863, file: !857, line: 125, baseType: !61, size: 32, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_hpf2_blank3", scope: !863, file: !857, line: 126, baseType: !61, size: 32, offset: 224)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_hpf2_blank4", scope: !863, file: !857, line: 127, baseType: !61, size: 32, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_hpf2_blank5", scope: !863, file: !857, line: 128, baseType: !61, size: 32, offset: 288)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_lpf1_id_len", scope: !863, file: !857, line: 129, baseType: !61, size: 32, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_lpf1_fc", scope: !863, file: !857, line: 130, baseType: !61, size: 32, offset: 352)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_lpf1_blank1", scope: !863, file: !857, line: 131, baseType: !61, size: 32, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_lpf1_blank2", scope: !863, file: !857, line: 132, baseType: !61, size: 32, offset: 416)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_lpf1_blank3", scope: !863, file: !857, line: 133, baseType: !61, size: 32, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_bpf", scope: !863, file: !857, line: 134, baseType: !881, size: 1280, offset: 480)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 1280, elements: !890)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "acf_bpf_format_t", file: !857, line: 116, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !857, line: 110, size: 160, elements: !884)
!884 = !{!885, !886, !887, !888, !889}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_bpf_id_len", scope: !883, file: !857, line: 111, baseType: !61, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_bpf_fc_bw", scope: !883, file: !857, line: 112, baseType: !61, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_bpf_gain", scope: !883, file: !857, line: 113, baseType: !61, size: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_bpf_blank1", scope: !883, file: !857, line: 114, baseType: !61, size: 32, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "acf_par_bpf_blank2", scope: !883, file: !857, line: 115, baseType: !61, size: 32, offset: 128)
!890 = !{!891}
!891 = !DISubrange(count: 8)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "design", scope: !858, file: !857, line: 154, baseType: !893, size: 896, offset: 1792)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "acf_design_t", file: !857, line: 149, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !857, line: 143, size: 896, elements: !895)
!895 = !{!896, !897, !898, !899, !900}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "hpf_order", scope: !894, file: !857, line: 144, baseType: !61, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "hpf_fc", scope: !894, file: !857, line: 145, baseType: !61, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lpf_order", scope: !894, file: !857, line: 146, baseType: !61, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lpf_fc", scope: !894, file: !857, line: 147, baseType: !61, size: 32, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "bpf", scope: !894, file: !857, line: 148, baseType: !901, size: 768, offset: 128)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 768, elements: !890)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "acf_bpf_design_t", file: !857, line: 141, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !857, line: 137, size: 96, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !903, file: !857, line: 138, baseType: !61, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bw", scope: !903, file: !857, line: 139, baseType: !61, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !903, file: !857, line: 140, baseType: !578, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "dsp_ctrl", scope: !858, file: !857, line: 155, baseType: !183, size: 16, offset: 2688)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !858, file: !857, line: 156, baseType: !910, size: 2112, offset: 2704)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 2112, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 132)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "dynamic_download_entry_counter", scope: !915, file: !916, line: 41, type: !61, isLocal: true, isDefinition: true)
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !917, splitDebugInlining: false, nameTableKind: None)
!916 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_audio_fw_interface.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!917 = !{!913, !918, !946, !949, !952}
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "audio_fw_id_address_table", scope: !915, file: !916, line: 102, type: !920, isLocal: true, isDefinition: true)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 192, elements: !420)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "dsp_audio_fw_id_address_entry_t", file: !923, line: 131, baseType: !924)
!923 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_audio_fw_internal_common.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !923, line: 127, size: 64, elements: !925)
!925 = !{!926, !927, !928}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fw_id", scope: !924, file: !923, line: 128, baseType: !183, size: 16)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !924, file: !923, line: 129, baseType: !183, size: 16, offset: 16)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !924, file: !923, line: 130, baseType: !929, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "dsp_audio_fw_type_address_entry_t", file: !923, line: 124, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !923, line: 116, size: 64, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !932, file: !923, line: 117, baseType: !183, size: 16)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !932, file: !923, line: 118, baseType: !183, size: 16, offset: 16)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !932, file: !923, line: 120, baseType: !937, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "dsp_audio_fw_ddl_address_t", file: !923, line: 107, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !923, line: 103, size: 96, elements: !941)
!941 = !{!942, !943, !945}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !940, file: !923, line: 104, baseType: !446, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !940, file: !923, line: 105, baseType: !944, size: 32, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !940, file: !923, line: 106, baseType: !446, size: 32, offset: 64)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "audio_fw_ddl_pcm_table", scope: !915, file: !916, line: 48, type: !948, isLocal: true, isDefinition: true)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 256, elements: !464)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "audio_fw_ddl_sbc_dec_table", scope: !915, file: !916, line: 84, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 320, elements: !847)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "audio_fw_ddl_sph_enh_table", scope: !915, file: !916, line: 95, type: !948, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "gpt_lock_sleep_name", scope: !956, file: !957, line: 46, type: !1018, isLocal: true, isDefinition: true)
!956 = distinct !DICompileUnit(language: DW_LANG_C99, file: !957, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !958, retainedTypes: !1012, globals: !1014, splitDebugInlining: false, nameTableKind: None)
!957 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!958 = !{!959, !967, !977, !981, !985, !1004, !1008}
!959 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !960, line: 387, baseType: !7, size: 32, elements: !961)
!960 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!961 = !{!962, !963, !964, !965, !966}
!962 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!963 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!964 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!965 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!966 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!967 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !968, line: 846, baseType: !18, size: 32, elements: !969)
!968 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!969 = !{!970, !971, !972, !973, !974, !975, !976}
!970 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!971 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!972 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!973 = !DIEnumerator(name: "HAL_GPT_3", value: 3)
!974 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!975 = !DIEnumerator(name: "HAL_GPT_5", value: 5)
!976 = !DIEnumerator(name: "HAL_GPT_MAX_PORT", value: 6)
!977 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !960, line: 397, baseType: !18, size: 32, elements: !978)
!978 = !{!979, !980}
!979 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!980 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!981 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !968, line: 857, baseType: !18, size: 32, elements: !982)
!982 = !{!983, !984}
!983 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!984 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!985 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !986, line: 87, baseType: !18, size: 32, elements: !987)
!986 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_gpt_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!987 = !{!988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003}
!988 = !DIEnumerator(name: "GPT_DIVIDE_1", value: 0)
!989 = !DIEnumerator(name: "GPT_DIVIDE_2", value: 1)
!990 = !DIEnumerator(name: "GPT_DIVIDE_3", value: 2)
!991 = !DIEnumerator(name: "GPT_DIVIDE_4", value: 3)
!992 = !DIEnumerator(name: "GPT_DIVIDE_5", value: 4)
!993 = !DIEnumerator(name: "GPT_DIVIDE_6", value: 5)
!994 = !DIEnumerator(name: "GPT_DIVIDE_7", value: 6)
!995 = !DIEnumerator(name: "GPT_DIVIDE_8", value: 7)
!996 = !DIEnumerator(name: "GPT_DIVIDE_9", value: 8)
!997 = !DIEnumerator(name: "GPT_DIVIDE_10", value: 9)
!998 = !DIEnumerator(name: "GPT_DIVIDE_11", value: 10)
!999 = !DIEnumerator(name: "GPT_DIVIDE_12", value: 11)
!1000 = !DIEnumerator(name: "GPT_DIVIDE_13", value: 12)
!1001 = !DIEnumerator(name: "GPT_DIVIDE_16", value: 13)
!1002 = !DIEnumerator(name: "GPT_DIVIDE_32", value: 14)
!1003 = !DIEnumerator(name: "GPT_DIVIDE_64", value: 15)
!1004 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !960, line: 380, baseType: !18, size: 32, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!1007 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!1008 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !986, line: 82, baseType: !18, size: 32, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIEnumerator(name: "GPT_CLOCK_UNGATE", value: 0)
!1011 = !DIEnumerator(name: "GPT_CLOCK_GATE", value: 64)
!1012 = !{!61, !88, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !960, line: 371, baseType: !188)
!1014 = !{!1015, !954}
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "gpt_lock_sleep_handle", scope: !956, file: !957, line: 47, type: !1017, isLocal: true, isDefinition: true)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 48, elements: !429)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 192, elements: !429)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "gp_gpt", scope: !1021, file: !1022, line: 48, type: !1159, isLocal: false, isDefinition: true)
!1021 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1022, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1023, retainedTypes: !1089, globals: !1104, splitDebugInlining: false, nameTableKind: None)
!1022 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/audio_play_1k_tone/GCC")
!1023 = !{!1024, !1008, !1083, !279, !967, !1004, !977}
!1024 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !968, line: 1170, baseType: !18, size: 32, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082}
!1026 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_26M", value: 9)
!1027 = !DIEnumerator(name: "HAL_CLOCK_CG_CAMINF48M", value: 10)
!1028 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_BUSCK", value: 13)
!1029 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_N9", value: 15)
!1030 = !DIEnumerator(name: "HAL_CLOCK_CG_BUS", value: 20)
!1031 = !DIEnumerator(name: "HAL_CLOCK_CG_CM", value: 21)
!1032 = !DIEnumerator(name: "HAL_CLOCK_CG_BSI", value: 23)
!1033 = !DIEnumerator(name: "HAL_CLOCK_CG_SEJ", value: 32)
!1034 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA", value: 33)
