; ModuleID = 'build/96b_aerocore2/tmp112/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %struct.k_spinlock, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 103, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5824, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 91)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2912, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 501, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f427xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 492, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 494, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 495, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 496, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 497, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 498, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 499, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 500, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "static_regions", scope: !197, file: !206, line: 62, type: !348, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !199, globals: !202, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!199 = !{!200, !103, !121, !102}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 214, baseType: !32)
!201 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !195}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !205, file: !206, line: 198, type: !334, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !206, file: !206, line: 175, type: !207, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !329)
!206 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !211, line: 245, size: 1024, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !282, !295, !296, !297, !298, !304, !324}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !210, file: !211, line: 247, baseType: !214, size: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !211, line: 57, size: 384, elements: !215)
!215 = !{!216, !244, !252, !253, !254, !267, !268, !269}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 60, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 60, size: 64, elements: !218)
!218 = !{!219, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !217, file: !211, line: 61, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !221, line: 49, baseType: !222)
!221 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !221, line: 37, size: 64, elements: !223)
!223 = !{!224, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 38, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 38, size: 32, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !221, line: 39, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !221, line: 40, baseType: !228, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 42, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 42, size: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !221, line: 43, baseType: !228, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !221, line: 44, baseType: !228, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !217, file: !211, line: 62, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !237, line: 49, size: 64, elements: !238)
!237 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !236, file: !237, line: 50, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !214, file: !211, line: 68, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !221, line: 48, baseType: !222)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !214, file: !211, line: 71, baseType: !154, size: 8, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !214, file: !211, line: 74, baseType: !154, size: 8, offset: 104)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 90, baseType: !255, size: 16, offset: 112)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 90, size: 16, elements: !256)
!256 = !{!257, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !211, line: 91, baseType: !258, size: 16)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !211, line: 91, size: 16, elements: !259)
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !258, file: !211, line: 96, baseType: !261, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !262)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !258, file: !211, line: 97, baseType: !154, size: 8, offset: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !255, file: !211, line: 100, baseType: !265, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !266)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !214, file: !211, line: 107, baseType: !121, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !214, file: !211, line: 127, baseType: !102, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !214, file: !211, line: 131, baseType: !270, size: 192, offset: 192)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !271)
!271 = !{!272, !273, !279}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !270, file: !247, line: 245, baseType: !220, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !270, file: !247, line: 246, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !270, file: !247, line: 249, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !281)
!281 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !210, file: !211, line: 250, baseType: !283, size: 288, offset: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !284, line: 25, size: 288, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !283, file: !284, line: 26, baseType: !121, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !283, file: !284, line: 27, baseType: !121, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !283, file: !284, line: 28, baseType: !121, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !283, file: !284, line: 29, baseType: !121, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !283, file: !284, line: 30, baseType: !121, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !283, file: !284, line: 31, baseType: !121, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !283, file: !284, line: 32, baseType: !121, size: 32, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !283, file: !284, line: 33, baseType: !121, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !283, file: !284, line: 34, baseType: !121, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !210, file: !211, line: 253, baseType: !102, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !210, file: !211, line: 256, baseType: !246, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !210, file: !211, line: 294, baseType: !103, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !210, file: !211, line: 300, baseType: !299, size: 96, offset: 800)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !211, line: 149, size: 96, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !299, file: !211, line: 153, baseType: !22, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !211, line: 162, baseType: !200, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !299, file: !211, line: 168, baseType: !200, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !210, file: !211, line: 325, baseType: !305, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !307, line: 5073, size: 192, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 5074, baseType: !310, size: 96)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !311, line: 56, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !310, file: !311, line: 57, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !311, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !310, file: !311, line: 58, baseType: !102, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !310, file: !311, line: 59, baseType: !200, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !306, file: !307, line: 5075, baseType: !246, size: 64, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !307, line: 5076, baseType: !320, size: 32, offset: 160)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !321, line: 43, size: 32, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !320, file: !321, line: 52, baseType: !22, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !210, file: !211, line: 343, baseType: !325, size: 64, offset: 928)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !284, line: 60, size: 64, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !325, file: !284, line: 63, baseType: !121, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !325, file: !284, line: 66, baseType: !121, size: 32, offset: 32)
!329 = !{!330, !331, !332, !333}
!330 = !DILocalVariable(name: "thread", arg: 1, scope: !205, file: !206, line: 175, type: !209)
!331 = !DILocalVariable(name: "region_num", scope: !205, file: !206, line: 200, type: !154)
!332 = !DILocalVariable(name: "guard_start", scope: !205, file: !206, line: 265, type: !22)
!333 = !DILocalVariable(name: "guard_size", scope: !205, file: !206, line: 266, type: !200)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 96, elements: !346)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !336, line: 52, size: 96, elements: !337)
!336 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!337 = !{!338, !339, !340}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !335, file: !336, line: 53, baseType: !22, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !335, file: !336, line: 54, baseType: !200, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !335, file: !336, line: 55, baseType: !341, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !342, line: 151, baseType: !343)
!342 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 149, size: 32, elements: !344)
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !343, file: !342, line: 150, baseType: !121, size: 32)
!346 = !{!347}
!347 = !DISubrange(count: 1)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 96, elements: !346)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !352, file: !385, line: 39, type: !154, isLocal: true, isDefinition: true)
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !354, globals: !384, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!354 = !{!355, !102, !103, !372, !154}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !357, line: 1226, baseType: !358)
!357 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 1213, size: 352, elements: !359)
!359 = !{!360, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !358, file: !357, line: 1215, baseType: !361, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !358, file: !357, line: 1216, baseType: !120, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !358, file: !357, line: 1217, baseType: !120, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !358, file: !357, line: 1218, baseType: !120, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !358, file: !357, line: 1219, baseType: !120, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !358, file: !357, line: 1220, baseType: !120, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !358, file: !357, line: 1221, baseType: !120, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !358, file: !357, line: 1222, baseType: !120, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !358, file: !357, line: 1223, baseType: !120, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !358, file: !357, line: 1224, baseType: !120, size: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !358, file: !357, line: 1225, baseType: !120, size: 32, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !375, line: 27, size: 96, elements: !376)
!375 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!376 = !{!377, !378, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !374, file: !375, line: 29, baseType: !121, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !374, file: !375, line: 31, baseType: !144, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !374, file: !375, line: 37, baseType: !380, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !342, line: 146, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !342, line: 141, size: 32, elements: !382)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !381, file: !342, line: 143, baseType: !121, size: 32)
!384 = !{!350}
!385 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !388, file: !395, line: 21, type: !106, isLocal: true, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !390, globals: !394, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!390 = !{!391, !103, !102}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !393, line: 22, baseType: !103)
!393 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = !{!386}
!395 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !398, file: !403, line: 13, type: !420, isLocal: true, isDefinition: true)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !400, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!400 = !{!401, !396}
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "mpu_config", scope: !398, file: !403, line: 37, type: !404, isLocal: false, isDefinition: true)
!403 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !375, line: 41, size: 64, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !405, file: !375, line: 43, baseType: !121, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !405, file: !375, line: 45, baseType: !409, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !375, line: 27, size: 96, elements: !412)
!412 = !{!413, !414, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !411, file: !375, line: 29, baseType: !121, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !375, line: 31, baseType: !144, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !411, file: !375, line: 37, baseType: !416, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !342, line: 146, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !342, line: 141, size: 32, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !417, file: !342, line: 143, baseType: !121, size: 32)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 192, elements: !242)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !423, file: !538, line: 72, type: !622, isLocal: true, isDefinition: true)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !425, retainedTypes: !524, globals: !535, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!425 = !{!30, !426}
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!428 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!429 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!430 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!431 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!432 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!433 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!434 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!435 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!436 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!437 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!438 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!439 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!440 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!441 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!442 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!443 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!444 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!445 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!446 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!447 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!448 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!449 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!450 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!451 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!452 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!453 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!454 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!455 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!456 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!457 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!458 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!459 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!460 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!461 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!462 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!463 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!464 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!465 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!466 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!467 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!468 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!469 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!470 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!471 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!472 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!473 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!474 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!475 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!476 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!477 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!478 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!479 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!480 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!481 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!482 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!483 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!484 = !DIEnumerator(name: "FMC_IRQn", value: 48)
!485 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!486 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!487 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!488 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!489 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!490 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!491 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!492 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!493 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!494 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!495 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!496 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!497 = !DIEnumerator(name: "ETH_IRQn", value: 61)
!498 = !DIEnumerator(name: "ETH_WKUP_IRQn", value: 62)
!499 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!500 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!501 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!502 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!503 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!504 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!505 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!506 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!507 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!508 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!509 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!510 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!511 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!512 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!513 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!514 = !DIEnumerator(name: "DCMI_IRQn", value: 78)
!515 = !DIEnumerator(name: "HASH_RNG_IRQn", value: 80)
!516 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!517 = !DIEnumerator(name: "UART7_IRQn", value: 82)
!518 = !DIEnumerator(name: "UART8_IRQn", value: 83)
!519 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!520 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!521 = !DIEnumerator(name: "SPI6_IRQn", value: 86)
!522 = !DIEnumerator(name: "SAI1_IRQn", value: 87)
!523 = !DIEnumerator(name: "DMA2D_IRQn", value: 90)
!524 = !{!200, !103, !102, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 486, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 478, size: 192, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !527, file: !116, line: 480, baseType: !120, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !527, file: !116, line: 481, baseType: !120, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !527, file: !116, line: 482, baseType: !120, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !527, file: !116, line: 483, baseType: !120, size: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !527, file: !116, line: 484, baseType: !120, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !527, file: !116, line: 485, baseType: !120, size: 32, offset: 160)
!535 = !{!536, !542, !558, !569, !586, !421, !588, !602, !604, !606, !608, !610, !612, !614, !616, !618, !620}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !423, file: !538, line: 424, type: !539, isLocal: false, isDefinition: true, align: 16)
!538 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 4)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "__device_dts_ord_42", scope: !423, file: !538, line: 424, type: !544, isLocal: false, isDefinition: true, align: 32)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !546)
!546 = !{!547, !548, !549, !550, !556, !557}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !141, line: 380, baseType: !144, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !545, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !545, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !545, file: !141, line: 386, baseType: !551, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !552, file: !141, line: 359, baseType: !154, size: 8)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !552, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !545, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !545, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_42", scope: !423, file: !538, line: 424, type: !560, isLocal: true, isDefinition: true, align: 32)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !562)
!562 = !{!563, !568}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !561, file: !132, line: 60, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DISubroutineType(types: !566)
!566 = !{!103, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !561, file: !132, line: 65, baseType: !567, size: 32, offset: 32)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "exti_data", scope: !423, file: !538, line: 423, type: !571, isLocal: true, isDefinition: true)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !538, line: 107, size: 1472, elements: !572)
!572 = !{!573}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !571, file: !538, line: 109, baseType: !574, size: 1472)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 1472, elements: !584)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !538, line: 101, size: 64, elements: !576)
!576 = !{!577, !583}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !575, file: !538, line: 102, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !579, line: 63, baseType: !580)
!579 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !103, !102}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !575, file: !538, line: 103, baseType: !102, size: 32, offset: 32)
!584 = !{!585}
!585 = !DISubrange(count: 23)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_42", scope: !423, file: !538, line: 424, type: !552, isLocal: true, isDefinition: true, align: 8)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !590, file: !538, line: 493, type: !595, isLocal: true, isDefinition: true, align: 32)
!590 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !538, file: !538, line: 460, type: !591, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !423, retainedNodes: !593)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !567}
!593 = !{!594}
!594 = !DILocalVariable(name: "dev", arg: 1, scope: !590, file: !538, line: 460, type: !567)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !596)
!596 = !{!597, !599, !600, !601}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !595, file: !10, line: 55, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !595, file: !10, line: 57, baseType: !598, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !595, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !595, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !590, file: !538, line: 497, type: !595, isLocal: true, isDefinition: true, align: 32)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !590, file: !538, line: 507, type: !595, isLocal: true, isDefinition: true, align: 32)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !590, file: !538, line: 512, type: !595, isLocal: true, isDefinition: true, align: 32)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !590, file: !538, line: 516, type: !595, isLocal: true, isDefinition: true, align: 32)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !590, file: !538, line: 523, type: !595, isLocal: true, isDefinition: true, align: 32)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !590, file: !538, line: 527, type: !595, isLocal: true, isDefinition: true, align: 32)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !590, file: !538, line: 581, type: !595, isLocal: true, isDefinition: true, align: 32)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !590, file: !538, line: 586, type: !595, isLocal: true, isDefinition: true, align: 32)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !590, file: !538, line: 591, type: !595, isLocal: true, isDefinition: true, align: 32)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !590, file: !538, line: 595, type: !595, isLocal: true, isDefinition: true, align: 32)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 736, elements: !584)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 165, baseType: !426)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !627, file: !632, line: 30, type: !670, isLocal: false, isDefinition: true, align: 16)
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !629, splitDebugInlining: false, nameTableKind: None)
!628 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!629 = !{!630, !625, !636, !638, !640, !642, !644, !646, !648, !650, !652, !654, !656, !658, !660, !662, !664, !666, !668}
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !627, file: !632, line: 25, type: !633, isLocal: false, isDefinition: true, align: 16)
!632 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 320, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 20)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_106", scope: !627, file: !632, line: 37, type: !539, isLocal: false, isDefinition: true, align: 16)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_105", scope: !627, file: !632, line: 44, type: !539, isLocal: false, isDefinition: true, align: 16)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_104", scope: !627, file: !632, line: 51, type: !539, isLocal: false, isDefinition: true, align: 16)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_103", scope: !627, file: !632, line: 58, type: !539, isLocal: false, isDefinition: true, align: 16)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_102", scope: !627, file: !632, line: 65, type: !539, isLocal: false, isDefinition: true, align: 16)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_101", scope: !627, file: !632, line: 72, type: !539, isLocal: false, isDefinition: true, align: 16)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !627, file: !632, line: 79, type: !539, isLocal: false, isDefinition: true, align: 16)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_100", scope: !627, file: !632, line: 86, type: !539, isLocal: false, isDefinition: true, align: 16)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_99", scope: !627, file: !632, line: 93, type: !539, isLocal: false, isDefinition: true, align: 16)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_98", scope: !627, file: !632, line: 100, type: !539, isLocal: false, isDefinition: true, align: 16)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_97", scope: !627, file: !632, line: 107, type: !539, isLocal: false, isDefinition: true, align: 16)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_60", scope: !627, file: !632, line: 114, type: !539, isLocal: false, isDefinition: true, align: 16)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_57", scope: !627, file: !632, line: 121, type: !539, isLocal: false, isDefinition: true, align: 16)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_52", scope: !627, file: !632, line: 128, type: !539, isLocal: false, isDefinition: true, align: 16)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_49", scope: !627, file: !632, line: 135, type: !539, isLocal: false, isDefinition: true, align: 16)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_63", scope: !627, file: !632, line: 142, type: !539, isLocal: false, isDefinition: true, align: 16)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !627, file: !632, line: 149, type: !539, isLocal: false, isDefinition: true, align: 16)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 3)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !675, file: !738, line: 398, type: !771, isLocal: true, isDefinition: true)
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !677, retainedTypes: !690, globals: !735, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!677 = !{!678, !30, !683}
!678 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !679, line: 197, baseType: !32, size: 32, elements: !680)
!679 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!680 = !{!681, !682}
!681 = !DIEnumerator(name: "SUCCESS", value: 0)
!682 = !DIEnumerator(name: "ERROR", value: 1)
!683 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !684, line: 44, baseType: !32, size: 32, elements: !685)
!684 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!685 = !{!686, !687, !688, !689}
!686 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!687 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!688 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!689 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!690 = !{!102, !103, !121, !691, !728, !734}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 677, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 643, size: 1152, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !693, file: !116, line: 645, baseType: !120, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !693, file: !116, line: 646, baseType: !120, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !693, file: !116, line: 647, baseType: !120, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !693, file: !116, line: 648, baseType: !120, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !693, file: !116, line: 649, baseType: !120, size: 32, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !693, file: !116, line: 650, baseType: !120, size: 32, offset: 160)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !693, file: !116, line: 651, baseType: !120, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !693, file: !116, line: 652, baseType: !121, size: 32, offset: 224)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !693, file: !116, line: 653, baseType: !120, size: 32, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !693, file: !116, line: 654, baseType: !120, size: 32, offset: 288)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !693, file: !116, line: 655, baseType: !706, size: 64, offset: 320)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !242)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !693, file: !116, line: 656, baseType: !120, size: 32, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !693, file: !116, line: 657, baseType: !120, size: 32, offset: 416)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !693, file: !116, line: 658, baseType: !120, size: 32, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !693, file: !116, line: 659, baseType: !121, size: 32, offset: 480)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !693, file: !116, line: 660, baseType: !120, size: 32, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !693, file: !116, line: 661, baseType: !120, size: 32, offset: 544)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !693, file: !116, line: 662, baseType: !706, size: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !693, file: !116, line: 663, baseType: !120, size: 32, offset: 640)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !693, file: !116, line: 664, baseType: !120, size: 32, offset: 672)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !693, file: !116, line: 665, baseType: !120, size: 32, offset: 704)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !693, file: !116, line: 666, baseType: !121, size: 32, offset: 736)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !693, file: !116, line: 667, baseType: !120, size: 32, offset: 768)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !693, file: !116, line: 668, baseType: !120, size: 32, offset: 800)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !693, file: !116, line: 669, baseType: !706, size: 64, offset: 832)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !693, file: !116, line: 670, baseType: !120, size: 32, offset: 896)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !693, file: !116, line: 671, baseType: !120, size: 32, offset: 928)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !693, file: !116, line: 672, baseType: !706, size: 64, offset: 960)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !693, file: !116, line: 673, baseType: !120, size: 32, offset: 1024)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !693, file: !116, line: 674, baseType: !120, size: 32, offset: 1056)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSAICFGR", scope: !693, file: !116, line: 675, baseType: !120, size: 32, offset: 1088)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !693, file: !116, line: 676, baseType: !120, size: 32, offset: 1120)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !730, line: 343, size: 64, elements: !731)
!730 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !729, file: !730, line: 344, baseType: !121, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !729, file: !730, line: 345, baseType: !121, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!735 = !{!736, !742, !758, !769, !673}
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !675, file: !738, line: 752, type: !739, isLocal: false, isDefinition: true, align: 16)
!738 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1024, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 64)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !675, file: !738, line: 752, type: !744, isLocal: false, isDefinition: true, align: 32)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !746)
!746 = !{!747, !748, !749, !750, !756, !757}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !745, file: !141, line: 380, baseType: !144, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !745, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !745, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !745, file: !141, line: 386, baseType: !751, size: 32, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !752, file: !141, line: 359, baseType: !154, size: 8)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !752, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !745, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !745, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !675, file: !738, line: 752, type: !760, isLocal: true, isDefinition: true, align: 32)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !762)
!762 = !{!763, !768}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !761, file: !132, line: 60, baseType: !764, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DISubroutineType(types: !766)
!766 = !{!103, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !761, file: !132, line: 65, baseType: !767, size: 32, offset: 32)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !675, file: !738, line: 752, type: !752, isLocal: true, isDefinition: true, align: 8)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !684, line: 100, size: 224, elements: !772)
!772 = !{!773, !779, !780, !789, !794, !799, !805}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !771, file: !684, line: 101, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !684, line: 76, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DISubroutineType(types: !777)
!777 = !{!103, !767, !778}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !684, line: 56, baseType: !102)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !771, file: !684, line: 102, baseType: !774, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !771, file: !684, line: 103, baseType: !781, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !684, line: 83, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DISubroutineType(types: !784)
!784 = !{!103, !767, !778, !785, !102}
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !684, line: 72, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !767, !778, !102}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !771, file: !684, line: 104, baseType: !790, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !684, line: 79, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DISubroutineType(types: !793)
!793 = !{!103, !767, !778, !734}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !771, file: !684, line: 105, baseType: !795, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !684, line: 88, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DISubroutineType(types: !798)
!798 = !{!683, !767, !778}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !771, file: !684, line: 106, baseType: !800, size: 32, offset: 160)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !684, line: 92, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DISubroutineType(types: !803)
!803 = !{!103, !767, !778, !804}
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !684, line: 64, baseType: !102)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !771, file: !684, line: 107, baseType: !806, size: 32, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !684, line: 96, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DISubroutineType(types: !809)
!809 = !{!103, !767, !778, !102}
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !812, file: !869, line: 603, type: !871, isLocal: true, isDefinition: true, align: 32)
!812 = distinct !DICompileUnit(language: DW_LANG_C99, file: !813, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !814, globals: !866, splitDebugInlining: false, nameTableKind: None)
!813 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!814 = !{!102, !103, !815}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !818, line: 336, size: 160, elements: !819)
!818 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!819 = !{!820, !840, !844, !848, !861}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !817, file: !818, line: 365, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DISubroutineType(types: !823)
!823 = !{!103, !824, !839}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !827)
!827 = !{!828, !829, !830, !831, !837, !838}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !826, file: !141, line: 380, baseType: !144, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !826, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !826, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !826, file: !141, line: 386, baseType: !832, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !833, file: !141, line: 359, baseType: !154, size: 8)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !833, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !826, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !826, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !817, file: !818, line: 366, baseType: !841, size: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !824, !155}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !817, file: !818, line: 374, baseType: !845, size: 32, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DISubroutineType(types: !847)
!847 = !{!103, !824}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !817, file: !818, line: 377, baseType: !849, size: 32, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = !DISubroutineType(types: !851)
!851 = !{!103, !824, !852}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !818, line: 122, size: 64, elements: !855)
!855 = !{!856, !857, !858, !859, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !854, file: !818, line: 123, baseType: !121, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !854, file: !818, line: 124, baseType: !154, size: 8, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !854, file: !818, line: 125, baseType: !154, size: 8, offset: 40)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !854, file: !818, line: 126, baseType: !154, size: 8, offset: 48)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !854, file: !818, line: 127, baseType: !154, size: 8, offset: 56)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !817, file: !818, line: 379, baseType: !862, size: 32, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DISubroutineType(types: !864)
!864 = !{!103, !824, !865}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!866 = !{!810, !867}
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !812, file: !869, line: 38, type: !870, isLocal: true, isDefinition: true)
!869 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !872, file: !132, line: 60, baseType: !845, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !872, file: !132, line: 65, baseType: !824, size: 32, offset: 32)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !878, file: !1048, line: 762, type: !1187, isLocal: true, isDefinition: true)
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !880, retainedTypes: !898, globals: !1045, splitDebugInlining: false, nameTableKind: None)
!879 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/tmp112")
!880 = !{!30, !881, !887, !892, !683}
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !882, line: 506, baseType: !32, size: 32, elements: !883)
!882 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!883 = !{!884, !885, !886}
!884 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!885 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!886 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !882, line: 512, baseType: !32, size: 32, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!890 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!891 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!892 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !579, line: 43, baseType: !32, size: 32, elements: !893)
!893 = !{!894, !895, !896, !897}
!894 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!895 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!896 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!897 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!898 = !{!102, !103, !899, !969, !974, !934, !887, !881, !979, !980, !121, !994, !949, !1004, !1005, !1006}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !882, line: 523, size: 288, elements: !902)
!902 = !{!903, !924, !930, !935, !939, !940, !941, !945, !965}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !901, file: !882, line: 524, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DISubroutineType(types: !906)
!906 = !{!103, !907, !922, !923}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !910)
!910 = !{!911, !912, !913, !914, !920, !921}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !909, file: !141, line: 380, baseType: !144, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !909, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !909, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !909, file: !141, line: 386, baseType: !915, size: 32, offset: 96)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !916, file: !141, line: 359, baseType: !154, size: 8)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !916, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !909, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !909, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !882, line: 237, baseType: !154)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !882, line: 257, baseType: !121)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !901, file: !882, line: 530, baseType: !925, size: 32, offset: 32)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DISubroutineType(types: !927)
!927 = !{!103, !907, !928}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !882, line: 229, baseType: !121)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !901, file: !882, line: 532, baseType: !931, size: 32, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DISubroutineType(types: !933)
!933 = !{!103, !907, !934, !929}
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !882, line: 216, baseType: !121)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !901, file: !882, line: 535, baseType: !936, size: 32, offset: 96)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DISubroutineType(types: !938)
!938 = !{!103, !907, !934}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !901, file: !882, line: 537, baseType: !936, size: 32, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !901, file: !882, line: 539, baseType: !936, size: 32, offset: 160)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !901, file: !882, line: 541, baseType: !942, size: 32, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = !DISubroutineType(types: !944)
!944 = !{!103, !907, !922, !881, !887}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !901, file: !882, line: 544, baseType: !946, size: 32, offset: 224)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = !DISubroutineType(types: !948)
!948 = !{!103, !907, !949, !157}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !882, line: 478, size: 96, elements: !951)
!951 = !{!952, !959, !964}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !950, file: !882, line: 482, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !954, line: 33, baseType: !955)
!954 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !954, line: 29, size: 32, elements: !956)
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !955, file: !954, line: 30, baseType: !958, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !950, file: !882, line: 485, baseType: !960, size: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !882, line: 464, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !907, !949, !934}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !950, file: !882, line: 493, baseType: !934, size: 32, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !901, file: !882, line: 547, baseType: !966, size: 32, offset: 256)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DISubroutineType(types: !968)
!968 = !{!121, !907}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !882, line: 428, size: 32, elements: !972)
!972 = !{!973}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !971, file: !882, line: 434, baseType: !934, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !882, line: 441, size: 32, elements: !977)
!977 = !{!978}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !976, file: !882, line: 447, baseType: !934, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 583, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 572, size: 320, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !982, file: !116, line: 574, baseType: !120, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !982, file: !116, line: 575, baseType: !120, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !982, file: !116, line: 576, baseType: !120, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !982, file: !116, line: 577, baseType: !120, size: 32, offset: 96)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !982, file: !116, line: 578, baseType: !120, size: 32, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !982, file: !116, line: 579, baseType: !120, size: 32, offset: 160)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !982, file: !116, line: 580, baseType: !120, size: 32, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !982, file: !116, line: 581, baseType: !120, size: 32, offset: 224)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !982, file: !116, line: 582, baseType: !993, size: 64, offset: 256)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !242)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 596, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 589, size: 288, elements: !997)
!997 = !{!998, !999, !1000, !1002, !1003}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !996, file: !116, line: 591, baseType: !120, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !996, file: !116, line: 592, baseType: !120, size: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !996, file: !116, line: 593, baseType: !1001, size: 128, offset: 64)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !540)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !996, file: !116, line: 594, baseType: !706, size: 64, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !996, file: !116, line: 595, baseType: !120, size: 32, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !684, line: 100, size: 224, elements: !1009)
!1009 = !{!1010, !1015, !1016, !1025, !1030, !1035, !1040}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1008, file: !684, line: 101, baseType: !1011, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !684, line: 76, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!103, !907, !778}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1008, file: !684, line: 102, baseType: !1011, size: 32, offset: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1008, file: !684, line: 103, baseType: !1017, size: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !684, line: 83, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!103, !907, !778, !1021, !102}
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !684, line: 72, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{null, !907, !778, !102}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1008, file: !684, line: 104, baseType: !1026, size: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !684, line: 79, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 32)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!103, !907, !778, !734}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1008, file: !684, line: 105, baseType: !1031, size: 32, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !684, line: 88, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!683, !907, !778}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !1008, file: !684, line: 106, baseType: !1036, size: 32, offset: 160)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !684, line: 92, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 32)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!103, !907, !778, !804}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1008, file: !684, line: 107, baseType: !1041, size: 32, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !684, line: 96, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!103, !907, !778, !102}
!1045 = !{!1046, !1052, !1054, !1064, !1066, !1068, !1070, !1072, !1074, !1076, !1078, !1080, !1082, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1111, !1113, !1115, !1117, !1119, !1121, !1123, !1125, !1127, !1141, !1143, !1145, !1147, !1149, !1151, !1153, !1155, !1157, !1159, !1161, !1163, !1165, !1167, !1169, !1171, !1173, !1175, !1177, !1179, !1181, !876, !1183, !1185, !1198, !1200, !1202, !1204, !1206, !1208, !1210, !1212, !1214}
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_97", scope: !878, file: !1048, line: 762, type: !1049, isLocal: false, isDefinition: true, align: 16)
!1048 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 80, elements: !1050)
!1050 = !{!1051}
!1051 = !DISubrange(count: 5)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(name: "__device_dts_ord_97", scope: !878, file: !1048, line: 762, type: !908, isLocal: false, isDefinition: true, align: 32)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
