; ModuleID = 'build/arduino_due/sensor/fxas21002/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon, i8*, i32 }
%union.anon = type { i32 }
%struct.mpsc_pbuf_buffer.19 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon }
%struct.mpsc_pbuf_buffer_config.20 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.19*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/fxas21002/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/fxas21002")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/fxas21002")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "sem", scope: !27, file: !278, line: 11, type: !279, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !200, globals: !277, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/sensor/fxas21002/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/fxas21002")
!29 = !{!30, !101, !165, !185}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_channel", file: !102, line: 53, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "zephyr/include/zephyr/drivers/sensor.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!104 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_X", value: 0)
!105 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Y", value: 1)
!106 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Z", value: 2)
!107 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_XYZ", value: 3)
!108 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_X", value: 4)
!109 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Y", value: 5)
!110 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Z", value: 6)
!111 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_XYZ", value: 7)
!112 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_X", value: 8)
!113 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Y", value: 9)
!114 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Z", value: 10)
!115 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_XYZ", value: 11)
!116 = !DIEnumerator(name: "SENSOR_CHAN_DIE_TEMP", value: 12)
!117 = !DIEnumerator(name: "SENSOR_CHAN_AMBIENT_TEMP", value: 13)
!118 = !DIEnumerator(name: "SENSOR_CHAN_PRESS", value: 14)
!119 = !DIEnumerator(name: "SENSOR_CHAN_PROX", value: 15)
!120 = !DIEnumerator(name: "SENSOR_CHAN_HUMIDITY", value: 16)
!121 = !DIEnumerator(name: "SENSOR_CHAN_LIGHT", value: 17)
!122 = !DIEnumerator(name: "SENSOR_CHAN_IR", value: 18)
!123 = !DIEnumerator(name: "SENSOR_CHAN_RED", value: 19)
!124 = !DIEnumerator(name: "SENSOR_CHAN_GREEN", value: 20)
!125 = !DIEnumerator(name: "SENSOR_CHAN_BLUE", value: 21)
!126 = !DIEnumerator(name: "SENSOR_CHAN_ALTITUDE", value: 22)
!127 = !DIEnumerator(name: "SENSOR_CHAN_PM_1_0", value: 23)
!128 = !DIEnumerator(name: "SENSOR_CHAN_PM_2_5", value: 24)
!129 = !DIEnumerator(name: "SENSOR_CHAN_PM_10", value: 25)
!130 = !DIEnumerator(name: "SENSOR_CHAN_DISTANCE", value: 26)
!131 = !DIEnumerator(name: "SENSOR_CHAN_CO2", value: 27)
!132 = !DIEnumerator(name: "SENSOR_CHAN_VOC", value: 28)
!133 = !DIEnumerator(name: "SENSOR_CHAN_GAS_RES", value: 29)
!134 = !DIEnumerator(name: "SENSOR_CHAN_VOLTAGE", value: 30)
!135 = !DIEnumerator(name: "SENSOR_CHAN_CURRENT", value: 31)
!136 = !DIEnumerator(name: "SENSOR_CHAN_POWER", value: 32)
!137 = !DIEnumerator(name: "SENSOR_CHAN_RESISTANCE", value: 33)
!138 = !DIEnumerator(name: "SENSOR_CHAN_ROTATION", value: 34)
!139 = !DIEnumerator(name: "SENSOR_CHAN_POS_DX", value: 35)
!140 = !DIEnumerator(name: "SENSOR_CHAN_POS_DY", value: 36)
!141 = !DIEnumerator(name: "SENSOR_CHAN_POS_DZ", value: 37)
!142 = !DIEnumerator(name: "SENSOR_CHAN_RPM", value: 38)
!143 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_VOLTAGE", value: 39)
!144 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_CURRENT", value: 40)
!145 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STDBY_CURRENT", value: 41)
!146 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_MAX_LOAD_CURRENT", value: 42)
!147 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TEMP", value: 43)
!148 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_CHARGE", value: 44)
!149 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_CHARGE_CAPACITY", value: 45)
!150 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_REMAINING_CHARGE_CAPACITY", value: 46)
!151 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_NOM_AVAIL_CAPACITY", value: 47)
!152 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_AVAIL_CAPACITY", value: 48)
!153 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_POWER", value: 49)
!154 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_HEALTH", value: 50)
!155 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_EMPTY", value: 51)
!156 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_FULL", value: 52)
!157 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_CYCLE_COUNT", value: 53)
!158 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIGN_VOLTAGE", value: 54)
!159 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_VOLTAGE", value: 55)
!160 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_CHARGING_CURRENT", value: 56)
!161 = !DIEnumerator(name: "SENSOR_CHAN_ALL", value: 57)
!162 = !DIEnumerator(name: "SENSOR_CHAN_COMMON_COUNT", value: 58)
!163 = !DIEnumerator(name: "SENSOR_CHAN_PRIV_START", value: 58)
!164 = !DIEnumerator(name: "SENSOR_CHAN_MAX", value: 32767)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_attribute", file: !102, line: 274, baseType: !32, size: 32, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!167 = !DIEnumerator(name: "SENSOR_ATTR_SAMPLING_FREQUENCY", value: 0)
!168 = !DIEnumerator(name: "SENSOR_ATTR_LOWER_THRESH", value: 1)
!169 = !DIEnumerator(name: "SENSOR_ATTR_UPPER_THRESH", value: 2)
!170 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_TH", value: 3)
!171 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_DUR", value: 4)
!172 = !DIEnumerator(name: "SENSOR_ATTR_HYSTERESIS", value: 5)
!173 = !DIEnumerator(name: "SENSOR_ATTR_OVERSAMPLING", value: 6)
!174 = !DIEnumerator(name: "SENSOR_ATTR_FULL_SCALE", value: 7)
!175 = !DIEnumerator(name: "SENSOR_ATTR_OFFSET", value: 8)
!176 = !DIEnumerator(name: "SENSOR_ATTR_CALIB_TARGET", value: 9)
!177 = !DIEnumerator(name: "SENSOR_ATTR_CONFIGURATION", value: 10)
!178 = !DIEnumerator(name: "SENSOR_ATTR_CALIBRATION", value: 11)
!179 = !DIEnumerator(name: "SENSOR_ATTR_FEATURE_MASK", value: 12)
!180 = !DIEnumerator(name: "SENSOR_ATTR_ALERT", value: 13)
!181 = !DIEnumerator(name: "SENSOR_ATTR_FF_DUR", value: 14)
!182 = !DIEnumerator(name: "SENSOR_ATTR_COMMON_COUNT", value: 15)
!183 = !DIEnumerator(name: "SENSOR_ATTR_PRIV_START", value: 15)
!184 = !DIEnumerator(name: "SENSOR_ATTR_MAX", value: 32767)
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_trigger_type", file: !102, line: 203, baseType: !32, size: 32, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199}
!187 = !DIEnumerator(name: "SENSOR_TRIG_TIMER", value: 0)
!188 = !DIEnumerator(name: "SENSOR_TRIG_DATA_READY", value: 1)
!189 = !DIEnumerator(name: "SENSOR_TRIG_DELTA", value: 2)
!190 = !DIEnumerator(name: "SENSOR_TRIG_NEAR_FAR", value: 3)
!191 = !DIEnumerator(name: "SENSOR_TRIG_THRESHOLD", value: 4)
!192 = !DIEnumerator(name: "SENSOR_TRIG_TAP", value: 5)
!193 = !DIEnumerator(name: "SENSOR_TRIG_DOUBLE_TAP", value: 6)
!194 = !DIEnumerator(name: "SENSOR_TRIG_FREEFALL", value: 7)
!195 = !DIEnumerator(name: "SENSOR_TRIG_MOTION", value: 8)
!196 = !DIEnumerator(name: "SENSOR_TRIG_STATIONARY", value: 9)
!197 = !DIEnumerator(name: "SENSOR_TRIG_COMMON_COUNT", value: 10)
!198 = !DIEnumerator(name: "SENSOR_TRIG_PRIV_START", value: 10)
!199 = !DIEnumerator(name: "SENSOR_TRIG_MAX", value: 32767)
!200 = !{!201, !202, !203}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!202 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_driver_api", file: !102, line: 397, size: 160, elements: !206)
!206 = !{!207, !246, !252, !267, !272}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "attr_set", scope: !205, file: !102, line: 398, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_set_t", file: !102, line: 354, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DISubroutineType(types: !211)
!211 = !{!202, !212, !101, !165, !239}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !215, line: 378, size: 192, elements: !216)
!215 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!216 = !{!217, !221, !222, !223, !232, !233}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !215, line: 380, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !214, file: !215, line: 382, baseType: !13, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !214, file: !215, line: 384, baseType: !13, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !214, file: !215, line: 386, baseType: !224, size: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !215, line: 351, size: 16, elements: !226)
!226 = !{!227, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !225, file: !215, line: 359, baseType: !228, size: 8)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !229)
!229 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !225, file: !215, line: 364, baseType: !231, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!231 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !215, line: 388, baseType: !201, size: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !214, file: !215, line: 396, baseType: !234, size: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !215, line: 43, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !238)
!238 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_value", file: !102, line: 43, size: 64, elements: !242)
!242 = !{!243, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !241, file: !102, line: 45, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !202)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !241, file: !102, line: 47, baseType: !244, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "attr_get", scope: !205, file: !102, line: 399, baseType: !247, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_get_t", file: !102, line: 365, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DISubroutineType(types: !250)
!250 = !{!202, !212, !101, !165, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "trigger_set", scope: !205, file: !102, line: 400, baseType: !253, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_set_t", file: !102, line: 376, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!202, !212, !257, !263}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_trigger", file: !102, line: 264, size: 64, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !259, file: !102, line: 266, baseType: !185, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !259, file: !102, line: 268, baseType: !101, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_handler_t", file: !102, line: 345, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !212, !257}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fetch", scope: !205, file: !102, line: 401, baseType: !268, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_sample_fetch_t", file: !102, line: 385, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!202, !212, !101}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "channel_get", scope: !205, file: !102, line: 402, baseType: !273, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_channel_get_t", file: !102, line: 393, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DISubroutineType(types: !276)
!276 = !{!202, !212, !101, !251}
!277 = !{!25}
!278 = !DIFile(filename: "zephyr/samples/sensor/fxas21002/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !280, line: 2909, size: 128, elements: !281)
!280 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!281 = !{!282, !303, !304}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !279, file: !280, line: 2910, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !284, line: 233, baseType: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !284, line: 231, size: 64, elements: !286)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !285, file: !284, line: 232, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !289, line: 48, baseType: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !289, line: 37, size: 64, elements: !291)
!291 = !{!292, !298}
!292 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !289, line: 38, baseType: !293, size: 32)
!293 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !289, line: 38, size: 32, elements: !294)
!294 = !{!295, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !293, file: !289, line: 39, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !289, line: 40, baseType: !296, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !289, line: 42, baseType: !299, size: 32, offset: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !289, line: 42, size: 32, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !299, file: !289, line: 43, baseType: !296, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !299, file: !289, line: 44, baseType: !296, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !279, file: !280, line: 2911, baseType: !32, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !279, file: !280, line: 2912, baseType: !32, size: 32, offset: 96)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !307, file: !379, line: 18, type: !381, isLocal: false, isDefinition: true)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !309, retainedTypes: !316, globals: !376, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/fxas21002")
!309 = !{!310}
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !311, line: 121, baseType: !32, size: 32, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !314, !315}
!313 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!314 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!315 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!316 = !{!22, !201, !24, !317, !319, !321, !322, !202, !324, !325, !327, !329, !330, !331, !332, !334, !346, !228, !347, !357, !218}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !323, line: 214, baseType: !32)
!323 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !333)
!333 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !336, line: 78, size: 32, elements: !337)
!336 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!337 = !{!338, !345}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !335, file: !336, line: 80, baseType: !339, size: 32)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !336, line: 45, size: 32, elements: !340)
!340 = !{!341, !342, !343, !344}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !339, file: !336, line: 47, baseType: !228, size: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !339, file: !336, line: 50, baseType: !228, size: 8, offset: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !339, file: !336, line: 53, baseType: !228, size: 8, offset: 16)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !339, file: !336, line: 56, baseType: !228, size: 8, offset: 24)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !335, file: !336, line: 82, baseType: !201, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !311, line: 88, size: 128, elements: !349)
!349 = !{!350, !368, !372}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !348, file: !311, line: 89, baseType: !351, size: 96)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !311, line: 66, size: 96, elements: !352)
!352 = !{!353, !365, !366}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !351, file: !311, line: 67, baseType: !354, size: 32)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !311, line: 51, size: 32, elements: !355)
!355 = !{!356, !358, !359, !360, !361, !362, !363, !364}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !354, file: !311, line: 52, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !354, file: !311, line: 52, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !354, file: !311, line: 52, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !354, file: !311, line: 53, baseType: !357, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !354, file: !311, line: 54, baseType: !357, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !354, file: !311, line: 55, baseType: !357, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !354, file: !311, line: 56, baseType: !357, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !354, file: !311, line: 57, baseType: !357, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !351, file: !311, line: 75, baseType: !13, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !351, file: !311, line: 76, baseType: !367, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !311, line: 35, baseType: !357)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !348, file: !311, line: 93, baseType: !369, size: 32, offset: 96)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 32, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 4)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !348, file: !311, line: 94, baseType: !373, offset: 128)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: -1)
!376 = !{!305, !377}
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !307, file: !379, line: 18, type: !380, isLocal: true, isDefinition: true)
!379 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !383, line: 16, size: 64, elements: !384)
!383 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !383, line: 17, baseType: !218, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !382, file: !383, line: 18, baseType: !228, size: 8, offset: 32)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "_char_out", scope: !389, file: !394, line: 54, type: !395, isLocal: false, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !391, retainedTypes: !392, globals: !393, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/fxas21002")
!391 = !{!30}
!392 = !{!201, !202}
!393 = !{!387}
!394 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!202, !202}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !400, file: !465, line: 235, type: !466, isLocal: true, isDefinition: true, align: 32)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !391, retainedTypes: !402, globals: !464, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/fxas21002")
!402 = !{!201, !202, !403, !414}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !405, line: 46, baseType: !406)
!405 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 41, size: 128, elements: !407)
!407 = !{!408, !410, !411, !413}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !406, file: !405, line: 42, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !357)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !406, file: !405, line: 43, baseType: !409, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !406, file: !405, line: 44, baseType: !412, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !406, file: !405, line: 45, baseType: !412, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !416, line: 75, baseType: !417)
!416 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 41, size: 2176, elements: !418)
!418 = !{!419, !420, !421, !422, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !442, !446, !447, !448, !449, !450, !451, !452, !453, !457, !458, !459, !460, !461, !462, !463}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !417, file: !416, line: 42, baseType: !409, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !417, file: !416, line: 43, baseType: !409, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !417, file: !416, line: 44, baseType: !412, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !417, file: !416, line: 45, baseType: !423, size: 32, offset: 96)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 32, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 1)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !417, file: !416, line: 46, baseType: !409, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !417, file: !416, line: 47, baseType: !409, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !417, file: !416, line: 48, baseType: !412, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !417, file: !416, line: 49, baseType: !409, size: 32, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !417, file: !416, line: 50, baseType: !409, size: 32, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !417, file: !416, line: 51, baseType: !412, size: 32, offset: 288)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !417, file: !416, line: 52, baseType: !409, size: 32, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !417, file: !416, line: 53, baseType: !423, size: 32, offset: 352)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !417, file: !416, line: 54, baseType: !409, size: 32, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !417, file: !416, line: 55, baseType: !423, size: 32, offset: 416)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !417, file: !416, line: 56, baseType: !409, size: 32, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !417, file: !416, line: 57, baseType: !423, size: 32, offset: 480)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !417, file: !416, line: 58, baseType: !439, size: 96, offset: 512)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 96, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 3)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !417, file: !416, line: 59, baseType: !443, size: 160, offset: 608)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 160, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 5)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !417, file: !416, line: 60, baseType: !409, size: 32, offset: 768)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !417, file: !416, line: 61, baseType: !409, size: 32, offset: 800)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !417, file: !416, line: 62, baseType: !412, size: 32, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !417, file: !416, line: 63, baseType: !412, size: 32, offset: 864)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !417, file: !416, line: 64, baseType: !409, size: 32, offset: 896)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !417, file: !416, line: 65, baseType: !409, size: 32, offset: 928)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !417, file: !416, line: 66, baseType: !409, size: 32, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !417, file: !416, line: 67, baseType: !454, size: 832, offset: 992)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 832, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 26)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !417, file: !416, line: 68, baseType: !409, size: 32, offset: 1824)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !417, file: !416, line: 69, baseType: !412, size: 32, offset: 1856)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !417, file: !416, line: 70, baseType: !443, size: 160, offset: 1888)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !417, file: !416, line: 71, baseType: !409, size: 32, offset: 2048)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !417, file: !416, line: 72, baseType: !409, size: 32, offset: 2080)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !417, file: !416, line: 73, baseType: !412, size: 32, offset: 2112)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !417, file: !416, line: 74, baseType: !409, size: 32, offset: 2144)
!464 = !{!398}
!465 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !468, line: 51, size: 64, elements: !469)
!468 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = !{!470, !489}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !467, file: !468, line: 60, baseType: !471, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DISubroutineType(types: !473)
!473 = !{!202, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !215, line: 378, size: 192, elements: !477)
!477 = !{!478, !479, !480, !481, !487, !488}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !476, file: !215, line: 380, baseType: !218, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !476, file: !215, line: 382, baseType: !13, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !476, file: !215, line: 384, baseType: !13, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !476, file: !215, line: 386, baseType: !482, size: 32, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !215, line: 351, size: 16, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !483, file: !215, line: 359, baseType: !228, size: 8)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !483, file: !215, line: 364, baseType: !231, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !476, file: !215, line: 388, baseType: !201, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !476, file: !215, line: 396, baseType: !234, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !467, file: !468, line: 65, baseType: !474, size: 32, offset: 32)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "log_const_log", scope: !492, file: !573, line: 25, type: !810, isLocal: false, isDefinition: true)
!492 = distinct !DICompileUnit(language: DW_LANG_C99, file: !493, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !494, retainedTypes: !500, globals: !570, splitDebugInlining: false, nameTableKind: None)
!493 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/fxas21002")
!494 = !{!495, !310, !30}
!495 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !496, line: 33, baseType: !32, size: 32, elements: !497)
!496 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = !{!498, !499}
!498 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!499 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!500 = !{!322, !202, !201, !501, !346, !512, !228, !513, !357, !534, !22, !24, !561, !564, !566, !568}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !336, line: 78, size: 32, elements: !503)
!503 = !{!504, !511}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !502, file: !336, line: 80, baseType: !505, size: 32)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !336, line: 45, size: 32, elements: !506)
!506 = !{!507, !508, !509, !510}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !505, file: !336, line: 47, baseType: !228, size: 8)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !505, file: !336, line: 50, baseType: !228, size: 8, offset: 8)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !505, file: !336, line: 53, baseType: !228, size: 8, offset: 16)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !505, file: !336, line: 56, baseType: !228, size: 8, offset: 24)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !502, file: !336, line: 82, baseType: !201, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !311, line: 88, size: 128, elements: !515)
!515 = !{!516, !532, !533}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !514, file: !311, line: 89, baseType: !517, size: 96)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !311, line: 66, size: 96, elements: !518)
!518 = !{!519, !530, !531}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !517, file: !311, line: 67, baseType: !520, size: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !311, line: 51, size: 32, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !520, file: !311, line: 52, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !520, file: !311, line: 52, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !520, file: !311, line: 52, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !520, file: !311, line: 53, baseType: !357, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !520, file: !311, line: 54, baseType: !357, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !520, file: !311, line: 55, baseType: !357, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !520, file: !311, line: 56, baseType: !357, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !520, file: !311, line: 57, baseType: !357, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !517, file: !311, line: 75, baseType: !13, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !517, file: !311, line: 76, baseType: !367, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !514, file: !311, line: 93, baseType: !369, size: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !514, file: !311, line: 94, baseType: !373, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !311, line: 111, size: 128, elements: !536)
!536 = !{!537, !554, !560}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !535, file: !311, line: 112, baseType: !538, size: 32)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !539, line: 49, size: 32, elements: !540)
!539 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = !{!541, !547, !553}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !538, file: !539, line: 50, baseType: !542, size: 32)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !539, line: 37, size: 32, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !542, file: !539, line: 38, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !542, file: !539, line: 38, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !542, file: !539, line: 39, baseType: !357, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !538, file: !539, line: 51, baseType: !548, size: 32)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !539, line: 43, size: 32, elements: !549)
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !548, file: !539, line: 44, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !548, file: !539, line: 44, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !548, file: !539, line: 45, baseType: !357, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !538, file: !539, line: 52, baseType: !357, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !535, file: !311, line: 113, baseType: !555, size: 32)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !311, line: 107, size: 32, elements: !556)
!556 = !{!557, !558, !559}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !555, file: !311, line: 108, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !555, file: !311, line: 108, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !555, file: !311, line: 108, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !535, file: !311, line: 114, baseType: !514, size: 128)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !562, line: 46, baseType: !563)
!562 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !328)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !565)
!565 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!570 = !{!490, !571, !597, !610, !612, !614, !618, !620, !622, !624, !626, !628, !634, !667, !670, !679, !771, !798, !805, !807, !815, !825, !830, !845, !849}
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !492, file: !573, line: 93, type: !574, isLocal: false, isDefinition: true, align: 32)
!573 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !280, line: 2909, size: 128, elements: !575)
!575 = !{!576, !595, !596}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !574, file: !280, line: 2910, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !284, line: 233, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !284, line: 231, size: 64, elements: !579)
!579 = !{!580}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !578, file: !284, line: 232, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !289, line: 48, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !289, line: 37, size: 64, elements: !583)
!583 = !{!584, !590}
!584 = !DIDerivedType(tag: DW_TAG_member, scope: !582, file: !289, line: 38, baseType: !585, size: 32)
!585 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !582, file: !289, line: 38, size: 32, elements: !586)
!586 = !{!587, !589}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !585, file: !289, line: 39, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !585, file: !289, line: 40, baseType: !588, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, scope: !582, file: !289, line: 42, baseType: !591, size: 32, offset: 32)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !582, file: !289, line: 42, size: 32, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !591, file: !289, line: 43, baseType: !588, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !591, file: !289, line: 44, baseType: !588, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !574, file: !280, line: 2911, baseType: !32, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !574, file: !280, line: 2912, baseType: !32, size: 32, offset: 96)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !492, file: !573, line: 910, type: !599, isLocal: true, isDefinition: true, align: 32)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !468, line: 51, size: 64, elements: !601)
!601 = !{!602, !609}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !600, file: !468, line: 60, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DISubroutineType(types: !605)
!605 = !{!202, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !608)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !468, line: 48, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !600, file: !468, line: 65, baseType: !606, size: 32, offset: 32)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "panic_mode", scope: !492, file: !573, line: 96, type: !231, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "backend_attached", scope: !492, file: !573, line: 97, type: !231, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !492, file: !573, line: 98, type: !616, isLocal: true, isDefinition: true)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !617, line: 22, baseType: !326)
!617 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !492, file: !573, line: 99, type: !616, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !492, file: !573, line: 105, type: !357, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !492, file: !573, line: 107, type: !367, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !492, file: !573, line: 108, type: !616, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "last_failure_report", scope: !492, file: !573, line: 109, type: !564, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !492, file: !573, line: 111, type: !630, isLocal: true, isDefinition: true, align: 32)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !631, line: 29, size: 32, elements: !632)
!631 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!632 = !{!633}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !630, file: !631, line: 30, baseType: !534, size: 32)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "log_buffer", scope: !492, file: !573, line: 112, type: !636, isLocal: true, isDefinition: true, align: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !637, line: 87, size: 448, elements: !638)
!637 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!638 = !{!639, !640, !641, !642, !643, !644, !648, !657, !662, !664, !665, !666}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !636, file: !637, line: 89, baseType: !357, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !636, file: !637, line: 92, baseType: !357, size: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !636, file: !637, line: 95, baseType: !357, size: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !636, file: !637, line: 98, baseType: !357, size: 32, offset: 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !636, file: !637, line: 101, baseType: !357, size: 32, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !636, file: !637, line: 104, baseType: !645, offset: 160)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !646, line: 43, elements: !647)
!646 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!647 = !{}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !636, file: !637, line: 110, baseType: !649, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !637, line: 83, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !653, !655}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !636, file: !637, line: 113, baseType: !658, size: 32, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !637, line: 75, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DISubroutineType(types: !661)
!661 = !{!357, !655}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !636, file: !637, line: 116, baseType: !663, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !636, file: !637, line: 119, baseType: !357, size: 32, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !636, file: !637, line: 122, baseType: !357, size: 32, offset: 288)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !636, file: !637, line: 124, baseType: !574, size: 128, offset: 320)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !492, file: !573, line: 113, type: !669, isLocal: true, isDefinition: true)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "logging_stack", scope: !492, file: !573, line: 884, type: !672, isLocal: false, isDefinition: true, align: 512)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 6656, elements: !677)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !674, line: 47, size: 8, elements: !675)
!674 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !673, file: !674, line: 48, baseType: !220, size: 8)
!677 = !{!678}
!678 = !DISubrange(count: 832)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "logging_thread", scope: !492, file: !573, line: 885, type: !681, isLocal: false, isDefinition: true)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !682, line: 245, size: 1024, elements: !683)
!682 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!683 = !{!684, !729, !742, !743, !744, !745, !751, !766}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !681, file: !682, line: 247, baseType: !685, size: 384)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !682, line: 57, size: 384, elements: !686)
!686 = !{!687, !701, !703, !704, !705, !716, !717, !718}
!687 = !DIDerivedType(tag: DW_TAG_member, scope: !685, file: !682, line: 60, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !685, file: !682, line: 60, size: 64, elements: !689)
!689 = !{!690, !692}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !688, file: !682, line: 61, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !289, line: 49, baseType: !582)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !688, file: !682, line: 62, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !694, line: 49, size: 64, elements: !695)
!694 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !693, file: !694, line: 50, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 64, elements: !699)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!699 = !{!700}
!700 = !DISubrange(count: 2)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !685, file: !682, line: 68, baseType: !702, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !685, file: !682, line: 71, baseType: !228, size: 8, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !685, file: !682, line: 74, baseType: !228, size: 8, offset: 104)
!705 = !DIDerivedType(tag: DW_TAG_member, scope: !685, file: !682, line: 90, baseType: !706, size: 16, offset: 112)
!706 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !685, file: !682, line: 90, size: 16, elements: !707)
!707 = !{!708, !715}
!708 = !DIDerivedType(tag: DW_TAG_member, scope: !706, file: !682, line: 91, baseType: !709, size: 16)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !706, file: !682, line: 91, size: 16, elements: !710)
!710 = !{!711, !714}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !709, file: !682, line: 96, baseType: !712, size: 8)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !713)
!713 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !709, file: !682, line: 97, baseType: !228, size: 8, offset: 8)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !706, file: !682, line: 100, baseType: !332, size: 16)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !685, file: !682, line: 107, baseType: !357, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !685, file: !682, line: 127, baseType: !201, size: 32, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !685, file: !682, line: 131, baseType: !719, size: 192, offset: 192)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !284, line: 244, size: 192, elements: !720)
!720 = !{!721, !722, !728}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !719, file: !284, line: 245, baseType: !691, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !719, file: !284, line: 246, baseType: !723, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !284, line: 242, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !719, file: !284, line: 249, baseType: !563, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !681, file: !682, line: 250, baseType: !730, size: 288, offset: 384)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !731, line: 25, size: 288, elements: !732)
!731 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !730, file: !731, line: 26, baseType: !357, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !730, file: !731, line: 27, baseType: !357, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !730, file: !731, line: 28, baseType: !357, size: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !730, file: !731, line: 29, baseType: !357, size: 32, offset: 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !730, file: !731, line: 30, baseType: !357, size: 32, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !730, file: !731, line: 31, baseType: !357, size: 32, offset: 160)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !730, file: !731, line: 32, baseType: !357, size: 32, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !730, file: !731, line: 33, baseType: !357, size: 32, offset: 224)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !730, file: !731, line: 34, baseType: !357, size: 32, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !681, file: !682, line: 253, baseType: !201, size: 32, offset: 672)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !681, file: !682, line: 256, baseType: !577, size: 64, offset: 704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !681, file: !682, line: 294, baseType: !202, size: 32, offset: 768)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !681, file: !682, line: 300, baseType: !746, size: 96, offset: 800)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !682, line: 149, size: 96, elements: !747)
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !746, file: !682, line: 153, baseType: !22, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !746, file: !682, line: 162, baseType: !322, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !746, file: !682, line: 168, baseType: !322, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !681, file: !682, line: 325, baseType: !752, size: 32, offset: 896)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !280, line: 5073, size: 160, elements: !754)
!754 = !{!755, !764, !765}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !753, file: !280, line: 5074, baseType: !756, size: 96)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !757, line: 56, size: 96, elements: !758)
!757 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!758 = !{!759, !762, !763}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !756, file: !757, line: 57, baseType: !760, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !757, line: 57, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !756, file: !757, line: 58, baseType: !201, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !756, file: !757, line: 59, baseType: !322, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !753, file: !280, line: 5075, baseType: !577, size: 64, offset: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !753, file: !280, line: 5076, baseType: !645, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !681, file: !682, line: 343, baseType: !767, size: 64, offset: 928)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !731, line: 60, size: 64, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !767, file: !731, line: 63, baseType: !357, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !767, file: !731, line: 66, baseType: !357, size: 32, offset: 32)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "format_table", scope: !492, file: !573, line: 72, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 128, elements: !370)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !776, line: 105, baseType: !777)
!776 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !780, !513, !357}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !776, line: 89, size: 128, elements: !783)
!783 = !{!784, !789, !796, !797}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !782, file: !776, line: 90, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !776, line: 79, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DISubroutineType(types: !788)
!788 = !{!202, !331, !322, !201}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !782, file: !776, line: 91, baseType: !790, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !776, line: 82, size: 96, elements: !792)
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !791, file: !776, line: 83, baseType: !616, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !791, file: !776, line: 84, baseType: !201, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !791, file: !776, line: 85, baseType: !218, size: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !782, file: !776, line: 92, baseType: !331, size: 32, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !782, file: !776, line: 93, baseType: !322, size: 32, offset: 96)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !492, file: !573, line: 104, type: !800, isLocal: true, isDefinition: true)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !801, line: 33, baseType: !802)
!801 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DISubroutineType(types: !804)
!804 = !{!367}
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "initialized", scope: !492, file: !573, line: 95, type: !616, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !492, file: !573, line: 25, type: !809, isLocal: true, isDefinition: true)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !383, line: 16, size: 64, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !811, file: !383, line: 17, baseType: !218, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !811, file: !383, line: 18, baseType: !228, size: 8, offset: 32)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !492, file: !573, line: 121, type: !817, isLocal: true, isDefinition: true)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !637, line: 128, size: 160, elements: !819)
!819 = !{!820, !821, !822, !823, !824}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !818, file: !637, line: 130, baseType: !663, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !818, file: !637, line: 133, baseType: !357, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !818, file: !637, line: 136, baseType: !649, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !818, file: !637, line: 137, baseType: !658, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !818, file: !637, line: 140, baseType: !357, size: 32, offset: 128)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "buf32", scope: !492, file: !573, line: 116, type: !827, isLocal: true, isDefinition: true, align: 64)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 8192, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 256)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "process_lock", scope: !832, file: !573, line: 157, type: !645, isLocal: true, isDefinition: true)
!832 = distinct !DISubprogram(name: "z_log_msg_post_finalize", scope: !573, file: !573, line: 152, type: !833, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !492, retainedNodes: !835)
!833 = !DISubroutineType(types: !834)
!834 = !{null}
!835 = !{!836, !838}
!836 = !DILocalVariable(name: "cnt", scope: !832, file: !573, line: 154, type: !837)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_val_t", file: !617, line: 23, baseType: !616)
!838 = !DILocalVariable(name: "key", scope: !839, file: !573, line: 158, type: !841)
!839 = distinct !DILexicalBlock(scope: !840, file: !573, line: 156, column: 18)
!840 = distinct !DILexicalBlock(scope: !832, file: !573, line: 156, column: 6)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !646, line: 106, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !646, line: 32, size: 32, elements: !843)
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !842, file: !646, line: 33, baseType: !202, size: 32)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "proc_tid", scope: !492, file: !573, line: 100, type: !847, isLocal: true, isDefinition: true)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !682, line: 347, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "log_process_thread_timer", scope: !492, file: !573, line: 101, type: !851, isLocal: true, isDefinition: true)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !280, line: 1318, size: 448, elements: !852)
!852 = !{!853, !854, !855, !860, !861, !866, !867}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !851, file: !280, line: 1324, baseType: !719, size: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !851, file: !280, line: 1327, baseType: !577, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !851, file: !280, line: 1330, baseType: !856, size: 32, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !851, file: !280, line: 1333, baseType: !856, size: 32, offset: 288)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !851, file: !280, line: 1336, baseType: !862, size: 64, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !562, line: 67, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !562, line: 65, size: 64, elements: !864)
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !863, file: !562, line: 66, baseType: !561, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !851, file: !280, line: 1339, baseType: !357, size: 32, offset: 384)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !851, file: !280, line: 1342, baseType: !201, size: 32, offset: 416)
!868 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!869 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !872, file: !881, line: 14, type: !1112, isLocal: false, isDefinition: true)
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !874, retainedTypes: !875, globals: !878, splitDebugInlining: false, nameTableKind: None)
!873 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/fxas21002")
!874 = !{!495, !30}
!875 = !{!201, !202, !876, !331, !218, !22}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!878 = !{!870, !879, !907, !1089, !1091, !1103, !1105, !1110}
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "sname_cache", scope: !872, file: !881, line: 44, type: !882, isLocal: true, isDefinition: true)
!881 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !883, line: 30, size: 256, elements: !884)
!883 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!884 = !{!885, !898, !899, !904, !905, !906}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !882, file: !883, line: 31, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !887, line: 40, baseType: !888)
!887 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !887, line: 35, size: 64, elements: !889)
!889 = !{!890, !897}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !888, file: !887, line: 36, baseType: !891, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !887, line: 33, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !887, line: 29, size: 32, elements: !894)
!894 = !{!895}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !893, file: !887, line: 30, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !888, file: !887, line: 37, baseType: !891, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !882, file: !883, line: 32, baseType: !886, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !882, file: !883, line: 33, baseType: !900, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !883, line: 21, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{!231, !22, !22}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !882, file: !883, line: 34, baseType: !357, size: 32, offset: 160)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !882, file: !883, line: 35, baseType: !357, size: 32, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !882, file: !883, line: 36, baseType: !322, size: 32, offset: 224)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !909, file: !881, line: 261, type: !218, isLocal: true, isDefinition: true)
!909 = distinct !DISubprogram(name: "link_domain_name_get", scope: !881, file: !881, line: 256, type: !910, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !872, retainedNodes: !912)
!910 = !DISubroutineType(types: !911)
!911 = !{!218, !228}
!912 = !{!913, !914, !915, !916, !917, !920, !1088}
!913 = !DILocalVariable(name: "domain_id", arg: 1, scope: !909, file: !881, line: 256, type: !228)
!914 = !DILocalVariable(name: "cached", scope: !909, file: !881, line: 258, type: !331)
!915 = !DILocalVariable(name: "cache_size", scope: !909, file: !881, line: 259, type: !322)
!916 = !DILocalVariable(name: "id", scope: !909, file: !881, line: 260, type: !22)
!917 = !DILocalVariable(name: "rel_domain_id", scope: !918, file: !881, line: 265, type: !228)
!918 = distinct !DILexicalBlock(scope: !919, file: !881, line: 264, column: 49)
!919 = distinct !DILexicalBlock(scope: !909, file: !881, line: 264, column: 6)
!920 = !DILocalVariable(name: "link", scope: !918, file: !881, line: 266, type: !921)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !924, line: 61, size: 192, elements: !925)
!924 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!925 = !{!926, !1015, !1016, !1025, !1026, !1078}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !923, file: !924, line: 62, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !924, line: 38, size: 192, elements: !930)
!930 = !{!931, !994, !998, !1003, !1007, !1011}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !929, file: !924, line: 39, baseType: !932, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DISubroutineType(types: !934)
!934 = !{!202, !921, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !924, line: 33, size: 64, elements: !937)
!937 = !{!938, !989}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !936, file: !924, line: 34, baseType: !939, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !924, line: 27, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !921, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !311, line: 111, size: 128, elements: !945)
!945 = !{!946, !962, !968}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !944, file: !311, line: 112, baseType: !947, size: 32)
!947 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !539, line: 49, size: 32, elements: !948)
!948 = !{!949, !955, !961}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !947, file: !539, line: 50, baseType: !950, size: 32)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !539, line: 37, size: 32, elements: !951)
!951 = !{!952, !953, !954}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !950, file: !539, line: 38, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !950, file: !539, line: 38, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !950, file: !539, line: 39, baseType: !357, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !947, file: !539, line: 51, baseType: !956, size: 32)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !539, line: 43, size: 32, elements: !957)
!957 = !{!958, !959, !960}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !956, file: !539, line: 44, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !956, file: !539, line: 44, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !956, file: !539, line: 45, baseType: !357, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !947, file: !539, line: 52, baseType: !357, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !944, file: !311, line: 113, baseType: !963, size: 32)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !311, line: 107, size: 32, elements: !964)
!964 = !{!965, !966, !967}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !963, file: !311, line: 108, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !963, file: !311, line: 108, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !963, file: !311, line: 108, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !944, file: !311, line: 114, baseType: !969, size: 128)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !311, line: 88, size: 128, elements: !970)
!970 = !{!971, !987, !988}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !969, file: !311, line: 89, baseType: !972, size: 96)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !311, line: 66, size: 96, elements: !973)
!973 = !{!974, !985, !986}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !972, file: !311, line: 67, baseType: !975, size: 32)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !311, line: 51, size: 32, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !982, !983, !984}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !975, file: !311, line: 52, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !975, file: !311, line: 52, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !975, file: !311, line: 52, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !975, file: !311, line: 53, baseType: !357, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !975, file: !311, line: 54, baseType: !357, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !975, file: !311, line: 55, baseType: !357, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !975, file: !311, line: 56, baseType: !357, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !975, file: !311, line: 57, baseType: !357, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !972, file: !311, line: 75, baseType: !13, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !972, file: !311, line: 76, baseType: !367, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !969, file: !311, line: 93, baseType: !369, size: 32, offset: 96)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !969, file: !311, line: 94, baseType: !373, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "dropped_cb", scope: !936, file: !924, line: 35, baseType: !990, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_dropped_cb_t", file: !924, line: 30, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !921, !357}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !929, file: !924, line: 40, baseType: !995, size: 32, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DISubroutineType(types: !997)
!997 = !{!202, !921}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "get_domain_name", scope: !929, file: !924, line: 41, baseType: !999, size: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!202, !921, !357, !330, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "get_source_name", scope: !929, file: !924, line: 43, baseType: !1004, size: 32, offset: 96)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!202, !921, !357, !332, !330, !1002}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "get_levels", scope: !929, file: !924, line: 45, baseType: !1008, size: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!202, !921, !357, !332, !331, !331}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "set_runtime_level", scope: !929, file: !924, line: 48, baseType: !1012, size: 32, offset: 160)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!202, !921, !357, !332, !228}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !923, file: !924, line: 63, baseType: !218, size: 32, offset: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_blk", scope: !923, file: !924, line: 64, baseType: !1017, size: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_ctrl_blk", file: !924, line: 52, size: 128, elements: !1019)
!1019 = !{!1020, !1021, !1023, !1024}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "domain_cnt", scope: !1018, file: !924, line: 53, baseType: !357, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "source_cnt", scope: !1018, file: !924, line: 54, baseType: !1022, size: 16, offset: 32)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 16, elements: !424)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "domain_offset", scope: !1018, file: !924, line: 57, baseType: !357, size: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !1018, file: !924, line: 58, baseType: !663, size: 32, offset: 96)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !923, file: !924, line: 65, baseType: !201, size: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf", scope: !923, file: !924, line: 66, baseType: !1027, size: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 32)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !637, line: 87, size: 448, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1034, !1035, !1037, !1046, !1051, !1052, !1053, !1054}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !1028, file: !637, line: 89, baseType: !357, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !1028, file: !637, line: 92, baseType: !357, size: 32, offset: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !1028, file: !637, line: 95, baseType: !357, size: 32, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !1028, file: !637, line: 98, baseType: !357, size: 32, offset: 96)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1028, file: !637, line: 101, baseType: !357, size: 32, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1028, file: !637, line: 104, baseType: !1036, offset: 160)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !646, line: 43, elements: !647)
