; ModuleID = 'build/96b_meerkat96/drivers/ipm/ipm_mcux/remote/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pinctrl_soc_pinmux = type { i32, i32, i32, i8 }
%struct.imx_gpio_config = type { %union.anon.1, %struct.GPIO_Type*, %struct.pinctrl_soc_pinmux*, i8 }
%union.anon.1 = type { i32 }
%struct.GPIO_Type = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.gpio_driver_api = type { i32 (%struct.device*, i8, i32)*, i32 (%struct.device*, i32*)*, i32 (%struct.device*, i32, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i8, i32, i32)*, i32 (%struct.device*, %struct.gpio_callback*, i1)*, i32 (%struct.device*)* }
%struct.gpio_callback = type { %struct._snode, void (%struct.device*, %struct.gpio_callback*, i32)*, i32 }
%struct._snode = type { %struct._snode* }
%struct.imx_gpio_data = type { %union.anon.1, %struct._slist }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.imx_mu_config = type { %struct.MU_Type*, void (%struct.device*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !111, file: !530, line: 258, type: !531, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !396, globals: !529, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote")
!113 = !{!114, !146, !156, !205, !211, !332, !367}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !115, line: 54, baseType: !32, size: 32, elements: !116)
!115 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!117 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!118 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!119 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!120 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!121 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!122 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!123 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!124 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!125 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!126 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!127 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!128 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!129 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!130 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!131 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!132 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!133 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!134 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!135 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!136 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!137 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!138 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!139 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!140 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!141 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!142 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!143 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!144 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!145 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !115, line: 224, baseType: !32, size: 32, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155}
!148 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!149 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!150 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!151 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!152 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!153 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!154 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!155 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !115, line: 275, baseType: !32, size: 32, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!158 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!159 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!160 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!161 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!162 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!163 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!164 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!165 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!166 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!167 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!168 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!169 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!170 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!171 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!172 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!173 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!174 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!175 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!176 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!177 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!178 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!179 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!180 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!181 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!182 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!183 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!184 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!185 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!186 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!187 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!188 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!189 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!190 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!191 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!192 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!193 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!194 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!195 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!196 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!197 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!198 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!199 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!200 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!201 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!202 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!203 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!204 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !115, line: 327, baseType: !32, size: 32, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!208 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!209 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!210 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !212, line: 76, baseType: !32, size: 32, elements: !213)
!212 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!214 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!215 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!216 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!217 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!218 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!219 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!220 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!221 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!222 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!223 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!224 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!225 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!226 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!227 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!228 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!229 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!230 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!231 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!232 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!233 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!234 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!235 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!236 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!237 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!238 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!239 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!240 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!241 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!242 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!243 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!244 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!245 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!246 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!247 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!248 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!249 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!250 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!251 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!252 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!253 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!254 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!255 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!256 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!257 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!258 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!259 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!260 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!261 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!262 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!263 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!264 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!265 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!266 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!267 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!268 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!269 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!270 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!271 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!272 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!273 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!274 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!275 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!276 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!277 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!278 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!279 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!280 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!281 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!282 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!283 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!284 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!285 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!286 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!287 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!288 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!289 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!290 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!291 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!292 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!293 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!294 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!295 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!296 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!297 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!298 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!299 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!300 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!301 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!302 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!303 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!304 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!305 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!306 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!307 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!308 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!309 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!310 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!311 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!312 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!313 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!314 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!315 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!316 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!317 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!318 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!319 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!320 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!321 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!322 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!323 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!324 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!325 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!326 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!327 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!328 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!329 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!330 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!331 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !115, line: 237, baseType: !32, size: 32, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!334 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!335 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!336 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!337 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!338 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!339 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!340 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!341 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!342 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!343 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!344 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!345 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!346 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!347 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!348 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!349 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!350 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!351 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!352 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!353 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!354 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!355 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!356 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!357 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!358 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!359 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!360 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!361 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!362 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!363 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!364 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!365 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!366 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !212, line: 44, baseType: !32, size: 32, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!369 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!370 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!371 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!372 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!373 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!374 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!375 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!376 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!377 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!378 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!379 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!380 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!381 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!382 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!383 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!384 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!385 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!386 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!387 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!388 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!389 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!390 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!391 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!392 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!393 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!394 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!395 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!396 = !{!397, !472, !515, !528, !404}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !399, line: 4575, baseType: !400)
!399 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 4532, size: 390144, elements: !401)
!401 = !{!402, !405, !406, !407, !408, !414, !424, !428, !438, !442}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !400, file: !399, line: 4533, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !400, file: !399, line: 4534, baseType: !403, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !400, file: !399, line: 4535, baseType: !403, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !400, file: !399, line: 4536, baseType: !403, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !400, file: !399, line: 4537, baseType: !409, size: 16256, offset: 128)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 16256, elements: !412)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !411)
!411 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!412 = !{!413}
!413 = !DISubrange(count: 2032)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !400, file: !399, line: 4543, baseType: !415, size: 4224, offset: 16384)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 4224, elements: !422)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !399, line: 4538, size: 128, elements: !417)
!417 = !{!418, !419, !420, !421}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !416, file: !399, line: 4539, baseType: !403, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !416, file: !399, line: 4540, baseType: !403, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !416, file: !399, line: 4541, baseType: !403, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !416, file: !399, line: 4542, baseType: !403, size: 32, offset: 96)
!422 = !{!423}
!423 = !DISubrange(count: 33)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !400, file: !399, line: 4544, baseType: !425, size: 110464, offset: 20608)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 110464, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 13808)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !400, file: !399, line: 4550, baseType: !429, size: 24448, offset: 131072)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 24448, elements: !436)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !399, line: 4545, size: 128, elements: !431)
!431 = !{!432, !433, !434, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !430, file: !399, line: 4546, baseType: !403, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !430, file: !399, line: 4547, baseType: !403, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !430, file: !399, line: 4548, baseType: !403, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !430, file: !399, line: 4549, baseType: !403, size: 32, offset: 96)
!436 = !{!437}
!437 = !DISubrange(count: 191)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !400, file: !399, line: 4551, baseType: !439, size: 106624, offset: 155520)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 106624, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 13328)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !400, file: !399, line: 4574, baseType: !443, size: 128000, offset: 262144)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 128000, elements: !470)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !399, line: 4552, size: 1024, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !466, !467, !468, !469}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !444, file: !399, line: 4553, baseType: !403, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !444, file: !399, line: 4554, baseType: !403, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !444, file: !399, line: 4555, baseType: !403, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !444, file: !399, line: 4556, baseType: !403, size: 32, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !444, file: !399, line: 4557, baseType: !403, size: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !444, file: !399, line: 4558, baseType: !403, size: 32, offset: 160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !444, file: !399, line: 4559, baseType: !403, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !444, file: !399, line: 4560, baseType: !403, size: 32, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !444, file: !399, line: 4561, baseType: !403, size: 32, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !444, file: !399, line: 4562, baseType: !403, size: 32, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !444, file: !399, line: 4563, baseType: !403, size: 32, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !444, file: !399, line: 4564, baseType: !403, size: 32, offset: 352)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !444, file: !399, line: 4565, baseType: !403, size: 32, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !444, file: !399, line: 4566, baseType: !403, size: 32, offset: 416)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !444, file: !399, line: 4567, baseType: !403, size: 32, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !444, file: !399, line: 4568, baseType: !403, size: 32, offset: 480)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !444, file: !399, line: 4569, baseType: !463, size: 384, offset: 512)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 384, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 48)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !444, file: !399, line: 4570, baseType: !403, size: 32, offset: 896)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !444, file: !399, line: 4571, baseType: !403, size: 32, offset: 928)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !444, file: !399, line: 4572, baseType: !403, size: 32, offset: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !444, file: !399, line: 4573, baseType: !403, size: 32, offset: 992)
!470 = !{!471}
!471 = !DISubrange(count: 125)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !399, line: 38320, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 38303, size: 23040, elements: !475)
!475 = !{!476, !478, !482, !483, !484, !485, !489, !493, !497, !501, !505}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !474, file: !399, line: 38304, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !474, file: !399, line: 38305, baseType: !479, size: 256, offset: 32)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 256, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !474, file: !399, line: 38306, baseType: !403, size: 32, offset: 288)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !474, file: !399, line: 38307, baseType: !403, size: 32, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !474, file: !399, line: 38308, baseType: !403, size: 32, offset: 352)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !474, file: !399, line: 38309, baseType: !486, size: 3712, offset: 384)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 3712, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 464)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !474, file: !399, line: 38310, baseType: !490, size: 864, offset: 4096)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 864, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 27)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !474, file: !399, line: 38311, baseType: !494, size: 3232, offset: 4960)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 3232, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 404)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !474, file: !399, line: 38312, baseType: !498, size: 3776, offset: 8192)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 3776, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 118)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !474, file: !399, line: 38313, baseType: !502, size: 4416, offset: 11968)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 4416, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 552)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !474, file: !399, line: 38319, baseType: !506, size: 6656, offset: 16384)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 6656, elements: !513)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !399, line: 38314, size: 128, elements: !508)
!508 = !{!509, !510, !511, !512}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !507, file: !399, line: 38315, baseType: !403, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !507, file: !399, line: 38316, baseType: !403, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !507, file: !399, line: 38317, baseType: !403, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !507, file: !399, line: 38318, baseType: !403, size: 32, offset: 96)
!513 = !{!514}
!514 = !DISubrange(count: 52)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !399, line: 43319, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 43313, size: 80, elements: !518)
!518 = !{!519, !523, !524, !526, !527}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !517, file: !399, line: 43314, baseType: !520, size: 16)
!520 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !522)
!522 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !517, file: !399, line: 43315, baseType: !520, size: 16, offset: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !517, file: !399, line: 43316, baseType: !525, size: 16, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !517, file: !399, line: 43317, baseType: !520, size: 16, offset: 48)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !517, file: !399, line: 43318, baseType: !520, size: 16, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!529 = !{!109}
!530 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !533, line: 51, size: 64, elements: !534)
!533 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!534 = !{!535, !542}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !532, file: !533, line: 60, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!537 = !DISubroutineType(types: !538)
!538 = !{!103, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !533, line: 48, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !532, file: !533, line: 65, baseType: !539, size: 32, offset: 32)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !545, file: !646, line: 603, type: !648, isLocal: true, isDefinition: true, align: 32)
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !547, globals: !643, splitDebugInlining: false, nameTableKind: None)
!546 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote")
!547 = !{!102, !103, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !551, line: 336, size: 608, elements: !552)
!551 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!552 = !{!553, !583, !587, !591, !604, !609, !615, !621, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !550, file: !551, line: 365, baseType: !554, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = !DISubroutineType(types: !556)
!556 = !{!103, !557, !582}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !560, line: 378, size: 192, elements: !561)
!560 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!561 = !{!562, !566, !567, !568, !575, !576}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !559, file: !560, line: 380, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !559, file: !560, line: 382, baseType: !13, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !559, file: !560, line: 384, baseType: !13, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !559, file: !560, line: 386, baseType: !569, size: 32, offset: 96)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !560, line: 351, size: 16, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !570, file: !560, line: 359, baseType: !410, size: 8)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !570, file: !560, line: 364, baseType: !574, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!574 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !559, file: !560, line: 388, baseType: !102, size: 32, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !559, file: !560, line: 396, baseType: !577, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !560, line: 43, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !581)
!581 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !550, file: !551, line: 366, baseType: !584, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !557, !411}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !550, file: !551, line: 374, baseType: !588, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DISubroutineType(types: !590)
!590 = !{!103, !557}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !550, file: !551, line: 377, baseType: !592, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DISubroutineType(types: !594)
!594 = !{!103, !557, !595}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !551, line: 122, size: 64, elements: !598)
!598 = !{!599, !600, !601, !602, !603}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !597, file: !551, line: 123, baseType: !404, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !597, file: !551, line: 124, baseType: !410, size: 8, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !597, file: !551, line: 125, baseType: !410, size: 8, offset: 40)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !597, file: !551, line: 126, baseType: !410, size: 8, offset: 48)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !597, file: !551, line: 127, baseType: !410, size: 8, offset: 56)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !550, file: !551, line: 379, baseType: !605, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DISubroutineType(types: !607)
!607 = !{!103, !557, !608}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !550, file: !551, line: 384, baseType: !610, size: 32, offset: 160)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DISubroutineType(types: !612)
!612 = !{!103, !557, !613, !103}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !550, file: !551, line: 393, baseType: !616, size: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DISubroutineType(types: !618)
!618 = !{!103, !557, !619, !620}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !550, file: !551, line: 402, baseType: !622, size: 32, offset: 224)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !557}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !550, file: !551, line: 405, baseType: !622, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !550, file: !551, line: 408, baseType: !588, size: 32, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !550, file: !551, line: 411, baseType: !622, size: 32, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !550, file: !551, line: 414, baseType: !622, size: 32, offset: 352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !550, file: !551, line: 417, baseType: !588, size: 32, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !550, file: !551, line: 420, baseType: !588, size: 32, offset: 416)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !550, file: !551, line: 423, baseType: !622, size: 32, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !550, file: !551, line: 426, baseType: !622, size: 32, offset: 480)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !550, file: !551, line: 429, baseType: !588, size: 32, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !550, file: !551, line: 432, baseType: !588, size: 32, offset: 544)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !550, file: !551, line: 435, baseType: !636, size: 32, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !557, !639, !102}
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !551, line: 142, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !557, !102}
!643 = !{!543, !644}
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !545, file: !646, line: 38, type: !647, isLocal: true, isDefinition: true)
!646 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !533, line: 51, size: 64, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !649, file: !533, line: 60, baseType: !588, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !649, file: !533, line: 65, baseType: !557, size: 32, offset: 32)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "mcux_igpio_pinmux_0", scope: !655, file: !760, line: 318, type: !837, isLocal: false, isDefinition: true)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !657, retainedTypes: !674, globals: !757, splitDebugInlining: false, nameTableKind: None)
!656 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote")
!657 = !{!658, !664, !669}
!658 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !659, line: 506, baseType: !32, size: 32, elements: !660)
!659 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!660 = !{!661, !662, !663}
!661 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!662 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!663 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!664 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !659, line: 512, baseType: !32, size: 32, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!667 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!668 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!669 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_gpio_pin_action", file: !670, line: 66, baseType: !32, size: 32, elements: !671)
!670 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./gpio_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!671 = !{!672, !673}
!672 = !DIEnumerator(name: "gpioPinClear", value: 0)
!673 = !DIEnumerator(name: "gpioPinSet", value: 1)
!674 = !{!675, !745, !750, !710, !664, !658, !755, !102, !528, !725, !756}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !659, line: 523, size: 288, elements: !678)
!678 = !{!679, !700, !706, !711, !715, !716, !717, !721, !741}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !677, file: !659, line: 524, baseType: !680, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DISubroutineType(types: !682)
!682 = !{!103, !683, !698, !699}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !560, line: 378, size: 192, elements: !686)
!686 = !{!687, !688, !689, !690, !696, !697}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !685, file: !560, line: 380, baseType: !563, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !685, file: !560, line: 382, baseType: !13, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !685, file: !560, line: 384, baseType: !13, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !685, file: !560, line: 386, baseType: !691, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !560, line: 351, size: 16, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !692, file: !560, line: 359, baseType: !410, size: 8)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !692, file: !560, line: 364, baseType: !574, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !685, file: !560, line: 388, baseType: !102, size: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !685, file: !560, line: 396, baseType: !577, size: 32, offset: 160)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !659, line: 237, baseType: !410)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !659, line: 257, baseType: !404)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !677, file: !659, line: 530, baseType: !701, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DISubroutineType(types: !703)
!703 = !{!103, !683, !704}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !659, line: 229, baseType: !404)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !677, file: !659, line: 532, baseType: !707, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DISubroutineType(types: !709)
!709 = !{!103, !683, !710, !705}
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !659, line: 216, baseType: !404)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !677, file: !659, line: 535, baseType: !712, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DISubroutineType(types: !714)
!714 = !{!103, !683, !710}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !677, file: !659, line: 537, baseType: !712, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !677, file: !659, line: 539, baseType: !712, size: 32, offset: 160)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !677, file: !659, line: 541, baseType: !718, size: 32, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DISubroutineType(types: !720)
!720 = !{!103, !683, !698, !658, !664}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !677, file: !659, line: 544, baseType: !722, size: 32, offset: 224)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!723 = !DISubroutineType(types: !724)
!724 = !{!103, !683, !725, !574}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 32)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !659, line: 478, size: 96, elements: !727)
!727 = !{!728, !735, !740}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !726, file: !659, line: 482, baseType: !729, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !730, line: 33, baseType: !731)
!730 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !730, line: 29, size: 32, elements: !732)
!732 = !{!733}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !731, file: !730, line: 30, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !726, file: !659, line: 485, baseType: !736, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !659, line: 464, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !683, !725, !710}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !726, file: !659, line: 493, baseType: !710, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !677, file: !659, line: 547, baseType: !742, size: 32, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DISubroutineType(types: !744)
!744 = !{!404, !683}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !659, line: 428, size: 32, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !747, file: !659, line: 434, baseType: !710, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !659, line: 441, size: 32, elements: !753)
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !752, file: !659, line: 447, baseType: !710, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!757 = !{!653, !758, !764, !766, !776, !788, !790, !821, !823, !835}
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !655, file: !760, line: 318, type: !761, isLocal: false, isDefinition: true, align: 16)
!760 = !DIFile(filename: "zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 400, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 25)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !655, file: !760, line: 318, type: !684, isLocal: false, isDefinition: true, align: 32)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !655, file: !760, line: 318, type: !768, isLocal: true, isDefinition: true, align: 32)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !533, line: 51, size: 64, elements: !770)
!770 = !{!771, !775}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !769, file: !533, line: 60, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DISubroutineType(types: !774)
!774 = !{!103, !683}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !769, file: !533, line: 65, baseType: !683, size: 32, offset: 32)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "imx_gpio_0_data", scope: !655, file: !760, line: 318, type: !778, isLocal: true, isDefinition: true)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_data", file: !760, line: 33, size: 96, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !778, file: !760, line: 35, baseType: !752, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !778, file: !760, line: 37, baseType: !782, size: 64, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !730, line: 40, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !730, line: 35, size: 64, elements: !784)
!784 = !{!785, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !783, file: !730, line: 36, baseType: !786, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !783, file: !730, line: 37, baseType: !786, size: 32, offset: 32)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !655, file: !760, line: 318, type: !692, isLocal: true, isDefinition: true, align: 8)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "imx_gpio_0_config", scope: !655, file: !760, line: 318, type: !792, isLocal: true, isDefinition: true)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_config", file: !760, line: 23, size: 128, elements: !794)
!794 = !{!795, !796, !809, !820}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !793, file: !760, line: 25, baseType: !747, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !793, file: !760, line: 26, baseType: !797, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_Type", file: !399, line: 19729, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 19720, size: 256, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !799, file: !399, line: 19721, baseType: !403, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "GDIR", scope: !799, file: !399, line: 19722, baseType: !403, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "PSR", scope: !799, file: !399, line: 19723, baseType: !477, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ICR1", scope: !799, file: !399, line: 19724, baseType: !403, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ICR2", scope: !799, file: !399, line: 19725, baseType: !403, size: 32, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !799, file: !399, line: 19726, baseType: !403, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !799, file: !399, line: 19727, baseType: !403, size: 32, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "EDGE_SEL", scope: !799, file: !399, line: 19728, baseType: !403, size: 32, offset: 224)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pin_muxes", scope: !793, file: !760, line: 28, baseType: !810, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pinmux", file: !813, line: 51, size: 128, elements: !814)
!813 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/pinctrl_soc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!814 = !{!815, !816, !817, !818, !819}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mux_register", scope: !812, file: !813, line: 52, baseType: !404, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "config_register", scope: !812, file: !813, line: 53, baseType: !404, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "input_register", scope: !812, file: !813, line: 54, baseType: !404, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mux_mode", scope: !812, file: !813, line: 55, baseType: !410, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "input_daisy", scope: !812, file: !813, line: 56, baseType: !404, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mux_count", scope: !793, file: !760, line: 29, baseType: !410, size: 8, offset: 96)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "imx_gpio_driver_api", scope: !655, file: !760, line: 249, type: !676, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_0", scope: !825, file: !760, line: 318, type: !828, isLocal: true, isDefinition: true, align: 32)
!825 = distinct !DISubprogram(name: "imx_gpio_0_init", scope: !760, file: !760, line: 318, type: !773, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !655, retainedNodes: !826)
!826 = !{!827}
!827 = !DILocalVariable(name: "port", arg: 1, scope: !825, file: !760, line: 318, type: !683)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !829)
!829 = !{!830, !832, !833, !834}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !828, file: !10, line: 55, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !828, file: !10, line: 57, baseType: !831, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !828, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !828, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_1", scope: !825, file: !760, line: 318, type: !828, isLocal: true, isDefinition: true, align: 32)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 2048, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 16)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !842, file: !847, line: 7, type: !848, isLocal: false, isDefinition: true, align: 16)
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !844, splitDebugInlining: false, nameTableKind: None)
!843 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote")
!844 = !{!840, !845, !851}
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_190", scope: !842, file: !847, line: 12, type: !848, isLocal: false, isDefinition: true, align: 16)
!847 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote")
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 48, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 3)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_198", scope: !842, file: !847, line: 17, type: !848, isLocal: false, isDefinition: true, align: 16)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "imx_mu_b_config", scope: !855, file: !936, line: 337, type: !972, isLocal: true, isDefinition: true)
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !857, retainedTypes: !869, globals: !933, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/ipm/ipm_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote")
!857 = !{!30, !858}
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mu_status", file: !859, line: 70, baseType: !32, size: 32, elements: !860)
!859 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./mu_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868}
!861 = !DIEnumerator(name: "kStatus_MU_Success", value: 0)
!862 = !DIEnumerator(name: "kStatus_MU_TxNotEmpty", value: 1)
!863 = !DIEnumerator(name: "kStatus_MU_RxNotFull", value: 2)
!864 = !DIEnumerator(name: "kStatus_MU_FlagPending", value: 3)
!865 = !DIEnumerator(name: "kStatus_MU_EventPending", value: 4)
!866 = !DIEnumerator(name: "kStatus_MU_Initialized", value: 5)
!867 = !DIEnumerator(name: "kStatus_MU_IntPending", value: 6)
!868 = !DIEnumerator(name: "kStatus_MU_Failed", value: 7)
!869 = !{!102, !103, !870, !921, !404, !574}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipm_driver_api", file: !873, line: 98, size: 160, elements: !874)
!873 = !DIFile(filename: "zephyr/include/zephyr/drivers/ipm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!874 = !{!875, !895, !906, !911, !916}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !872, file: !873, line: 99, baseType: !876, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_send_t", file: !873, line: 54, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DISubroutineType(types: !879)
!879 = !{!103, !880, !103, !404, !13, !103}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !560, line: 378, size: 192, elements: !883)
!883 = !{!884, !885, !886, !887, !893, !894}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !882, file: !560, line: 380, baseType: !563, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !882, file: !560, line: 382, baseType: !13, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !882, file: !560, line: 384, baseType: !13, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !882, file: !560, line: 386, baseType: !888, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !560, line: 351, size: 16, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !889, file: !560, line: 359, baseType: !410, size: 8)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !889, file: !560, line: 364, baseType: !574, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !882, file: !560, line: 388, baseType: !102, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !882, file: !560, line: 396, baseType: !577, size: 32, offset: 160)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "register_callback", scope: !872, file: !873, line: 100, baseType: !896, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_register_callback_t", file: !873, line: 78, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DISubroutineType(types: !899)
!899 = !{null, !880, !900, !102}
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_callback_t", file: !873, line: 45, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !880, !102, !404, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "max_data_size_get", scope: !872, file: !873, line: 101, baseType: !907, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_data_size_get_t", file: !873, line: 62, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DISubroutineType(types: !910)
!910 = !{!103, !880}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "max_id_val_get", scope: !872, file: !873, line: 102, baseType: !912, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_id_val_get_t", file: !873, line: 70, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DISubroutineType(types: !915)
!915 = !{!404, !880}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "set_enabled", scope: !872, file: !873, line: 103, baseType: !917, size: 32, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_set_enabled_t", file: !873, line: 88, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DISubroutineType(types: !920)
!920 = !{!103, !880, !103}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "MU_Type", file: !399, line: 30872, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 30867, size: 320, elements: !924)
!924 = !{!925, !929, !931, !932}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "TR", scope: !923, file: !399, line: 30868, baseType: !926, size: 128)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 128, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 4)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !923, file: !399, line: 30869, baseType: !930, size: 128, offset: 128)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 128, elements: !927)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !923, file: !399, line: 30870, baseType: !403, size: 32, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !923, file: !399, line: 30871, baseType: !403, size: 32, offset: 288)
!933 = !{!934, !940, !942, !949, !955, !853, !957, !970}
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_190", scope: !855, file: !936, line: 344, type: !937, isLocal: false, isDefinition: true, align: 16)
!936 = !DIFile(filename: "zephyr/drivers/ipm/ipm_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 80, elements: !938)
!938 = !{!939}
!939 = !DISubrange(count: 5)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "__device_dts_ord_190", scope: !855, file: !936, line: 344, type: !881, isLocal: false, isDefinition: true, align: 32)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_190", scope: !855, file: !936, line: 344, type: !944, isLocal: true, isDefinition: true, align: 32)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !533, line: 51, size: 64, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !945, file: !533, line: 60, baseType: !908, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !945, file: !533, line: 65, baseType: !880, size: 32, offset: 32)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "imx_mu_b_data", scope: !855, file: !936, line: 342, type: !951, isLocal: true, isDefinition: true)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_mu_data", file: !936, line: 34, size: 64, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !951, file: !936, line: 35, baseType: !900, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !951, file: !936, line: 36, baseType: !102, size: 32, offset: 32)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_190", scope: !855, file: !936, line: 344, type: !889, isLocal: true, isDefinition: true, align: 8)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "__isr_imx_mu_isr_irq_0", scope: !959, file: !936, line: 353, type: !964, isLocal: true, isDefinition: true, align: 32)
!959 = distinct !DISubprogram(name: "imx_mu_config_func_b", scope: !936, file: !936, line: 351, type: !960, scopeLine: 352, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !855, retainedNodes: !962)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !880}
!962 = !{!963}
!963 = !DILocalVariable(name: "dev", arg: 1, scope: !959, file: !936, line: 351, type: !880)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !965)
!965 = !{!966, !967, !968, !969}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !964, file: !10, line: 55, baseType: !831, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !964, file: !10, line: 57, baseType: !831, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !964, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !964, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "imx_mu_driver_api", scope: !855, file: !936, line: 325, type: !871, isLocal: true, isDefinition: true)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_mu_config", file: !936, line: 29, size: 64, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !973, file: !936, line: 30, baseType: !921, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "irq_config_func", scope: !973, file: !936, line: 31, baseType: !977, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "imx_uart_0_config", scope: !980, file: !1177, line: 339, type: !1175, isLocal: true, isDefinition: true)
!980 = distinct !DICompileUnit(language: DW_LANG_C99, file: !981, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !982, retainedTypes: !1068, globals: !1213, splitDebugInlining: false, nameTableKind: None)
!981 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/drivers/ipm/ipm_mcux/remote")
!982 = !{!30, !983, !1021, !1049, !1053, !1057, !1062}
!983 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_status_flag", file: !984, line: 122, baseType: !32, size: 32, elements: !985)
!984 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./uart_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!985 = !{!986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020}
!986 = !DIEnumerator(name: "uartStatusRxCharReady", value: 15)
!987 = !DIEnumerator(name: "uartStatusRxError", value: 14)
!988 = !DIEnumerator(name: "uartStatusRxOverrunError", value: 13)
!989 = !DIEnumerator(name: "uartStatusRxFrameError", value: 12)
!990 = !DIEnumerator(name: "uartStatusRxBreakDetect", value: 11)
!991 = !DIEnumerator(name: "uartStatusRxParityError", value: 10)
!992 = !DIEnumerator(name: "uartStatusParityError", value: 9699343)
!993 = !DIEnumerator(name: "uartStatusRtsStatus", value: 9699342)
!994 = !DIEnumerator(name: "uartStatusTxReady", value: 9699341)
!995 = !DIEnumerator(name: "uartStatusRtsDelta", value: 9699340)
!996 = !DIEnumerator(name: "uartStatusEscape", value: 9699339)
!997 = !DIEnumerator(name: "uartStatusFrameError", value: 9699338)
!998 = !DIEnumerator(name: "uartStatusRxReady", value: 9699337)
!999 = !DIEnumerator(name: "uartStatusAgingTimer", value: 9699336)
!1000 = !DIEnumerator(name: "uartStatusDtrDelta", value: 9699335)
!1001 = !DIEnumerator(name: "uartStatusRxDs", value: 9699334)
!1002 = !DIEnumerator(name: "uartStatustAirWake", value: 9699333)
!1003 = !DIEnumerator(name: "uartStatusAwake", value: 9699332)
!1004 = !DIEnumerator(name: "uartStatusRs485SlaveAddrMatch", value: 9699331)
!1005 = !DIEnumerator(name: "uartStatusAutoBaud", value: 9961487)
!1006 = !DIEnumerator(name: "uartStatusTxEmpty", value: 9961486)
!1007 = !DIEnumerator(name: "uartStatusDtr", value: 9961485)
!1008 = !DIEnumerator(name: "uartStatusIdle", value: 9961484)
!1009 = !DIEnumerator(name: "uartStatusAutoBaudCntStop", value: 9961483)
!1010 = !DIEnumerator(name: "uartStatusRiDelta", value: 9961482)
!1011 = !DIEnumerator(name: "uartStatusRi", value: 9961481)
!1012 = !DIEnumerator(name: "uartStatusIr", value: 9961480)
!1013 = !DIEnumerator(name: "uartStatusWake", value: 9961479)
!1014 = !DIEnumerator(name: "uartStatusDcdDelta", value: 9961478)
!1015 = !DIEnumerator(name: "uartStatusDcd", value: 9961477)
!1016 = !DIEnumerator(name: "uartStatusRts", value: 9961476)
!1017 = !DIEnumerator(name: "uartStatusTxComplete", value: 9961475)
!1018 = !DIEnumerator(name: "uartStatusBreakDetect", value: 9961474)
!1019 = !DIEnumerator(name: "uartStatusRxOverrun", value: 9961473)
!1020 = !DIEnumerator(name: "uartStatusRxDataReady", value: 9961472)
!1021 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_interrupt", file: !984, line: 91, baseType: !32, size: 32, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048}
!1023 = !DIEnumerator(name: "uartIntAutoBaud", value: 8388623)
!1024 = !DIEnumerator(name: "uartIntTxReady", value: 8388621)
!1025 = !DIEnumerator(name: "uartIntIdle", value: 8388620)
!1026 = !DIEnumerator(name: "uartIntRxReady", value: 8388617)
!1027 = !DIEnumerator(name: "uartIntTxEmpty", value: 8388614)
!1028 = !DIEnumerator(name: "uartIntRtsDelta", value: 8388613)
!1029 = !DIEnumerator(name: "uartIntEscape", value: 8650767)
!1030 = !DIEnumerator(name: "uartIntRts", value: 8650756)
!1031 = !DIEnumerator(name: "uartIntAgingTimer", value: 8650755)
!1032 = !DIEnumerator(name: "uartIntDtr", value: 8912909)
!1033 = !DIEnumerator(name: "uartIntParityError", value: 8912908)
!1034 = !DIEnumerator(name: "uartIntFrameError", value: 8912907)
!1035 = !DIEnumerator(name: "uartIntDcd", value: 8912905)
!1036 = !DIEnumerator(name: "uartIntRi", value: 8912904)
!1037 = !DIEnumerator(name: "uartIntRxDs", value: 8912902)
!1038 = !DIEnumerator(name: "uartInttAirWake", value: 8912901)
!1039 = !DIEnumerator(name: "uartIntAwake", value: 8912900)
!1040 = !DIEnumerator(name: "uartIntDtrDelta", value: 8912899)
!1041 = !DIEnumerator(name: "uartIntAutoBaudCnt", value: 8912896)
!1042 = !DIEnumerator(name: "uartIntIr", value: 9175048)
!1043 = !DIEnumerator(name: "uartIntWake", value: 9175047)
!1044 = !DIEnumerator(name: "uartIntTxComplete", value: 9175043)
!1045 = !DIEnumerator(name: "uartIntBreakDetect", value: 9175042)
!1046 = !DIEnumerator(name: "uartIntRxOverrun", value: 9175041)
!1047 = !DIEnumerator(name: "uartIntRxDataReady", value: 9175040)
!1048 = !DIEnumerator(name: "uartIntRs485SlaveAddrMatch", value: 12058627)
!1049 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_word_length", file: !984, line: 60, baseType: !32, size: 32, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIEnumerator(name: "uartWordLength7Bits", value: 0)
!1052 = !DIEnumerator(name: "uartWordLength8Bits", value: 32)
!1053 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_stop_bit_num", file: !984, line: 67, baseType: !32, size: 32, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIEnumerator(name: "uartStopBitNumOne", value: 0)
!1056 = !DIEnumerator(name: "uartStopBitNumTwo", value: 64)
!1057 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_partity_mode", file: !984, line: 74, baseType: !32, size: 32, elements: !1058)
!1058 = !{!1059, !1060, !1061}
!1059 = !DIEnumerator(name: "uartParityDisable", value: 0)
!1060 = !DIEnumerator(name: "uartParityEven", value: 256)
!1061 = !DIEnumerator(name: "uartParityOdd", value: 384)
!1062 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_direction_mode", file: !984, line: 82, baseType: !32, size: 32, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067}
!1064 = !DIEnumerator(name: "uartDirectionDisable", value: 0)
!1065 = !DIEnumerator(name: "uartDirectionTx", value: 4)
!1066 = !DIEnumerator(name: "uartDirectionRx", value: 2)
!1067 = !DIEnumerator(name: "uartDirectionTxRx", value: 6)
!1068 = !{!102, !103, !1069, !1148, !1174, !1212, !404, !574, !410}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !551, line: 336, size: 608, elements: !1072)
!1072 = !{!1073, !1092, !1096, !1100, !1113, !1118, !1122, !1126, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !1071, file: !551, line: 365, baseType: !1074, size: 32)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 32)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!103, !1077, !582}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !560, line: 378, size: 192, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1084, !1090, !1091}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1079, file: !560, line: 380, baseType: !563, size: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1079, file: !560, line: 382, baseType: !13, size: 32, offset: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1079, file: !560, line: 384, baseType: !13, size: 32, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1079, file: !560, line: 386, baseType: !1085, size: 32, offset: 96)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 32)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !560, line: 351, size: 16, elements: !1087)
!1087 = !{!1088, !1089}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1086, file: !560, line: 359, baseType: !410, size: 8)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1086, file: !560, line: 364, baseType: !574, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1079, file: !560, line: 388, baseType: !102, size: 32, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1079, file: !560, line: 396, baseType: !577, size: 32, offset: 160)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !1071, file: !551, line: 366, baseType: !1093, size: 32, offset: 32)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 32)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{null, !1077, !411}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !1071, file: !551, line: 374, baseType: !1097, size: 32, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 32)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!103, !1077}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1071, file: !551, line: 377, baseType: !1101, size: 32, offset: 96)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 32)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!103, !1077, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 32)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !551, line: 122, size: 64, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1106, file: !551, line: 123, baseType: !404, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1106, file: !551, line: 124, baseType: !410, size: 8, offset: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1106, file: !551, line: 125, baseType: !410, size: 8, offset: 40)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !1106, file: !551, line: 126, baseType: !410, size: 8, offset: 48)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !1106, file: !551, line: 127, baseType: !410, size: 8, offset: 56)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !1071, file: !551, line: 379, baseType: !1114, size: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 32)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!103, !1077, !1117}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !1071, file: !551, line: 384, baseType: !1119, size: 32, offset: 160)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 32)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!103, !1077, !613, !103}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !1071, file: !551, line: 393, baseType: !1123, size: 32, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 32)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!103, !1077, !619, !620}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !1071, file: !551, line: 402, baseType: !1127, size: 32, offset: 224)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 32)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{null, !1077}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !1071, file: !551, line: 405, baseType: !1127, size: 32, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !1071, file: !551, line: 408, baseType: !1097, size: 32, offset: 288)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !1071, file: !551, line: 411, baseType: !1127, size: 32, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !1071, file: !551, line: 414, baseType: !1127, size: 32, offset: 352)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !1071, file: !551, line: 417, baseType: !1097, size: 32, offset: 384)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !1071, file: !551, line: 420, baseType: !1097, size: 32, offset: 416)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !1071, file: !551, line: 423, baseType: !1127, size: 32, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !1071, file: !551, line: 426, baseType: !1127, size: 32, offset: 480)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !1071, file: !551, line: 429, baseType: !1097, size: 32, offset: 512)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !1071, file: !551, line: 432, baseType: !1097, size: 32, offset: 544)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !1071, file: !551, line: 435, baseType: !1141, size: 32, offset: 576)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 32)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{null, !1077, !1144, !102}
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !551, line: 142, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 32)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null, !1077, !102}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 32)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_Type", file: !399, line: 41342, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 41322, size: 1504, elements: !1151)
!1151 = !{!1152, !1153, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "URXD", scope: !1150, file: !399, line: 41323, baseType: !477, size: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !1150, file: !399, line: 41324, baseType: !1154, size: 480, offset: 32)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 480, elements: !1155)
!1155 = !{!1156}
!1156 = !DISubrange(count: 60)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "UTXD", scope: !1150, file: !399, line: 41325, baseType: !403, size: 32, offset: 512)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !1150, file: !399, line: 41326, baseType: !1154, size: 480, offset: 544)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "UCR1", scope: !1150, file: !399, line: 41327, baseType: !403, size: 32, offset: 1024)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "UCR2", scope: !1150, file: !399, line: 41328, baseType: !403, size: 32, offset: 1056)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "UCR3", scope: !1150, file: !399, line: 41329, baseType: !403, size: 32, offset: 1088)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "UCR4", scope: !1150, file: !399, line: 41330, baseType: !403, size: 32, offset: 1120)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "UFCR", scope: !1150, file: !399, line: 41331, baseType: !403, size: 32, offset: 1152)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "USR1", scope: !1150, file: !399, line: 41332, baseType: !403, size: 32, offset: 1184)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "USR2", scope: !1150, file: !399, line: 41333, baseType: !403, size: 32, offset: 1216)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "UESC", scope: !1150, file: !399, line: 41334, baseType: !403, size: 32, offset: 1248)
