; ModuleID = 'build/adafruit_trinket_m0/basic/fade_led/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.1, i8*, i32 }
%union.anon.1 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.18 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.1 }
%struct.mpsc_pbuf_buffer_config.19 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.18*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/fade_led/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/fade_led")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/fade_led")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !27, file: !107, line: 18, type: !109, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !37, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/fade_led")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !{!22, !38, !24, !39, !41, !43, !47, !49, !50, !51, !53, !55, !56, !57, !60, !62, !74, !58, !75, !85, !44}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 214, baseType: !32)
!48 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!54 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !61)
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !64, line: 78, size: 32, elements: !65)
!64 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!65 = !{!66, !73}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !63, file: !64, line: 80, baseType: !67, size: 32)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !64, line: 45, size: 32, elements: !68)
!68 = !{!69, !70, !71, !72}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !67, file: !64, line: 47, baseType: !58, size: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !67, file: !64, line: 50, baseType: !58, size: 8, offset: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !67, file: !64, line: 53, baseType: !58, size: 8, offset: 16)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !67, file: !64, line: 56, baseType: !58, size: 8, offset: 24)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !63, file: !64, line: 82, baseType: !38, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !77)
!77 = !{!78, !96, !100}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !76, file: !31, line: 89, baseType: !79, size: 96)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !80)
!80 = !{!81, !93, !94}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !79, file: !31, line: 67, baseType: !82, size: 32)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !83)
!83 = !{!84, !86, !87, !88, !89, !90, !91, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !82, file: !31, line: 52, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !82, file: !31, line: 52, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !31, line: 52, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !82, file: !31, line: 53, baseType: !85, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !82, file: !31, line: 54, baseType: !85, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !82, file: !31, line: 55, baseType: !85, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !82, file: !31, line: 56, baseType: !85, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !82, file: !31, line: 57, baseType: !85, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !79, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !79, file: !31, line: 76, baseType: !95, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !85)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !76, file: !31, line: 93, baseType: !97, size: 32, offset: 96)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 4)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !31, line: 94, baseType: !101, offset: 128)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: -1)
!104 = !{!25, !105}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !107, line: 18, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !111, line: 16, size: 64, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !111, line: 17, baseType: !44, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !110, file: !111, line: 18, baseType: !58, size: 8, offset: 32)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "_char_out", scope: !117, file: !192, line: 54, type: !193, isLocal: false, isDefinition: true)
!117 = distinct !DICompileUnit(language: DW_LANG_C99, file: !118, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !119, retainedTypes: !190, globals: !191, splitDebugInlining: false, nameTableKind: None)
!118 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/fade_led")
!119 = !{!120}
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !121, line: 27, baseType: !32, size: 32, elements: !122)
!121 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189}
!123 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!124 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!125 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!126 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!127 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!128 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!129 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!130 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!131 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!132 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!133 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!134 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!135 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!136 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!137 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!138 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!139 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!140 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!141 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!142 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!143 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!144 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!145 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!146 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!147 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!148 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!149 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!150 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!151 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!152 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!153 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!154 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!155 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!156 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!157 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!158 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!159 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!160 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!161 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!162 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!163 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!164 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!165 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!166 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!167 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!168 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!169 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!170 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!171 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!172 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!173 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!174 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!175 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!176 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!177 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!178 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!179 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!180 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!181 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!182 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!183 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!184 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!185 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!186 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!187 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!188 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!189 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!190 = !{!38, !49}
!191 = !{!115}
!192 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!49, !49}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !198, file: !932, line: 202, type: !933, isLocal: true, isDefinition: true, align: 32)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !119, retainedTypes: !200, globals: !931, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/fade_led")
!200 = !{!38, !49, !201, !325, !662, !663, !730}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !203, line: 335, baseType: !204)
!203 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 320, size: 288, elements: !205)
!205 = !{!206, !217, !225, !239, !250, !261, !265, !276, !277, !288, !289, !304, !305, !315}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !204, file: !203, line: 321, baseType: !207, size: 16)
!207 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !203, line: 50, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 43, size: 16, elements: !210)
!210 = !{!211, !216}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !209, file: !203, line: 48, baseType: !212, size: 16)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !209, file: !203, line: 44, size: 16, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !212, file: !203, line: 45, baseType: !60, size: 7, flags: DIFlagBitField, extraData: i64 0)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !212, file: !203, line: 47, baseType: !60, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !209, file: !203, line: 49, baseType: !60, size: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !204, file: !203, line: 322, baseType: !218, size: 16, offset: 16)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 16, elements: !223)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !220, line: 52, baseType: !221)
!220 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21e18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!223 = !{!224}
!224 = !DISubrange(count: 2)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !204, file: !203, line: 323, baseType: !226, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !203, line: 107, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 94, size: 32, elements: !229)
!229 = !{!230, !238}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !228, file: !203, line: 105, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !228, file: !203, line: 95, size: 32, elements: !232)
!232 = !{!233, !234, !235, !236, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !231, file: !203, line: 97, baseType: !85, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !231, file: !203, line: 99, baseType: !85, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !231, file: !203, line: 100, baseType: !85, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !231, file: !203, line: 102, baseType: !85, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !231, file: !203, line: 103, baseType: !85, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !228, file: !203, line: 106, baseType: !85, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !204, file: !203, line: 324, baseType: !240, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !203, line: 155, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 148, size: 32, elements: !243)
!243 = !{!244, !249}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !242, file: !203, line: 153, baseType: !245, size: 32)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !203, line: 149, size: 32, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !245, file: !203, line: 150, baseType: !85, size: 16, flags: DIFlagBitField, extraData: i64 0)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !245, file: !203, line: 151, baseType: !85, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !242, file: !203, line: 154, baseType: !85, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !204, file: !203, line: 325, baseType: !251, size: 8, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !203, line: 194, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 187, size: 8, elements: !254)
!254 = !{!255, !260}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !253, file: !203, line: 192, baseType: !256, size: 8)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !253, file: !203, line: 188, size: 8, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !256, file: !203, line: 189, baseType: !58, size: 1, flags: DIFlagBitField, extraData: i64 0)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !256, file: !203, line: 190, baseType: !58, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !253, file: !203, line: 193, baseType: !58, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !204, file: !203, line: 326, baseType: !262, size: 24, offset: 104)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 24, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 3)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !204, file: !203, line: 327, baseType: !266, size: 8, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !203, line: 215, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 208, size: 8, elements: !269)
!269 = !{!270, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !268, file: !203, line: 213, baseType: !271, size: 8)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !203, line: 209, size: 8, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !271, file: !203, line: 210, baseType: !58, size: 1, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !271, file: !203, line: 211, baseType: !58, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !268, file: !203, line: 214, baseType: !58, size: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !204, file: !203, line: 328, baseType: !262, size: 24, offset: 136)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !204, file: !203, line: 329, baseType: !278, size: 8, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !203, line: 236, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 229, size: 8, elements: !281)
!281 = !{!282, !287}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !280, file: !203, line: 234, baseType: !283, size: 8)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !280, file: !203, line: 230, size: 8, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !283, file: !203, line: 231, baseType: !221, size: 1, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !283, file: !203, line: 232, baseType: !221, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !280, file: !203, line: 235, baseType: !58, size: 8)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !204, file: !203, line: 330, baseType: !262, size: 24, offset: 168)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !204, file: !203, line: 331, baseType: !290, size: 16, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !203, line: 262, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 250, size: 16, elements: !293)
!293 = !{!294, !303}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !292, file: !203, line: 260, baseType: !295, size: 16)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !203, line: 251, size: 16, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !295, file: !203, line: 252, baseType: !60, size: 1, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !295, file: !203, line: 253, baseType: !60, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !295, file: !203, line: 254, baseType: !60, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !295, file: !203, line: 255, baseType: !60, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !295, file: !203, line: 256, baseType: !60, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !295, file: !203, line: 258, baseType: !60, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !292, file: !203, line: 261, baseType: !60, size: 16)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !204, file: !203, line: 332, baseType: !218, size: 16, offset: 208)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !204, file: !203, line: 333, baseType: !306, size: 32, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !203, line: 290, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 284, size: 32, elements: !309)
!309 = !{!310, !314}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !308, file: !203, line: 288, baseType: !311, size: 32)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !308, file: !203, line: 285, size: 32, elements: !312)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !311, file: !203, line: 286, baseType: !85, size: 22, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !308, file: !203, line: 289, baseType: !85, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !204, file: !203, line: 334, baseType: !316, size: 16, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !203, line: 308, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 303, size: 16, elements: !319)
!319 = !{!320, !324}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !318, file: !203, line: 306, baseType: !321, size: 16)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !203, line: 304, size: 16, elements: !322)
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !321, file: !203, line: 305, baseType: !60, size: 16, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !318, file: !203, line: 307, baseType: !60, size: 16)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !327, line: 928, baseType: !328)
!327 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 899, size: 672, elements: !329)
!329 = !{!330, !354, !378, !404, !429, !445, !446, !464, !465, !482, !493, !494, !509, !529, !530, !542, !554, !564, !565, !582, !584, !595, !596, !608, !620, !621, !632, !648}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !328, file: !327, line: 900, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !327, line: 64, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 43, size: 32, elements: !334)
!334 = !{!335, !353}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !333, file: !327, line: 62, baseType: !336, size: 32)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !327, line: 44, size: 32, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !336, file: !327, line: 45, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !336, file: !327, line: 46, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !336, file: !327, line: 47, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !336, file: !327, line: 48, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !336, file: !327, line: 49, baseType: !85, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !336, file: !327, line: 50, baseType: !85, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !336, file: !327, line: 51, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !336, file: !327, line: 52, baseType: !85, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !336, file: !327, line: 53, baseType: !85, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !336, file: !327, line: 54, baseType: !85, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !336, file: !327, line: 55, baseType: !85, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !336, file: !327, line: 56, baseType: !85, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !336, file: !327, line: 58, baseType: !85, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !336, file: !327, line: 59, baseType: !85, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !336, file: !327, line: 60, baseType: !85, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !333, file: !327, line: 63, baseType: !85, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !328, file: !327, line: 901, baseType: !355, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !327, line: 125, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 104, size: 32, elements: !358)
!358 = !{!359, !377}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !357, file: !327, line: 123, baseType: !360, size: 32)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !357, file: !327, line: 105, size: 32, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !360, file: !327, line: 106, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !360, file: !327, line: 107, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !360, file: !327, line: 108, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !360, file: !327, line: 109, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !360, file: !327, line: 110, baseType: !85, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !360, file: !327, line: 111, baseType: !85, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !360, file: !327, line: 112, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !360, file: !327, line: 113, baseType: !85, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !360, file: !327, line: 114, baseType: !85, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !360, file: !327, line: 115, baseType: !85, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !360, file: !327, line: 116, baseType: !85, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !360, file: !327, line: 117, baseType: !85, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !360, file: !327, line: 119, baseType: !85, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !360, file: !327, line: 120, baseType: !85, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !360, file: !327, line: 121, baseType: !85, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !357, file: !327, line: 124, baseType: !85, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !328, file: !327, line: 902, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !327, line: 186, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 165, size: 32, elements: !382)
!382 = !{!383, !403}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !381, file: !327, line: 184, baseType: !384, size: 32)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !381, file: !327, line: 166, size: 32, elements: !385)
!385 = !{!386, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !384, file: !327, line: 167, baseType: !387, size: 1, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !85)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !384, file: !327, line: 168, baseType: !387, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !384, file: !327, line: 169, baseType: !387, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !384, file: !327, line: 170, baseType: !387, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !384, file: !327, line: 171, baseType: !387, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !384, file: !327, line: 172, baseType: !387, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !384, file: !327, line: 173, baseType: !387, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !384, file: !327, line: 174, baseType: !387, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !384, file: !327, line: 175, baseType: !387, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !384, file: !327, line: 176, baseType: !387, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !384, file: !327, line: 177, baseType: !387, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !384, file: !327, line: 178, baseType: !387, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !384, file: !327, line: 180, baseType: !387, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !384, file: !327, line: 181, baseType: !387, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !384, file: !327, line: 182, baseType: !387, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !381, file: !327, line: 185, baseType: !85, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !328, file: !327, line: 903, baseType: !405, size: 32, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !327, line: 247, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 226, size: 32, elements: !409)
!409 = !{!410, !428}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !408, file: !327, line: 245, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !327, line: 227, size: 32, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !411, file: !327, line: 228, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !411, file: !327, line: 229, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !411, file: !327, line: 230, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !411, file: !327, line: 231, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !411, file: !327, line: 232, baseType: !85, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !411, file: !327, line: 233, baseType: !85, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !411, file: !327, line: 234, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !411, file: !327, line: 235, baseType: !85, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !411, file: !327, line: 236, baseType: !85, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !411, file: !327, line: 237, baseType: !85, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !411, file: !327, line: 238, baseType: !85, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !411, file: !327, line: 239, baseType: !85, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !411, file: !327, line: 241, baseType: !85, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !411, file: !327, line: 242, baseType: !85, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !411, file: !327, line: 243, baseType: !85, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !408, file: !327, line: 246, baseType: !85, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !328, file: !327, line: 904, baseType: !430, size: 16, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !327, line: 300, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 287, size: 16, elements: !433)
!433 = !{!434, !444}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !432, file: !327, line: 298, baseType: !435, size: 16)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !327, line: 288, size: 16, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !435, file: !327, line: 290, baseType: !60, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !435, file: !327, line: 291, baseType: !60, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !435, file: !327, line: 293, baseType: !60, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !435, file: !327, line: 294, baseType: !60, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !435, file: !327, line: 295, baseType: !60, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !435, file: !327, line: 296, baseType: !60, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !435, file: !327, line: 297, baseType: !60, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !432, file: !327, line: 299, baseType: !60, size: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !328, file: !327, line: 905, baseType: !218, size: 16, offset: 144)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !328, file: !327, line: 906, baseType: !447, size: 16, offset: 160)
!447 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !327, line: 352, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 336, size: 16, elements: !450)
!450 = !{!451, !463}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !449, file: !327, line: 350, baseType: !452, size: 16)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !327, line: 337, size: 16, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !452, file: !327, line: 339, baseType: !60, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !452, file: !327, line: 340, baseType: !60, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !452, file: !327, line: 341, baseType: !60, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !452, file: !327, line: 342, baseType: !60, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !452, file: !327, line: 343, baseType: !60, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !452, file: !327, line: 344, baseType: !60, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !452, file: !327, line: 345, baseType: !60, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !452, file: !327, line: 346, baseType: !60, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !452, file: !327, line: 348, baseType: !60, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !449, file: !327, line: 351, baseType: !60, size: 16)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !328, file: !327, line: 907, baseType: !218, size: 16, offset: 176)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !328, file: !327, line: 908, baseType: !466, size: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !327, line: 398, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 381, size: 32, elements: !469)
!469 = !{!470, !481}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !468, file: !327, line: 396, baseType: !471, size: 32)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !327, line: 382, size: 32, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !471, file: !327, line: 384, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !471, file: !327, line: 385, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !471, file: !327, line: 386, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !471, file: !327, line: 388, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !471, file: !327, line: 389, baseType: !85, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !471, file: !327, line: 390, baseType: !85, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !471, file: !327, line: 392, baseType: !85, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !471, file: !327, line: 394, baseType: !85, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !468, file: !327, line: 397, baseType: !85, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !328, file: !327, line: 909, baseType: !483, size: 8, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !327, line: 433, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 426, size: 8, elements: !486)
!486 = !{!487, !492}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !485, file: !327, line: 431, baseType: !488, size: 8)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !485, file: !327, line: 427, size: 8, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !488, file: !327, line: 428, baseType: !58, size: 5, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !488, file: !327, line: 430, baseType: !58, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !485, file: !327, line: 432, baseType: !58, size: 8)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !328, file: !327, line: 910, baseType: !262, size: 24, offset: 232)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !328, file: !327, line: 911, baseType: !495, size: 32, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !327, line: 462, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 448, size: 32, elements: !498)
!498 = !{!499, !508}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !497, file: !327, line: 460, baseType: !500, size: 32)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !497, file: !327, line: 449, size: 32, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !500, file: !327, line: 451, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !500, file: !327, line: 453, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !500, file: !327, line: 454, baseType: !85, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !500, file: !327, line: 455, baseType: !85, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !500, file: !327, line: 457, baseType: !85, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !500, file: !327, line: 459, baseType: !85, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !497, file: !327, line: 461, baseType: !85, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !328, file: !327, line: 912, baseType: !510, size: 16, offset: 288)
!510 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !327, line: 520, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 503, size: 16, elements: !513)
!513 = !{!514, !528}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !512, file: !327, line: 518, baseType: !515, size: 16)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !512, file: !327, line: 504, size: 16, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !515, file: !327, line: 506, baseType: !60, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !515, file: !327, line: 507, baseType: !60, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !515, file: !327, line: 508, baseType: !60, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !515, file: !327, line: 509, baseType: !60, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !515, file: !327, line: 510, baseType: !60, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !515, file: !327, line: 511, baseType: !60, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !515, file: !327, line: 512, baseType: !60, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !515, file: !327, line: 513, baseType: !60, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !515, file: !327, line: 514, baseType: !60, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !515, file: !327, line: 515, baseType: !60, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !515, file: !327, line: 516, baseType: !60, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !512, file: !327, line: 519, baseType: !60, size: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !328, file: !327, line: 913, baseType: !218, size: 16, offset: 304)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !328, file: !327, line: 914, baseType: !531, size: 32, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !327, line: 559, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 552, size: 32, elements: !534)
!534 = !{!535, !541}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !533, file: !327, line: 557, baseType: !536, size: 32)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !533, file: !327, line: 553, size: 32, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !536, file: !327, line: 554, baseType: !85, size: 10, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !536, file: !327, line: 555, baseType: !85, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !536, file: !327, line: 556, baseType: !85, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !533, file: !327, line: 558, baseType: !85, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !328, file: !327, line: 915, baseType: !543, size: 32, offset: 352)
!543 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !327, line: 585, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 578, size: 32, elements: !546)
!546 = !{!547, !553}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !545, file: !327, line: 583, baseType: !548, size: 32)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !545, file: !327, line: 579, size: 32, elements: !549)
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !548, file: !327, line: 580, baseType: !85, size: 16, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !548, file: !327, line: 581, baseType: !85, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !548, file: !327, line: 582, baseType: !85, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !545, file: !327, line: 584, baseType: !85, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !328, file: !327, line: 916, baseType: !555, size: 8, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !327, line: 610, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 604, size: 8, elements: !558)
!558 = !{!559, !563}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !557, file: !327, line: 608, baseType: !560, size: 8)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !557, file: !327, line: 605, size: 8, elements: !561)
!561 = !{!562}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !560, file: !327, line: 607, baseType: !58, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !557, file: !327, line: 609, baseType: !58, size: 8)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !328, file: !327, line: 917, baseType: !262, size: 24, offset: 392)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !328, file: !327, line: 918, baseType: !566, size: 32, offset: 416)
!566 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !327, line: 639, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 622, size: 32, elements: !569)
!569 = !{!570, !581}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !568, file: !327, line: 637, baseType: !571, size: 32)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !568, file: !327, line: 623, size: 32, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !571, file: !327, line: 625, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !571, file: !327, line: 626, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !571, file: !327, line: 627, baseType: !85, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !571, file: !327, line: 629, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !571, file: !327, line: 631, baseType: !85, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !571, file: !327, line: 632, baseType: !85, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !571, file: !327, line: 634, baseType: !85, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !571, file: !327, line: 635, baseType: !85, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !568, file: !327, line: 638, baseType: !85, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !328, file: !327, line: 919, baseType: !583, size: 32, offset: 448)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 32, elements: !98)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !328, file: !327, line: 920, baseType: !585, size: 16, offset: 480)
!585 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !327, line: 715, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 706, size: 16, elements: !588)
!588 = !{!589, !594}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !587, file: !327, line: 713, baseType: !590, size: 16)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !587, file: !327, line: 707, size: 16, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !590, file: !327, line: 709, baseType: !60, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !590, file: !327, line: 711, baseType: !60, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !587, file: !327, line: 714, baseType: !60, size: 16)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !328, file: !327, line: 921, baseType: !218, size: 16, offset: 496)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !328, file: !327, line: 922, baseType: !597, size: 32, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !327, line: 739, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 729, size: 32, elements: !600)
!600 = !{!601, !607}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !599, file: !327, line: 737, baseType: !602, size: 32)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !599, file: !327, line: 730, size: 32, elements: !603)
!603 = !{!604, !605, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !602, file: !327, line: 732, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !602, file: !327, line: 733, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !602, file: !327, line: 735, baseType: !85, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !599, file: !327, line: 738, baseType: !85, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !328, file: !327, line: 923, baseType: !609, size: 8, offset: 544)
!609 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !327, line: 765, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 756, size: 8, elements: !612)
!612 = !{!613, !619}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !611, file: !327, line: 763, baseType: !614, size: 8)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !611, file: !327, line: 757, size: 8, elements: !615)
!615 = !{!616, !617, !618}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !614, file: !327, line: 759, baseType: !58, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !614, file: !327, line: 761, baseType: !58, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !614, file: !327, line: 762, baseType: !58, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !611, file: !327, line: 764, baseType: !58, size: 8)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !328, file: !327, line: 924, baseType: !262, size: 24, offset: 552)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !328, file: !327, line: 925, baseType: !622, size: 32, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !327, line: 789, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 781, size: 32, elements: !625)
!625 = !{!626, !631}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !624, file: !327, line: 787, baseType: !627, size: 32)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !624, file: !327, line: 782, size: 32, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !627, file: !327, line: 783, baseType: !85, size: 12, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !627, file: !327, line: 785, baseType: !85, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !624, file: !327, line: 788, baseType: !85, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !328, file: !327, line: 926, baseType: !633, size: 32, offset: 608)
!633 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !327, line: 820, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 805, size: 32, elements: !636)
!636 = !{!637, !647}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !635, file: !327, line: 818, baseType: !638, size: 32)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !635, file: !327, line: 806, size: 32, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !638, file: !327, line: 807, baseType: !85, size: 2, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !638, file: !327, line: 808, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !638, file: !327, line: 809, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !638, file: !327, line: 810, baseType: !85, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !638, file: !327, line: 812, baseType: !85, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !638, file: !327, line: 814, baseType: !85, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !638, file: !327, line: 816, baseType: !85, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !635, file: !327, line: 819, baseType: !85, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !328, file: !327, line: 927, baseType: !649, size: 8, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !327, line: 881, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !327, line: 872, size: 8, elements: !653)
!653 = !{!654, !661}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !652, file: !327, line: 879, baseType: !655, size: 8)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !652, file: !327, line: 873, size: 8, elements: !656)
!656 = !{!657, !658, !659, !660}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !655, file: !327, line: 874, baseType: !58, size: 1, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !655, file: !327, line: 875, baseType: !58, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !655, file: !327, line: 876, baseType: !58, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !655, file: !327, line: 877, baseType: !58, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !652, file: !327, line: 880, baseType: !58, size: 8)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !665, line: 290, baseType: !666)
!665 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !665, line: 284, size: 96, elements: !667)
!667 = !{!668, !678, !689, !702, !719}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !666, file: !665, line: 285, baseType: !669, size: 8)
!669 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !665, line: 49, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !665, line: 43, size: 8, elements: !672)
!672 = !{!673, !677}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !671, file: !665, line: 47, baseType: !674, size: 8)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !665, line: 44, size: 8, elements: !675)
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !674, file: !665, line: 45, baseType: !58, size: 1, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !671, file: !665, line: 48, baseType: !58, size: 8)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !666, file: !665, line: 286, baseType: !679, size: 8, offset: 8)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !665, line: 67, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !665, line: 61, size: 8, elements: !683)
!683 = !{!684, !688}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !682, file: !665, line: 65, baseType: !685, size: 8)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !682, file: !665, line: 62, size: 8, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !685, file: !665, line: 64, baseType: !58, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !682, file: !665, line: 66, baseType: !58, size: 8)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !666, file: !665, line: 287, baseType: !690, size: 16, offset: 16)
!690 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !665, line: 89, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !665, line: 79, size: 16, elements: !693)
!693 = !{!694, !701}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !692, file: !665, line: 87, baseType: !695, size: 16)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !692, file: !665, line: 80, size: 16, elements: !696)
!696 = !{!697, !698, !699, !700}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !695, file: !665, line: 81, baseType: !60, size: 6, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !695, file: !665, line: 83, baseType: !60, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !695, file: !665, line: 85, baseType: !60, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !695, file: !665, line: 86, baseType: !60, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !692, file: !665, line: 88, baseType: !60, size: 16)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !666, file: !665, line: 288, baseType: !703, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !665, line: 214, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !665, line: 199, size: 32, elements: !706)
!706 = !{!707, !718}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !705, file: !665, line: 212, baseType: !708, size: 32)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !665, line: 200, size: 32, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !708, file: !665, line: 201, baseType: !85, size: 4, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !708, file: !665, line: 203, baseType: !85, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !708, file: !665, line: 205, baseType: !85, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !708, file: !665, line: 206, baseType: !85, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !708, file: !665, line: 207, baseType: !85, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !708, file: !665, line: 208, baseType: !85, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !708, file: !665, line: 209, baseType: !85, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !708, file: !665, line: 210, baseType: !85, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !705, file: !665, line: 213, baseType: !85, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !666, file: !665, line: 289, baseType: !720, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !665, line: 268, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !665, line: 260, size: 32, elements: !723)
!723 = !{!724, !729}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !722, file: !665, line: 266, baseType: !725, size: 32)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !722, file: !665, line: 261, size: 32, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !725, file: !665, line: 262, baseType: !85, size: 4, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !725, file: !665, line: 264, baseType: !85, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !722, file: !665, line: 267, baseType: !85, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !732, line: 513, baseType: !733)
!732 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !732, line: 494, size: 480, elements: !734)
!734 = !{!735, !741, !751, !755, !765, !775, !785, !795, !799, !815, !831, !847, !877, !881, !891, !901, !911, !915}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !733, file: !732, line: 495, baseType: !736, size: 8)
!736 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !732, line: 45, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !732, line: 43, size: 8, elements: !739)
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !738, file: !732, line: 44, baseType: !58, size: 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !733, file: !732, line: 496, baseType: !742, size: 8, offset: 8)
!742 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !732, line: 61, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !732, line: 55, size: 8, elements: !745)
!745 = !{!746, !750}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !744, file: !732, line: 59, baseType: !747, size: 8)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !744, file: !732, line: 56, size: 8, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !747, file: !732, line: 57, baseType: !58, size: 2, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !744, file: !732, line: 60, baseType: !58, size: 8)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !733, file: !732, line: 497, baseType: !752, size: 48, offset: 16)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 48, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 6)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !733, file: !732, line: 498, baseType: !756, size: 8, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !732, line: 86, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !732, line: 80, size: 8, elements: !759)
!759 = !{!760, !764}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !758, file: !732, line: 84, baseType: !761, size: 8)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !758, file: !732, line: 81, size: 8, elements: !762)
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !761, file: !732, line: 82, baseType: !58, size: 3, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !758, file: !732, line: 85, baseType: !58, size: 8)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !733, file: !732, line: 499, baseType: !766, size: 8, offset: 72)
!766 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !732, line: 121, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !732, line: 115, size: 8, elements: !769)
!769 = !{!770, !774}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !768, file: !732, line: 119, baseType: !771, size: 8)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !768, file: !732, line: 116, size: 8, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !771, file: !732, line: 117, baseType: !58, size: 3, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !768, file: !732, line: 120, baseType: !58, size: 8)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !733, file: !732, line: 500, baseType: !776, size: 8, offset: 80)
!776 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !732, line: 156, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !732, line: 150, size: 8, elements: !779)
!779 = !{!780, !784}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !778, file: !732, line: 154, baseType: !781, size: 8)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !778, file: !732, line: 151, size: 8, elements: !782)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !781, file: !732, line: 152, baseType: !58, size: 3, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !778, file: !732, line: 155, baseType: !58, size: 8)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !733, file: !732, line: 501, baseType: !786, size: 8, offset: 88)
!786 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !732, line: 191, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !732, line: 185, size: 8, elements: !789)
!789 = !{!790, !794}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !788, file: !732, line: 189, baseType: !791, size: 8)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !788, file: !732, line: 186, size: 8, elements: !792)
!792 = !{!793}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !791, file: !732, line: 187, baseType: !58, size: 3, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !788, file: !732, line: 190, baseType: !58, size: 8)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !733, file: !732, line: 502, baseType: !796, size: 64, offset: 96)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 64, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 8)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !733, file: !732, line: 503, baseType: !800, size: 32, offset: 160)
!800 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !732, line: 232, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !732, line: 220, size: 32, elements: !803)
!803 = !{!804, !814}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !802, file: !732, line: 230, baseType: !805, size: 32)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !802, file: !732, line: 221, size: 32, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !805, file: !732, line: 222, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !805, file: !732, line: 223, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !805, file: !732, line: 224, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !805, file: !732, line: 225, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !805, file: !732, line: 226, baseType: !85, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !805, file: !732, line: 227, baseType: !85, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !805, file: !732, line: 228, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !802, file: !732, line: 231, baseType: !85, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !733, file: !732, line: 504, baseType: !816, size: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !732, line: 268, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !732, line: 256, size: 32, elements: !819)
!819 = !{!820, !830}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !818, file: !732, line: 266, baseType: !821, size: 32)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !818, file: !732, line: 257, size: 32, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !821, file: !732, line: 258, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !821, file: !732, line: 259, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !821, file: !732, line: 260, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !821, file: !732, line: 261, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !821, file: !732, line: 262, baseType: !85, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !821, file: !732, line: 263, baseType: !85, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !821, file: !732, line: 264, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !818, file: !732, line: 267, baseType: !85, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !733, file: !732, line: 505, baseType: !832, size: 32, offset: 224)
!832 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !732, line: 304, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !732, line: 292, size: 32, elements: !835)
!835 = !{!836, !846}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !834, file: !732, line: 302, baseType: !837, size: 32)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !834, file: !732, line: 293, size: 32, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !837, file: !732, line: 294, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !837, file: !732, line: 295, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !837, file: !732, line: 296, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !837, file: !732, line: 297, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !837, file: !732, line: 298, baseType: !85, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !837, file: !732, line: 299, baseType: !85, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !837, file: !732, line: 300, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !834, file: !732, line: 303, baseType: !85, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !733, file: !732, line: 506, baseType: !848, size: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !732, line: 354, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !732, line: 328, size: 32, elements: !851)
!851 = !{!852, !876}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !850, file: !732, line: 352, baseType: !853, size: 32)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !850, file: !732, line: 329, size: 32, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !853, file: !732, line: 330, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !853, file: !732, line: 331, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !853, file: !732, line: 332, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !853, file: !732, line: 333, baseType: !85, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !853, file: !732, line: 334, baseType: !85, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !853, file: !732, line: 335, baseType: !85, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !853, file: !732, line: 336, baseType: !85, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !853, file: !732, line: 337, baseType: !85, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !853, file: !732, line: 338, baseType: !85, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !853, file: !732, line: 339, baseType: !85, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !853, file: !732, line: 340, baseType: !85, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !853, file: !732, line: 341, baseType: !85, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !853, file: !732, line: 342, baseType: !85, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !853, file: !732, line: 343, baseType: !85, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !853, file: !732, line: 344, baseType: !85, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !853, file: !732, line: 345, baseType: !85, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !853, file: !732, line: 346, baseType: !85, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !853, file: !732, line: 347, baseType: !85, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_", scope: !853, file: !732, line: 348, baseType: !85, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "PTC_", scope: !853, file: !732, line: 349, baseType: !85, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_", scope: !853, file: !732, line: 350, baseType: !85, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !850, file: !732, line: 353, baseType: !85, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !733, file: !732, line: 507, baseType: !878, size: 128, offset: 288)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 128, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 16)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !733, file: !732, line: 508, baseType: !882, size: 8, offset: 416)
!882 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENCLR_Type", file: !732, line: 412, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !732, line: 406, size: 8, elements: !885)
!885 = !{!886, !890}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !884, file: !732, line: 410, baseType: !887, size: 8)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !884, file: !732, line: 407, size: 8, elements: !888)
!888 = !{!889}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !887, file: !732, line: 408, baseType: !58, size: 1, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !884, file: !732, line: 411, baseType: !58, size: 8)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !733, file: !732, line: 509, baseType: !892, size: 8, offset: 424)
!892 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !893)
