; ModuleID = 'build/adafruit_itsybitsy_m4_express/synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 149, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8768, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 137)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4384, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "threadA_sem", scope: !27, file: !116, line: 72, type: !117, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/synchronization")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 214, baseType: !32)
!108 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !143, !153, !257, !259}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !27, file: !116, line: 73, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !118, line: 2909, size: 128, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !141, !142}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2910, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !117, file: !118, line: 2911, baseType: !32, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !117, file: !118, line: 2912, baseType: !32, size: 32, offset: 96)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "threadA_stack_area", scope: !27, file: !116, line: 88, type: !145, isLocal: false, isDefinition: true, align: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 8192, elements: !151)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !147, line: 47, size: 8, elements: !148)
!147 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 48, baseType: !150, size: 8)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152}
!152 = !DISubrange(count: 1024)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "threadA_data", scope: !27, file: !116, line: 89, type: !155, isLocal: true, isDefinition: true)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1344, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !208, !221, !222, !223, !227, !228, !234, !252}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !155, file: !156, line: 247, baseType: !159, size: 448)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 448, elements: !160)
!160 = !{!161, !175, !177, !180, !181, !194, !195, !196, !197}
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 60, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 60, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !162, file: !156, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !162, file: !156, line: 62, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 50, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !159, file: !156, line: 68, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !159, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !159, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 90, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 90, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !156, line: 91, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !156, line: 91, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !156, line: 96, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !156, line: 100, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !159, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_mask", scope: !159, file: !156, line: 123, baseType: !178, size: 8, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !159, file: !156, line: 127, baseType: !106, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !156, line: 131, baseType: !198, size: 192, offset: 256)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !199)
!199 = !{!200, !201, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !198, file: !122, line: 245, baseType: !165, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !198, file: !122, line: 246, baseType: !202, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !198, file: !122, line: 249, baseType: !104, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !155, file: !156, line: 250, baseType: !209, size: 288, offset: 448)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !210, line: 25, size: 288, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !209, file: !210, line: 26, baseType: !110, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !209, file: !210, line: 27, baseType: !110, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !209, file: !210, line: 28, baseType: !110, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !209, file: !210, line: 29, baseType: !110, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !209, file: !210, line: 30, baseType: !110, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !209, file: !210, line: 31, baseType: !110, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !209, file: !210, line: 32, baseType: !110, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !209, file: !210, line: 33, baseType: !110, size: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !209, file: !210, line: 34, baseType: !110, size: 32, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !155, file: !156, line: 253, baseType: !106, size: 32, offset: 736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !155, file: !156, line: 256, baseType: !121, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 279, baseType: !224, size: 256, offset: 832)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !155, file: !156, line: 294, baseType: !109, size: 32, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !155, file: !156, line: 300, baseType: !229, size: 96, offset: 1120)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !229, file: !156, line: 153, baseType: !22, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !156, line: 162, baseType: !107, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !229, file: !156, line: 168, baseType: !107, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !155, file: !156, line: 325, baseType: !235, size: 32, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 160, elements: !237)
!237 = !{!238, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !236, file: !118, line: 5074, baseType: !239, size: 96)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !240, line: 57, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !240, line: 57, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !239, file: !240, line: 58, baseType: !106, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !239, file: !240, line: 59, baseType: !107, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !236, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !236, file: !118, line: 5076, baseType: !249, offset: 160)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !155, file: !156, line: 343, baseType: !253, size: 64, offset: 1248)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !210, line: 60, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !253, file: !210, line: 63, baseType: !110, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !253, file: !210, line: 66, baseType: !110, size: 32, offset: 32)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !27, file: !116, line: 91, type: !145, isLocal: false, isDefinition: true, align: 64)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "threadB_data", scope: !27, file: !116, line: 92, type: !155, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "_char_out", scope: !263, file: !267, line: 54, type: !268, isLocal: false, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !265, globals: !266, splitDebugInlining: false, nameTableKind: None)
!264 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/synchronization")
!265 = !{!106, !109}
!266 = !{!261}
!267 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{!109, !109}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !273, file: !808, line: 149, type: !809, isLocal: true, isDefinition: true, align: 32)
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !275, globals: !807, splitDebugInlining: false, nameTableKind: None)
!274 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/synchronization")
!275 = !{!106, !109, !276, !410, !495}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cmcc", file: !278, line: 352, baseType: !279)
!278 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/cmcc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 339, size: 448, elements: !280)
!280 = !{!281, !297, !309, !319, !330, !340, !348, !358, !369, !379, !389, !399}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !279, file: !278, line: 340, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_TYPE_Type", file: !278, line: 57, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 44, size: 32, elements: !286)
!286 = !{!287, !296}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !285, file: !278, line: 55, baseType: !288, size: 32)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !285, file: !278, line: 45, size: 32, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK", scope: !288, file: !278, line: 47, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "RRP", scope: !288, file: !278, line: 49, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "WAYNUM", scope: !288, file: !278, line: 50, baseType: !110, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "LCKDOWN", scope: !288, file: !278, line: 51, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZE", scope: !288, file: !278, line: 52, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "CLSIZE", scope: !288, file: !278, line: 53, baseType: !110, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !285, file: !278, line: 56, baseType: !110, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "CFG", scope: !279, file: !278, line: 341, baseType: !298, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CFG_Type", file: !278, line: 124, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 114, size: 32, elements: !301)
!301 = !{!302, !308}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !300, file: !278, line: 122, baseType: !303, size: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !278, line: 115, size: 32, elements: !304)
!304 = !{!305, !306, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ICDIS", scope: !303, file: !278, line: 117, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "DCDIS", scope: !303, file: !278, line: 118, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZESW", scope: !303, file: !278, line: 120, baseType: !110, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !300, file: !278, line: 123, baseType: !110, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !279, file: !278, line: 342, baseType: !310, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CTRL_Type", file: !278, line: 161, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 155, size: 32, elements: !313)
!313 = !{!314, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !312, file: !278, line: 159, baseType: !315, size: 32)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !312, file: !278, line: 156, size: 32, elements: !316)
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !315, file: !278, line: 157, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !312, file: !278, line: 160, baseType: !110, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !279, file: !278, line: 343, baseType: !320, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_SR_Type", file: !278, line: 179, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 173, size: 32, elements: !324)
!324 = !{!325, !329}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !323, file: !278, line: 177, baseType: !326, size: 32)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !323, file: !278, line: 174, size: 32, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "CSTS", scope: !326, file: !278, line: 175, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !323, file: !278, line: 178, baseType: !110, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !279, file: !278, line: 344, baseType: !331, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_LCKWAY_Type", file: !278, line: 197, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 191, size: 32, elements: !334)
!334 = !{!335, !339}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !333, file: !278, line: 195, baseType: !336, size: 32)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !278, line: 192, size: 32, elements: !337)
!337 = !{!338}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !336, file: !278, line: 193, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !333, file: !278, line: 196, baseType: !110, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !279, file: !278, line: 345, baseType: !341, size: 96, offset: 160)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 96, elements: !346)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !343, line: 53, baseType: !344)
!343 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/samd51g19a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !178)
!346 = !{!347}
!347 = !DISubrange(count: 12)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT0", scope: !279, file: !278, line: 346, baseType: !349, size: 32, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT0_Type", file: !278, line: 216, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 210, size: 32, elements: !352)
!352 = !{!353, !357}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !351, file: !278, line: 214, baseType: !354, size: 32)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !351, file: !278, line: 211, size: 32, elements: !355)
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "INVALL", scope: !354, file: !278, line: 212, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !351, file: !278, line: 215, baseType: !110, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT1", scope: !279, file: !278, line: 347, baseType: !359, size: 32, offset: 288)
!359 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT1_Type", file: !278, line: 236, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 228, size: 32, elements: !362)
!362 = !{!363, !368}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !361, file: !278, line: 234, baseType: !364, size: 32)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !361, file: !278, line: 229, size: 32, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "INDEX", scope: !364, file: !278, line: 231, baseType: !110, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "WAY", scope: !364, file: !278, line: 233, baseType: !110, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !361, file: !278, line: 235, baseType: !110, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "MCFG", scope: !279, file: !278, line: 348, baseType: !370, size: 32, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCFG_Type", file: !278, line: 266, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 260, size: 32, elements: !373)
!373 = !{!374, !378}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !372, file: !278, line: 264, baseType: !375, size: 32)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !372, file: !278, line: 261, size: 32, elements: !376)
!376 = !{!377}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !375, file: !278, line: 262, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !372, file: !278, line: 265, baseType: !110, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "MEN", scope: !279, file: !278, line: 349, baseType: !380, size: 32, offset: 352)
!380 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MEN_Type", file: !278, line: 291, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 285, size: 32, elements: !383)
!383 = !{!384, !388}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !382, file: !278, line: 289, baseType: !385, size: 32)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !382, file: !278, line: 286, size: 32, elements: !386)
!386 = !{!387}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "MENABLE", scope: !385, file: !278, line: 287, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !382, file: !278, line: 290, baseType: !110, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "MCTRL", scope: !279, file: !278, line: 350, baseType: !390, size: 32, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCTRL_Type", file: !278, line: 309, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 303, size: 32, elements: !393)
!393 = !{!394, !398}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !392, file: !278, line: 307, baseType: !395, size: 32)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !278, line: 304, size: 32, elements: !396)
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !395, file: !278, line: 305, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !392, file: !278, line: 308, baseType: !110, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !279, file: !278, line: 351, baseType: !400, size: 32, offset: 416)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MSR_Type", file: !278, line: 326, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 321, size: 32, elements: !404)
!404 = !{!405, !409}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !403, file: !278, line: 324, baseType: !406, size: 32)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !403, file: !278, line: 322, size: 32, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "EVENT_CNT", scope: !406, file: !278, line: 323, baseType: !110, size: 32, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !403, file: !278, line: 325, baseType: !110, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !412, line: 267, baseType: !413)
!412 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 259, size: 2560, elements: !414)
!414 = !{!415, !425, !429, !456, !460, !478, !482}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !413, file: !412, line: 260, baseType: !416, size: 8)
!416 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRLA_Type", file: !412, line: 50, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !412, line: 44, size: 8, elements: !419)
!419 = !{!420, !424}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !418, file: !412, line: 48, baseType: !421, size: 8)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !412, line: 45, size: 8, elements: !422)
!422 = !{!423}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !421, file: !412, line: 46, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !418, file: !412, line: 49, baseType: !178, size: 8)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !413, file: !412, line: 261, baseType: !426, size: 24, offset: 8)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 24, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 3)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !413, file: !412, line: 262, baseType: !430, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_SYNCBUSY_Type", file: !412, line: 86, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !412, line: 62, size: 32, elements: !434)
!434 = !{!435, !451, !455}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !433, file: !412, line: 79, baseType: !436, size: 32)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !433, file: !412, line: 63, size: 32, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !436, file: !412, line: 64, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL0", scope: !436, file: !412, line: 66, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL1", scope: !436, file: !412, line: 67, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL2", scope: !436, file: !412, line: 68, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL3", scope: !436, file: !412, line: 69, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL4", scope: !436, file: !412, line: 70, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL5", scope: !436, file: !412, line: 71, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL6", scope: !436, file: !412, line: 72, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL7", scope: !436, file: !412, line: 73, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL8", scope: !436, file: !412, line: 74, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL9", scope: !436, file: !412, line: 75, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL10", scope: !436, file: !412, line: 76, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL11", scope: !436, file: !412, line: 77, baseType: !110, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !433, file: !412, line: 84, baseType: !452, size: 32)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !433, file: !412, line: 80, size: 32, elements: !453)
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !452, file: !412, line: 82, baseType: !110, size: 12, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !433, file: !412, line: 85, baseType: !110, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !413, file: !412, line: 263, baseType: !457, size: 192, offset: 64)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 192, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 24)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !413, file: !412, line: 264, baseType: !461, size: 384, offset: 256)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 384, elements: !346)
!462 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !412, line: 163, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !412, line: 149, size: 32, elements: !465)
!465 = !{!466, !477}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !464, file: !412, line: 161, baseType: !467, size: 32)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !464, file: !412, line: 150, size: 32, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !467, file: !412, line: 151, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !467, file: !412, line: 153, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !467, file: !412, line: 154, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !467, file: !412, line: 155, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !467, file: !412, line: 156, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !467, file: !412, line: 157, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !467, file: !412, line: 158, baseType: !110, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !467, file: !412, line: 160, baseType: !110, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !464, file: !412, line: 162, baseType: !110, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !413, file: !412, line: 265, baseType: !479, size: 384, offset: 640)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 384, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 48)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "PCHCTRL", scope: !413, file: !412, line: 266, baseType: !483, size: 1536, offset: 1024)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 1536, elements: !480)
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_PCHCTRL_Type", file: !412, line: 218, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !412, line: 209, size: 32, elements: !487)
!487 = !{!488, !494}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !486, file: !412, line: 216, baseType: !489, size: 32)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !486, file: !412, line: 210, size: 32, elements: !490)
!490 = !{!491, !492, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !489, file: !412, line: 211, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "CHEN", scope: !489, file: !412, line: 213, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !489, file: !412, line: 214, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !486, file: !412, line: 217, baseType: !110, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "Oscctrl", file: !497, line: 788, baseType: !498)
!497 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/oscctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 771, size: 704, elements: !499)
!499 = !{!500, !515, !516, !547, !578, !611, !646, !668, !680, !681, !698, !699, !711, !723, !736, !737}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "EVCTRL", scope: !498, file: !497, line: 772, baseType: !501, size: 8)
!501 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_EVCTRL_Type", file: !497, line: 55, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 44, size: 8, elements: !504)
!504 = !{!505, !510, !514}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !503, file: !497, line: 49, baseType: !506, size: 8)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !503, file: !497, line: 45, size: 8, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO0", scope: !506, file: !497, line: 46, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO1", scope: !506, file: !497, line: 47, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !503, file: !497, line: 53, baseType: !511, size: 8)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !503, file: !497, line: 50, size: 8, elements: !512)
!512 = !{!513}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO", scope: !511, file: !497, line: 51, baseType: !178, size: 2, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !503, file: !497, line: 54, baseType: !178, size: 8)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !498, file: !497, line: 773, baseType: !426, size: 24, offset: 8)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !498, file: !497, line: 774, baseType: !517, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENCLR_Type", file: !497, line: 102, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 72, size: 32, elements: !520)
!520 = !{!521, !541, !546}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !519, file: !497, line: 95, baseType: !522, size: 32)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !519, file: !497, line: 73, size: 32, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !522, file: !497, line: 74, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !522, file: !497, line: 75, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !522, file: !497, line: 76, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !522, file: !497, line: 77, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !522, file: !497, line: 79, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !522, file: !497, line: 80, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !522, file: !497, line: 81, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !522, file: !497, line: 82, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !522, file: !497, line: 83, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !522, file: !497, line: 85, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !522, file: !497, line: 86, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !522, file: !497, line: 87, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !522, file: !497, line: 88, baseType: !110, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !522, file: !497, line: 90, baseType: !110, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !522, file: !497, line: 91, baseType: !110, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !522, file: !497, line: 92, baseType: !110, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !522, file: !497, line: 93, baseType: !110, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !519, file: !497, line: 100, baseType: !542, size: 32)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !519, file: !497, line: 96, size: 32, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !542, file: !497, line: 97, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !542, file: !497, line: 98, baseType: !110, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !519, file: !497, line: 101, baseType: !110, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !498, file: !497, line: 775, baseType: !548, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENSET_Type", file: !497, line: 182, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 152, size: 32, elements: !551)
!551 = !{!552, !572, !577}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !550, file: !497, line: 175, baseType: !553, size: 32)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !550, file: !497, line: 153, size: 32, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !553, file: !497, line: 154, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !553, file: !497, line: 155, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !553, file: !497, line: 156, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !553, file: !497, line: 157, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !553, file: !497, line: 159, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !553, file: !497, line: 160, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !553, file: !497, line: 161, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !553, file: !497, line: 162, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !553, file: !497, line: 163, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !553, file: !497, line: 165, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !553, file: !497, line: 166, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !553, file: !497, line: 167, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !553, file: !497, line: 168, baseType: !110, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !553, file: !497, line: 170, baseType: !110, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !553, file: !497, line: 171, baseType: !110, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !553, file: !497, line: 172, baseType: !110, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !553, file: !497, line: 173, baseType: !110, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !550, file: !497, line: 180, baseType: !573, size: 32)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !550, file: !497, line: 176, size: 32, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !573, file: !497, line: 177, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !573, file: !497, line: 178, baseType: !110, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !550, file: !497, line: 181, baseType: !110, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !498, file: !497, line: 776, baseType: !579, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTFLAG_Type", file: !497, line: 262, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 232, size: 32, elements: !582)
!582 = !{!583, !605, !610}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !581, file: !497, line: 255, baseType: !584, size: 32)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !581, file: !497, line: 233, size: 32, elements: !585)
!585 = !{!586, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !584, file: !497, line: 234, baseType: !587, size: 1, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !584, file: !497, line: 235, baseType: !587, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !584, file: !497, line: 236, baseType: !587, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !584, file: !497, line: 237, baseType: !587, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !584, file: !497, line: 239, baseType: !587, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !584, file: !497, line: 240, baseType: !587, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !584, file: !497, line: 241, baseType: !587, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !584, file: !497, line: 242, baseType: !587, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !584, file: !497, line: 243, baseType: !587, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !584, file: !497, line: 245, baseType: !587, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !584, file: !497, line: 246, baseType: !587, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !584, file: !497, line: 247, baseType: !587, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !584, file: !497, line: 248, baseType: !587, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !584, file: !497, line: 250, baseType: !587, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !584, file: !497, line: 251, baseType: !587, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !584, file: !497, line: 252, baseType: !587, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !584, file: !497, line: 253, baseType: !587, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !581, file: !497, line: 260, baseType: !606, size: 32)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !581, file: !497, line: 256, size: 32, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !606, file: !497, line: 257, baseType: !587, size: 2, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !606, file: !497, line: 258, baseType: !587, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !581, file: !497, line: 261, baseType: !110, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !498, file: !497, line: 777, baseType: !612, size: 32, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_STATUS_Type", file: !497, line: 345, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 312, size: 32, elements: !616)
!616 = !{!617, !639, !645}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !615, file: !497, line: 337, baseType: !618, size: 32)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !615, file: !497, line: 313, size: 32, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !618, file: !497, line: 314, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !618, file: !497, line: 315, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !618, file: !497, line: 316, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !618, file: !497, line: 317, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW0", scope: !618, file: !497, line: 318, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW1", scope: !618, file: !497, line: 319, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !618, file: !497, line: 321, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !618, file: !497, line: 322, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !618, file: !497, line: 323, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !618, file: !497, line: 324, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !618, file: !497, line: 325, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !618, file: !497, line: 327, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !618, file: !497, line: 328, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0TO", scope: !618, file: !497, line: 329, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !618, file: !497, line: 330, baseType: !110, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !618, file: !497, line: 332, baseType: !110, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !618, file: !497, line: 333, baseType: !110, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1TO", scope: !618, file: !497, line: 334, baseType: !110, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !618, file: !497, line: 335, baseType: !110, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !615, file: !497, line: 343, baseType: !640, size: 32)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !615, file: !497, line: 338, size: 32, elements: !641)
!641 = !{!642, !643, !644}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !640, file: !497, line: 339, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !640, file: !497, line: 340, baseType: !110, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW", scope: !640, file: !497, line: 341, baseType: !110, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !615, file: !497, line: 344, baseType: !110, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCTRL", scope: !498, file: !497, line: 778, baseType: !647, size: 64, offset: 160)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 64, elements: !173)
!648 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_XOSCCTRL_Type", file: !497, line: 422, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 402, size: 32, elements: !651)
!651 = !{!652, !667}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !650, file: !497, line: 420, baseType: !653, size: 32)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !650, file: !497, line: 403, size: 32, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !653, file: !497, line: 405, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !653, file: !497, line: 406, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !653, file: !497, line: 408, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !653, file: !497, line: 409, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "LOWBUFGAIN", scope: !653, file: !497, line: 410, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "IPTAT", scope: !653, file: !497, line: 411, baseType: !110, size: 2, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "IMULT", scope: !653, file: !497, line: 412, baseType: !110, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ENALC", scope: !653, file: !497, line: 413, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEN", scope: !653, file: !497, line: 414, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "SWBEN", scope: !653, file: !497, line: 415, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !653, file: !497, line: 417, baseType: !110, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "CFDPRESC", scope: !653, file: !497, line: 418, baseType: !110, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !650, file: !497, line: 421, baseType: !110, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLA", scope: !498, file: !497, line: 779, baseType: !669, size: 8, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLA_Type", file: !497, line: 469, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 460, size: 8, elements: !672)
!672 = !{!673, !679}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !671, file: !497, line: 467, baseType: !674, size: 8)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !497, line: 461, size: 8, elements: !675)
!675 = !{!676, !677, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !674, file: !497, line: 463, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !674, file: !497, line: 465, baseType: !178, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !674, file: !497, line: 466, baseType: !178, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !671, file: !497, line: 468, baseType: !178, size: 8)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !498, file: !497, line: 780, baseType: !426, size: 24, offset: 232)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !498, file: !497, line: 781, baseType: !682, size: 8, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLB_Type", file: !497, line: 497, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 485, size: 8, elements: !685)
!685 = !{!686, !697}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !684, file: !497, line: 495, baseType: !687, size: 8)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !684, file: !497, line: 486, size: 8, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !687, file: !497, line: 487, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !687, file: !497, line: 488, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !687, file: !497, line: 489, baseType: !178, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !687, file: !497, line: 490, baseType: !178, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !687, file: !497, line: 491, baseType: !178, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !687, file: !497, line: 492, baseType: !178, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !687, file: !497, line: 493, baseType: !178, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !687, file: !497, line: 494, baseType: !178, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !684, file: !497, line: 496, baseType: !178, size: 8)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !498, file: !497, line: 782, baseType: !426, size: 24, offset: 264)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !498, file: !497, line: 783, baseType: !700, size: 32, offset: 288)
!700 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLVAL_Type", file: !497, line: 531, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 523, size: 32, elements: !703)
!703 = !{!704, !710}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !702, file: !497, line: 529, baseType: !705, size: 32)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !702, file: !497, line: 524, size: 32, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !705, file: !497, line: 525, baseType: !110, size: 8, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !705, file: !497, line: 527, baseType: !110, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !705, file: !497, line: 528, baseType: !110, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !702, file: !497, line: 530, baseType: !110, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !498, file: !497, line: 784, baseType: !712, size: 32, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLMUL_Type", file: !497, line: 558, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 550, size: 32, elements: !715)
!715 = !{!716, !722}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !497, line: 556, baseType: !717, size: 32)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !497, line: 551, size: 32, elements: !718)
!718 = !{!719, !720, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !717, file: !497, line: 552, baseType: !110, size: 16, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !717, file: !497, line: 553, baseType: !110, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !717, file: !497, line: 555, baseType: !110, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !497, line: 557, baseType: !110, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !498, file: !497, line: 785, baseType: !724, size: 8, offset: 352)
!724 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLSYNC_Type", file: !497, line: 587, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 577, size: 8, elements: !727)
!727 = !{!728, !735}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !726, file: !497, line: 585, baseType: !729, size: 8)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !726, file: !497, line: 578, size: 8, elements: !730)
!730 = !{!731, !732, !733, !734}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !729, file: !497, line: 580, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !729, file: !497, line: 581, baseType: !178, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !729, file: !497, line: 582, baseType: !178, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !729, file: !497, line: 583, baseType: !178, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !726, file: !497, line: 586, baseType: !178, size: 8)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !498, file: !497, line: 786, baseType: !426, size: 24, offset: 360)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Dpll", scope: !498, file: !497, line: 787, baseType: !738, size: 320, offset: 384)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 320, elements: !173)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "OscctrlDpll", file: !497, line: 766, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 759, size: 160, elements: !741)
!741 = !{!742, !754, !755, !766, !783, !795}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !740, file: !497, line: 760, baseType: !743, size: 8)
!743 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLA_Type", file: !497, line: 614, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 605, size: 8, elements: !746)
!746 = !{!747, !753}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !745, file: !497, line: 612, baseType: !748, size: 8)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !745, file: !497, line: 606, size: 8, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !748, file: !497, line: 608, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !748, file: !497, line: 610, baseType: !178, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !748, file: !497, line: 611, baseType: !178, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !745, file: !497, line: 613, baseType: !178, size: 8)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !740, file: !497, line: 761, baseType: !426, size: 24, offset: 8)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !740, file: !497, line: 762, baseType: !756, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLRATIO_Type", file: !497, line: 638, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 630, size: 32, elements: !759)
!759 = !{!760, !765}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !758, file: !497, line: 636, baseType: !761, size: 32)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !758, file: !497, line: 631, size: 32, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !761, file: !497, line: 632, baseType: !110, size: 13, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !761, file: !497, line: 634, baseType: !110, size: 5, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !758, file: !497, line: 637, baseType: !110, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !740, file: !497, line: 763, baseType: !767, size: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLB_Type", file: !497, line: 667, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 654, size: 32, elements: !770)
!770 = !{!771, !782}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !769, file: !497, line: 665, baseType: !772, size: 32)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !769, file: !497, line: 655, size: 32, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !772, file: !497, line: 656, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !772, file: !497, line: 657, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !772, file: !497, line: 658, baseType: !110, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !772, file: !497, line: 659, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !772, file: !497, line: 660, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "DCOFILTER", scope: !772, file: !497, line: 661, baseType: !110, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "DCOEN", scope: !772, file: !497, line: 662, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !772, file: !497, line: 663, baseType: !110, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !769, file: !497, line: 666, baseType: !110, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSYNCBUSY", scope: !740, file: !497, line: 764, baseType: !784, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSYNCBUSY_Type", file: !497, line: 724, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 716, size: 32, elements: !788)
!788 = !{!789, !794}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !787, file: !497, line: 722, baseType: !790, size: 32)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !787, file: !497, line: 717, size: 32, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !790, file: !497, line: 719, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !790, file: !497, line: 720, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !787, file: !497, line: 723, baseType: !110, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !740, file: !497, line: 765, baseType: !796, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSTATUS_Type", file: !497, line: 745, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !497, line: 738, size: 32, elements: !800)
!800 = !{!801, !806}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !799, file: !497, line: 743, baseType: !802, size: 32)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !799, file: !497, line: 739, size: 32, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !802, file: !497, line: 740, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !802, file: !497, line: 741, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !799, file: !497, line: 744, baseType: !110, size: 32)
!807 = !{!271}
!808 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !811, line: 51, size: 64, elements: !812)
!811 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!812 = !{!813, !841}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !810, file: !811, line: 60, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{!109, !817}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !820, line: 378, size: 192, elements: !821)
!820 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!821 = !{!822, !825, !826, !827, !834, !835}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !819, file: !820, line: 380, baseType: !823, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !819, file: !820, line: 382, baseType: !13, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !819, file: !820, line: 384, baseType: !13, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !819, file: !820, line: 386, baseType: !828, size: 32, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !820, line: 351, size: 16, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !829, file: !820, line: 359, baseType: !178, size: 8)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !829, file: !820, line: 364, baseType: !833, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!833 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !819, file: !820, line: 388, baseType: !106, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !819, file: !820, line: 396, baseType: !836, size: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !820, line: 43, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !840)
!840 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !810, file: !811, line: 65, baseType: !817, size: 32, offset: 32)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "static_regions", scope: !844, file: !851, line: 62, type: !973, isLocal: true, isDefinition: true)
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !846, globals: !847, splitDebugInlining: false, nameTableKind: None)
!845 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/synchronization")
!846 = !{!107, !109, !110, !106}
!847 = !{!848, !842}
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !850, file: !851, line: 198, type: !959, isLocal: true, isDefinition: true)
!850 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !851, file: !851, line: 175, type: !852, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !844, retainedNodes: !956)
!851 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!852 = !DISubroutineType(types: !853)
!853 = !{null, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1344, elements: !856)
!856 = !{!857, !916, !928, !929, !930, !931, !932, !938, !951}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !855, file: !156, line: 247, baseType: !858, size: 448)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 448, elements: !859)
!859 = !{!860, !884, !891, !892, !893, !902, !903, !904, !905}
!860 = !DIDerivedType(tag: DW_TAG_member, scope: !858, file: !156, line: 60, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !858, file: !156, line: 60, size: 64, elements: !862)
!862 = !{!863, !878}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !861, file: !156, line: 61, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !866)
!866 = !{!867, !873}
!867 = !DIDerivedType(tag: DW_TAG_member, scope: !865, file: !127, line: 38, baseType: !868, size: 32)
!868 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !865, file: !127, line: 38, size: 32, elements: !869)
!869 = !{!870, !872}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !868, file: !127, line: 39, baseType: !871, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !868, file: !127, line: 40, baseType: !871, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, scope: !865, file: !127, line: 42, baseType: !874, size: 32, offset: 32)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !865, file: !127, line: 42, size: 32, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !874, file: !127, line: 43, baseType: !871, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !874, file: !127, line: 44, baseType: !871, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !861, file: !156, line: 62, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !880)
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !879, file: !168, line: 50, baseType: !882, size: 64)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !883, size: 64, elements: !173)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !858, file: !156, line: 68, baseType: !885, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !888)
!888 = !{!889}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !887, file: !122, line: 232, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !865)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !858, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !858, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!893 = !DIDerivedType(tag: DW_TAG_member, scope: !858, file: !156, line: 90, baseType: !894, size: 16, offset: 112)
!894 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !858, file: !156, line: 90, size: 16, elements: !895)
!895 = !{!896, !901}
!896 = !DIDerivedType(tag: DW_TAG_member, scope: !894, file: !156, line: 91, baseType: !897, size: 16)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !894, file: !156, line: 91, size: 16, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !897, file: !156, line: 96, baseType: !188, size: 8)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !897, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !894, file: !156, line: 100, baseType: !192, size: 16)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !858, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_mask", scope: !858, file: !156, line: 123, baseType: !178, size: 8, offset: 160)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !858, file: !156, line: 127, baseType: !106, size: 32, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !858, file: !156, line: 131, baseType: !906, size: 192, offset: 256)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !907)
!907 = !{!908, !909, !915}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !906, file: !122, line: 245, baseType: !864, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !906, file: !122, line: 246, baseType: !910, size: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DISubroutineType(types: !913)
!913 = !{null, !914}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !906, file: !122, line: 249, baseType: !104, size: 64, offset: 128)
