; ModuleID = 'build/adafruit_feather_m0_basic_proto/subsys/testsuite/pytest/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.ztest_suite_stats = type { i32, i32, i32 }
%struct.ztest_suite_node = type { i8*, i8* ()*, void (i8*)*, void (i8*)*, void (i8*)*, i1 (i8*)*, %struct.ztest_suite_stats* }
%struct.ztest_unit_test_stats = type { i32, i32, i32, i32, i32 }
%struct.ztest_unit_test = type { i8*, i8*, void (i8*)*, i32, %struct.ztest_unit_test_stats* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.anon.10 = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/testsuite/pytest/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/testsuite/pytest")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/testsuite/pytest")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "z_ztest_suite_node_stats_test_pytest", scope: !27, file: !111, line: 8, type: !149, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !108, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/testsuite/pytest")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_NODE", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_STATS", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_ZTEST_UNIT_TEST", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_ZTEST_TEST_RULE", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 68)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 69)
!104 = !DIEnumerator(name: "K_OBJ_LAST", value: 70)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !{!109, !155, !25, !173}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_ztest_test_node_test_pytest", scope: !27, file: !111, line: 8, type: !112, isLocal: true, isDefinition: true, align: 32)
!111 = !DIFile(filename: "zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !115)
!114 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/include/zephyr/ztest_test_new.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !{!116, !121, !127, !133, !136, !139, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 179, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !113, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_setup_t", file: !114, line: 141, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!106}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !113, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_before_t", file: !114, line: 148, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !106}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !113, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_after_t", file: !114, line: 155, baseType: !130)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !113, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_teardown_t", file: !114, line: 162, baseType: !130)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !113, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_predicate_t", file: !114, line: 171, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !13}
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !113, file: !114, line: 197, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !150)
!150 = !{!151, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !149, file: !114, line: 116, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !149, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !149, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "z_ztest_unit_test__test_pytest__test_pytest", scope: !27, file: !111, line: 10, type: !157, isLocal: true, isDefinition: true, align: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test", file: !114, line: 97, size: 160, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "test_suite_name", scope: !157, file: !114, line: 98, baseType: !118, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !114, line: 99, baseType: !118, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !157, file: !114, line: 100, baseType: !130, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "thread_options", scope: !157, file: !114, line: 101, baseType: !152, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !157, file: !114, line: 104, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test_stats", file: !114, line: 123, size: 160, elements: !167)
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !166, file: !114, line: 125, baseType: !152, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !166, file: !114, line: 127, baseType: !152, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !166, file: !114, line: 129, baseType: !152, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pass_count", scope: !166, file: !114, line: 131, baseType: !152, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "duration_worst_ms", scope: !166, file: !114, line: 133, baseType: !152, size: 32, offset: 128)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_ztest_unit_test_stats_test_pytest_test_pytest", scope: !27, file: !111, line: 10, type: !166, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !177, file: !200, line: 18, type: !201, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !179, globals: !199, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/testsuite/pytest")
!179 = !{!22, !106, !24, !180, !182, !184, !185, !107, !187, !188, !190, !192, !193, !194, !197, !118}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 214, baseType: !32)
!186 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !196)
!196 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !198)
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !{!175}
!200 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 17, baseType: !118, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "_char_out", scope: !209, file: !212, line: 54, type: !213, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !211, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/testsuite/pytest")
!211 = !{!207}
!212 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!107, !107}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !218, file: !954, line: 202, type: !955, isLocal: true, isDefinition: true, align: 32)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !220, globals: !953, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/testsuite/pytest")
!220 = !{!106, !107, !221, !345, !684, !685, !752}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !223, line: 335, baseType: !224)
!223 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !223, line: 320, size: 288, elements: !225)
!225 = !{!226, !237, !245, !259, !270, !281, !285, !296, !297, !308, !309, !324, !325, !335}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !224, file: !223, line: 321, baseType: !227, size: 16)
!227 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !223, line: 50, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 43, size: 16, elements: !230)
!230 = !{!231, !236}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !229, file: !223, line: 48, baseType: !232, size: 16)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !229, file: !223, line: 44, size: 16, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !232, file: !223, line: 45, baseType: !197, size: 7, flags: DIFlagBitField, extraData: i64 0)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !232, file: !223, line: 47, baseType: !197, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !229, file: !223, line: 49, baseType: !197, size: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !224, file: !223, line: 322, baseType: !238, size: 16, offset: 16)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 16, elements: !243)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !240, line: 52, baseType: !241)
!240 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !195)
!243 = !{!244}
!244 = !DISubrange(count: 2)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !224, file: !223, line: 323, baseType: !246, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !223, line: 107, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 94, size: 32, elements: !249)
!249 = !{!250, !258}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !248, file: !223, line: 105, baseType: !251, size: 32)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !248, file: !223, line: 95, size: 32, elements: !252)
!252 = !{!253, !254, !255, !256, !257}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !251, file: !223, line: 97, baseType: !152, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !251, file: !223, line: 99, baseType: !152, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !251, file: !223, line: 100, baseType: !152, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !251, file: !223, line: 102, baseType: !152, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !251, file: !223, line: 103, baseType: !152, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !248, file: !223, line: 106, baseType: !152, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !224, file: !223, line: 324, baseType: !260, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !223, line: 155, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 148, size: 32, elements: !263)
!263 = !{!264, !269}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !262, file: !223, line: 153, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !223, line: 149, size: 32, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !265, file: !223, line: 150, baseType: !152, size: 16, flags: DIFlagBitField, extraData: i64 0)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !265, file: !223, line: 151, baseType: !152, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !262, file: !223, line: 154, baseType: !152, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !224, file: !223, line: 325, baseType: !271, size: 8, offset: 96)
!271 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !223, line: 194, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 187, size: 8, elements: !274)
!274 = !{!275, !280}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !273, file: !223, line: 192, baseType: !276, size: 8)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !273, file: !223, line: 188, size: 8, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !276, file: !223, line: 189, baseType: !195, size: 1, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !276, file: !223, line: 190, baseType: !195, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !273, file: !223, line: 193, baseType: !195, size: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !224, file: !223, line: 326, baseType: !282, size: 24, offset: 104)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 24, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 3)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !224, file: !223, line: 327, baseType: !286, size: 8, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !223, line: 215, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 208, size: 8, elements: !289)
!289 = !{!290, !295}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !288, file: !223, line: 213, baseType: !291, size: 8)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !288, file: !223, line: 209, size: 8, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !291, file: !223, line: 210, baseType: !195, size: 1, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !291, file: !223, line: 211, baseType: !195, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !288, file: !223, line: 214, baseType: !195, size: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !224, file: !223, line: 328, baseType: !282, size: 24, offset: 136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !224, file: !223, line: 329, baseType: !298, size: 8, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !223, line: 236, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 229, size: 8, elements: !301)
!301 = !{!302, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !300, file: !223, line: 234, baseType: !303, size: 8)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !223, line: 230, size: 8, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !303, file: !223, line: 231, baseType: !241, size: 1, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !303, file: !223, line: 232, baseType: !241, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !300, file: !223, line: 235, baseType: !195, size: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !224, file: !223, line: 330, baseType: !282, size: 24, offset: 168)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !224, file: !223, line: 331, baseType: !310, size: 16, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !223, line: 262, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 250, size: 16, elements: !313)
!313 = !{!314, !323}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !312, file: !223, line: 260, baseType: !315, size: 16)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !312, file: !223, line: 251, size: 16, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !315, file: !223, line: 252, baseType: !197, size: 1, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !315, file: !223, line: 253, baseType: !197, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !315, file: !223, line: 254, baseType: !197, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !315, file: !223, line: 255, baseType: !197, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !315, file: !223, line: 256, baseType: !197, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !315, file: !223, line: 258, baseType: !197, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !312, file: !223, line: 261, baseType: !197, size: 16)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !224, file: !223, line: 332, baseType: !238, size: 16, offset: 208)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !224, file: !223, line: 333, baseType: !326, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !223, line: 290, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 284, size: 32, elements: !329)
!329 = !{!330, !334}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !328, file: !223, line: 288, baseType: !331, size: 32)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !223, line: 285, size: 32, elements: !332)
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !331, file: !223, line: 286, baseType: !152, size: 22, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !328, file: !223, line: 289, baseType: !152, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !224, file: !223, line: 334, baseType: !336, size: 16, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !223, line: 308, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !223, line: 303, size: 16, elements: !339)
!339 = !{!340, !344}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !338, file: !223, line: 306, baseType: !341, size: 16)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !223, line: 304, size: 16, elements: !342)
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !341, file: !223, line: 305, baseType: !197, size: 16, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !338, file: !223, line: 307, baseType: !197, size: 16)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !347, line: 928, baseType: !348)
!347 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !347, line: 899, size: 672, elements: !349)
!349 = !{!350, !374, !398, !424, !449, !465, !466, !484, !485, !502, !513, !514, !529, !549, !550, !562, !574, !584, !585, !602, !606, !617, !618, !630, !642, !643, !654, !670}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !348, file: !347, line: 900, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !347, line: 64, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 43, size: 32, elements: !354)
!354 = !{!355, !373}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !353, file: !347, line: 62, baseType: !356, size: 32)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !353, file: !347, line: 44, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !356, file: !347, line: 45, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !356, file: !347, line: 46, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !356, file: !347, line: 47, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !356, file: !347, line: 48, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !356, file: !347, line: 49, baseType: !152, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !356, file: !347, line: 50, baseType: !152, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !356, file: !347, line: 51, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !356, file: !347, line: 52, baseType: !152, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !356, file: !347, line: 53, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !356, file: !347, line: 54, baseType: !152, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !356, file: !347, line: 55, baseType: !152, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !356, file: !347, line: 56, baseType: !152, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !356, file: !347, line: 58, baseType: !152, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !356, file: !347, line: 59, baseType: !152, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !356, file: !347, line: 60, baseType: !152, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !353, file: !347, line: 63, baseType: !152, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !348, file: !347, line: 901, baseType: !375, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !347, line: 125, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 104, size: 32, elements: !378)
!378 = !{!379, !397}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !377, file: !347, line: 123, baseType: !380, size: 32)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !347, line: 105, size: 32, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !380, file: !347, line: 106, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !380, file: !347, line: 107, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !380, file: !347, line: 108, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !380, file: !347, line: 109, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !380, file: !347, line: 110, baseType: !152, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !380, file: !347, line: 111, baseType: !152, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !380, file: !347, line: 112, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !380, file: !347, line: 113, baseType: !152, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !380, file: !347, line: 114, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !380, file: !347, line: 115, baseType: !152, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !380, file: !347, line: 116, baseType: !152, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !380, file: !347, line: 117, baseType: !152, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !380, file: !347, line: 119, baseType: !152, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !380, file: !347, line: 120, baseType: !152, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !380, file: !347, line: 121, baseType: !152, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !377, file: !347, line: 124, baseType: !152, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !348, file: !347, line: 902, baseType: !399, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !347, line: 186, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 165, size: 32, elements: !402)
!402 = !{!403, !423}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !401, file: !347, line: 184, baseType: !404, size: 32)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !401, file: !347, line: 166, size: 32, elements: !405)
!405 = !{!406, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !404, file: !347, line: 167, baseType: !407, size: 1, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !152)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !404, file: !347, line: 168, baseType: !407, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !404, file: !347, line: 169, baseType: !407, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !404, file: !347, line: 170, baseType: !407, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !404, file: !347, line: 171, baseType: !407, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !404, file: !347, line: 172, baseType: !407, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !404, file: !347, line: 173, baseType: !407, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !404, file: !347, line: 174, baseType: !407, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !404, file: !347, line: 175, baseType: !407, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !404, file: !347, line: 176, baseType: !407, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !404, file: !347, line: 177, baseType: !407, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !404, file: !347, line: 178, baseType: !407, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !404, file: !347, line: 180, baseType: !407, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !404, file: !347, line: 181, baseType: !407, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !404, file: !347, line: 182, baseType: !407, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !401, file: !347, line: 185, baseType: !152, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !348, file: !347, line: 903, baseType: !425, size: 32, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !347, line: 247, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 226, size: 32, elements: !429)
!429 = !{!430, !448}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !428, file: !347, line: 245, baseType: !431, size: 32)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !428, file: !347, line: 227, size: 32, elements: !432)
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !431, file: !347, line: 228, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !431, file: !347, line: 229, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !431, file: !347, line: 230, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !431, file: !347, line: 231, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !431, file: !347, line: 232, baseType: !152, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !431, file: !347, line: 233, baseType: !152, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !431, file: !347, line: 234, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !431, file: !347, line: 235, baseType: !152, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !431, file: !347, line: 236, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !431, file: !347, line: 237, baseType: !152, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !431, file: !347, line: 238, baseType: !152, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !431, file: !347, line: 239, baseType: !152, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !431, file: !347, line: 241, baseType: !152, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !431, file: !347, line: 242, baseType: !152, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !431, file: !347, line: 243, baseType: !152, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !428, file: !347, line: 246, baseType: !152, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !348, file: !347, line: 904, baseType: !450, size: 16, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !347, line: 300, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 287, size: 16, elements: !453)
!453 = !{!454, !464}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !452, file: !347, line: 298, baseType: !455, size: 16)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !452, file: !347, line: 288, size: 16, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !455, file: !347, line: 290, baseType: !197, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !455, file: !347, line: 291, baseType: !197, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !455, file: !347, line: 293, baseType: !197, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !455, file: !347, line: 294, baseType: !197, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !455, file: !347, line: 295, baseType: !197, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !455, file: !347, line: 296, baseType: !197, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !455, file: !347, line: 297, baseType: !197, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !452, file: !347, line: 299, baseType: !197, size: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !348, file: !347, line: 905, baseType: !238, size: 16, offset: 144)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !348, file: !347, line: 906, baseType: !467, size: 16, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !347, line: 352, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 336, size: 16, elements: !470)
!470 = !{!471, !483}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !469, file: !347, line: 350, baseType: !472, size: 16)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !347, line: 337, size: 16, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !472, file: !347, line: 339, baseType: !197, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !472, file: !347, line: 340, baseType: !197, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !472, file: !347, line: 341, baseType: !197, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !472, file: !347, line: 342, baseType: !197, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !472, file: !347, line: 343, baseType: !197, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !472, file: !347, line: 344, baseType: !197, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !472, file: !347, line: 345, baseType: !197, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !472, file: !347, line: 346, baseType: !197, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !472, file: !347, line: 348, baseType: !197, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !469, file: !347, line: 351, baseType: !197, size: 16)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !348, file: !347, line: 907, baseType: !238, size: 16, offset: 176)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !348, file: !347, line: 908, baseType: !486, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !347, line: 398, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 381, size: 32, elements: !489)
!489 = !{!490, !501}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !488, file: !347, line: 396, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !347, line: 382, size: 32, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !491, file: !347, line: 384, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !491, file: !347, line: 385, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !491, file: !347, line: 386, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !491, file: !347, line: 388, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !491, file: !347, line: 389, baseType: !152, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !491, file: !347, line: 390, baseType: !152, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !491, file: !347, line: 392, baseType: !152, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !491, file: !347, line: 394, baseType: !152, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !488, file: !347, line: 397, baseType: !152, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !348, file: !347, line: 909, baseType: !503, size: 8, offset: 224)
!503 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !347, line: 433, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 426, size: 8, elements: !506)
!506 = !{!507, !512}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !505, file: !347, line: 431, baseType: !508, size: 8)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !505, file: !347, line: 427, size: 8, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !508, file: !347, line: 428, baseType: !195, size: 5, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !508, file: !347, line: 430, baseType: !195, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !505, file: !347, line: 432, baseType: !195, size: 8)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !348, file: !347, line: 910, baseType: !282, size: 24, offset: 232)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !348, file: !347, line: 911, baseType: !515, size: 32, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !347, line: 462, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 448, size: 32, elements: !518)
!518 = !{!519, !528}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !517, file: !347, line: 460, baseType: !520, size: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !517, file: !347, line: 449, size: 32, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !520, file: !347, line: 451, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !520, file: !347, line: 453, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !520, file: !347, line: 454, baseType: !152, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !520, file: !347, line: 455, baseType: !152, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !520, file: !347, line: 457, baseType: !152, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !520, file: !347, line: 459, baseType: !152, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !517, file: !347, line: 461, baseType: !152, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !348, file: !347, line: 912, baseType: !530, size: 16, offset: 288)
!530 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !347, line: 520, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 503, size: 16, elements: !533)
!533 = !{!534, !548}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !532, file: !347, line: 518, baseType: !535, size: 16)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !532, file: !347, line: 504, size: 16, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !535, file: !347, line: 506, baseType: !197, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !535, file: !347, line: 507, baseType: !197, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !535, file: !347, line: 508, baseType: !197, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !535, file: !347, line: 509, baseType: !197, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !535, file: !347, line: 510, baseType: !197, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !535, file: !347, line: 511, baseType: !197, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !535, file: !347, line: 512, baseType: !197, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !535, file: !347, line: 513, baseType: !197, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !535, file: !347, line: 514, baseType: !197, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !535, file: !347, line: 515, baseType: !197, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !535, file: !347, line: 516, baseType: !197, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !532, file: !347, line: 519, baseType: !197, size: 16)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !348, file: !347, line: 913, baseType: !238, size: 16, offset: 304)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !348, file: !347, line: 914, baseType: !551, size: 32, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !347, line: 559, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 552, size: 32, elements: !554)
!554 = !{!555, !561}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !553, file: !347, line: 557, baseType: !556, size: 32)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !553, file: !347, line: 553, size: 32, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !556, file: !347, line: 554, baseType: !152, size: 10, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !556, file: !347, line: 555, baseType: !152, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !556, file: !347, line: 556, baseType: !152, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !553, file: !347, line: 558, baseType: !152, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !348, file: !347, line: 915, baseType: !563, size: 32, offset: 352)
!563 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !347, line: 585, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 578, size: 32, elements: !566)
!566 = !{!567, !573}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !565, file: !347, line: 583, baseType: !568, size: 32)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !565, file: !347, line: 579, size: 32, elements: !569)
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !568, file: !347, line: 580, baseType: !152, size: 16, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !568, file: !347, line: 581, baseType: !152, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !568, file: !347, line: 582, baseType: !152, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !565, file: !347, line: 584, baseType: !152, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !348, file: !347, line: 916, baseType: !575, size: 8, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !347, line: 610, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 604, size: 8, elements: !578)
!578 = !{!579, !583}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !577, file: !347, line: 608, baseType: !580, size: 8)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !347, line: 605, size: 8, elements: !581)
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !580, file: !347, line: 607, baseType: !195, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !577, file: !347, line: 609, baseType: !195, size: 8)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !348, file: !347, line: 917, baseType: !282, size: 24, offset: 392)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !348, file: !347, line: 918, baseType: !586, size: 32, offset: 416)
!586 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !347, line: 639, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 622, size: 32, elements: !589)
!589 = !{!590, !601}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !588, file: !347, line: 637, baseType: !591, size: 32)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !347, line: 623, size: 32, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !591, file: !347, line: 625, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !591, file: !347, line: 626, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !591, file: !347, line: 627, baseType: !152, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !591, file: !347, line: 629, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !591, file: !347, line: 631, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !591, file: !347, line: 632, baseType: !152, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !591, file: !347, line: 634, baseType: !152, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !591, file: !347, line: 635, baseType: !152, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !588, file: !347, line: 638, baseType: !152, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !348, file: !347, line: 919, baseType: !603, size: 32, offset: 448)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 32, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 4)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !348, file: !347, line: 920, baseType: !607, size: 16, offset: 480)
!607 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !347, line: 715, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 706, size: 16, elements: !610)
!610 = !{!611, !616}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !609, file: !347, line: 713, baseType: !612, size: 16)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !609, file: !347, line: 707, size: 16, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !612, file: !347, line: 709, baseType: !197, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !612, file: !347, line: 711, baseType: !197, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !609, file: !347, line: 714, baseType: !197, size: 16)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !348, file: !347, line: 921, baseType: !238, size: 16, offset: 496)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !348, file: !347, line: 922, baseType: !619, size: 32, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !347, line: 739, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 729, size: 32, elements: !622)
!622 = !{!623, !629}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !621, file: !347, line: 737, baseType: !624, size: 32)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !621, file: !347, line: 730, size: 32, elements: !625)
!625 = !{!626, !627, !628}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !624, file: !347, line: 732, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !624, file: !347, line: 733, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !624, file: !347, line: 735, baseType: !152, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !621, file: !347, line: 738, baseType: !152, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !348, file: !347, line: 923, baseType: !631, size: 8, offset: 544)
!631 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !347, line: 765, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 756, size: 8, elements: !634)
!634 = !{!635, !641}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !633, file: !347, line: 763, baseType: !636, size: 8)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !633, file: !347, line: 757, size: 8, elements: !637)
!637 = !{!638, !639, !640}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !636, file: !347, line: 759, baseType: !195, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !636, file: !347, line: 761, baseType: !195, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !636, file: !347, line: 762, baseType: !195, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !633, file: !347, line: 764, baseType: !195, size: 8)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !348, file: !347, line: 924, baseType: !282, size: 24, offset: 552)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !348, file: !347, line: 925, baseType: !644, size: 32, offset: 576)
!644 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !347, line: 789, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 781, size: 32, elements: !647)
!647 = !{!648, !653}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !646, file: !347, line: 787, baseType: !649, size: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !347, line: 782, size: 32, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !649, file: !347, line: 783, baseType: !152, size: 12, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !649, file: !347, line: 785, baseType: !152, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !646, file: !347, line: 788, baseType: !152, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !348, file: !347, line: 926, baseType: !655, size: 32, offset: 608)
!655 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !347, line: 820, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 805, size: 32, elements: !658)
!658 = !{!659, !669}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !657, file: !347, line: 818, baseType: !660, size: 32)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !657, file: !347, line: 806, size: 32, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !660, file: !347, line: 807, baseType: !152, size: 2, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !660, file: !347, line: 808, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !660, file: !347, line: 809, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !660, file: !347, line: 810, baseType: !152, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !660, file: !347, line: 812, baseType: !152, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !660, file: !347, line: 814, baseType: !152, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !660, file: !347, line: 816, baseType: !152, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !657, file: !347, line: 819, baseType: !152, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !348, file: !347, line: 927, baseType: !671, size: 8, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !347, line: 881, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !347, line: 872, size: 8, elements: !675)
!675 = !{!676, !683}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !674, file: !347, line: 879, baseType: !677, size: 8)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !674, file: !347, line: 873, size: 8, elements: !678)
!678 = !{!679, !680, !681, !682}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !677, file: !347, line: 874, baseType: !195, size: 1, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !677, file: !347, line: 875, baseType: !195, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !677, file: !347, line: 876, baseType: !195, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !677, file: !347, line: 877, baseType: !195, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !674, file: !347, line: 880, baseType: !195, size: 8)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !687, line: 290, baseType: !688)
!687 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 284, size: 96, elements: !689)
!689 = !{!690, !700, !711, !724, !741}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !688, file: !687, line: 285, baseType: !691, size: 8)
!691 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !687, line: 49, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !687, line: 43, size: 8, elements: !694)
!694 = !{!695, !699}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !693, file: !687, line: 47, baseType: !696, size: 8)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !693, file: !687, line: 44, size: 8, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !696, file: !687, line: 45, baseType: !195, size: 1, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !693, file: !687, line: 48, baseType: !195, size: 8)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !688, file: !687, line: 286, baseType: !701, size: 8, offset: 8)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !687, line: 67, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !687, line: 61, size: 8, elements: !705)
!705 = !{!706, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !704, file: !687, line: 65, baseType: !707, size: 8)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !687, line: 62, size: 8, elements: !708)
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !707, file: !687, line: 64, baseType: !195, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !704, file: !687, line: 66, baseType: !195, size: 8)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !688, file: !687, line: 287, baseType: !712, size: 16, offset: 16)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !687, line: 89, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !687, line: 79, size: 16, elements: !715)
!715 = !{!716, !723}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !687, line: 87, baseType: !717, size: 16)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !687, line: 80, size: 16, elements: !718)
!718 = !{!719, !720, !721, !722}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !717, file: !687, line: 81, baseType: !197, size: 6, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !717, file: !687, line: 83, baseType: !197, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !717, file: !687, line: 85, baseType: !197, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !717, file: !687, line: 86, baseType: !197, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !687, line: 88, baseType: !197, size: 16)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !688, file: !687, line: 288, baseType: !725, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !687, line: 214, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !687, line: 199, size: 32, elements: !728)
!728 = !{!729, !740}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !727, file: !687, line: 212, baseType: !730, size: 32)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !727, file: !687, line: 200, size: 32, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !730, file: !687, line: 201, baseType: !152, size: 4, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !730, file: !687, line: 203, baseType: !152, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !730, file: !687, line: 205, baseType: !152, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !730, file: !687, line: 206, baseType: !152, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !730, file: !687, line: 207, baseType: !152, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !730, file: !687, line: 208, baseType: !152, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !730, file: !687, line: 209, baseType: !152, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !730, file: !687, line: 210, baseType: !152, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !727, file: !687, line: 213, baseType: !152, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !688, file: !687, line: 289, baseType: !742, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !687, line: 268, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !687, line: 260, size: 32, elements: !745)
!745 = !{!746, !751}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !744, file: !687, line: 266, baseType: !747, size: 32)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !744, file: !687, line: 261, size: 32, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !747, file: !687, line: 262, baseType: !152, size: 4, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !747, file: !687, line: 264, baseType: !152, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !744, file: !687, line: 267, baseType: !152, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !754, line: 513, baseType: !755)
!754 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !754, line: 494, size: 480, elements: !756)
!756 = !{!757, !763, !773, !777, !787, !797, !807, !817, !821, !837, !853, !869, !899, !903, !913, !923, !933, !937}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !755, file: !754, line: 495, baseType: !758, size: 8)
!758 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !754, line: 45, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !754, line: 43, size: 8, elements: !761)
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !760, file: !754, line: 44, baseType: !195, size: 8)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !755, file: !754, line: 496, baseType: !764, size: 8, offset: 8)
!764 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !754, line: 61, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !754, line: 55, size: 8, elements: !767)
!767 = !{!768, !772}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !766, file: !754, line: 59, baseType: !769, size: 8)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !766, file: !754, line: 56, size: 8, elements: !770)
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !769, file: !754, line: 57, baseType: !195, size: 2, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !766, file: !754, line: 60, baseType: !195, size: 8)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !755, file: !754, line: 497, baseType: !774, size: 48, offset: 16)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 48, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 6)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !755, file: !754, line: 498, baseType: !778, size: 8, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !754, line: 86, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !754, line: 80, size: 8, elements: !781)
!781 = !{!782, !786}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !780, file: !754, line: 84, baseType: !783, size: 8)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !780, file: !754, line: 81, size: 8, elements: !784)
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !783, file: !754, line: 82, baseType: !195, size: 3, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !780, file: !754, line: 85, baseType: !195, size: 8)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !755, file: !754, line: 499, baseType: !788, size: 8, offset: 72)
!788 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !754, line: 121, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !754, line: 115, size: 8, elements: !791)
!791 = !{!792, !796}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !790, file: !754, line: 119, baseType: !793, size: 8)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !790, file: !754, line: 116, size: 8, elements: !794)
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !793, file: !754, line: 117, baseType: !195, size: 3, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !790, file: !754, line: 120, baseType: !195, size: 8)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !755, file: !754, line: 500, baseType: !798, size: 8, offset: 80)
!798 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !754, line: 156, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !754, line: 150, size: 8, elements: !801)
!801 = !{!802, !806}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !800, file: !754, line: 154, baseType: !803, size: 8)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !754, line: 151, size: 8, elements: !804)
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !803, file: !754, line: 152, baseType: !195, size: 3, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !800, file: !754, line: 155, baseType: !195, size: 8)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !755, file: !754, line: 501, baseType: !808, size: 8, offset: 88)
!808 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !754, line: 191, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !754, line: 185, size: 8, elements: !811)
!811 = !{!812, !816}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !810, file: !754, line: 189, baseType: !813, size: 8)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !810, file: !754, line: 186, size: 8, elements: !814)
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !813, file: !754, line: 187, baseType: !195, size: 3, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !810, file: !754, line: 190, baseType: !195, size: 8)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !755, file: !754, line: 502, baseType: !818, size: 64, offset: 96)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 64, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 8)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !755, file: !754, line: 503, baseType: !822, size: 32, offset: 160)
!822 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !754, line: 232, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !754, line: 220, size: 32, elements: !825)
!825 = !{!826, !836}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !824, file: !754, line: 230, baseType: !827, size: 32)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !824, file: !754, line: 221, size: 32, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !834, !835}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !827, file: !754, line: 222, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !827, file: !754, line: 223, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !827, file: !754, line: 224, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !827, file: !754, line: 225, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !827, file: !754, line: 226, baseType: !152, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !827, file: !754, line: 227, baseType: !152, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !827, file: !754, line: 228, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !824, file: !754, line: 231, baseType: !152, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !755, file: !754, line: 504, baseType: !838, size: 32, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !754, line: 268, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !754, line: 256, size: 32, elements: !841)
!841 = !{!842, !852}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !840, file: !754, line: 266, baseType: !843, size: 32)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !754, line: 257, size: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !843, file: !754, line: 258, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !843, file: !754, line: 259, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !843, file: !754, line: 260, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !843, file: !754, line: 261, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !843, file: !754, line: 262, baseType: !152, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !843, file: !754, line: 263, baseType: !152, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !843, file: !754, line: 264, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !840, file: !754, line: 267, baseType: !152, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !755, file: !754, line: 505, baseType: !854, size: 32, offset: 224)
!854 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !754, line: 304, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !754, line: 292, size: 32, elements: !857)
!857 = !{!858, !868}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !856, file: !754, line: 302, baseType: !859, size: 32)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !856, file: !754, line: 293, size: 32, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !859, file: !754, line: 294, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !859, file: !754, line: 295, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !859, file: !754, line: 296, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !859, file: !754, line: 297, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !859, file: !754, line: 298, baseType: !152, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !859, file: !754, line: 299, baseType: !152, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !859, file: !754, line: 300, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !856, file: !754, line: 303, baseType: !152, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !755, file: !754, line: 506, baseType: !870, size: 32, offset: 256)
!870 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !754, line: 354, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !754, line: 328, size: 32, elements: !873)
!873 = !{!874, !898}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !872, file: !754, line: 352, baseType: !875, size: 32)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !872, file: !754, line: 329, size: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !875, file: !754, line: 330, baseType: !152, size: 1, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !875, file: !754, line: 331, baseType: !152, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !875, file: !754, line: 332, baseType: !152, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !875, file: !754, line: 333, baseType: !152, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !875, file: !754, line: 334, baseType: !152, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !875, file: !754, line: 335, baseType: !152, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !875, file: !754, line: 336, baseType: !152, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !875, file: !754, line: 337, baseType: !152, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !875, file: !754, line: 338, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !875, file: !754, line: 339, baseType: !152, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !875, file: !754, line: 340, baseType: !152, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !875, file: !754, line: 341, baseType: !152, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !875, file: !754, line: 342, baseType: !152, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !875, file: !754, line: 343, baseType: !152, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !875, file: !754, line: 344, baseType: !152, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !875, file: !754, line: 345, baseType: !152, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
