; ModuleID = 'build/adafruit_itsybitsy_m4_express/subsys/zbus/benchmark/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.zbus_observer = type { i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/zbus/benchmark/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/zbus/benchmark")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 149, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/zbus/benchmark")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8768, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 137)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4384, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_bm_channel", scope: !27, file: !114, line: 16, type: !136, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/zbus/benchmark")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !290, !292, !294, !296, !298, !300, !302, !304, !306, !339, !343, !348, !350, !357, !362}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "bm_channel", scope: !27, file: !114, line: 16, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 192, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !123, !125, !126, !134, !259}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !120, size: 16)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !124, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !13, !132}
!131 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 214, baseType: !32)
!133 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !135, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !137, line: 2720, size: 160, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !160, !257, !258}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !136, file: !137, line: 2722, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !141, line: 233, baseType: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 231, size: 64, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !142, file: !141, line: 232, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !146, line: 48, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !146, line: 37, size: 64, elements: !148)
!148 = !{!149, !155}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 38, baseType: !150, size: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 38, size: 32, elements: !151)
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !150, file: !146, line: 39, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !146, line: 40, baseType: !153, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 42, baseType: !156, size: 32, offset: 32)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 42, size: 32, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !156, file: !146, line: 43, baseType: !153, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !146, line: 44, baseType: !153, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !136, file: !137, line: 2724, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !163, line: 245, size: 1024, elements: !164)
!163 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = !{!165, !212, !225, !226, !227, !228, !234, !252}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !162, file: !163, line: 247, baseType: !166, size: 384)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !163, line: 57, size: 384, elements: !167)
!167 = !{!168, !182, !184, !187, !188, !199, !200, !201}
!168 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 60, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 60, size: 64, elements: !170)
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !169, file: !163, line: 61, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !146, line: 49, baseType: !147)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !169, file: !163, line: 62, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !175, line: 49, size: 64, elements: !176)
!175 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !174, file: !175, line: 50, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!180 = !{!181}
!181 = !DISubrange(count: 2)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !166, file: !163, line: 68, baseType: !183, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !166, file: !163, line: 71, baseType: !185, size: 8, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !186)
!186 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !166, file: !163, line: 74, baseType: !185, size: 8, offset: 104)
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 90, baseType: !189, size: 16, offset: 112)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 90, size: 16, elements: !190)
!190 = !{!191, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !163, line: 91, baseType: !192, size: 16)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !163, line: 91, size: 16, elements: !193)
!193 = !{!194, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !192, file: !163, line: 96, baseType: !195, size: 8)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !196)
!196 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !192, file: !163, line: 97, baseType: !185, size: 8, offset: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !189, file: !163, line: 100, baseType: !121, size: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !166, file: !163, line: 107, baseType: !108, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !166, file: !163, line: 127, baseType: !102, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !166, file: !163, line: 131, baseType: !202, size: 192, offset: 192)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !141, line: 244, size: 192, elements: !203)
!203 = !{!204, !205, !211}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !202, file: !141, line: 245, baseType: !172, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !202, file: !141, line: 246, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !141, line: 242, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !202, file: !141, line: 249, baseType: !106, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !162, file: !163, line: 250, baseType: !213, size: 288, offset: 384)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !214, line: 25, size: 288, elements: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !213, file: !214, line: 26, baseType: !108, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !213, file: !214, line: 27, baseType: !108, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !213, file: !214, line: 28, baseType: !108, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !213, file: !214, line: 29, baseType: !108, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !213, file: !214, line: 30, baseType: !108, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !213, file: !214, line: 31, baseType: !108, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !213, file: !214, line: 32, baseType: !108, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !213, file: !214, line: 33, baseType: !108, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !213, file: !214, line: 34, baseType: !108, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !162, file: !163, line: 253, baseType: !102, size: 32, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !162, file: !163, line: 256, baseType: !140, size: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !162, file: !163, line: 294, baseType: !103, size: 32, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !162, file: !163, line: 300, baseType: !229, size: 96, offset: 800)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !163, line: 149, size: 96, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !229, file: !163, line: 153, baseType: !22, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !163, line: 162, baseType: !132, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !229, file: !163, line: 168, baseType: !132, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !162, file: !163, line: 325, baseType: !235, size: 32, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !137, line: 5073, size: 160, elements: !237)
!237 = !{!238, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !236, file: !137, line: 5074, baseType: !239, size: 96)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !240, line: 57, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !240, line: 57, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !239, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !239, file: !240, line: 59, baseType: !132, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !236, file: !137, line: 5075, baseType: !140, size: 64, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !236, file: !137, line: 5076, baseType: !249, offset: 160)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !162, file: !163, line: 343, baseType: !253, size: 64, offset: 928)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !214, line: 60, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !253, file: !214, line: 63, baseType: !108, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !253, file: !214, line: 66, baseType: !108, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !136, file: !137, line: 2727, baseType: !108, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !136, file: !137, line: 2730, baseType: !103, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !260, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 96, elements: !265)
!265 = !{!266, !267, !284}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !264, file: !117, line: 91, baseType: !131, size: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !264, file: !117, line: 93, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !137, line: 4204, size: 320, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !279, !280, !281, !282, !283}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !270, file: !137, line: 4206, baseType: !140, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !270, file: !137, line: 4208, baseType: !249, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !270, file: !137, line: 4210, baseType: !132, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !270, file: !137, line: 4212, baseType: !108, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !270, file: !137, line: 4214, baseType: !277, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !270, file: !137, line: 4216, baseType: !277, size: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !270, file: !137, line: 4218, baseType: !277, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !270, file: !137, line: 4220, baseType: !277, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !270, file: !137, line: 4222, baseType: !108, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !270, file: !137, line: 4227, baseType: !185, size: 8, offset: 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !264, file: !117, line: 96, baseType: !285, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "s1", scope: !27, file: !114, line: 126, type: !264, isLocal: false, isDefinition: true, align: 32)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "s2", scope: !27, file: !114, line: 129, type: !264, isLocal: false, isDefinition: true, align: 32)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "s3", scope: !27, file: !114, line: 131, type: !264, isLocal: false, isDefinition: true, align: 32)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "s4", scope: !27, file: !114, line: 132, type: !264, isLocal: false, isDefinition: true, align: 32)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "s5", scope: !27, file: !114, line: 134, type: !264, isLocal: false, isDefinition: true, align: 32)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "s6", scope: !27, file: !114, line: 135, type: !264, isLocal: false, isDefinition: true, align: 32)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "s7", scope: !27, file: !114, line: 136, type: !264, isLocal: false, isDefinition: true, align: 32)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "s8", scope: !27, file: !114, line: 137, type: !264, isLocal: false, isDefinition: true, align: 32)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "_k_thread_data_producer_thread_id", scope: !27, file: !114, line: 216, type: !308, isLocal: false, isDefinition: true, align: 32)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !137, line: 620, size: 384, elements: !309)
!309 = !{!310, !311, !319, !320, !325, !326, !327, !328, !329, !330, !332, !336}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !308, file: !137, line: 621, baseType: !161, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !308, file: !137, line: 622, baseType: !312, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !314, line: 44, baseType: !315)
!314 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !316, line: 47, size: 8, elements: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !316, line: 48, baseType: !278, size: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !308, file: !137, line: 623, baseType: !32, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !308, file: !137, line: 624, baseType: !321, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !314, line: 46, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !102, !102, !102}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !308, file: !137, line: 625, baseType: !102, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !308, file: !137, line: 626, baseType: !102, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !308, file: !137, line: 627, baseType: !102, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !308, file: !137, line: 628, baseType: !103, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !308, file: !137, line: 629, baseType: !108, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !308, file: !137, line: 630, baseType: !331, size: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !308, file: !137, line: 631, baseType: !333, size: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{null}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !308, file: !137, line: 632, baseType: !337, size: 32, offset: 352)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "producer_thread_id", scope: !27, file: !114, line: 216, type: !341, isLocal: false, isDefinition: true)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !163, line: 347, baseType: !161)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "_k_thread_stack_producer_thread_id", scope: !27, file: !114, line: 216, type: !345, isLocal: false, isDefinition: true, align: 64)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 8192, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 1024)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_k_thread_obj_producer_thread_id", scope: !27, file: !114, line: 216, type: !162, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "_zbus_message_bm_channel", scope: !27, file: !114, line: 16, type: !352, isLocal: true, isDefinition: true)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_data_msg", file: !353, line: 10, size: 64, elements: !354)
!353 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !352, file: !353, line: 11, baseType: !102, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !352, file: !353, line: 12, baseType: !132, size: 32, offset: 32)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "_zbus_observers_bm_channel", scope: !27, file: !114, line: 16, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 288, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 9)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 44, type: !109, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !366, file: !381, line: 18, type: !382, isLocal: false, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !368, globals: !380, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/zbus/benchmark")
!368 = !{!22, !102, !24, !369, !371, !373, !132, !103, !374, !375, !377, !378, !277, !379, !121, !337}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!380 = !{!364}
!381 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !385)
!384 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !384, line: 17, baseType: !337, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !383, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "_char_out", scope: !390, file: !394, line: 54, type: !395, isLocal: false, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !392, globals: !393, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/zbus/benchmark")
!392 = !{!102, !103}
!393 = !{!388}
!394 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!103, !103}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !400, file: !935, line: 149, type: !936, isLocal: true, isDefinition: true, align: 32)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !402, globals: !934, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/zbus/benchmark")
!402 = !{!102, !103, !403, !537, !622}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cmcc", file: !405, line: 352, baseType: !406)
!405 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/cmcc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 339, size: 448, elements: !407)
!407 = !{!408, !424, !436, !446, !457, !467, !475, !485, !496, !506, !516, !526}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !406, file: !405, line: 340, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_TYPE_Type", file: !405, line: 57, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 44, size: 32, elements: !413)
!413 = !{!414, !423}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !412, file: !405, line: 55, baseType: !415, size: 32)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !412, file: !405, line: 45, size: 32, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK", scope: !415, file: !405, line: 47, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "RRP", scope: !415, file: !405, line: 49, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "WAYNUM", scope: !415, file: !405, line: 50, baseType: !108, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "LCKDOWN", scope: !415, file: !405, line: 51, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZE", scope: !415, file: !405, line: 52, baseType: !108, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "CLSIZE", scope: !415, file: !405, line: 53, baseType: !108, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !412, file: !405, line: 56, baseType: !108, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "CFG", scope: !406, file: !405, line: 341, baseType: !425, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CFG_Type", file: !405, line: 124, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 114, size: 32, elements: !428)
!428 = !{!429, !435}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !427, file: !405, line: 122, baseType: !430, size: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !405, line: 115, size: 32, elements: !431)
!431 = !{!432, !433, !434}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ICDIS", scope: !430, file: !405, line: 117, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "DCDIS", scope: !430, file: !405, line: 118, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZESW", scope: !430, file: !405, line: 120, baseType: !108, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !427, file: !405, line: 123, baseType: !108, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !406, file: !405, line: 342, baseType: !437, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CTRL_Type", file: !405, line: 161, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 155, size: 32, elements: !440)
!440 = !{!441, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !439, file: !405, line: 159, baseType: !442, size: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !405, line: 156, size: 32, elements: !443)
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !442, file: !405, line: 157, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !439, file: !405, line: 160, baseType: !108, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !406, file: !405, line: 343, baseType: !447, size: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_SR_Type", file: !405, line: 179, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 173, size: 32, elements: !451)
!451 = !{!452, !456}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !450, file: !405, line: 177, baseType: !453, size: 32)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !450, file: !405, line: 174, size: 32, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "CSTS", scope: !453, file: !405, line: 175, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !450, file: !405, line: 178, baseType: !108, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !406, file: !405, line: 344, baseType: !458, size: 32, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_LCKWAY_Type", file: !405, line: 197, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 191, size: 32, elements: !461)
!461 = !{!462, !466}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !460, file: !405, line: 195, baseType: !463, size: 32)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !405, line: 192, size: 32, elements: !464)
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !463, file: !405, line: 193, baseType: !108, size: 4, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !460, file: !405, line: 196, baseType: !108, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !406, file: !405, line: 345, baseType: !468, size: 96, offset: 160)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 96, elements: !473)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !470, line: 53, baseType: !471)
!470 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/samd51g19a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !185)
!473 = !{!474}
!474 = !DISubrange(count: 12)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT0", scope: !406, file: !405, line: 346, baseType: !476, size: 32, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT0_Type", file: !405, line: 216, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 210, size: 32, elements: !479)
!479 = !{!480, !484}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !478, file: !405, line: 214, baseType: !481, size: 32)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !478, file: !405, line: 211, size: 32, elements: !482)
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "INVALL", scope: !481, file: !405, line: 212, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !478, file: !405, line: 215, baseType: !108, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT1", scope: !406, file: !405, line: 347, baseType: !486, size: 32, offset: 288)
!486 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT1_Type", file: !405, line: 236, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 228, size: 32, elements: !489)
!489 = !{!490, !495}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !488, file: !405, line: 234, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !405, line: 229, size: 32, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "INDEX", scope: !491, file: !405, line: 231, baseType: !108, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "WAY", scope: !491, file: !405, line: 233, baseType: !108, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !488, file: !405, line: 235, baseType: !108, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "MCFG", scope: !406, file: !405, line: 348, baseType: !497, size: 32, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCFG_Type", file: !405, line: 266, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 260, size: 32, elements: !500)
!500 = !{!501, !505}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !499, file: !405, line: 264, baseType: !502, size: 32)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !499, file: !405, line: 261, size: 32, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !502, file: !405, line: 262, baseType: !108, size: 2, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !499, file: !405, line: 265, baseType: !108, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "MEN", scope: !406, file: !405, line: 349, baseType: !507, size: 32, offset: 352)
!507 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MEN_Type", file: !405, line: 291, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 285, size: 32, elements: !510)
!510 = !{!511, !515}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !509, file: !405, line: 289, baseType: !512, size: 32)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !405, line: 286, size: 32, elements: !513)
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "MENABLE", scope: !512, file: !405, line: 287, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !509, file: !405, line: 290, baseType: !108, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "MCTRL", scope: !406, file: !405, line: 350, baseType: !517, size: 32, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCTRL_Type", file: !405, line: 309, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 303, size: 32, elements: !520)
!520 = !{!521, !525}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !519, file: !405, line: 307, baseType: !522, size: 32)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !519, file: !405, line: 304, size: 32, elements: !523)
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !522, file: !405, line: 305, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !519, file: !405, line: 308, baseType: !108, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !406, file: !405, line: 351, baseType: !527, size: 32, offset: 416)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MSR_Type", file: !405, line: 326, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 321, size: 32, elements: !531)
!531 = !{!532, !536}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !530, file: !405, line: 324, baseType: !533, size: 32)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !530, file: !405, line: 322, size: 32, elements: !534)
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "EVENT_CNT", scope: !533, file: !405, line: 323, baseType: !108, size: 32, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !530, file: !405, line: 325, baseType: !108, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !539, line: 267, baseType: !540)
!539 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 259, size: 2560, elements: !541)
!541 = !{!542, !552, !556, !583, !587, !605, !609}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !540, file: !539, line: 260, baseType: !543, size: 8)
!543 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRLA_Type", file: !539, line: 50, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !539, line: 44, size: 8, elements: !546)
!546 = !{!547, !551}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !545, file: !539, line: 48, baseType: !548, size: 8)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !545, file: !539, line: 45, size: 8, elements: !549)
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !548, file: !539, line: 46, baseType: !185, size: 1, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !545, file: !539, line: 49, baseType: !185, size: 8)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !540, file: !539, line: 261, baseType: !553, size: 24, offset: 8)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 24, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 3)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !540, file: !539, line: 262, baseType: !557, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_SYNCBUSY_Type", file: !539, line: 86, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !539, line: 62, size: 32, elements: !561)
!561 = !{!562, !578, !582}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !560, file: !539, line: 79, baseType: !563, size: 32)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !539, line: 63, size: 32, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !563, file: !539, line: 64, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL0", scope: !563, file: !539, line: 66, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL1", scope: !563, file: !539, line: 67, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL2", scope: !563, file: !539, line: 68, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL3", scope: !563, file: !539, line: 69, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL4", scope: !563, file: !539, line: 70, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL5", scope: !563, file: !539, line: 71, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL6", scope: !563, file: !539, line: 72, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL7", scope: !563, file: !539, line: 73, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL8", scope: !563, file: !539, line: 74, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL9", scope: !563, file: !539, line: 75, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL10", scope: !563, file: !539, line: 76, baseType: !108, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL11", scope: !563, file: !539, line: 77, baseType: !108, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !560, file: !539, line: 84, baseType: !579, size: 32)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !539, line: 80, size: 32, elements: !580)
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !579, file: !539, line: 82, baseType: !108, size: 12, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !560, file: !539, line: 85, baseType: !108, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !540, file: !539, line: 263, baseType: !584, size: 192, offset: 64)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 192, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 24)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !540, file: !539, line: 264, baseType: !588, size: 384, offset: 256)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 384, elements: !473)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !539, line: 163, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !539, line: 149, size: 32, elements: !592)
!592 = !{!593, !604}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !591, file: !539, line: 161, baseType: !594, size: 32)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !591, file: !539, line: 150, size: 32, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !594, file: !539, line: 151, baseType: !108, size: 4, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !594, file: !539, line: 153, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !594, file: !539, line: 154, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !594, file: !539, line: 155, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !594, file: !539, line: 156, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !594, file: !539, line: 157, baseType: !108, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !594, file: !539, line: 158, baseType: !108, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !594, file: !539, line: 160, baseType: !108, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !591, file: !539, line: 162, baseType: !108, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !540, file: !539, line: 265, baseType: !606, size: 384, offset: 640)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 384, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 48)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "PCHCTRL", scope: !540, file: !539, line: 266, baseType: !610, size: 1536, offset: 1024)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 1536, elements: !607)
!611 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_PCHCTRL_Type", file: !539, line: 218, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !539, line: 209, size: 32, elements: !614)
!614 = !{!615, !621}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !613, file: !539, line: 216, baseType: !616, size: 32)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !613, file: !539, line: 210, size: 32, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !616, file: !539, line: 211, baseType: !108, size: 4, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "CHEN", scope: !616, file: !539, line: 213, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !616, file: !539, line: 214, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !613, file: !539, line: 217, baseType: !108, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "Oscctrl", file: !624, line: 788, baseType: !625)
!624 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/oscctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !624, line: 771, size: 704, elements: !626)
!626 = !{!627, !642, !643, !674, !705, !738, !773, !795, !807, !808, !825, !826, !838, !850, !863, !864}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "EVCTRL", scope: !625, file: !624, line: 772, baseType: !628, size: 8)
!628 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_EVCTRL_Type", file: !624, line: 55, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 44, size: 8, elements: !631)
!631 = !{!632, !637, !641}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !630, file: !624, line: 49, baseType: !633, size: 8)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !630, file: !624, line: 45, size: 8, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO0", scope: !633, file: !624, line: 46, baseType: !185, size: 1, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO1", scope: !633, file: !624, line: 47, baseType: !185, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !630, file: !624, line: 53, baseType: !638, size: 8)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !630, file: !624, line: 50, size: 8, elements: !639)
!639 = !{!640}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO", scope: !638, file: !624, line: 51, baseType: !185, size: 2, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !630, file: !624, line: 54, baseType: !185, size: 8)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !625, file: !624, line: 773, baseType: !553, size: 24, offset: 8)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !625, file: !624, line: 774, baseType: !644, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENCLR_Type", file: !624, line: 102, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 72, size: 32, elements: !647)
!647 = !{!648, !668, !673}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !646, file: !624, line: 95, baseType: !649, size: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !624, line: 73, size: 32, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !649, file: !624, line: 74, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !649, file: !624, line: 75, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !649, file: !624, line: 76, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !649, file: !624, line: 77, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !649, file: !624, line: 79, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !649, file: !624, line: 80, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !649, file: !624, line: 81, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !649, file: !624, line: 82, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !649, file: !624, line: 83, baseType: !108, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !649, file: !624, line: 85, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !649, file: !624, line: 86, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !649, file: !624, line: 87, baseType: !108, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !649, file: !624, line: 88, baseType: !108, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !649, file: !624, line: 90, baseType: !108, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !649, file: !624, line: 91, baseType: !108, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !649, file: !624, line: 92, baseType: !108, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !649, file: !624, line: 93, baseType: !108, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !646, file: !624, line: 100, baseType: !669, size: 32)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !624, line: 96, size: 32, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !669, file: !624, line: 97, baseType: !108, size: 2, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !669, file: !624, line: 98, baseType: !108, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !646, file: !624, line: 101, baseType: !108, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !625, file: !624, line: 775, baseType: !675, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENSET_Type", file: !624, line: 182, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 152, size: 32, elements: !678)
!678 = !{!679, !699, !704}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !677, file: !624, line: 175, baseType: !680, size: 32)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !624, line: 153, size: 32, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !680, file: !624, line: 154, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !680, file: !624, line: 155, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !680, file: !624, line: 156, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !680, file: !624, line: 157, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !680, file: !624, line: 159, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !680, file: !624, line: 160, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !680, file: !624, line: 161, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !680, file: !624, line: 162, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !680, file: !624, line: 163, baseType: !108, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !680, file: !624, line: 165, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !680, file: !624, line: 166, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !680, file: !624, line: 167, baseType: !108, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !680, file: !624, line: 168, baseType: !108, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !680, file: !624, line: 170, baseType: !108, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !680, file: !624, line: 171, baseType: !108, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !680, file: !624, line: 172, baseType: !108, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !680, file: !624, line: 173, baseType: !108, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !677, file: !624, line: 180, baseType: !700, size: 32)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !624, line: 176, size: 32, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !700, file: !624, line: 177, baseType: !108, size: 2, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !700, file: !624, line: 178, baseType: !108, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !677, file: !624, line: 181, baseType: !108, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !625, file: !624, line: 776, baseType: !706, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTFLAG_Type", file: !624, line: 262, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 232, size: 32, elements: !709)
!709 = !{!710, !732, !737}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !708, file: !624, line: 255, baseType: !711, size: 32)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !708, file: !624, line: 233, size: 32, elements: !712)
!712 = !{!713, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !711, file: !624, line: 234, baseType: !714, size: 1, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !711, file: !624, line: 235, baseType: !714, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !711, file: !624, line: 236, baseType: !714, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !711, file: !624, line: 237, baseType: !714, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !711, file: !624, line: 239, baseType: !714, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !711, file: !624, line: 240, baseType: !714, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !711, file: !624, line: 241, baseType: !714, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !711, file: !624, line: 242, baseType: !714, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !711, file: !624, line: 243, baseType: !714, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !711, file: !624, line: 245, baseType: !714, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !711, file: !624, line: 246, baseType: !714, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !711, file: !624, line: 247, baseType: !714, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !711, file: !624, line: 248, baseType: !714, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !711, file: !624, line: 250, baseType: !714, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !711, file: !624, line: 251, baseType: !714, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !711, file: !624, line: 252, baseType: !714, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !711, file: !624, line: 253, baseType: !714, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !708, file: !624, line: 260, baseType: !733, size: 32)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !708, file: !624, line: 256, size: 32, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !733, file: !624, line: 257, baseType: !714, size: 2, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !733, file: !624, line: 258, baseType: !714, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !708, file: !624, line: 261, baseType: !108, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !625, file: !624, line: 777, baseType: !739, size: 32, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_STATUS_Type", file: !624, line: 345, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 312, size: 32, elements: !743)
!743 = !{!744, !766, !772}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !742, file: !624, line: 337, baseType: !745, size: 32)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !742, file: !624, line: 313, size: 32, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !745, file: !624, line: 314, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !745, file: !624, line: 315, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !745, file: !624, line: 316, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !745, file: !624, line: 317, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW0", scope: !745, file: !624, line: 318, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW1", scope: !745, file: !624, line: 319, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !745, file: !624, line: 321, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !745, file: !624, line: 322, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !745, file: !624, line: 323, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !745, file: !624, line: 324, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !745, file: !624, line: 325, baseType: !108, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !745, file: !624, line: 327, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !745, file: !624, line: 328, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0TO", scope: !745, file: !624, line: 329, baseType: !108, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !745, file: !624, line: 330, baseType: !108, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !745, file: !624, line: 332, baseType: !108, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !745, file: !624, line: 333, baseType: !108, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1TO", scope: !745, file: !624, line: 334, baseType: !108, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !745, file: !624, line: 335, baseType: !108, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !742, file: !624, line: 343, baseType: !767, size: 32)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !742, file: !624, line: 338, size: 32, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !767, file: !624, line: 339, baseType: !108, size: 2, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !767, file: !624, line: 340, baseType: !108, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW", scope: !767, file: !624, line: 341, baseType: !108, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !742, file: !624, line: 344, baseType: !108, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCTRL", scope: !625, file: !624, line: 778, baseType: !774, size: 64, offset: 160)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 64, elements: !180)
!775 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_XOSCCTRL_Type", file: !624, line: 422, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 402, size: 32, elements: !778)
!778 = !{!779, !794}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !777, file: !624, line: 420, baseType: !780, size: 32)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !777, file: !624, line: 403, size: 32, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !780, file: !624, line: 405, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !780, file: !624, line: 406, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !780, file: !624, line: 408, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !780, file: !624, line: 409, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "LOWBUFGAIN", scope: !780, file: !624, line: 410, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "IPTAT", scope: !780, file: !624, line: 411, baseType: !108, size: 2, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "IMULT", scope: !780, file: !624, line: 412, baseType: !108, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ENALC", scope: !780, file: !624, line: 413, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEN", scope: !780, file: !624, line: 414, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "SWBEN", scope: !780, file: !624, line: 415, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !780, file: !624, line: 417, baseType: !108, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "CFDPRESC", scope: !780, file: !624, line: 418, baseType: !108, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !777, file: !624, line: 421, baseType: !108, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLA", scope: !625, file: !624, line: 779, baseType: !796, size: 8, offset: 224)
!796 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLA_Type", file: !624, line: 469, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 460, size: 8, elements: !799)
!799 = !{!800, !806}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !798, file: !624, line: 467, baseType: !801, size: 8)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !798, file: !624, line: 461, size: 8, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !801, file: !624, line: 463, baseType: !185, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !801, file: !624, line: 465, baseType: !185, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !801, file: !624, line: 466, baseType: !185, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !798, file: !624, line: 468, baseType: !185, size: 8)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !625, file: !624, line: 780, baseType: !553, size: 24, offset: 232)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !625, file: !624, line: 781, baseType: !809, size: 8, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLB_Type", file: !624, line: 497, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 485, size: 8, elements: !812)
!812 = !{!813, !824}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !811, file: !624, line: 495, baseType: !814, size: 8)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !811, file: !624, line: 486, size: 8, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !814, file: !624, line: 487, baseType: !185, size: 1, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !814, file: !624, line: 488, baseType: !185, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !814, file: !624, line: 489, baseType: !185, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !814, file: !624, line: 490, baseType: !185, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !814, file: !624, line: 491, baseType: !185, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !814, file: !624, line: 492, baseType: !185, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !814, file: !624, line: 493, baseType: !185, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !814, file: !624, line: 494, baseType: !185, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !811, file: !624, line: 496, baseType: !185, size: 8)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !625, file: !624, line: 782, baseType: !553, size: 24, offset: 264)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !625, file: !624, line: 783, baseType: !827, size: 32, offset: 288)
!827 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLVAL_Type", file: !624, line: 531, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 523, size: 32, elements: !830)
!830 = !{!831, !837}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !829, file: !624, line: 529, baseType: !832, size: 32)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !829, file: !624, line: 524, size: 32, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !832, file: !624, line: 525, baseType: !108, size: 8, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !832, file: !624, line: 527, baseType: !108, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !832, file: !624, line: 528, baseType: !108, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !829, file: !624, line: 530, baseType: !108, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !625, file: !624, line: 784, baseType: !839, size: 32, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLMUL_Type", file: !624, line: 558, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 550, size: 32, elements: !842)
!842 = !{!843, !849}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !841, file: !624, line: 556, baseType: !844, size: 32)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !841, file: !624, line: 551, size: 32, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !844, file: !624, line: 552, baseType: !108, size: 16, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !844, file: !624, line: 553, baseType: !108, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !844, file: !624, line: 555, baseType: !108, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !841, file: !624, line: 557, baseType: !108, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !625, file: !624, line: 785, baseType: !851, size: 8, offset: 352)
!851 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLSYNC_Type", file: !624, line: 587, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 577, size: 8, elements: !854)
!854 = !{!855, !862}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !853, file: !624, line: 585, baseType: !856, size: 8)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !853, file: !624, line: 578, size: 8, elements: !857)
!857 = !{!858, !859, !860, !861}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !856, file: !624, line: 580, baseType: !185, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !856, file: !624, line: 581, baseType: !185, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !856, file: !624, line: 582, baseType: !185, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !856, file: !624, line: 583, baseType: !185, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !853, file: !624, line: 586, baseType: !185, size: 8)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !625, file: !624, line: 786, baseType: !553, size: 24, offset: 360)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Dpll", scope: !625, file: !624, line: 787, baseType: !865, size: 320, offset: 384)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 320, elements: !180)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "OscctrlDpll", file: !624, line: 766, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !624, line: 759, size: 160, elements: !868)
!868 = !{!869, !881, !882, !893, !910, !922}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !867, file: !624, line: 760, baseType: !870, size: 8)
!870 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLA_Type", file: !624, line: 614, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 605, size: 8, elements: !873)
!873 = !{!874, !880}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !872, file: !624, line: 612, baseType: !875, size: 8)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !872, file: !624, line: 606, size: 8, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !875, file: !624, line: 608, baseType: !185, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !875, file: !624, line: 610, baseType: !185, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !875, file: !624, line: 611, baseType: !185, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !872, file: !624, line: 613, baseType: !185, size: 8)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !867, file: !624, line: 761, baseType: !553, size: 24, offset: 8)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !867, file: !624, line: 762, baseType: !883, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLRATIO_Type", file: !624, line: 638, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 630, size: 32, elements: !886)
!886 = !{!887, !892}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !885, file: !624, line: 636, baseType: !888, size: 32)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !885, file: !624, line: 631, size: 32, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !888, file: !624, line: 632, baseType: !108, size: 13, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !888, file: !624, line: 634, baseType: !108, size: 5, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !885, file: !624, line: 637, baseType: !108, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !867, file: !624, line: 763, baseType: !894, size: 32, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLB_Type", file: !624, line: 667, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !624, line: 654, size: 32, elements: !897)
!897 = !{!898, !909}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !896, file: !624, line: 665, baseType: !899, size: 32)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !896, file: !624, line: 655, size: 32, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !899, file: !624, line: 656, baseType: !108, size: 4, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !899, file: !624, line: 657, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !899, file: !624, line: 658, baseType: !108, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !899, file: !624, line: 659, baseType: !108, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !899, file: !624, line: 660, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "DCOFILTER", scope: !899, file: !624, line: 661, baseType: !108, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "DCOEN", scope: !899, file: !624, line: 662, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !899, file: !624, line: 663, baseType: !108, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !896, file: !624, line: 666, baseType: !108, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSYNCBUSY", scope: !867, file: !624, line: 764, baseType: !911, size: 32, offset: 96)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSYNCBUSY_Type", file: !624, line: 724, baseType: !914)
