; ModuleID = 'build/adafruit_itsybitsy_m4_express/subsys/usb/console/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.common_descriptor = type <{ %struct.usb_device_descriptor, %struct.usb_cfg_descriptor }>
%struct.usb_device_descriptor = type { i8, i8, i16, i8, i8, i8, i8, i16, i16, i16, i8, i8, i8, i8 }
%struct.usb_cfg_descriptor = type <{ i8, i8, i16, i8, i8, i8, i8, i8 }>
%struct.usb_string_desription = type { %struct.usb_string_descriptor, %struct.usb_mfr_descriptor, %struct.usb_product_descriptor, %struct.usb_sn_descriptor }
%struct.usb_string_descriptor = type { i8, i8, i16 }
%struct.usb_mfr_descriptor = type { i8, i8, [12 x i8] }
%struct.usb_product_descriptor = type { i8, i8, [50 x i8] }
%struct.usb_sn_descriptor = type { i8, i8, [32 x i8] }
%struct.device_state = type { i8, i8 }
%struct.usb_cdc_acm_config = type { %struct.usb_association_descriptor, %struct.usb_if_descriptor, %struct.cdc_header_descriptor, %struct.cdc_cm_descriptor, %struct.cdc_acm_descriptor, %struct.cdc_cm_descriptor, %struct.usb_ep_descriptor, %struct.usb_if_descriptor, %struct.usb_ep_descriptor, %struct.usb_ep_descriptor }
%struct.usb_association_descriptor = type { i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.cdc_header_descriptor = type <{ i8, i8, i8, i16 }>
%struct.cdc_acm_descriptor = type { i8, i8, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/usb/console/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/usb/console")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 149, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/usb/console")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8768, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 137)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4384, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/usb/console")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_bossa_init", scope: !111, file: !161, line: 58, type: !162, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !160, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./bossa.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/usb/console")
!113 = !{!102, !114, !115, !116}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !118, line: 468, baseType: !119)
!118 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 445, size: 1120, elements: !120)
!120 = !{!121, !124, !125, !126, !127, !128, !129, !136, !137, !138, !139, !140, !141, !142, !143, !147, !148, !149, !153, !157, !159}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !119, file: !118, line: 447, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !115)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !119, file: !118, line: 448, baseType: !123, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !119, file: !118, line: 449, baseType: !123, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !119, file: !118, line: 450, baseType: !123, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !119, file: !118, line: 451, baseType: !123, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !119, file: !118, line: 452, baseType: !123, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !119, file: !118, line: 453, baseType: !130, size: 96, offset: 192)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 96, elements: !134)
!131 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !133)
!133 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!134 = !{!135}
!135 = !DISubrange(count: 12)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !119, file: !118, line: 454, baseType: !123, size: 32, offset: 288)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !119, file: !118, line: 455, baseType: !123, size: 32, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !119, file: !118, line: 456, baseType: !123, size: 32, offset: 352)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !119, file: !118, line: 457, baseType: !123, size: 32, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !119, file: !118, line: 458, baseType: !123, size: 32, offset: 416)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !119, file: !118, line: 459, baseType: !123, size: 32, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !119, file: !118, line: 460, baseType: !123, size: 32, offset: 480)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !119, file: !118, line: 461, baseType: !144, size: 64, offset: 512)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 64, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 2)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !119, file: !118, line: 462, baseType: !122, size: 32, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !119, file: !118, line: 463, baseType: !122, size: 32, offset: 608)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !119, file: !118, line: 464, baseType: !150, size: 128, offset: 640)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 128, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 4)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !119, file: !118, line: 465, baseType: !154, size: 160, offset: 768)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 160, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 5)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !119, file: !118, line: 466, baseType: !158, size: 160, offset: 928)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 160, elements: !155)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !119, file: !118, line: 467, baseType: !123, size: 32, offset: 1088)
!160 = !{!109}
!161 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/bossa.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !164, line: 51, size: 64, elements: !165)
!164 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!165 = !{!166, !195}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !163, file: !164, line: 60, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{!103, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !173, line: 378, size: 192, elements: !174)
!173 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !{!175, !179, !180, !181, !188, !189}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !173, line: 380, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !172, file: !173, line: 382, baseType: !13, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !172, file: !173, line: 384, baseType: !13, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !172, file: !173, line: 386, baseType: !182, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !173, line: 351, size: 16, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !183, file: !173, line: 359, baseType: !132, size: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !183, file: !173, line: 364, baseType: !187, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!187 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !172, file: !173, line: 388, baseType: !102, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !172, file: !173, line: 396, baseType: !190, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !173, line: 43, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !194)
!194 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !163, file: !164, line: 65, baseType: !170, size: 32, offset: 32)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !198, file: !728, line: 149, type: !729, isLocal: true, isDefinition: true, align: 32)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !200, globals: !727, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/usb/console")
!200 = !{!102, !103, !201, !332, !417}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cmcc", file: !203, line: 352, baseType: !204)
!203 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/cmcc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 339, size: 448, elements: !205)
!205 = !{!206, !222, !234, !244, !255, !265, !270, !280, !291, !301, !311, !321}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !204, file: !203, line: 340, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_TYPE_Type", file: !203, line: 57, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 44, size: 32, elements: !211)
!211 = !{!212, !221}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !210, file: !203, line: 55, baseType: !213, size: 32)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !203, line: 45, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK", scope: !213, file: !203, line: 47, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "RRP", scope: !213, file: !203, line: 49, baseType: !115, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "WAYNUM", scope: !213, file: !203, line: 50, baseType: !115, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "LCKDOWN", scope: !213, file: !203, line: 51, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZE", scope: !213, file: !203, line: 52, baseType: !115, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "CLSIZE", scope: !213, file: !203, line: 53, baseType: !115, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !210, file: !203, line: 56, baseType: !115, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "CFG", scope: !204, file: !203, line: 341, baseType: !223, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CFG_Type", file: !203, line: 124, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 114, size: 32, elements: !226)
!226 = !{!227, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !225, file: !203, line: 122, baseType: !228, size: 32)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !225, file: !203, line: 115, size: 32, elements: !229)
!229 = !{!230, !231, !232}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ICDIS", scope: !228, file: !203, line: 117, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "DCDIS", scope: !228, file: !203, line: 118, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZESW", scope: !228, file: !203, line: 120, baseType: !115, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !225, file: !203, line: 123, baseType: !115, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !204, file: !203, line: 342, baseType: !235, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CTRL_Type", file: !203, line: 161, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 155, size: 32, elements: !238)
!238 = !{!239, !243}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !237, file: !203, line: 159, baseType: !240, size: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !237, file: !203, line: 156, size: 32, elements: !241)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !240, file: !203, line: 157, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !237, file: !203, line: 160, baseType: !115, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !204, file: !203, line: 343, baseType: !245, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_SR_Type", file: !203, line: 179, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 173, size: 32, elements: !249)
!249 = !{!250, !254}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !248, file: !203, line: 177, baseType: !251, size: 32)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !248, file: !203, line: 174, size: 32, elements: !252)
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "CSTS", scope: !251, file: !203, line: 175, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !248, file: !203, line: 178, baseType: !115, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !204, file: !203, line: 344, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_LCKWAY_Type", file: !203, line: 197, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 191, size: 32, elements: !259)
!259 = !{!260, !264}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !258, file: !203, line: 195, baseType: !261, size: 32)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !258, file: !203, line: 192, size: 32, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !261, file: !203, line: 193, baseType: !115, size: 4, flags: DIFlagBitField, extraData: i64 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !258, file: !203, line: 196, baseType: !115, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !204, file: !203, line: 345, baseType: !266, size: 96, offset: 160)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 96, elements: !134)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !268, line: 53, baseType: !269)
!268 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/samd51g19a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT0", scope: !204, file: !203, line: 346, baseType: !271, size: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT0_Type", file: !203, line: 216, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 210, size: 32, elements: !274)
!274 = !{!275, !279}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !273, file: !203, line: 214, baseType: !276, size: 32)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !273, file: !203, line: 211, size: 32, elements: !277)
!277 = !{!278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "INVALL", scope: !276, file: !203, line: 212, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !273, file: !203, line: 215, baseType: !115, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT1", scope: !204, file: !203, line: 347, baseType: !281, size: 32, offset: 288)
!281 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT1_Type", file: !203, line: 236, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 228, size: 32, elements: !284)
!284 = !{!285, !290}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !283, file: !203, line: 234, baseType: !286, size: 32)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !283, file: !203, line: 229, size: 32, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "INDEX", scope: !286, file: !203, line: 231, baseType: !115, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "WAY", scope: !286, file: !203, line: 233, baseType: !115, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !283, file: !203, line: 235, baseType: !115, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "MCFG", scope: !204, file: !203, line: 348, baseType: !292, size: 32, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCFG_Type", file: !203, line: 266, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 260, size: 32, elements: !295)
!295 = !{!296, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !294, file: !203, line: 264, baseType: !297, size: 32)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !294, file: !203, line: 261, size: 32, elements: !298)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !297, file: !203, line: 262, baseType: !115, size: 2, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !294, file: !203, line: 265, baseType: !115, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "MEN", scope: !204, file: !203, line: 349, baseType: !302, size: 32, offset: 352)
!302 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MEN_Type", file: !203, line: 291, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 285, size: 32, elements: !305)
!305 = !{!306, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !304, file: !203, line: 289, baseType: !307, size: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !304, file: !203, line: 286, size: 32, elements: !308)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "MENABLE", scope: !307, file: !203, line: 287, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !304, file: !203, line: 290, baseType: !115, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "MCTRL", scope: !204, file: !203, line: 350, baseType: !312, size: 32, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCTRL_Type", file: !203, line: 309, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 303, size: 32, elements: !315)
!315 = !{!316, !320}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !314, file: !203, line: 307, baseType: !317, size: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !314, file: !203, line: 304, size: 32, elements: !318)
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !317, file: !203, line: 305, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !314, file: !203, line: 308, baseType: !115, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !204, file: !203, line: 351, baseType: !322, size: 32, offset: 416)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MSR_Type", file: !203, line: 326, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 321, size: 32, elements: !326)
!326 = !{!327, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !325, file: !203, line: 324, baseType: !328, size: 32)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !325, file: !203, line: 322, size: 32, elements: !329)
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "EVENT_CNT", scope: !328, file: !203, line: 323, baseType: !115, size: 32, flags: DIFlagBitField, extraData: i64 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !325, file: !203, line: 325, baseType: !115, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !334, line: 267, baseType: !335)
!334 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 259, size: 2560, elements: !336)
!336 = !{!337, !347, !351, !378, !382, !400, !404}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !335, file: !334, line: 260, baseType: !338, size: 8)
!338 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRLA_Type", file: !334, line: 50, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 44, size: 8, elements: !341)
!341 = !{!342, !346}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !340, file: !334, line: 48, baseType: !343, size: 8)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !340, file: !334, line: 45, size: 8, elements: !344)
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !343, file: !334, line: 46, baseType: !132, size: 1, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !340, file: !334, line: 49, baseType: !132, size: 8)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !335, file: !334, line: 261, baseType: !348, size: 24, offset: 8)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 24, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 3)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !335, file: !334, line: 262, baseType: !352, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_SYNCBUSY_Type", file: !334, line: 86, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 62, size: 32, elements: !356)
!356 = !{!357, !373, !377}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !355, file: !334, line: 79, baseType: !358, size: 32)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !334, line: 63, size: 32, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !358, file: !334, line: 64, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL0", scope: !358, file: !334, line: 66, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL1", scope: !358, file: !334, line: 67, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL2", scope: !358, file: !334, line: 68, baseType: !115, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL3", scope: !358, file: !334, line: 69, baseType: !115, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL4", scope: !358, file: !334, line: 70, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL5", scope: !358, file: !334, line: 71, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL6", scope: !358, file: !334, line: 72, baseType: !115, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL7", scope: !358, file: !334, line: 73, baseType: !115, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL8", scope: !358, file: !334, line: 74, baseType: !115, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL9", scope: !358, file: !334, line: 75, baseType: !115, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL10", scope: !358, file: !334, line: 76, baseType: !115, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL11", scope: !358, file: !334, line: 77, baseType: !115, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !355, file: !334, line: 84, baseType: !374, size: 32)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !334, line: 80, size: 32, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !374, file: !334, line: 82, baseType: !115, size: 12, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !355, file: !334, line: 85, baseType: !115, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !335, file: !334, line: 263, baseType: !379, size: 192, offset: 64)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 192, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 24)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !335, file: !334, line: 264, baseType: !383, size: 384, offset: 256)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 384, elements: !134)
!384 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !334, line: 163, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 149, size: 32, elements: !387)
!387 = !{!388, !399}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !386, file: !334, line: 161, baseType: !389, size: 32)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !334, line: 150, size: 32, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !389, file: !334, line: 151, baseType: !115, size: 4, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !389, file: !334, line: 153, baseType: !115, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !389, file: !334, line: 154, baseType: !115, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !389, file: !334, line: 155, baseType: !115, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !389, file: !334, line: 156, baseType: !115, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !389, file: !334, line: 157, baseType: !115, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !389, file: !334, line: 158, baseType: !115, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !389, file: !334, line: 160, baseType: !115, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !386, file: !334, line: 162, baseType: !115, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !335, file: !334, line: 265, baseType: !401, size: 384, offset: 640)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 384, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 48)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "PCHCTRL", scope: !335, file: !334, line: 266, baseType: !405, size: 1536, offset: 1024)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 1536, elements: !402)
!406 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_PCHCTRL_Type", file: !334, line: 218, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 209, size: 32, elements: !409)
!409 = !{!410, !416}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !408, file: !334, line: 216, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !334, line: 210, size: 32, elements: !412)
!412 = !{!413, !414, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !411, file: !334, line: 211, baseType: !115, size: 4, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "CHEN", scope: !411, file: !334, line: 213, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !411, file: !334, line: 214, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !408, file: !334, line: 217, baseType: !115, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "Oscctrl", file: !419, line: 788, baseType: !420)
!419 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/oscctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 771, size: 704, elements: !421)
!421 = !{!422, !437, !438, !469, !500, !531, !566, !588, !600, !601, !618, !619, !631, !643, !656, !657}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "EVCTRL", scope: !420, file: !419, line: 772, baseType: !423, size: 8)
!423 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_EVCTRL_Type", file: !419, line: 55, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 44, size: 8, elements: !426)
!426 = !{!427, !432, !436}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !425, file: !419, line: 49, baseType: !428, size: 8)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !425, file: !419, line: 45, size: 8, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO0", scope: !428, file: !419, line: 46, baseType: !132, size: 1, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO1", scope: !428, file: !419, line: 47, baseType: !132, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !425, file: !419, line: 53, baseType: !433, size: 8)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !425, file: !419, line: 50, size: 8, elements: !434)
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO", scope: !433, file: !419, line: 51, baseType: !132, size: 2, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !425, file: !419, line: 54, baseType: !132, size: 8)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !420, file: !419, line: 773, baseType: !348, size: 24, offset: 8)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !420, file: !419, line: 774, baseType: !439, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENCLR_Type", file: !419, line: 102, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 72, size: 32, elements: !442)
!442 = !{!443, !463, !468}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !441, file: !419, line: 95, baseType: !444, size: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !419, line: 73, size: 32, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !444, file: !419, line: 74, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !444, file: !419, line: 75, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !444, file: !419, line: 76, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !444, file: !419, line: 77, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !444, file: !419, line: 79, baseType: !115, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !444, file: !419, line: 80, baseType: !115, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !444, file: !419, line: 81, baseType: !115, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !444, file: !419, line: 82, baseType: !115, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !444, file: !419, line: 83, baseType: !115, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !444, file: !419, line: 85, baseType: !115, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !444, file: !419, line: 86, baseType: !115, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !444, file: !419, line: 87, baseType: !115, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !444, file: !419, line: 88, baseType: !115, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !444, file: !419, line: 90, baseType: !115, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !444, file: !419, line: 91, baseType: !115, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !444, file: !419, line: 92, baseType: !115, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !444, file: !419, line: 93, baseType: !115, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !441, file: !419, line: 100, baseType: !464, size: 32)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !419, line: 96, size: 32, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !464, file: !419, line: 97, baseType: !115, size: 2, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !464, file: !419, line: 98, baseType: !115, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !441, file: !419, line: 101, baseType: !115, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !420, file: !419, line: 775, baseType: !470, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENSET_Type", file: !419, line: 182, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 152, size: 32, elements: !473)
!473 = !{!474, !494, !499}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !472, file: !419, line: 175, baseType: !475, size: 32)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !472, file: !419, line: 153, size: 32, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !475, file: !419, line: 154, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !475, file: !419, line: 155, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !475, file: !419, line: 156, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !475, file: !419, line: 157, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !475, file: !419, line: 159, baseType: !115, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !475, file: !419, line: 160, baseType: !115, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !475, file: !419, line: 161, baseType: !115, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !475, file: !419, line: 162, baseType: !115, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !475, file: !419, line: 163, baseType: !115, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !475, file: !419, line: 165, baseType: !115, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !475, file: !419, line: 166, baseType: !115, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !475, file: !419, line: 167, baseType: !115, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !475, file: !419, line: 168, baseType: !115, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !475, file: !419, line: 170, baseType: !115, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !475, file: !419, line: 171, baseType: !115, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !475, file: !419, line: 172, baseType: !115, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !475, file: !419, line: 173, baseType: !115, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !472, file: !419, line: 180, baseType: !495, size: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !472, file: !419, line: 176, size: 32, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !495, file: !419, line: 177, baseType: !115, size: 2, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !495, file: !419, line: 178, baseType: !115, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !472, file: !419, line: 181, baseType: !115, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !420, file: !419, line: 776, baseType: !501, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTFLAG_Type", file: !419, line: 262, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 232, size: 32, elements: !504)
!504 = !{!505, !525, !530}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !503, file: !419, line: 255, baseType: !506, size: 32)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !503, file: !419, line: 233, size: 32, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !506, file: !419, line: 234, baseType: !122, size: 1, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !506, file: !419, line: 235, baseType: !122, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !506, file: !419, line: 236, baseType: !122, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !506, file: !419, line: 237, baseType: !122, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !506, file: !419, line: 239, baseType: !122, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !506, file: !419, line: 240, baseType: !122, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !506, file: !419, line: 241, baseType: !122, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !506, file: !419, line: 242, baseType: !122, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !506, file: !419, line: 243, baseType: !122, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !506, file: !419, line: 245, baseType: !122, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !506, file: !419, line: 246, baseType: !122, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !506, file: !419, line: 247, baseType: !122, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !506, file: !419, line: 248, baseType: !122, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !506, file: !419, line: 250, baseType: !122, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !506, file: !419, line: 251, baseType: !122, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !506, file: !419, line: 252, baseType: !122, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !506, file: !419, line: 253, baseType: !122, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !503, file: !419, line: 260, baseType: !526, size: 32)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !503, file: !419, line: 256, size: 32, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !526, file: !419, line: 257, baseType: !122, size: 2, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !526, file: !419, line: 258, baseType: !122, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !503, file: !419, line: 261, baseType: !115, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !420, file: !419, line: 777, baseType: !532, size: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_STATUS_Type", file: !419, line: 345, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 312, size: 32, elements: !536)
!536 = !{!537, !559, !565}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !535, file: !419, line: 337, baseType: !538, size: 32)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !535, file: !419, line: 313, size: 32, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !538, file: !419, line: 314, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !538, file: !419, line: 315, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !538, file: !419, line: 316, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !538, file: !419, line: 317, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW0", scope: !538, file: !419, line: 318, baseType: !115, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW1", scope: !538, file: !419, line: 319, baseType: !115, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !538, file: !419, line: 321, baseType: !115, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !538, file: !419, line: 322, baseType: !115, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !538, file: !419, line: 323, baseType: !115, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !538, file: !419, line: 324, baseType: !115, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !538, file: !419, line: 325, baseType: !115, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !538, file: !419, line: 327, baseType: !115, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !538, file: !419, line: 328, baseType: !115, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0TO", scope: !538, file: !419, line: 329, baseType: !115, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !538, file: !419, line: 330, baseType: !115, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !538, file: !419, line: 332, baseType: !115, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !538, file: !419, line: 333, baseType: !115, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1TO", scope: !538, file: !419, line: 334, baseType: !115, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !538, file: !419, line: 335, baseType: !115, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !535, file: !419, line: 343, baseType: !560, size: 32)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !535, file: !419, line: 338, size: 32, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !560, file: !419, line: 339, baseType: !115, size: 2, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !560, file: !419, line: 340, baseType: !115, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW", scope: !560, file: !419, line: 341, baseType: !115, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !535, file: !419, line: 344, baseType: !115, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCTRL", scope: !420, file: !419, line: 778, baseType: !567, size: 64, offset: 160)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 64, elements: !145)
!568 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_XOSCCTRL_Type", file: !419, line: 422, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 402, size: 32, elements: !571)
!571 = !{!572, !587}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !570, file: !419, line: 420, baseType: !573, size: 32)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !570, file: !419, line: 403, size: 32, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !573, file: !419, line: 405, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !573, file: !419, line: 406, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !573, file: !419, line: 408, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !573, file: !419, line: 409, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "LOWBUFGAIN", scope: !573, file: !419, line: 410, baseType: !115, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "IPTAT", scope: !573, file: !419, line: 411, baseType: !115, size: 2, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "IMULT", scope: !573, file: !419, line: 412, baseType: !115, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ENALC", scope: !573, file: !419, line: 413, baseType: !115, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEN", scope: !573, file: !419, line: 414, baseType: !115, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "SWBEN", scope: !573, file: !419, line: 415, baseType: !115, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !573, file: !419, line: 417, baseType: !115, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "CFDPRESC", scope: !573, file: !419, line: 418, baseType: !115, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !570, file: !419, line: 421, baseType: !115, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLA", scope: !420, file: !419, line: 779, baseType: !589, size: 8, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLA_Type", file: !419, line: 469, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 460, size: 8, elements: !592)
!592 = !{!593, !599}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !591, file: !419, line: 467, baseType: !594, size: 8)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !591, file: !419, line: 461, size: 8, elements: !595)
!595 = !{!596, !597, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !594, file: !419, line: 463, baseType: !132, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !594, file: !419, line: 465, baseType: !132, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !594, file: !419, line: 466, baseType: !132, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !591, file: !419, line: 468, baseType: !132, size: 8)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !420, file: !419, line: 780, baseType: !348, size: 24, offset: 232)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !420, file: !419, line: 781, baseType: !602, size: 8, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLB_Type", file: !419, line: 497, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 485, size: 8, elements: !605)
!605 = !{!606, !617}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !604, file: !419, line: 495, baseType: !607, size: 8)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !604, file: !419, line: 486, size: 8, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !607, file: !419, line: 487, baseType: !132, size: 1, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !607, file: !419, line: 488, baseType: !132, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !607, file: !419, line: 489, baseType: !132, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !607, file: !419, line: 490, baseType: !132, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !607, file: !419, line: 491, baseType: !132, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !607, file: !419, line: 492, baseType: !132, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !607, file: !419, line: 493, baseType: !132, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !607, file: !419, line: 494, baseType: !132, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !604, file: !419, line: 496, baseType: !132, size: 8)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !420, file: !419, line: 782, baseType: !348, size: 24, offset: 264)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !420, file: !419, line: 783, baseType: !620, size: 32, offset: 288)
!620 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLVAL_Type", file: !419, line: 531, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 523, size: 32, elements: !623)
!623 = !{!624, !630}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !622, file: !419, line: 529, baseType: !625, size: 32)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !622, file: !419, line: 524, size: 32, elements: !626)
!626 = !{!627, !628, !629}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !625, file: !419, line: 525, baseType: !115, size: 8, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !625, file: !419, line: 527, baseType: !115, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !625, file: !419, line: 528, baseType: !115, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !622, file: !419, line: 530, baseType: !115, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !420, file: !419, line: 784, baseType: !632, size: 32, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLMUL_Type", file: !419, line: 558, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 550, size: 32, elements: !635)
!635 = !{!636, !642}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !634, file: !419, line: 556, baseType: !637, size: 32)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !634, file: !419, line: 551, size: 32, elements: !638)
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !637, file: !419, line: 552, baseType: !115, size: 16, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !637, file: !419, line: 553, baseType: !115, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !637, file: !419, line: 555, baseType: !115, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !634, file: !419, line: 557, baseType: !115, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !420, file: !419, line: 785, baseType: !644, size: 8, offset: 352)
!644 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLSYNC_Type", file: !419, line: 587, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 577, size: 8, elements: !647)
!647 = !{!648, !655}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !646, file: !419, line: 585, baseType: !649, size: 8)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !419, line: 578, size: 8, elements: !650)
!650 = !{!651, !652, !653, !654}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !649, file: !419, line: 580, baseType: !132, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !649, file: !419, line: 581, baseType: !132, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !649, file: !419, line: 582, baseType: !132, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !649, file: !419, line: 583, baseType: !132, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !646, file: !419, line: 586, baseType: !132, size: 8)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !420, file: !419, line: 786, baseType: !348, size: 24, offset: 360)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Dpll", scope: !420, file: !419, line: 787, baseType: !658, size: 320, offset: 384)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 320, elements: !145)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "OscctrlDpll", file: !419, line: 766, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 759, size: 160, elements: !661)
!661 = !{!662, !674, !675, !686, !703, !715}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !660, file: !419, line: 760, baseType: !663, size: 8)
!663 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLA_Type", file: !419, line: 614, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 605, size: 8, elements: !666)
!666 = !{!667, !673}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !665, file: !419, line: 612, baseType: !668, size: 8)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !665, file: !419, line: 606, size: 8, elements: !669)
!669 = !{!670, !671, !672}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !668, file: !419, line: 608, baseType: !132, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !668, file: !419, line: 610, baseType: !132, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !668, file: !419, line: 611, baseType: !132, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !665, file: !419, line: 613, baseType: !132, size: 8)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !660, file: !419, line: 761, baseType: !348, size: 24, offset: 8)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !660, file: !419, line: 762, baseType: !676, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLRATIO_Type", file: !419, line: 638, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 630, size: 32, elements: !679)
!679 = !{!680, !685}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !678, file: !419, line: 636, baseType: !681, size: 32)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !419, line: 631, size: 32, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !681, file: !419, line: 632, baseType: !115, size: 13, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !681, file: !419, line: 634, baseType: !115, size: 5, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !678, file: !419, line: 637, baseType: !115, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !660, file: !419, line: 763, baseType: !687, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLB_Type", file: !419, line: 667, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 654, size: 32, elements: !690)
!690 = !{!691, !702}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !689, file: !419, line: 665, baseType: !692, size: 32)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !689, file: !419, line: 655, size: 32, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !692, file: !419, line: 656, baseType: !115, size: 4, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !692, file: !419, line: 657, baseType: !115, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !692, file: !419, line: 658, baseType: !115, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !692, file: !419, line: 659, baseType: !115, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !692, file: !419, line: 660, baseType: !115, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "DCOFILTER", scope: !692, file: !419, line: 661, baseType: !115, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "DCOEN", scope: !692, file: !419, line: 662, baseType: !115, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !692, file: !419, line: 663, baseType: !115, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !689, file: !419, line: 666, baseType: !115, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSYNCBUSY", scope: !660, file: !419, line: 764, baseType: !704, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSYNCBUSY_Type", file: !419, line: 724, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 716, size: 32, elements: !708)
!708 = !{!709, !714}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !707, file: !419, line: 722, baseType: !710, size: 32)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !707, file: !419, line: 717, size: 32, elements: !711)
!711 = !{!712, !713}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !710, file: !419, line: 719, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !710, file: !419, line: 720, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !707, file: !419, line: 723, baseType: !115, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !660, file: !419, line: 765, baseType: !716, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSTATUS_Type", file: !419, line: 745, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !419, line: 738, size: 32, elements: !720)
!720 = !{!721, !726}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !719, file: !419, line: 743, baseType: !722, size: 32)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !719, file: !419, line: 739, size: 32, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !722, file: !419, line: 740, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !722, file: !419, line: 741, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !719, file: !419, line: 744, baseType: !115, size: 32)
!727 = !{!196}
!728 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !164, line: 51, size: 64, elements: !731)
!731 = !{!732, !751}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !730, file: !164, line: 60, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DISubroutineType(types: !735)
!735 = !{!103, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !173, line: 378, size: 192, elements: !739)
!739 = !{!740, !741, !742, !743, !749, !750}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !738, file: !173, line: 380, baseType: !176, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !738, file: !173, line: 382, baseType: !13, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !738, file: !173, line: 384, baseType: !13, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !738, file: !173, line: 386, baseType: !744, size: 32, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !173, line: 351, size: 16, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !745, file: !173, line: 359, baseType: !132, size: 8)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !745, file: !173, line: 364, baseType: !187, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !738, file: !173, line: 388, baseType: !102, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !738, file: !173, line: 396, baseType: !190, size: 32, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !730, file: !164, line: 65, baseType: !736, size: 32, offset: 32)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "usb_enable_lock", scope: !754, file: !910, line: 102, type: !978, isLocal: false, isDefinition: true, align: 32)
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !755, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !756, retainedTypes: !794, globals: !907, splitDebugInlining: false, nameTableKind: None)
!755 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/usb/device/usb_device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/subsys/usb/console")
!756 = !{!757, !772, !778, !783, !789, !30}
!757 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_dc_status_code", file: !758, line: 63, baseType: !32, size: 32, elements: !759)
!758 = !DIFile(filename: "zephyr/include/zephyr/drivers/usb/usb_dc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771}
!760 = !DIEnumerator(name: "USB_DC_ERROR", value: 0)
!761 = !DIEnumerator(name: "USB_DC_RESET", value: 1)
!762 = !DIEnumerator(name: "USB_DC_CONNECTED", value: 2)
!763 = !DIEnumerator(name: "USB_DC_CONFIGURED", value: 3)
!764 = !DIEnumerator(name: "USB_DC_DISCONNECTED", value: 4)
!765 = !DIEnumerator(name: "USB_DC_SUSPEND", value: 5)
!766 = !DIEnumerator(name: "USB_DC_RESUME", value: 6)
!767 = !DIEnumerator(name: "USB_DC_INTERFACE", value: 7)
!768 = !DIEnumerator(name: "USB_DC_SET_HALT", value: 8)
!769 = !DIEnumerator(name: "USB_DC_CLEAR_HALT", value: 9)
!770 = !DIEnumerator(name: "USB_DC_SOF", value: 10)
!771 = !DIEnumerator(name: "USB_DC_UNKNOWN", value: 11)
!772 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_dc_ep_transfer_type", file: !758, line: 107, baseType: !32, size: 32, elements: !773)
!773 = !{!774, !775, !776, !777}
!774 = !DIEnumerator(name: "USB_DC_EP_CONTROL", value: 0)
!775 = !DIEnumerator(name: "USB_DC_EP_ISOCHRONOUS", value: 1)
!776 = !DIEnumerator(name: "USB_DC_EP_BULK", value: 2)
!777 = !DIEnumerator(name: "USB_DC_EP_INTERRUPT", value: 3)
!778 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_dc_ep_cb_status_code", file: !758, line: 95, baseType: !32, size: 32, elements: !779)
!779 = !{!780, !781, !782}
!780 = !DIEnumerator(name: "USB_DC_EP_SETUP", value: 0)
!781 = !DIEnumerator(name: "USB_DC_EP_DATA_OUT", value: 1)
!782 = !DIEnumerator(name: "USB_DC_EP_DATA_IN", value: 2)
!783 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !784, line: 506, baseType: !32, size: 32, elements: !785)
!784 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!785 = !{!786, !787, !788}
!786 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!787 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!788 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !784, line: 512, baseType: !32, size: 32, elements: !790)
!790 = !{!791, !792, !793}
!791 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!792 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!793 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!794 = !{!795, !799, !869, !874, !834, !789, !783, !879, !102, !103, !132, !880, !881, !893, !895}
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !796, line: 46, baseType: !797)
!796 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !798)
!798 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !784, line: 523, size: 288, elements: !802)
!802 = !{!803, !824, !830, !835, !839, !840, !841, !845, !865}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !801, file: !784, line: 524, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DISubroutineType(types: !806)
!806 = !{!103, !807, !822, !823}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !173, line: 378, size: 192, elements: !810)
!810 = !{!811, !812, !813, !814, !820, !821}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !809, file: !173, line: 380, baseType: !176, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !809, file: !173, line: 382, baseType: !13, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !809, file: !173, line: 384, baseType: !13, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !809, file: !173, line: 386, baseType: !815, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !173, line: 351, size: 16, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !816, file: !173, line: 359, baseType: !132, size: 8)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !816, file: !173, line: 364, baseType: !187, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !809, file: !173, line: 388, baseType: !102, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !809, file: !173, line: 396, baseType: !190, size: 32, offset: 160)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !784, line: 237, baseType: !132)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !784, line: 257, baseType: !115)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !801, file: !784, line: 530, baseType: !825, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DISubroutineType(types: !827)
!827 = !{!103, !807, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !784, line: 229, baseType: !115)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !801, file: !784, line: 532, baseType: !831, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!832 = !DISubroutineType(types: !833)
!833 = !{!103, !807, !834, !829}
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !784, line: 216, baseType: !115)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !801, file: !784, line: 535, baseType: !836, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DISubroutineType(types: !838)
!838 = !{!103, !807, !834}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !801, file: !784, line: 537, baseType: !836, size: 32, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !801, file: !784, line: 539, baseType: !836, size: 32, offset: 160)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !801, file: !784, line: 541, baseType: !842, size: 32, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DISubroutineType(types: !844)
!844 = !{!103, !807, !822, !783, !789}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !801, file: !784, line: 544, baseType: !846, size: 32, offset: 224)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DISubroutineType(types: !848)
!848 = !{!103, !807, !849, !187}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !784, line: 478, size: 96, elements: !851)
!851 = !{!852, !859, !864}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !850, file: !784, line: 482, baseType: !853, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !854, line: 33, baseType: !855)
!854 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !854, line: 29, size: 32, elements: !856)
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !855, file: !854, line: 30, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !850, file: !784, line: 485, baseType: !860, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !784, line: 464, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !807, !849, !834}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !850, file: !784, line: 493, baseType: !834, size: 32, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !801, file: !784, line: 547, baseType: !866, size: 32, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(types: !868)
!868 = !{!115, !807}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !784, line: 428, size: 32, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !871, file: !784, line: 434, baseType: !834, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !784, line: 441, size: 32, elements: !877)
!877 = !{!878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !876, file: !784, line: 447, baseType: !834, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_ep_descriptor", file: !883, line: 191, size: 56, elements: !884)
!883 = !DIFile(filename: "zephyr/include/zephyr/usb/usb_ch9.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!884 = !{!885, !886, !887, !888, !889, !892}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !882, file: !883, line: 192, baseType: !132, size: 8)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !882, file: !883, line: 193, baseType: !132, size: 8, offset: 8)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "bEndpointAddress", scope: !882, file: !883, line: 194, baseType: !132, size: 8, offset: 16)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bmAttributes", scope: !882, file: !883, line: 195, baseType: !132, size: 8, offset: 24)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "wMaxPacketSize", scope: !882, file: !883, line: 196, baseType: !890, size: 16, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !891)
!891 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "bInterval", scope: !882, file: !883, line: 197, baseType: !132, size: 8, offset: 48)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !894, line: 214, baseType: !32)
!894 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_cfg_descriptor", file: !883, line: 166, size: 72, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !897, file: !883, line: 167, baseType: !132, size: 8)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !897, file: !883, line: 168, baseType: !132, size: 8, offset: 8)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "wTotalLength", scope: !897, file: !883, line: 169, baseType: !890, size: 16, offset: 16)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "bNumInterfaces", scope: !897, file: !883, line: 170, baseType: !132, size: 8, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "bConfigurationValue", scope: !897, file: !883, line: 171, baseType: !132, size: 8, offset: 40)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "iConfiguration", scope: !897, file: !883, line: 172, baseType: !132, size: 8, offset: 48)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "bmAttributes", scope: !897, file: !883, line: 173, baseType: !132, size: 8, offset: 56)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bMaxPower", scope: !897, file: !883, line: 174, baseType: !132, size: 8, offset: 64)
!907 = !{!752, !908, !919}
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "__init_usb_device_init", scope: !754, file: !910, line: 1714, type: !911, isLocal: true, isDefinition: true, align: 32)
!910 = !DIFile(filename: "zephyr/subsys/usb/device/usb_device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !164, line: 51, size: 64, elements: !913)
!913 = !{!914, !918}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !912, file: !164, line: 60, baseType: !915, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DISubroutineType(types: !917)
!917 = !{!103, !807}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !912, file: !164, line: 65, baseType: !807, size: 32, offset: 32)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "usb_dev", scope: !754, file: !910, line: 140, type: !921, isLocal: true, isDefinition: true)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_dev_priv", file: !910, line: 104, size: 1600, elements: !922)
!922 = !{!923, !940, !941, !943, !944, !945, !954, !961, !962, !963, !965, !969, !970, !971, !972, !976, !977}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !921, file: !910, line: 106, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_setup_packet", file: !883, line: 38, size: 64, elements: !925)
!925 = !{!926, !936, !937, !938, !939}
!926 = !DIDerivedType(tag: DW_TAG_member, scope: !924, file: !883, line: 39, baseType: !927, size: 8)
!927 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !924, file: !883, line: 39, size: 8, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "bmRequestType", scope: !927, file: !883, line: 40, baseType: !132, size: 8)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "RequestType", scope: !927, file: !883, line: 41, baseType: !931, size: 8)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_req_type_field", file: !883, line: 25, size: 8, elements: !932)
!932 = !{!933, !934, !935}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "recipient", scope: !931, file: !883, line: 27, baseType: !132, size: 5, flags: DIFlagBitField, extraData: i64 0)
