; ModuleID = 'build/actinius_icarus_ns/sys_heap/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, i32, i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "heap", scope: !27, file: !107, line: 13, type: !112, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "heap_mem", scope: !27, file: !107, line: 12, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !110)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !{!115, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !112, file: !113, line: 57, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !113, line: 57, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !112, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !112, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 214, baseType: !32)
!121 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !127, line: 54, type: !128, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!126 = !{!122}
!127 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!103, !103}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "state", scope: !133, file: !134, line: 227, type: !163, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "rand32", scope: !134, file: !134, line: 225, type: !135, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !138, retainedNodes: !162)
!134 = !DIFile(filename: "zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !148, globals: !161, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!140 = !{!30, !141}
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !142, line: 54, baseType: !32, size: 32, elements: !143)
!142 = !DIFile(filename: "zephyr/lib/os/heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!145 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!146 = !DIEnumerator(name: "FREE_PREV", value: 2)
!147 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!148 = !{!102, !103, !149, !150, !137, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !142, line: 58, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 58, size: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !155, file: !142, line: 58, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !{!131}
!162 = !{}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !164)
!164 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !167, file: !222, line: 65, type: !223, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !169, globals: !217, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!169 = !{!102, !103, !170, !137, !181}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !172, file: !171, line: 167, baseType: !180)
!171 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !171, file: !171, line: 134, type: !173, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !175)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !137}
!175 = !{!176, !177, !179}
!176 = !DILocalVariable(name: "time_us", arg: 1, scope: !172, file: !171, line: 134, type: !137)
!177 = !DILocalVariable(name: "delay_cycles", scope: !172, file: !171, line: 168, type: !178)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!179 = !DILocalVariable(name: "cycles", scope: !172, file: !171, line: 171, type: !137)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !183, line: 1928, baseType: !184)
!183 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 1909, size: 11360, elements: !185)
!185 = !{!186, !190, !191, !192, !193, !197, !198, !199, !200, !204, !205, !207, !208, !209, !210, !211, !215, !216}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !184, file: !183, line: 1910, baseType: !187, size: 8192)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 8192, elements: !110)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !184, file: !183, line: 1911, baseType: !188, size: 32, offset: 8192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !184, file: !183, line: 1912, baseType: !188, size: 32, offset: 8224)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !184, file: !183, line: 1913, baseType: !188, size: 32, offset: 8256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !184, file: !183, line: 1914, baseType: !194, size: 1984, offset: 8288)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 1984, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 62)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !184, file: !183, line: 1915, baseType: !189, size: 32, offset: 10272)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !184, file: !183, line: 1916, baseType: !188, size: 32, offset: 10304)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !184, file: !183, line: 1917, baseType: !189, size: 32, offset: 10336)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !184, file: !183, line: 1918, baseType: !201, size: 96, offset: 10368)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 96, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 3)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !184, file: !183, line: 1919, baseType: !189, size: 32, offset: 10464)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !184, file: !183, line: 1920, baseType: !206, size: 256, offset: 10496)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 256, elements: !159)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !184, file: !183, line: 1921, baseType: !189, size: 32, offset: 10752)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !184, file: !183, line: 1922, baseType: !188, size: 32, offset: 10784)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !184, file: !183, line: 1923, baseType: !189, size: 32, offset: 10816)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !184, file: !183, line: 1924, baseType: !189, size: 32, offset: 10848)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !184, file: !183, line: 1925, baseType: !212, size: 416, offset: 10880)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 416, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 13)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !184, file: !183, line: 1926, baseType: !189, size: 32, offset: 11296)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !184, file: !183, line: 1927, baseType: !189, size: 32, offset: 11328)
!217 = !{!165, !218}
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !172, file: !171, line: 161, type: !220, isLocal: true, isDefinition: true, align: 128)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 48, elements: !202)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!222 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !225, line: 51, size: 64, elements: !226)
!225 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !{!227, !234}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !224, file: !225, line: 60, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DISubroutineType(types: !230)
!230 = !{!103, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !225, line: 48, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !224, file: !225, line: 65, baseType: !231, size: 32, offset: 32)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !237, file: !276, line: 27, type: !304, isLocal: true, isDefinition: true)
!237 = distinct !DICompileUnit(language: DW_LANG_C99, file: !238, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !239, retainedTypes: !251, globals: !273, splitDebugInlining: false, nameTableKind: None)
!238 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!239 = !{!240, !30}
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !241, line: 27, baseType: !32, size: 32, elements: !242)
!241 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250}
!243 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!244 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!245 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!246 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!247 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!248 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!249 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!250 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!251 = !{!102, !252, !103, !24, !256, !272, !137, !163}
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !253, line: 46, baseType: !254)
!253 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !255)
!255 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !258, line: 54, size: 96, elements: !259)
!258 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !{!260, !267, !271}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !257, file: !258, line: 55, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !263)
!262 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !262, line: 30, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !257, file: !258, line: 60, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !240}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !257, file: !258, line: 65, baseType: !268, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!273 = !{!235, !274, !279, !281, !294, !296}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !237, file: !276, line: 44, type: !277, isLocal: true, isDefinition: true)
!276 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !162)
!278 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !237, file: !276, line: 49, type: !277, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !237, file: !276, line: 36, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 128, elements: !292)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !241, line: 114, size: 128, elements: !285)
!285 = !{!286, !287, !290, !291}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !284, file: !241, line: 115, baseType: !240, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !284, file: !241, line: 141, baseType: !288, size: 8, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !289)
!289 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !284, file: !241, line: 149, baseType: !137, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !284, file: !241, line: 156, baseType: !137, size: 32, offset: 96)
!292 = !{!293}
!293 = !DISubrange(count: 1)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !237, file: !276, line: 40, type: !283, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !237, file: !276, line: 28, type: !298, isLocal: true, isDefinition: true)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !262, line: 40, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !262, line: 35, size: 64, elements: !300)
!300 = !{!301, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !299, file: !262, line: 36, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !299, file: !262, line: 37, baseType: !302, size: 32, offset: 32)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 32, elements: !292)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !306, line: 22, baseType: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!308 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!309 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !312, file: !341, line: 50, type: !328, isLocal: true, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !239, retainedTypes: !314, globals: !338, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!314 = !{!315, !252, !120, !103, !102, !137, !163, !317, !272, !328, !329}
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !316)
!316 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !319, line: 45, size: 64, elements: !320)
!319 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = !{!321, !327}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !318, file: !319, line: 46, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !324)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !262, line: 30, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !318, file: !319, line: 48, baseType: !137, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !319, line: 38, size: 64, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !330, file: !319, line: 39, baseType: !322, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !330, file: !319, line: 41, baseType: !334, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !319, line: 35, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !328}
!338 = !{!339, !343, !351, !310, !353, !363}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "latency_lock", scope: !312, file: !341, line: 44, type: !342, isLocal: true, isDefinition: true)
!341 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !162)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !312, file: !341, line: 46, type: !345, isLocal: true, isDefinition: true)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !262, line: 40, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !262, line: 35, size: 64, elements: !347)
!347 = !{!348, !350}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !346, file: !262, line: 36, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !346, file: !262, line: 37, baseType: !349, size: 32, offset: 32)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "latency_subs", scope: !312, file: !341, line: 52, type: !345, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !312, file: !341, line: 39, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, elements: !361)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 35, size: 96, elements: !357)
!357 = !{!358, !359, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !356, file: !341, line: 36, baseType: !240, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !356, file: !341, line: 37, baseType: !288, size: 8, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !356, file: !341, line: 38, baseType: !305, size: 32, offset: 64)
!361 = !{!362}
!362 = !DISubrange(count: 0)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !312, file: !341, line: 48, type: !328, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !367, file: !374, line: 47, type: !388, isLocal: true, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !370, globals: !371, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!369 = !{!240}
!370 = !{!120, !103}
!371 = !{!372, !365, !384}
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "cpus_states", scope: !367, file: !374, line: 50, type: !375, isLocal: true, isDefinition: true)
!374 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 32, elements: !292)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !241, line: 114, size: 128, elements: !379)
!379 = !{!380, !381, !382, !383}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !378, file: !241, line: 115, baseType: !240, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !378, file: !241, line: 141, baseType: !288, size: 8, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !378, file: !241, line: 149, baseType: !137, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !378, file: !241, line: 156, baseType: !137, size: 32, offset: 96)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !367, file: !374, line: 55, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 8, elements: !292)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, elements: !361)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "static_regions", scope: !391, file: !398, line: 62, type: !527, isLocal: true, isDefinition: true)
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !393, globals: !394, splitDebugInlining: false, nameTableKind: None)
!392 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!393 = !{!120, !103, !137, !102}
!394 = !{!395, !389}
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !397, file: !398, line: 198, type: !514, isLocal: true, isDefinition: true)
!397 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !398, file: !398, line: 175, type: !399, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !391, retainedNodes: !511)
!398 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!399 = !DISubroutineType(types: !400)
!400 = !{null, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !403, line: 245, size: 1024, elements: !404)
!403 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !{!405, !470, !483, !484, !485, !486, !492, !506}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !402, file: !403, line: 247, baseType: !406, size: 384)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !403, line: 57, size: 384, elements: !407)
!407 = !{!408, !436, !444, !445, !446, !457, !458, !459}
!408 = !DIDerivedType(tag: DW_TAG_member, scope: !406, file: !403, line: 60, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !406, file: !403, line: 60, size: 64, elements: !410)
!410 = !{!411, !427}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !409, file: !403, line: 61, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !413, line: 49, baseType: !414)
!413 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !413, line: 37, size: 64, elements: !415)
!415 = !{!416, !422}
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !413, line: 38, baseType: !417, size: 32)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !413, line: 38, size: 32, elements: !418)
!418 = !{!419, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !417, file: !413, line: 39, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !413, line: 40, baseType: !420, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !413, line: 42, baseType: !423, size: 32, offset: 32)
!423 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !413, line: 42, size: 32, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !423, file: !413, line: 43, baseType: !420, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !423, file: !413, line: 44, baseType: !420, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !409, file: !403, line: 62, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !429, line: 49, size: 64, elements: !430)
!429 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !428, file: !429, line: 50, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 64, elements: !434)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!434 = !{!435}
!435 = !DISubrange(count: 2)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !406, file: !403, line: 68, baseType: !437, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !439, line: 233, baseType: !440)
!439 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 231, size: 64, elements: !441)
!441 = !{!442}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !440, file: !439, line: 232, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !413, line: 48, baseType: !414)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !406, file: !403, line: 71, baseType: !288, size: 8, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !406, file: !403, line: 74, baseType: !288, size: 8, offset: 104)
!446 = !DIDerivedType(tag: DW_TAG_member, scope: !406, file: !403, line: 90, baseType: !447, size: 16, offset: 112)
!447 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !406, file: !403, line: 90, size: 16, elements: !448)
!448 = !{!449, !456}
!449 = !DIDerivedType(tag: DW_TAG_member, scope: !447, file: !403, line: 91, baseType: !450, size: 16)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !447, file: !403, line: 91, size: 16, elements: !451)
!451 = !{!452, !455}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !450, file: !403, line: 96, baseType: !453, size: 8)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !454)
!454 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !450, file: !403, line: 97, baseType: !288, size: 8, offset: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !447, file: !403, line: 100, baseType: !151, size: 16)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !406, file: !403, line: 107, baseType: !137, size: 32, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !406, file: !403, line: 127, baseType: !102, size: 32, offset: 160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !406, file: !403, line: 131, baseType: !460, size: 192, offset: 192)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !439, line: 244, size: 192, elements: !461)
!461 = !{!462, !463, !469}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !460, file: !439, line: 245, baseType: !412, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !460, file: !439, line: 246, baseType: !464, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !439, line: 242, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !460, file: !439, line: 249, baseType: !254, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !402, file: !403, line: 250, baseType: !471, size: 288, offset: 384)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !472, line: 25, size: 288, elements: !473)
!472 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !471, file: !472, line: 26, baseType: !137, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !471, file: !472, line: 27, baseType: !137, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !471, file: !472, line: 28, baseType: !137, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !471, file: !472, line: 29, baseType: !137, size: 32, offset: 96)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !471, file: !472, line: 30, baseType: !137, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !471, file: !472, line: 31, baseType: !137, size: 32, offset: 160)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !471, file: !472, line: 32, baseType: !137, size: 32, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !471, file: !472, line: 33, baseType: !137, size: 32, offset: 224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !471, file: !472, line: 34, baseType: !137, size: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !402, file: !403, line: 253, baseType: !102, size: 32, offset: 672)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !402, file: !403, line: 256, baseType: !438, size: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !402, file: !403, line: 294, baseType: !103, size: 32, offset: 768)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !402, file: !403, line: 300, baseType: !487, size: 96, offset: 800)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !403, line: 149, size: 96, elements: !488)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !487, file: !403, line: 153, baseType: !22, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !487, file: !403, line: 162, baseType: !120, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !487, file: !403, line: 168, baseType: !120, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !402, file: !403, line: 325, baseType: !493, size: 32, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !495, line: 5073, size: 160, elements: !496)
!495 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = !{!497, !503, !504}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !494, file: !495, line: 5074, baseType: !498, size: 96)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !498, file: !113, line: 57, baseType: !116, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !498, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !498, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !494, file: !495, line: 5075, baseType: !438, size: 64, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !494, file: !495, line: 5076, baseType: !505, offset: 160)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !162)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !402, file: !403, line: 343, baseType: !507, size: 64, offset: 928)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !472, line: 60, size: 64, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !507, file: !472, line: 63, baseType: !137, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !507, file: !472, line: 66, baseType: !137, size: 32, offset: 32)
!511 = !{!512, !513}
!512 = !DILocalVariable(name: "thread", arg: 1, scope: !397, file: !398, line: 175, type: !401)
!513 = !DILocalVariable(name: "region_num", scope: !397, file: !398, line: 200, type: !288)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, elements: !361)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !516, line: 52, size: 96, elements: !517)
!516 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !515, file: !516, line: 53, baseType: !22, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !515, file: !516, line: 54, baseType: !120, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !515, file: !516, line: 55, baseType: !521, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !522, line: 304, baseType: !523)
!522 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 301, size: 32, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !523, file: !522, line: 302, baseType: !151, size: 16)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !523, file: !522, line: 303, baseType: !151, size: 16, offset: 16)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 96, elements: !292)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !531, file: !587, line: 39, type: !288, isLocal: true, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !533, globals: !578, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!533 = !{!534, !102, !103, !562}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !536, line: 1495, baseType: !537)
!536 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 1474, size: 448, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !552}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !537, file: !536, line: 1476, baseType: !188, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !537, file: !536, line: 1477, baseType: !189, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !537, file: !536, line: 1478, baseType: !189, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !537, file: !536, line: 1479, baseType: !189, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !537, file: !536, line: 1480, baseType: !189, size: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !537, file: !536, line: 1481, baseType: !189, size: 32, offset: 160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !537, file: !536, line: 1482, baseType: !189, size: 32, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !537, file: !536, line: 1483, baseType: !189, size: 32, offset: 224)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !537, file: !536, line: 1484, baseType: !189, size: 32, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !537, file: !536, line: 1485, baseType: !189, size: 32, offset: 288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !537, file: !536, line: 1486, baseType: !189, size: 32, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !537, file: !536, line: 1487, baseType: !551, size: 32, offset: 352)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 32, elements: !292)
!552 = !DIDerivedType(tag: DW_TAG_member, scope: !537, file: !536, line: 1488, baseType: !553, size: 64, offset: 384)
!553 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !537, file: !536, line: 1488, size: 64, elements: !554)
!554 = !{!555, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !553, file: !536, line: 1489, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 64, elements: !434)
!557 = !DIDerivedType(tag: DW_TAG_member, scope: !553, file: !536, line: 1490, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !553, file: !536, line: 1490, size: 64, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !558, file: !536, line: 1491, baseType: !189, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !558, file: !536, line: 1492, baseType: !189, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !565, line: 27, size: 128, elements: !566)
!565 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!566 = !{!567, !568, !571}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !564, file: !565, line: 29, baseType: !137, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !564, file: !565, line: 31, baseType: !569, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !564, file: !565, line: 37, baseType: !572, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !522, line: 298, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !522, line: 289, size: 64, elements: !574)
!574 = !{!575, !576, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !573, file: !522, line: 291, baseType: !288, size: 5, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !573, file: !522, line: 293, baseType: !288, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !573, file: !522, line: 295, baseType: !137, size: 32, offset: 32)
!578 = !{!529, !579}
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !531, file: !581, line: 31, type: !582, isLocal: true, isDefinition: true)
!581 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 160, elements: !292)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !581, line: 21, size: 160, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !583, file: !581, line: 22, baseType: !103, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !583, file: !581, line: 23, baseType: !564, size: 128, offset: 32)
!587 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !590, file: !597, line: 21, type: !128, isLocal: true, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !592, globals: !596, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!592 = !{!593, !103, !102}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !595, line: 22, baseType: !103)
!595 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!596 = !{!588}
!597 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !600, file: !605, line: 13, type: !624, isLocal: true, isDefinition: true)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !602, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!602 = !{!603, !598}
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "mpu_config", scope: !600, file: !605, line: 37, type: !606, isLocal: false, isDefinition: true)
!605 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !565, line: 41, size: 64, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !607, file: !565, line: 43, baseType: !137, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !607, file: !565, line: 45, baseType: !611, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !565, line: 27, size: 128, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !613, file: !565, line: 29, baseType: !137, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !613, file: !565, line: 31, baseType: !569, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !613, file: !565, line: 37, baseType: !618, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !522, line: 298, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !522, line: 289, size: 64, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !619, file: !522, line: 291, baseType: !288, size: 5, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !619, file: !522, line: 293, baseType: !288, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !619, file: !522, line: 295, baseType: !137, size: 32, offset: 32)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 256, elements: !434)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_init", scope: !627, file: !728, line: 86, type: !729, isLocal: true, isDefinition: true, align: 32)
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !629, retainedTypes: !641, globals: !727, splitDebugInlining: false, nameTableKind: None)
!628 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!629 = !{!630, !636}
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !631, line: 506, baseType: !32, size: 32, elements: !632)
!631 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!632 = !{!633, !634, !635}
!633 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!634 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!635 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !631, line: 512, baseType: !32, size: 32, elements: !637)
!637 = !{!638, !639, !640}
!638 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!639 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!640 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!641 = !{!642, !716, !721, !682, !636, !630, !726, !102}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !631, line: 523, size: 288, elements: !645)
!645 = !{!646, !672, !678, !683, !687, !688, !689, !693, !712}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !644, file: !631, line: 524, baseType: !647, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!648 = !DISubroutineType(types: !649)
!649 = !{!103, !650, !670, !671}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !653, line: 378, size: 192, elements: !654)
!653 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!654 = !{!655, !656, !657, !658, !665, !666}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !652, file: !653, line: 380, baseType: !569, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !652, file: !653, line: 382, baseType: !13, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !652, file: !653, line: 384, baseType: !13, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !652, file: !653, line: 386, baseType: !659, size: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !653, line: 351, size: 16, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !660, file: !653, line: 359, baseType: !288, size: 8)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !660, file: !653, line: 364, baseType: !664, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!664 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !652, file: !653, line: 388, baseType: !102, size: 32, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !652, file: !653, line: 396, baseType: !667, size: 32, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !653, line: 43, baseType: !315)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !631, line: 237, baseType: !288)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !631, line: 257, baseType: !137)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !644, file: !631, line: 530, baseType: !673, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DISubroutineType(types: !675)
!675 = !{!103, !650, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !631, line: 229, baseType: !137)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !644, file: !631, line: 532, baseType: !679, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DISubroutineType(types: !681)
!681 = !{!103, !650, !682, !677}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !631, line: 216, baseType: !137)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !644, file: !631, line: 535, baseType: !684, size: 32, offset: 96)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!685 = !DISubroutineType(types: !686)
!686 = !{!103, !650, !682}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !644, file: !631, line: 537, baseType: !684, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !644, file: !631, line: 539, baseType: !684, size: 32, offset: 160)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !644, file: !631, line: 541, baseType: !690, size: 32, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DISubroutineType(types: !692)
!692 = !{!103, !650, !670, !630, !636}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !644, file: !631, line: 544, baseType: !694, size: 32, offset: 224)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DISubroutineType(types: !696)
!696 = !{!103, !650, !697, !664}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !631, line: 478, size: 96, elements: !699)
!699 = !{!700, !706, !711}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !698, file: !631, line: 482, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !703)
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !702, file: !262, line: 30, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !698, file: !631, line: 485, baseType: !707, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !631, line: 464, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !650, !697, !682}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !698, file: !631, line: 493, baseType: !682, size: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !644, file: !631, line: 547, baseType: !713, size: 32, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!714 = !DISubroutineType(types: !715)
!715 = !{!137, !650}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !631, line: 428, size: 32, elements: !719)
!719 = !{!720}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !718, file: !631, line: 434, baseType: !682, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !631, line: 441, size: 32, elements: !724)
!724 = !{!725}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !723, file: !631, line: 447, baseType: !682, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!727 = !{!625}
!728 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !225, line: 51, size: 64, elements: !731)
!731 = !{!732, !736}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !730, file: !225, line: 60, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DISubroutineType(types: !735)
!735 = !{!103, !650}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !730, file: !225, line: 65, baseType: !650, size: 32, offset: 32)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "__device_dts_ord_59", scope: !739, file: !943, line: 733, type: !1046, isLocal: false, isDefinition: true, align: 32)
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !740, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !741, retainedTypes: !859, globals: !939, splitDebugInlining: false, nameTableKind: None)
!740 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_ns/sys_heap")
!741 = !{!742, !748, !30, !753, !758, !762, !766, !770, !776, !780, !824, !831, !850}
!742 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !743, line: 23, baseType: !32, size: 32, elements: !744)
!743 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!744 = !{!745, !746, !747}
!745 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!746 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!747 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !743, line: 48, baseType: !32, size: 32, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!751 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!752 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!753 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 167, baseType: !32, size: 32, elements: !755)
!754 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!755 = !{!756, !757}
!756 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!757 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!758 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 107, baseType: !32, size: 32, elements: !759)
!759 = !{!760, !761}
!760 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!761 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!762 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 208, baseType: !32, size: 32, elements: !763)
!763 = !{!764, !765}
!764 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!765 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!766 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 261, baseType: !32, size: 32, elements: !767)
!767 = !{!768, !769}
!768 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!769 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 237, baseType: !32, size: 32, elements: !771)
!771 = !{!772, !773, !774, !775}
!772 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!773 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!774 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!775 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!776 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 152, baseType: !32, size: 32, elements: !777)
!777 = !{!778, !779}
!778 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!779 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!780 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 71, baseType: !103, size: 32, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!782 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!783 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!784 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!785 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!786 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!787 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!788 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!789 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!790 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!791 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!792 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!793 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!794 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!795 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!796 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!797 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!798 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!799 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!800 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!801 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!802 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!803 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!804 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!805 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!806 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!807 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!808 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!809 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!810 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!811 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!812 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!813 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!814 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!815 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!816 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!817 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!818 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!819 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!820 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!821 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!822 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!823 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !825, line: 44, baseType: !32, size: 32, elements: !826)
!825 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!826 = !{!827, !828, !829, !830}
!827 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!828 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!829 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!830 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!831 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !832, line: 54, baseType: !32, size: 32, elements: !833)
!832 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = !{!834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849}
!834 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!835 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!836 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!837 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!838 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!839 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!840 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!841 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!842 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!843 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!844 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!845 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!846 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!847 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!848 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!849 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 53, baseType: !32, size: 32, elements: !852)
!851 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!852 = !{!853, !854, !855, !856, !857, !858}
!853 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!854 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!855 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!856 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!857 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!858 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!859 = !{!742, !102, !103, !860, !902, !903, !904, !905, !252, !137, !163, !664, !906, !907, !328, !908, !938, !120}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !183, line: 923, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 883, size: 10464, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !872, !873, !874, !875, !876, !877, !878, !879, !883, !884, !885, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !862, file: !183, line: 884, baseType: !189, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !862, file: !183, line: 885, baseType: !189, size: 32, offset: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !862, file: !183, line: 886, baseType: !189, size: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !862, file: !183, line: 887, baseType: !189, size: 32, offset: 96)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !862, file: !183, line: 888, baseType: !869, size: 896, offset: 128)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 896, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 28)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !862, file: !183, line: 889, baseType: !189, size: 32, offset: 1024)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !862, file: !183, line: 890, baseType: !189, size: 32, offset: 1056)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !862, file: !183, line: 891, baseType: !189, size: 32, offset: 1088)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !862, file: !183, line: 892, baseType: !189, size: 32, offset: 1120)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !862, file: !183, line: 893, baseType: !869, size: 896, offset: 1152)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !862, file: !183, line: 894, baseType: !189, size: 32, offset: 2048)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !862, file: !183, line: 895, baseType: !189, size: 32, offset: 2080)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !862, file: !183, line: 896, baseType: !880, size: 960, offset: 2112)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 960, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: 30)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !862, file: !183, line: 897, baseType: !189, size: 32, offset: 3072)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !862, file: !183, line: 898, baseType: !189, size: 32, offset: 3104)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !862, file: !183, line: 899, baseType: !886, size: 3008, offset: 3136)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 3008, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 94)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !862, file: !183, line: 900, baseType: !189, size: 32, offset: 6144)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !862, file: !183, line: 901, baseType: !189, size: 32, offset: 6176)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !862, file: !183, line: 902, baseType: !189, size: 32, offset: 6208)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !862, file: !183, line: 903, baseType: !188, size: 32, offset: 6240)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !862, file: !183, line: 904, baseType: !194, size: 1984, offset: 6272)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !862, file: !183, line: 905, baseType: !188, size: 32, offset: 8256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !862, file: !183, line: 907, baseType: !188, size: 32, offset: 8288)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !862, file: !183, line: 910, baseType: !188, size: 32, offset: 8320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !862, file: !183, line: 911, baseType: !188, size: 32, offset: 8352)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !862, file: !183, line: 913, baseType: !188, size: 32, offset: 8384)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !862, file: !183, line: 917, baseType: !188, size: 32, offset: 8416)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !862, file: !183, line: 919, baseType: !194, size: 1984, offset: 8448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !862, file: !183, line: 920, baseType: !189, size: 32, offset: 10432)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !754, line: 146, baseType: !758)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !754, line: 164, baseType: !776)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !536, line: 485, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 468, size: 28704, elements: !911)
!911 = !{!912, !916, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !933, !937}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !910, file: !536, line: 470, baseType: !913, size: 512)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 512, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 16)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !910, file: !536, line: 471, baseType: !917, size: 512, offset: 512)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 512, elements: !914)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !910, file: !536, line: 472, baseType: !913, size: 512, offset: 1024)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !910, file: !536, line: 473, baseType: !917, size: 512, offset: 1536)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !910, file: !536, line: 474, baseType: !913, size: 512, offset: 2048)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !910, file: !536, line: 475, baseType: !917, size: 512, offset: 2560)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !910, file: !536, line: 476, baseType: !913, size: 512, offset: 3072)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !910, file: !536, line: 477, baseType: !917, size: 512, offset: 3584)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !910, file: !536, line: 478, baseType: !913, size: 512, offset: 4096)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !910, file: !536, line: 479, baseType: !917, size: 512, offset: 4608)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !910, file: !536, line: 480, baseType: !913, size: 512, offset: 5120)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !910, file: !536, line: 481, baseType: !917, size: 512, offset: 5632)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !910, file: !536, line: 482, baseType: !929, size: 3968, offset: 6144)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 3968, elements: !931)
!930 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !288)
!931 = !{!932}
!932 = !DISubrange(count: 496)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !910, file: !536, line: 483, baseType: !934, size: 18560, offset: 10112)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 18560, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 580)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !910, file: !536, line: 484, baseType: !189, size: 32, offset: 28672)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !825, line: 56, baseType: !102)
!939 = !{!940, !990, !1031, !737, !1036, !1061, !1063, !1080, !1082, !1092, !1095, !1110, !1147, !1161}
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "on", scope: !942, file: !943, line: 549, type: !305, isLocal: true, isDefinition: true)
!942 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !943, file: !943, line: 547, type: !944, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !739, retainedNodes: !946)
!943 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!944 = !DISubroutineType(types: !945)
!945 = !{null, !748}
!946 = !{!947, !948, !951}
!947 = !DILocalVariable(name: "start_mode", arg: 1, scope: !942, file: !943, line: 547, type: !748)
!948 = !DILocalVariable(name: "err", scope: !949, file: !943, line: 553, type: !103)
!949 = distinct !DILexicalBlock(scope: !950, file: !943, line: 552, column: 31)
!950 = distinct !DILexicalBlock(scope: !942, file: !943, line: 552, column: 6)
!951 = !DILocalVariable(name: "mgr", scope: !949, file: !943, line: 554, type: !952)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !954, line: 154, size: 224, elements: !955)
!954 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!955 = !{!956, !968, !969, !985, !987, !988, !989}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !953, file: !954, line: 158, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !262, line: 40, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !262, line: 35, size: 64, elements: !959)
!959 = !{!960, !967}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !958, file: !262, line: 36, baseType: !961, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !964)
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !963, file: !262, line: 30, baseType: !966, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !958, file: !262, line: 37, baseType: !961, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !953, file: !954, line: 163, baseType: !957, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !953, file: !954, line: 166, baseType: !970, size: 32, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !954, line: 133, size: 96, elements: !973)
!973 = !{!974, !983, !984}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !972, file: !954, line: 135, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !954, line: 129, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !952, !979}
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !954, line: 101, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DISubroutineType(types: !982)
!982 = !{null, !952, !103}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !972, file: !954, line: 138, baseType: !975, size: 32, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !972, file: !954, line: 143, baseType: !975, size: 32, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !953, file: !954, line: 169, baseType: !986, offset: 160)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !162)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !953, file: !954, line: 172, baseType: !103, size: 32, offset: 160)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !953, file: !954, line: 175, baseType: !151, size: 16, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !953, file: !954, line: 178, baseType: !151, size: 16, offset: 208)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "cli", scope: !942, file: !943, line: 550, type: !992, isLocal: true, isDefinition: true)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !954, line: 273, size: 128, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !992, file: !954, line: 280, baseType: !962, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !992, file: !954, line: 283, baseType: !996, size: 96, offset: 32)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !997, line: 138, size: 96, elements: !998)
!997 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!998 = !{!999, !1028, !1029}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !996, file: !997, line: 149, baseType: !1000, size: 32)
!1000 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !997, line: 139, size: 32, elements: !1001)
!1001 = !{!1002, !1023}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !1000, file: !997, line: 145, baseType: !1003, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !495, line: 5397, size: 128, elements: !1005)
!1005 = !{!1006, !1021, !1022}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !1004, file: !495, line: 5399, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !413, line: 48, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !413, line: 37, size: 64, elements: !1009)
!1009 = !{!1010, !1016}
!1010 = !DIDerivedType(tag: DW_TAG_member, scope: !1008, file: !413, line: 38, baseType: !1011, size: 32)
!1011 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1008, file: !413, line: 38, size: 32, elements: !1012)
!1012 = !{!1013, !1015}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1011, file: !413, line: 39, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1011, file: !413, line: 40, baseType: !1014, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, scope: !1008, file: !413, line: 42, baseType: !1017, size: 32, offset: 32)
!1017 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1008, file: !413, line: 42, size: 32, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1017, file: !413, line: 43, baseType: !1014, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1017, file: !413, line: 44, baseType: !1014, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !1004, file: !495, line: 5405, baseType: !32, size: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1004, file: !495, line: 5408, baseType: !103, size: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1000, file: !997, line: 148, baseType: !1024, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !997, line: 98, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{null, null}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !996, file: !997, line: 165, baseType: !189, size: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !996, file: !997, line: 174, baseType: !1030, size: 32, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !739, file: !943, line: 733, type: !1033, isLocal: false, isDefinition: true, align: 16)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 80, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 5)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_59", scope: !739, file: !943, line: 733, type: !1038, isLocal: true, isDefinition: true, align: 32)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !225, line: 51, size: 64, elements: !1040)
!1040 = !{!1041, !1060}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1039, file: !225, line: 60, baseType: !1042, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!103, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !653, line: 378, size: 192, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1058, !1059}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1047, file: !653, line: 380, baseType: !569, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1047, file: !653, line: 382, baseType: !13, size: 32, offset: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1047, file: !653, line: 384, baseType: !13, size: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1047, file: !653, line: 386, baseType: !1053, size: 32, offset: 96)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 32)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !653, line: 351, size: 16, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1054, file: !653, line: 359, baseType: !288, size: 8)
