; ModuleID = 'build/arduino_nano_33_ble_sense/drivers/crypto/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.mode_test = type { i8*, void (%struct.device*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.ctr_params }
%struct.ctr_params = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.ctr_params }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !294, line: 18, type: !371, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !123, globals: !290, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!29 = !{!30, !39, !42, !46, !116}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_mode", file: !31, line: 44, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/crypto/cipher.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38}
!34 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_ECB", value: 1)
!35 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CBC", value: 2)
!36 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CTR", value: 3)
!37 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CCM", value: 4)
!38 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_GCM", value: 5)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_algo", file: !31, line: 29, baseType: !32, size: 32, elements: !40)
!40 = !{!41}
!41 = !DIEnumerator(name: "CRYPTO_CIPHER_ALGO_AES", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_op", file: !31, line: 34, baseType: !32, size: 32, elements: !43)
!43 = !{!44, !45}
!44 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_DECRYPT", value: 0)
!45 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_ENCRYPT", value: 1)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !47, line: 27, baseType: !32, size: 32, elements: !48)
!47 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!49 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!50 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!51 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!52 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!53 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!54 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!55 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!56 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!57 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!58 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!59 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!60 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!61 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!62 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!63 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!64 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!65 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!115 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hash_algo", file: !117, line: 26, baseType: !32, size: 32, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/crypto/hash.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !120, !121, !122}
!119 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA224", value: 1)
!120 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA256", value: 2)
!121 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA384", value: 3)
!122 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA512", value: 4)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_driver_api", file: !128, line: 65, size: 224, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/crypto/crypto.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !161, !241, !245, !253, !278, !282}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "query_hw_caps", scope: !127, file: !128, line: 66, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DISubroutineType(types: !133)
!133 = !{!125, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !143, !144, !145, !154, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !137, line: 380, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !136, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !136, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !136, file: !137, line: 386, baseType: !146, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !148)
!148 = !{!149, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !147, file: !137, line: 359, baseType: !150, size: 8)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !151)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !147, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!153 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !136, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !137, line: 43, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !160)
!160 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_begin_session", scope: !127, file: !128, line: 69, baseType: !162, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!125, !134, !165, !39, !30, !42}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ctx", file: !31, line: 110, size: 256, elements: !167)
!167 = !{!168, !212, !217, !218, !219, !220, !239, !240}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !166, file: !31, line: 116, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ops", file: !31, line: 74, size: 64, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_mode", scope: !169, file: !31, line: 76, baseType: !30, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !31, line: 78, baseType: !173, size: 32, offset: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !31, line: 78, size: 32, elements: !174)
!174 = !{!175, !190, !195, !197, !210}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "block_crypt_hndlr", scope: !173, file: !31, line: 79, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_op_t", file: !31, line: 57, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!125, !165, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_pkt", file: !31, line: 180, size: 192, elements: !182)
!182 = !{!183, !185, !186, !187, !188, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !181, file: !31, line: 183, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !181, file: !31, line: 186, baseType: !125, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !181, file: !31, line: 192, baseType: !184, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf_max", scope: !181, file: !31, line: 197, baseType: !125, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !181, file: !31, line: 202, baseType: !125, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !181, file: !31, line: 208, baseType: !165, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_crypt_hndlr", scope: !173, file: !31, line: 80, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbc_op_t", file: !31, line: 62, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{!125, !165, !180, !184}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_crypt_hndlr", scope: !173, file: !31, line: 81, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctr_op_t", file: !31, line: 65, baseType: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_crypt_hndlr", scope: !173, file: !31, line: 82, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ccm_op_t", file: !31, line: 68, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!125, !165, !202, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_aead_pkt", file: !31, line: 217, size: 128, elements: !204)
!204 = !{!205, !206, !207, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt", scope: !203, file: !31, line: 219, baseType: !180, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !203, file: !31, line: 224, baseType: !184, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ad_len", scope: !203, file: !31, line: 227, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !203, file: !31, line: 233, baseType: !184, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_crypt_hndlr", scope: !173, file: !31, line: 83, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcm_op_t", file: !31, line: 71, baseType: !199)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !166, file: !31, line: 126, baseType: !213, size: 32, offset: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 119, size: 32, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bit_stream", scope: !213, file: !31, line: 121, baseType: !184, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !213, file: !31, line: 125, baseType: !124, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !166, file: !31, line: 131, baseType: !134, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !166, file: !31, line: 140, baseType: !124, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "app_sessn_state", scope: !166, file: !31, line: 146, baseType: !124, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mode_params", scope: !166, file: !31, line: 156, baseType: !221, size: 32, offset: 192)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 152, size: 32, elements: !222)
!222 = !{!223, !230, !234}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_info", scope: !221, file: !31, line: 153, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ccm_params", file: !31, line: 87, size: 32, elements: !225)
!225 = !{!226, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !224, file: !31, line: 88, baseType: !227, size: 16)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !224, file: !31, line: 89, baseType: !227, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_info", scope: !221, file: !31, line: 154, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctr_params", file: !31, line: 92, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_len", scope: !231, file: !31, line: 96, baseType: !208, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_info", scope: !221, file: !31, line: 155, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcm_params", file: !31, line: 99, size: 32, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !235, file: !31, line: 100, baseType: !227, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !235, file: !31, line: 101, baseType: !227, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !166, file: !31, line: 161, baseType: !227, size: 16, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !166, file: !31, line: 169, baseType: !227, size: 16, offset: 240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_free_session", scope: !127, file: !128, line: 74, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{!125, !134, !165}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_async_callback_set", scope: !127, file: !128, line: 77, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!125, !134, !249}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_completion_cb", file: !31, line: 242, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !180, !125}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hash_begin_session", scope: !127, file: !128, line: 81, baseType: !254, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!125, !134, !257, !116}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_ctx", file: !117, line: 47, size: 128, elements: !259)
!259 = !{!260, !261, !262, !276, !277}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !258, file: !117, line: 51, baseType: !134, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !258, file: !117, line: 60, baseType: !124, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hash_hndlr", scope: !258, file: !117, line: 65, baseType: !263, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_op_t", file: !117, line: 38, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{!125, !257, !267, !153}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_pkt", file: !117, line: 88, size: 128, elements: !269)
!269 = !{!270, !271, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !268, file: !117, line: 91, baseType: !184, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !268, file: !117, line: 94, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !268, file: !117, line: 101, baseType: !184, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !268, file: !117, line: 107, baseType: !257, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "started", scope: !258, file: !117, line: 70, baseType: !153, size: 8, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !117, line: 78, baseType: !227, size: 16, offset: 112)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hash_free_session", scope: !127, file: !128, line: 84, baseType: !279, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{!125, !134, !257}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "hash_async_callback_set", scope: !127, file: !128, line: 86, baseType: !283, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!125, !134, !286}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_completion_cb", file: !117, line: 114, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !267, !125}
!290 = !{!25, !291, !314, !316, !318, !320, !324, !327, !329, !334, !339, !344, !349, !351, !356, !361, !366}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "iv", scope: !293, file: !294, line: 227, type: !311, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "cbc_mode", scope: !294, file: !294, line: 205, type: !295, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !297)
!294 = !DIFile(filename: "zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !DISubroutineType(types: !296)
!296 = !{null, !134}
!297 = !{!298, !299, !303, !307, !308, !309, !310}
!298 = !DILocalVariable(name: "dev", arg: 1, scope: !293, file: !294, line: 205, type: !134)
!299 = !DILocalVariable(name: "encrypted", scope: !293, file: !294, line: 207, type: !300)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 640, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 80)
!303 = !DILocalVariable(name: "decrypted", scope: !293, file: !294, line: 208, type: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 64)
!307 = !DILocalVariable(name: "ini", scope: !293, file: !294, line: 209, type: !166)
!308 = !DILocalVariable(name: "encrypt", scope: !293, file: !294, line: 214, type: !181)
!309 = !DILocalVariable(name: "decrypt", scope: !293, file: !294, line: 220, type: !181)
!310 = !DILabel(scope: !293, name: "out", file: !294, line: 279)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 16)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "cap_flags", scope: !27, file: !294, line: 48, type: !208, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "key", scope: !27, file: !294, line: 34, type: !311, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "plaintext", scope: !27, file: !294, line: 39, type: !304, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "cbc_ciphertext", scope: !27, file: !294, line: 195, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 640, elements: !301)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "ctr_ciphertext", scope: !27, file: !294, line: 283, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 512, elements: !305)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "ccm_key", scope: !27, file: !294, line: 373, type: !311, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "ccm_data", scope: !27, file: !294, line: 384, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 184, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 23)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "ccm_hdr", scope: !27, file: !294, line: 381, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 8)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "ccm_nonce", scope: !27, file: !294, line: 377, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 104, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 13)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "ccm_expected", scope: !27, file: !294, line: 388, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 248, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 31)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "gcm_key", scope: !27, file: !294, line: 485, type: !311, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "gcm_data", scope: !27, file: !294, line: 496, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 336, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 42)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "gcm_hdr", scope: !27, file: !294, line: 492, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 160, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 20)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gcm_nonce", scope: !27, file: !294, line: 489, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 12)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "gcm_expected", scope: !27, file: !294, line: 502, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 464, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 58)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !373, line: 17, baseType: !140, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !372, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !379, file: !395, line: 18, type: !396, isLocal: false, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !381, globals: !394, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!381 = !{!22, !124, !24, !382, !384, !386, !272, !125, !387, !388, !390, !392, !393, !184, !227, !140}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!394 = !{!377}
!395 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !373, line: 17, baseType: !140, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !397, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_char_out", scope: !403, file: !408, line: 54, type: !409, isLocal: false, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!405 = !{!46}
!406 = !{!124, !125}
!407 = !{!401}
!408 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{!125, !125}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !414, file: !453, line: 22, type: !485, isLocal: false, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !416, retainedTypes: !428, globals: !450, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!416 = !{!417, !46}
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !418, line: 27, baseType: !32, size: 32, elements: !419)
!418 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427}
!420 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!421 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!422 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!423 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!424 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!425 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!426 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!427 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!428 = !{!124, !429, !125, !24, !432, !393, !208, !448}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !430, line: 46, baseType: !431)
!430 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !391)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !434, line: 54, size: 96, elements: !435)
!434 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!435 = !{!436, !443, !447}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !433, file: !434, line: 55, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !438, line: 33, baseType: !439)
!438 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !438, line: 29, size: 32, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !439, file: !438, line: 30, baseType: !442, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !433, file: !434, line: 60, baseType: !444, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !417}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !433, file: !434, line: 65, baseType: !444, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !449)
!449 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!450 = !{!412, !451, !459, !464, !466, !475, !477}
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !414, file: !453, line: 27, type: !454, isLocal: true, isDefinition: true)
!453 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 32, elements: !457)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !456, line: 22, baseType: !389)
!456 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = !{!458}
!458 = !DISubrange(count: 1)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !414, file: !453, line: 44, type: !461, isLocal: true, isDefinition: true)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !462, line: 43, elements: !463)
!462 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = !{}
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !414, file: !453, line: 49, type: !461, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !414, file: !453, line: 36, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 128, elements: !457)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !418, line: 114, size: 128, elements: !470)
!470 = !{!471, !472, !473, !474}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !469, file: !418, line: 115, baseType: !417, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !469, file: !418, line: 141, baseType: !150, size: 8, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !469, file: !418, line: 149, baseType: !208, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !469, file: !418, line: 156, baseType: !208, size: 32, offset: 96)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !414, file: !453, line: 40, type: !468, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !414, file: !453, line: 28, type: !479, isLocal: true, isDefinition: true)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !438, line: 40, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !438, line: 35, size: 64, elements: !481)
!481 = !{!482, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !480, file: !438, line: 36, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !480, file: !438, line: 37, baseType: !483, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !486, file: !373, line: 17, baseType: !140, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !486, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!490 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!491 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !494, file: !521, line: 50, type: !508, isLocal: true, isDefinition: true)
!494 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !416, retainedTypes: !496, globals: !518, splitDebugInlining: false, nameTableKind: None)
!495 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!496 = !{!159, !429, !272, !125, !124, !208, !448, !497, !393, !508, !509}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !499, line: 45, size: 64, elements: !500)
!499 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!500 = !{!501, !507}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !498, file: !499, line: 46, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !438, line: 33, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !438, line: 29, size: 32, elements: !504)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !503, file: !438, line: 30, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !498, file: !499, line: 48, baseType: !208, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !125)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !499, line: 38, size: 64, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !510, file: !499, line: 39, baseType: !502, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !510, file: !499, line: 41, baseType: !514, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !499, line: 35, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !508}
!518 = !{!519, !523, !531, !492, !533, !543}
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "latency_lock", scope: !494, file: !521, line: 44, type: !522, isLocal: true, isDefinition: true)
!521 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !462, line: 43, elements: !463)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !494, file: !521, line: 46, type: !525, isLocal: true, isDefinition: true)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !438, line: 40, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !438, line: 35, size: 64, elements: !527)
!527 = !{!528, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !526, file: !438, line: 36, baseType: !529, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !526, file: !438, line: 37, baseType: !529, size: 32, offset: 32)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "latency_subs", scope: !494, file: !521, line: 52, type: !525, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !494, file: !521, line: 39, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, elements: !541)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !521, line: 35, size: 96, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !536, file: !521, line: 36, baseType: !417, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !536, file: !521, line: 37, baseType: !150, size: 8, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !536, file: !521, line: 38, baseType: !455, size: 32, offset: 64)
!541 = !{!542}
!542 = !DISubrange(count: 0)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !494, file: !521, line: 48, type: !508, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !547, file: !554, line: 47, type: !567, isLocal: true, isDefinition: true)
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !549, retainedTypes: !550, globals: !551, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!549 = !{!417}
!550 = !{!272, !125}
!551 = !{!552, !545, !564}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "cpus_states", scope: !547, file: !554, line: 50, type: !555, isLocal: true, isDefinition: true)
!554 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 32, elements: !457)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !418, line: 114, size: 128, elements: !559)
!559 = !{!560, !561, !562, !563}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !558, file: !418, line: 115, baseType: !417, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !558, file: !418, line: 141, baseType: !150, size: 8, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !558, file: !418, line: 149, baseType: !208, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !558, file: !418, line: 156, baseType: !208, size: 32, offset: 96)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !547, file: !554, line: 55, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 8, elements: !457)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, elements: !541)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "inv_sbox", scope: !570, file: !584, line: 37, type: !585, isLocal: true, isDefinition: true)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !572, globals: !583, splitDebugInlining: false, nameTableKind: None)
!571 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!572 = !{!184, !573, !574, !150}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !575, line: 66, baseType: !576)
!575 = !DIFile(filename: "modules/crypto/tinycrypt/lib/include/tinycrypt/aes.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !575, line: 64, size: 1408, elements: !578)
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !577, file: !575, line: 65, baseType: !580, size: 1408)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1408, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 44)
!583 = !{!568}
!584 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 2048, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 256)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "sbox", scope: !590, file: !599, line: 37, type: !585, isLocal: true, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !592, globals: !598, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!592 = !{!593, !573, !184, !150}
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !575, line: 66, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !575, line: 64, size: 1408, elements: !596)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !595, file: !575, line: 65, baseType: !580, size: 1408)
!598 = !{!588}
!599 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !602, file: !609, line: 17, type: !746, isLocal: false, isDefinition: true)
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !604, globals: !605, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!604 = !{!272, !125, !208, !124}
!605 = !{!600, !606, !742}
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !608, file: !609, line: 198, type: !730, isLocal: true, isDefinition: true)
!608 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !609, file: !609, line: 175, type: !610, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !725)
!609 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!610 = !DISubroutineType(types: !611)
!611 = !{null, !612}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !614, line: 245, size: 1024, elements: !615)
!614 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!615 = !{!616, !681, !694, !695, !696, !697, !703, !720}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !613, file: !614, line: 247, baseType: !617, size: 384)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !614, line: 57, size: 384, elements: !618)
!618 = !{!619, !647, !655, !656, !657, !668, !669, !670}
!619 = !DIDerivedType(tag: DW_TAG_member, scope: !617, file: !614, line: 60, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !617, file: !614, line: 60, size: 64, elements: !621)
!621 = !{!622, !638}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !620, file: !614, line: 61, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !624, line: 49, baseType: !625)
!624 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !624, line: 37, size: 64, elements: !626)
!626 = !{!627, !633}
!627 = !DIDerivedType(tag: DW_TAG_member, scope: !625, file: !624, line: 38, baseType: !628, size: 32)
!628 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !625, file: !624, line: 38, size: 32, elements: !629)
!629 = !{!630, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !628, file: !624, line: 39, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !628, file: !624, line: 40, baseType: !631, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, scope: !625, file: !624, line: 42, baseType: !634, size: 32, offset: 32)
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !625, file: !624, line: 42, size: 32, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !634, file: !624, line: 43, baseType: !631, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !634, file: !624, line: 44, baseType: !631, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !620, file: !614, line: 62, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !640, line: 49, size: 64, elements: !641)
!640 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!641 = !{!642}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !639, file: !640, line: 50, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 64, elements: !645)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!645 = !{!646}
!646 = !DISubrange(count: 2)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !617, file: !614, line: 68, baseType: !648, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !650, line: 233, baseType: !651)
!650 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 231, size: 64, elements: !652)
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !651, file: !650, line: 232, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !624, line: 48, baseType: !625)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !617, file: !614, line: 71, baseType: !150, size: 8, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !617, file: !614, line: 74, baseType: !150, size: 8, offset: 104)
!657 = !DIDerivedType(tag: DW_TAG_member, scope: !617, file: !614, line: 90, baseType: !658, size: 16, offset: 112)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !617, file: !614, line: 90, size: 16, elements: !659)
!659 = !{!660, !667}
!660 = !DIDerivedType(tag: DW_TAG_member, scope: !658, file: !614, line: 91, baseType: !661, size: 16)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !658, file: !614, line: 91, size: 16, elements: !662)
!662 = !{!663, !666}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !661, file: !614, line: 96, baseType: !664, size: 8)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !665)
!665 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !661, file: !614, line: 97, baseType: !150, size: 8, offset: 8)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !658, file: !614, line: 100, baseType: !227, size: 16)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !617, file: !614, line: 107, baseType: !208, size: 32, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !617, file: !614, line: 127, baseType: !124, size: 32, offset: 160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !617, file: !614, line: 131, baseType: !671, size: 192, offset: 192)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !650, line: 244, size: 192, elements: !672)
!672 = !{!673, !674, !680}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !671, file: !650, line: 245, baseType: !623, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !671, file: !650, line: 246, baseType: !675, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !650, line: 242, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !679}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !671, file: !650, line: 249, baseType: !431, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !613, file: !614, line: 250, baseType: !682, size: 288, offset: 384)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !683, line: 25, size: 288, elements: !684)
!683 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !682, file: !683, line: 26, baseType: !208, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !682, file: !683, line: 27, baseType: !208, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !682, file: !683, line: 28, baseType: !208, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !682, file: !683, line: 29, baseType: !208, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !682, file: !683, line: 30, baseType: !208, size: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !682, file: !683, line: 31, baseType: !208, size: 32, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !682, file: !683, line: 32, baseType: !208, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !682, file: !683, line: 33, baseType: !208, size: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !682, file: !683, line: 34, baseType: !208, size: 32, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !613, file: !614, line: 253, baseType: !124, size: 32, offset: 672)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !613, file: !614, line: 256, baseType: !649, size: 64, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !613, file: !614, line: 294, baseType: !125, size: 32, offset: 768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !613, file: !614, line: 300, baseType: !698, size: 96, offset: 800)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !614, line: 149, size: 96, elements: !699)
!699 = !{!700, !701, !702}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !698, file: !614, line: 153, baseType: !22, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !698, file: !614, line: 162, baseType: !272, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !698, file: !614, line: 168, baseType: !272, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !613, file: !614, line: 325, baseType: !704, size: 32, offset: 896)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !706, line: 5073, size: 160, elements: !707)
!706 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!707 = !{!708, !717, !718}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !705, file: !706, line: 5074, baseType: !709, size: 96)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !710, line: 56, size: 96, elements: !711)
!710 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!711 = !{!712, !715, !716}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !709, file: !710, line: 57, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !710, line: 57, flags: DIFlagFwdDecl)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !709, file: !710, line: 58, baseType: !124, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !709, file: !710, line: 59, baseType: !272, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !705, file: !706, line: 5075, baseType: !649, size: 64, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !705, file: !706, line: 5076, baseType: !719, offset: 160)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !462, line: 43, elements: !463)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !613, file: !614, line: 343, baseType: !721, size: 64, offset: 928)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !683, line: 60, size: 64, elements: !722)
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !721, file: !683, line: 63, baseType: !208, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !721, file: !683, line: 66, baseType: !208, size: 32, offset: 32)
!725 = !{!726, !727, !728, !729}
!726 = !DILocalVariable(name: "thread", arg: 1, scope: !608, file: !609, line: 175, type: !612)
!727 = !DILocalVariable(name: "region_num", scope: !608, file: !609, line: 200, type: !150)
!728 = !DILocalVariable(name: "guard_start", scope: !608, file: !609, line: 265, type: !22)
!729 = !DILocalVariable(name: "guard_size", scope: !608, file: !609, line: 266, type: !272)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 96, elements: !457)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !732, line: 52, size: 96, elements: !733)
!732 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !731, file: !732, line: 53, baseType: !22, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !731, file: !732, line: 54, baseType: !272, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !731, file: !732, line: 55, baseType: !737, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !738, line: 151, baseType: !739)
!738 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !738, line: 149, size: 32, elements: !740)
!740 = !{!741}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !739, file: !738, line: 150, baseType: !208, size: 32)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "static_regions", scope: !602, file: !609, line: 62, type: !744, isLocal: true, isDefinition: true)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 96, elements: !457)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !731)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !747, file: !373, line: 17, baseType: !140, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !747, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !753, file: !787, line: 39, type: !150, isLocal: true, isDefinition: true)
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !755, globals: !786, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!755 = !{!756, !124, !125, !774, !150}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !758, line: 1226, baseType: !759)
!758 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !758, line: 1213, size: 352, elements: !760)
!760 = !{!761, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !759, file: !758, line: 1215, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !208)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !759, file: !758, line: 1216, baseType: !763, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !759, file: !758, line: 1217, baseType: !763, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !759, file: !758, line: 1218, baseType: !763, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !759, file: !758, line: 1219, baseType: !763, size: 32, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !759, file: !758, line: 1220, baseType: !763, size: 32, offset: 160)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !759, file: !758, line: 1221, baseType: !763, size: 32, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !759, file: !758, line: 1222, baseType: !763, size: 32, offset: 224)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !759, file: !758, line: 1223, baseType: !763, size: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !759, file: !758, line: 1224, baseType: !763, size: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !759, file: !758, line: 1225, baseType: !763, size: 32, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !777, line: 27, size: 96, elements: !778)
!777 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!778 = !{!779, !780, !781}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !776, file: !777, line: 29, baseType: !208, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !776, file: !777, line: 31, baseType: !140, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !776, file: !777, line: 37, baseType: !782, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !738, line: 146, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !738, line: 141, size: 32, elements: !784)
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !783, file: !738, line: 143, baseType: !208, size: 32)
!786 = !{!751}
!787 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !790, file: !797, line: 21, type: !409, isLocal: true, isDefinition: true)
!790 = distinct !DICompileUnit(language: DW_LANG_C99, file: !791, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !792, globals: !796, splitDebugInlining: false, nameTableKind: None)
!791 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!792 = !{!793, !125, !124}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !795, line: 22, baseType: !125)
!795 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!796 = !{!788}
!797 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !800, file: !805, line: 13, type: !822, isLocal: true, isDefinition: true)
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !801, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !802, splitDebugInlining: false, nameTableKind: None)
!801 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!802 = !{!803, !798}
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "mpu_config", scope: !800, file: !805, line: 37, type: !806, isLocal: false, isDefinition: true)
!805 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !777, line: 41, size: 64, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !807, file: !777, line: 43, baseType: !208, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !807, file: !777, line: 45, baseType: !811, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !777, line: 27, size: 96, elements: !814)
!814 = !{!815, !816, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !813, file: !777, line: 29, baseType: !208, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !813, file: !777, line: 31, baseType: !140, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !813, file: !777, line: 37, baseType: !818, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !738, line: 146, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !738, line: 141, size: 32, elements: !820)
!820 = !{!821}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !819, file: !738, line: 143, baseType: !208, size: 32)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 192, elements: !645)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !825, file: !987, line: 48, type: !1004, isLocal: false, isDefinition: true)
!825 = distinct !DICompileUnit(language: DW_LANG_C99, file: !826, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !827, globals: !984, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!827 = !{!828, !150, !124, !125, !908, !208, !909, !943, !954}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !830, line: 1071, baseType: !831)
!830 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 1035, size: 19584, elements: !832)
!832 = !{!833, !837, !838, !839, !843, !844, !846, !847, !848, !849, !850, !851, !855, !856, !857, !861, !862, !866, !867, !871, !872, !876, !877, !878, !879, !880, !881, !882, !886, !887, !888, !889, !893, !894, !898}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !831, file: !830, line: 1036, baseType: !834, size: 960)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 960, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 30)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !831, file: !830, line: 1037, baseType: !763, size: 32, offset: 960)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !831, file: !830, line: 1038, baseType: !763, size: 32, offset: 992)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !831, file: !830, line: 1039, baseType: !840, size: 1088, offset: 1024)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 1088, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 34)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !831, file: !830, line: 1040, baseType: !763, size: 32, offset: 2112)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !831, file: !830, line: 1041, baseType: !845, size: 64, offset: 2144)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 64, elements: !645)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !831, file: !830, line: 1042, baseType: !763, size: 32, offset: 2208)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !831, file: !830, line: 1043, baseType: !763, size: 32, offset: 2240)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !831, file: !830, line: 1044, baseType: !763, size: 32, offset: 2272)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !831, file: !830, line: 1045, baseType: !763, size: 32, offset: 2304)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !831, file: !830, line: 1046, baseType: !763, size: 32, offset: 2336)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !831, file: !830, line: 1047, baseType: !852, size: 3808, offset: 2368)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 3808, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 119)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !831, file: !830, line: 1048, baseType: !763, size: 32, offset: 6176)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !831, file: !830, line: 1049, baseType: !763, size: 32, offset: 6208)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !831, file: !830, line: 1050, baseType: !858, size: 1952, offset: 6240)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 1952, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 61)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !831, file: !830, line: 1051, baseType: !763, size: 32, offset: 8192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !831, file: !830, line: 1052, baseType: !863, size: 288, offset: 8224)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 288, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 9)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !831, file: !830, line: 1053, baseType: !762, size: 32, offset: 8512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !831, file: !830, line: 1054, baseType: !868, size: 96, offset: 8544)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 96, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 3)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !831, file: !830, line: 1055, baseType: !762, size: 32, offset: 8640)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !831, file: !830, line: 1056, baseType: !873, size: 1568, offset: 8672)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 1568, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 49)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !831, file: !830, line: 1057, baseType: !763, size: 32, offset: 10240)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !831, file: !830, line: 1058, baseType: !868, size: 96, offset: 10272)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !831, file: !830, line: 1059, baseType: !763, size: 32, offset: 10368)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !831, file: !830, line: 1060, baseType: !845, size: 64, offset: 10400)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !831, file: !830, line: 1061, baseType: !763, size: 32, offset: 10464)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !831, file: !830, line: 1062, baseType: !763, size: 32, offset: 10496)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !831, file: !830, line: 1063, baseType: !883, size: 672, offset: 10528)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 672, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 21)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !831, file: !830, line: 1064, baseType: !763, size: 32, offset: 11200)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !831, file: !830, line: 1065, baseType: !762, size: 32, offset: 11232)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !831, file: !830, line: 1066, baseType: !763, size: 32, offset: 11264)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !831, file: !830, line: 1067, baseType: !890, size: 1504, offset: 11296)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 1504, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 47)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !831, file: !830, line: 1068, baseType: !762, size: 32, offset: 12800)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !831, file: !830, line: 1069, baseType: !895, size: 5600, offset: 12832)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 5600, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 175)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !831, file: !830, line: 1070, baseType: !899, size: 1152, offset: 18432)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 1152, elements: !864)
!900 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !830, line: 278, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 272, size: 128, elements: !903)
!903 = !{!904, !905, !906, !907}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !902, file: !830, line: 273, baseType: !763, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !902, file: !830, line: 274, baseType: !763, size: 32, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !902, file: !830, line: 275, baseType: !763, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !902, file: !830, line: 277, baseType: !762, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !758, line: 468, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !758, line: 445, size: 1120, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918, !919, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !936, !940, !942}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !911, file: !758, line: 447, baseType: !762, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !911, file: !758, line: 448, baseType: !763, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !911, file: !758, line: 449, baseType: !763, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !911, file: !758, line: 450, baseType: !763, size: 32, offset: 96)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !911, file: !758, line: 451, baseType: !763, size: 32, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !911, file: !758, line: 452, baseType: !763, size: 32, offset: 160)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !911, file: !758, line: 453, baseType: !920, size: 96, offset: 192)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 96, elements: !364)
!921 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !150)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !911, file: !758, line: 454, baseType: !763, size: 32, offset: 288)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !911, file: !758, line: 455, baseType: !763, size: 32, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !911, file: !758, line: 456, baseType: !763, size: 32, offset: 352)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !911, file: !758, line: 457, baseType: !763, size: 32, offset: 384)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !911, file: !758, line: 458, baseType: !763, size: 32, offset: 416)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !911, file: !758, line: 459, baseType: !763, size: 32, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !911, file: !758, line: 460, baseType: !763, size: 32, offset: 480)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !911, file: !758, line: 461, baseType: !845, size: 64, offset: 512)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !911, file: !758, line: 462, baseType: !762, size: 32, offset: 576)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !911, file: !758, line: 463, baseType: !762, size: 32, offset: 608)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !911, file: !758, line: 464, baseType: !933, size: 128, offset: 640)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 128, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 4)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !911, file: !758, line: 465, baseType: !937, size: 160, offset: 768)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 160, elements: !938)
!938 = !{!939}
!939 = !DISubrange(count: 5)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !911, file: !758, line: 466, baseType: !941, size: 160, offset: 928)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 160, elements: !938)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !911, file: !758, line: 467, baseType: !763, size: 32, offset: 1088)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !945, file: !944, line: 167, baseType: !953)
!944 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!945 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !944, file: !944, line: 134, type: !946, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !825, retainedNodes: !948)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !208}
!948 = !{!949, !950, !952}
!949 = !DILocalVariable(name: "time_us", arg: 1, scope: !945, file: !944, line: 134, type: !208)
!950 = !DILocalVariable(name: "delay_cycles", scope: !945, file: !944, line: 168, type: !951)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!952 = !DILocalVariable(name: "cycles", scope: !945, file: !944, line: 171, type: !208)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !830, line: 2399, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 2373, size: 10880, elements: !957)
!957 = !{!958, !960, !961, !962, !963, !967, !968, !973, !974, !975, !976, !977, !978, !980, !981, !982, !983}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !956, file: !830, line: 2374, baseType: !959, size: 8192)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 8192, elements: !586)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !956, file: !830, line: 2375, baseType: !762, size: 32, offset: 8192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !956, file: !830, line: 2376, baseType: !762, size: 32, offset: 8224)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !956, file: !830, line: 2377, baseType: !762, size: 32, offset: 8256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !956, file: !830, line: 2378, baseType: !964, size: 1984, offset: 8288)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 1984, elements: !965)
!965 = !{!966}
!966 = !DISubrange(count: 62)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !956, file: !830, line: 2379, baseType: !763, size: 32, offset: 10272)
!968 = !DIDerivedType(tag: DW_TAG_member, scope: !956, file: !830, line: 2381, baseType: !969, size: 32, offset: 10304)
!969 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !956, file: !830, line: 2381, size: 32, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !969, file: !830, line: 2382, baseType: !763, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !969, file: !830, line: 2383, baseType: !763, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !956, file: !830, line: 2386, baseType: !763, size: 32, offset: 10336)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !956, file: !830, line: 2387, baseType: !763, size: 32, offset: 10368)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !956, file: !830, line: 2389, baseType: !763, size: 32, offset: 10400)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !956, file: !830, line: 2391, baseType: !763, size: 32, offset: 10432)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !956, file: !830, line: 2393, baseType: !763, size: 32, offset: 10464)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !956, file: !830, line: 2394, baseType: !979, size: 256, offset: 10496)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 256, elements: !337)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !956, file: !830, line: 2395, baseType: !763, size: 32, offset: 10752)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !956, file: !830, line: 2396, baseType: !762, size: 32, offset: 10784)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !956, file: !830, line: 2397, baseType: !763, size: 32, offset: 10816)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !956, file: !830, line: 2398, baseType: !763, size: 32, offset: 10848)
!984 = !{!823, !985, !1000}
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !825, file: !987, line: 93, type: !988, isLocal: true, isDefinition: true, align: 32)
!987 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !990, line: 51, size: 64, elements: !991)
!990 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!991 = !{!992, !999}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !989, file: !990, line: 60, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DISubroutineType(types: !995)
!995 = !{!125, !996}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !990, line: 48, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !989, file: !990, line: 65, baseType: !996, size: 32, offset: 32)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !945, file: !944, line: 161, type: !1002, isLocal: true, isDefinition: true, align: 128)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1003, size: 48, elements: !869)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !1006)
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1005, file: !373, line: 17, baseType: !140, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1005, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(name: "__init_board_init", scope: !1011, file: !1110, line: 36, type: !1125, isLocal: true, isDefinition: true, align: 32)
!1011 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1012, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1013, retainedTypes: !1025, globals: !1106, splitDebugInlining: false, nameTableKind: None)
!1012 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/drivers/crypto")
!1013 = !{!1014, !1020}
!1014 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !1015, line: 506, baseType: !32, size: 32, elements: !1016)
!1015 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1016 = !{!1017, !1018, !1019}
!1017 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!1018 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!1019 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!1020 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !1015, line: 512, baseType: !32, size: 32, elements: !1021)
!1021 = !{!1022, !1023, !1024}
!1022 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!1023 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!1024 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!1025 = !{!1026, !1095, !1100, !1061, !1020, !1014, !1105, !124}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !1015, line: 523, size: 288, elements: !1029)
!1029 = !{!1030, !1051, !1057, !1062, !1066, !1067, !1068, !1072, !1091}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !1028, file: !1015, line: 524, baseType: !1031, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!125, !1034, !1049, !1050}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1047, !1048}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1036, file: !137, line: 380, baseType: !140, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1036, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
