; ModuleID = 'build/96b_carbon/subsys/console/echo/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.tty_serial = type { %struct.device*, %struct.k_sem, i8*, i32, i16, i16, i32, %struct.k_sem, i8*, i32, i16, i16, i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.z_heap_bucket = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 97, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5440, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 85)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2720, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "prompt", scope: !27, file: !105, line: 9, type: !106, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/console/echo/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/samples/subsys/console/echo/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 400, elements: !109)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !{!110}
!110 = !DISubrange(count: 50)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "_char_out", scope: !113, file: !116, line: 54, type: !117, isLocal: false, isDefinition: true)
!113 = distinct !DICompileUnit(language: DW_LANG_C99, file: !114, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !115, splitDebugInlining: false, nameTableKind: None)
!114 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!115 = !{!111}
!116 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DISubroutineType(types: !119)
!119 = !{!103, !103}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !122, file: !140, line: 56, type: !141, isLocal: true, isDefinition: true, align: 32)
!122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !123, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !124, globals: !139, splitDebugInlining: false, nameTableKind: None)
!123 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !127, line: 258, baseType: !128)
!127 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f401xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 249, size: 224, elements: !129)
!129 = !{!130, !133, !134, !135, !136, !137, !138}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !128, file: !127, line: 251, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !128, file: !127, line: 252, baseType: !131, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !128, file: !127, line: 253, baseType: !131, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !128, file: !127, line: 254, baseType: !131, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !128, file: !127, line: 255, baseType: !131, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !128, file: !127, line: 256, baseType: !131, size: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !128, file: !127, line: 257, baseType: !131, size: 32, offset: 192)
!139 = !{!120}
!140 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !143, line: 51, size: 64, elements: !144)
!143 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!144 = !{!145, !174}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !142, file: !143, line: 60, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{!103, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !152, line: 378, size: 192, elements: !153)
!152 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!153 = !{!154, !156, !157, !158, !167, !168}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !152, line: 380, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !151, file: !152, line: 382, baseType: !13, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !151, file: !152, line: 384, baseType: !13, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !151, file: !152, line: 386, baseType: !159, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !152, line: 351, size: 16, elements: !161)
!161 = !{!162, !165}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !160, file: !152, line: 359, baseType: !163, size: 8)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !164)
!164 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !160, file: !152, line: 364, baseType: !166, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!166 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !151, file: !152, line: 388, baseType: !102, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !151, file: !152, line: 396, baseType: !169, size: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !152, line: 43, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !173)
!173 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !142, file: !143, line: 65, baseType: !149, size: 32, offset: 32)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !177, file: !180, line: 71, type: !181, isLocal: true, isDefinition: true, align: 32)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !179, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!179 = !{!175}
!180 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !143, line: 51, size: 64, elements: !183)
!183 = !{!184, !203}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !182, file: !143, line: 60, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{!103, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !152, line: 378, size: 192, elements: !191)
!191 = !{!192, !193, !194, !195, !201, !202}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !152, line: 380, baseType: !155, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !190, file: !152, line: 382, baseType: !13, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !190, file: !152, line: 384, baseType: !13, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !190, file: !152, line: 386, baseType: !196, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !152, line: 351, size: 16, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !197, file: !152, line: 359, baseType: !163, size: 8)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !197, file: !152, line: 364, baseType: !166, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !190, file: !152, line: 388, baseType: !102, size: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !190, file: !152, line: 396, baseType: !169, size: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !182, file: !143, line: 65, baseType: !188, size: 32, offset: 32)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "console_serial", scope: !206, file: !297, line: 13, type: !306, isLocal: true, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !208, globals: !294, splitDebugInlining: false, nameTableKind: None)
!207 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!208 = !{!209, !102, !103}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !212, line: 336, size: 608, elements: !213)
!212 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !{!214, !234, !238, !242, !255, !260, !266, !272, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !211, file: !212, line: 365, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DISubroutineType(types: !217)
!217 = !{!103, !218, !233}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !152, line: 378, size: 192, elements: !221)
!221 = !{!222, !223, !224, !225, !231, !232}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !220, file: !152, line: 380, baseType: !155, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !220, file: !152, line: 382, baseType: !13, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !220, file: !152, line: 384, baseType: !13, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !220, file: !152, line: 386, baseType: !226, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !152, line: 351, size: 16, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !227, file: !152, line: 359, baseType: !163, size: 8)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !227, file: !152, line: 364, baseType: !166, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !220, file: !152, line: 388, baseType: !102, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !220, file: !152, line: 396, baseType: !169, size: 32, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !211, file: !212, line: 366, baseType: !235, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !218, !164}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !211, file: !212, line: 374, baseType: !239, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DISubroutineType(types: !241)
!241 = !{!103, !218}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !211, file: !212, line: 377, baseType: !243, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DISubroutineType(types: !245)
!245 = !{!103, !218, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !212, line: 122, size: 64, elements: !249)
!249 = !{!250, !251, !252, !253, !254}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !248, file: !212, line: 123, baseType: !132, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !248, file: !212, line: 124, baseType: !163, size: 8, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !248, file: !212, line: 125, baseType: !163, size: 8, offset: 40)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !248, file: !212, line: 126, baseType: !163, size: 8, offset: 48)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !248, file: !212, line: 127, baseType: !163, size: 8, offset: 56)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !211, file: !212, line: 379, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DISubroutineType(types: !258)
!258 = !{!103, !218, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !211, file: !212, line: 384, baseType: !261, size: 32, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DISubroutineType(types: !263)
!263 = !{!103, !218, !264, !103}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !211, file: !212, line: 393, baseType: !267, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DISubroutineType(types: !269)
!269 = !{!103, !218, !270, !271}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !211, file: !212, line: 402, baseType: !273, size: 32, offset: 224)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !218}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !211, file: !212, line: 405, baseType: !273, size: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !211, file: !212, line: 408, baseType: !239, size: 32, offset: 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !211, file: !212, line: 411, baseType: !273, size: 32, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !211, file: !212, line: 414, baseType: !273, size: 32, offset: 352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !211, file: !212, line: 417, baseType: !239, size: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !211, file: !212, line: 420, baseType: !239, size: 32, offset: 416)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !211, file: !212, line: 423, baseType: !273, size: 32, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !211, file: !212, line: 426, baseType: !273, size: 32, offset: 480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !211, file: !212, line: 429, baseType: !239, size: 32, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !211, file: !212, line: 432, baseType: !239, size: 32, offset: 544)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !211, file: !212, line: 435, baseType: !287, size: 32, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !218, !290, !102}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !212, line: 142, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !218, !102}
!294 = !{!204, !295, !301}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "console_rxbuf", scope: !206, file: !297, line: 15, type: !298, isLocal: true, isDefinition: true)
!297 = !DIFile(filename: "zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 512, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 64)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "console_txbuf", scope: !206, file: !297, line: 16, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 4096, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 512)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tty_serial", file: !307, line: 18, size: 544, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/console/tty.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !310, !337, !338, !339, !342, !343, !345, !346, !347, !348, !349, !350}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "uart_dev", scope: !306, file: !307, line: 19, baseType: !218, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rx_sem", scope: !306, file: !307, line: 21, baseType: !311, size: 128, offset: 32)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !312, line: 2909, size: 128, elements: !313)
!312 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!313 = !{!314, !335, !336}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !311, file: !312, line: 2910, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !316, line: 233, baseType: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 231, size: 64, elements: !318)
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !317, file: !316, line: 232, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !321, line: 48, baseType: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !321, line: 37, size: 64, elements: !323)
!323 = !{!324, !330}
!324 = !DIDerivedType(tag: DW_TAG_member, scope: !322, file: !321, line: 38, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !322, file: !321, line: 38, size: 32, elements: !326)
!326 = !{!327, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !325, file: !321, line: 39, baseType: !328, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !321, line: 40, baseType: !328, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, scope: !322, file: !321, line: 42, baseType: !331, size: 32, offset: 32)
!331 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !322, file: !321, line: 42, size: 32, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !331, file: !321, line: 43, baseType: !328, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !331, file: !321, line: 44, baseType: !328, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !311, file: !312, line: 2911, baseType: !32, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !311, file: !312, line: 2912, baseType: !32, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf", scope: !306, file: !307, line: 22, baseType: !270, size: 32, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf_sz", scope: !306, file: !307, line: 23, baseType: !132, size: 32, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rx_get", scope: !306, file: !307, line: 24, baseType: !340, size: 16, offset: 224)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !341)
!341 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "rx_put", scope: !306, file: !307, line: 24, baseType: !340, size: 16, offset: 240)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rx_timeout", scope: !306, file: !307, line: 25, baseType: !344, size: 32, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tx_sem", scope: !306, file: !307, line: 27, baseType: !311, size: 128, offset: 288)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf", scope: !306, file: !307, line: 28, baseType: !270, size: 32, offset: 416)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf_sz", scope: !306, file: !307, line: 29, baseType: !132, size: 32, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tx_get", scope: !306, file: !307, line: 30, baseType: !340, size: 16, offset: 480)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tx_put", scope: !306, file: !307, line: 30, baseType: !340, size: 16, offset: 496)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tx_timeout", scope: !306, file: !307, line: 31, baseType: !344, size: 32, offset: 512)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "static_regions", scope: !353, file: !362, line: 62, type: !498, isLocal: true, isDefinition: true)
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !355, globals: !358, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!355 = !{!356, !103, !132, !102}
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !357, line: 214, baseType: !32)
!357 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = !{!359, !351}
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !361, file: !362, line: 198, type: !484, isLocal: true, isDefinition: true)
!361 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !362, file: !362, line: 175, type: !363, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !479)
!362 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!363 = !DISubroutineType(types: !364)
!364 = !{null, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !367, line: 245, size: 1024, elements: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = !{!369, !434, !447, !448, !449, !450, !456, !474}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !366, file: !367, line: 247, baseType: !370, size: 384)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !367, line: 57, size: 384, elements: !371)
!371 = !{!372, !399, !406, !407, !408, !419, !420, !421}
!372 = !DIDerivedType(tag: DW_TAG_member, scope: !370, file: !367, line: 60, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !370, file: !367, line: 60, size: 64, elements: !374)
!374 = !{!375, !390}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !373, file: !367, line: 61, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !321, line: 49, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !321, line: 37, size: 64, elements: !378)
!378 = !{!379, !385}
!379 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !321, line: 38, baseType: !380, size: 32)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !377, file: !321, line: 38, size: 32, elements: !381)
!381 = !{!382, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !380, file: !321, line: 39, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !380, file: !321, line: 40, baseType: !383, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !321, line: 42, baseType: !386, size: 32, offset: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !377, file: !321, line: 42, size: 32, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !386, file: !321, line: 43, baseType: !383, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !386, file: !321, line: 44, baseType: !383, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !373, file: !367, line: 62, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !392, line: 49, size: 64, elements: !393)
!392 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !391, file: !392, line: 50, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 64, elements: !397)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!397 = !{!398}
!398 = !DISubrange(count: 2)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !370, file: !367, line: 68, baseType: !400, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !316, line: 233, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 231, size: 64, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !402, file: !316, line: 232, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !321, line: 48, baseType: !377)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !370, file: !367, line: 71, baseType: !163, size: 8, offset: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !370, file: !367, line: 74, baseType: !163, size: 8, offset: 104)
!408 = !DIDerivedType(tag: DW_TAG_member, scope: !370, file: !367, line: 90, baseType: !409, size: 16, offset: 112)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !370, file: !367, line: 90, size: 16, elements: !410)
!410 = !{!411, !418}
!411 = !DIDerivedType(tag: DW_TAG_member, scope: !409, file: !367, line: 91, baseType: !412, size: 16)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !409, file: !367, line: 91, size: 16, elements: !413)
!413 = !{!414, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !412, file: !367, line: 96, baseType: !415, size: 8)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !416)
!416 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !412, file: !367, line: 97, baseType: !163, size: 8, offset: 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !409, file: !367, line: 100, baseType: !340, size: 16)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !370, file: !367, line: 107, baseType: !132, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !370, file: !367, line: 127, baseType: !102, size: 32, offset: 160)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !370, file: !367, line: 131, baseType: !422, size: 192, offset: 192)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !316, line: 244, size: 192, elements: !423)
!423 = !{!424, !425, !431}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !422, file: !316, line: 245, baseType: !376, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !422, file: !316, line: 246, baseType: !426, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !316, line: 242, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !422, file: !316, line: 249, baseType: !432, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !433)
!433 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !366, file: !367, line: 250, baseType: !435, size: 288, offset: 384)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !436, line: 25, size: 288, elements: !437)
!436 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !435, file: !436, line: 26, baseType: !132, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !435, file: !436, line: 27, baseType: !132, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !435, file: !436, line: 28, baseType: !132, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !435, file: !436, line: 29, baseType: !132, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !435, file: !436, line: 30, baseType: !132, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !435, file: !436, line: 31, baseType: !132, size: 32, offset: 160)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !435, file: !436, line: 32, baseType: !132, size: 32, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !435, file: !436, line: 33, baseType: !132, size: 32, offset: 224)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !435, file: !436, line: 34, baseType: !132, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !366, file: !367, line: 253, baseType: !102, size: 32, offset: 672)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !366, file: !367, line: 256, baseType: !401, size: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !366, file: !367, line: 294, baseType: !103, size: 32, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !366, file: !367, line: 300, baseType: !451, size: 96, offset: 800)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !367, line: 149, size: 96, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !451, file: !367, line: 153, baseType: !22, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !451, file: !367, line: 162, baseType: !356, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !451, file: !367, line: 168, baseType: !356, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !366, file: !367, line: 325, baseType: !457, size: 32, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !312, line: 5073, size: 160, elements: !459)
!459 = !{!460, !469, !470}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !458, file: !312, line: 5074, baseType: !461, size: 96)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !462, line: 56, size: 96, elements: !463)
!462 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = !{!464, !467, !468}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !461, file: !462, line: 57, baseType: !465, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !462, line: 57, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !461, file: !462, line: 58, baseType: !102, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !461, file: !462, line: 59, baseType: !356, size: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !458, file: !312, line: 5075, baseType: !401, size: 64, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !458, file: !312, line: 5076, baseType: !471, offset: 160)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !472, line: 43, elements: !473)
!472 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!473 = !{}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !366, file: !367, line: 343, baseType: !475, size: 64, offset: 928)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !436, line: 60, size: 64, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !475, file: !436, line: 63, baseType: !132, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !475, file: !436, line: 66, baseType: !132, size: 32, offset: 32)
!479 = !{!480, !481, !482, !483}
!480 = !DILocalVariable(name: "thread", arg: 1, scope: !361, file: !362, line: 175, type: !365)
!481 = !DILocalVariable(name: "region_num", scope: !361, file: !362, line: 200, type: !163)
!482 = !DILocalVariable(name: "guard_start", scope: !361, file: !362, line: 265, type: !22)
!483 = !DILocalVariable(name: "guard_size", scope: !361, file: !362, line: 266, type: !356)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 96, elements: !496)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !486, line: 52, size: 96, elements: !487)
!486 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!487 = !{!488, !489, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !485, file: !486, line: 53, baseType: !22, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !485, file: !486, line: 54, baseType: !356, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !485, file: !486, line: 55, baseType: !491, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !492, line: 151, baseType: !493)
!492 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 149, size: 32, elements: !494)
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !493, file: !492, line: 150, baseType: !132, size: 32)
!496 = !{!497}
!497 = !DISubrange(count: 1)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 96, elements: !496)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !502, file: !535, line: 39, type: !163, isLocal: true, isDefinition: true)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !504, globals: !534, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!504 = !{!505, !102, !103, !522, !163}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !507, line: 1226, baseType: !508)
!507 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !507, line: 1213, size: 352, elements: !509)
!509 = !{!510, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !508, file: !507, line: 1215, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !508, file: !507, line: 1216, baseType: !131, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !508, file: !507, line: 1217, baseType: !131, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !508, file: !507, line: 1218, baseType: !131, size: 32, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !508, file: !507, line: 1219, baseType: !131, size: 32, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !508, file: !507, line: 1220, baseType: !131, size: 32, offset: 160)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !508, file: !507, line: 1221, baseType: !131, size: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !508, file: !507, line: 1222, baseType: !131, size: 32, offset: 224)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !508, file: !507, line: 1223, baseType: !131, size: 32, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !508, file: !507, line: 1224, baseType: !131, size: 32, offset: 288)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !508, file: !507, line: 1225, baseType: !131, size: 32, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !525, line: 27, size: 96, elements: !526)
!525 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!526 = !{!527, !528, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !524, file: !525, line: 29, baseType: !132, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !524, file: !525, line: 31, baseType: !155, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !524, file: !525, line: 37, baseType: !530, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !492, line: 146, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !492, line: 141, size: 32, elements: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !531, file: !492, line: 143, baseType: !132, size: 32)
!534 = !{!500}
!535 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !538, file: !545, line: 21, type: !117, isLocal: true, isDefinition: true)
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !540, globals: !544, splitDebugInlining: false, nameTableKind: None)
!539 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!540 = !{!541, !103, !102}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !543, line: 22, baseType: !103)
!543 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!544 = !{!536}
!545 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !548, file: !553, line: 13, type: !570, isLocal: true, isDefinition: true)
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !550, splitDebugInlining: false, nameTableKind: None)
!549 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!550 = !{!551, !546}
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "mpu_config", scope: !548, file: !553, line: 37, type: !554, isLocal: false, isDefinition: true)
!553 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !525, line: 41, size: 64, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !555, file: !525, line: 43, baseType: !132, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !555, file: !525, line: 45, baseType: !559, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !525, line: 27, size: 96, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !561, file: !525, line: 29, baseType: !132, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !561, file: !525, line: 31, baseType: !155, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !561, file: !525, line: 37, baseType: !566, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !492, line: 146, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !492, line: 141, size: 32, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !567, file: !492, line: 143, baseType: !132, size: 32)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 192, elements: !397)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !573, file: !656, line: 72, type: !739, isLocal: true, isDefinition: true)
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !575, retainedTypes: !642, globals: !653, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!575 = !{!30, !576}
!576 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !127, line: 65, baseType: !103, size: 32, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!578 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!579 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!580 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!581 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!582 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!583 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!584 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!585 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!586 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!587 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!588 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!589 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!590 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!591 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!592 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!593 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!594 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!595 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!596 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!597 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!598 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!599 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!600 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!601 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!602 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!603 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!604 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!605 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!606 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!607 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!608 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!609 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!610 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!611 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!612 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!613 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!614 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!615 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!616 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!617 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!618 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!619 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!620 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!621 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!622 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!623 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!624 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!625 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!626 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!627 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!628 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!629 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!630 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!631 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!632 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!633 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!634 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!635 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!636 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!637 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!638 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!639 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!640 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!641 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!642 = !{!356, !103, !102, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !127, line: 243, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 235, size: 192, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !645, file: !127, line: 237, baseType: !131, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !645, file: !127, line: 238, baseType: !131, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !645, file: !127, line: 239, baseType: !131, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !645, file: !127, line: 240, baseType: !131, size: 32, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !645, file: !127, line: 241, baseType: !131, size: 32, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !645, file: !127, line: 242, baseType: !131, size: 32, offset: 160)
!653 = !{!654, !660, !676, !687, !704, !571, !706, !719, !721, !723, !725, !727, !729, !731, !733, !735, !737}
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !573, file: !656, line: 424, type: !657, isLocal: false, isDefinition: true, align: 16)
!656 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 64, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 4)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !573, file: !656, line: 424, type: !662, isLocal: false, isDefinition: true, align: 32)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !152, line: 378, size: 192, elements: !664)
!664 = !{!665, !666, !667, !668, !674, !675}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !663, file: !152, line: 380, baseType: !155, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !663, file: !152, line: 382, baseType: !13, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !663, file: !152, line: 384, baseType: !13, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !663, file: !152, line: 386, baseType: !669, size: 32, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !152, line: 351, size: 16, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !670, file: !152, line: 359, baseType: !163, size: 8)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !670, file: !152, line: 364, baseType: !166, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !663, file: !152, line: 388, baseType: !102, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !663, file: !152, line: 396, baseType: !169, size: 32, offset: 160)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !573, file: !656, line: 424, type: !678, isLocal: true, isDefinition: true, align: 32)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !143, line: 51, size: 64, elements: !680)
!680 = !{!681, !686}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !679, file: !143, line: 60, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DISubroutineType(types: !684)
!684 = !{!103, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !679, file: !143, line: 65, baseType: !685, size: 32, offset: 32)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "exti_data", scope: !573, file: !656, line: 423, type: !689, isLocal: true, isDefinition: true)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !656, line: 107, size: 1472, elements: !690)
!690 = !{!691}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !689, file: !656, line: 109, baseType: !692, size: 1472)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 1472, elements: !702)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !656, line: 101, size: 64, elements: !694)
!694 = !{!695, !701}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !693, file: !656, line: 102, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !697, line: 63, baseType: !698)
!697 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = !DISubroutineType(types: !700)
!700 = !{null, !103, !102}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !693, file: !656, line: 103, baseType: !102, size: 32, offset: 32)
!702 = !{!703}
!703 = !DISubrange(count: 23)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_39", scope: !573, file: !656, line: 424, type: !670, isLocal: true, isDefinition: true, align: 8)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !708, file: !656, line: 493, type: !713, isLocal: true, isDefinition: true, align: 32)
!708 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !656, file: !656, line: 460, type: !709, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !573, retainedNodes: !711)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !685}
!711 = !{!712}
!712 = !DILocalVariable(name: "dev", arg: 1, scope: !708, file: !656, line: 460, type: !685)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !714)
!714 = !{!715, !716, !717, !718}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !713, file: !10, line: 55, baseType: !344, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !713, file: !10, line: 57, baseType: !344, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !713, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !713, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !708, file: !656, line: 497, type: !713, isLocal: true, isDefinition: true, align: 32)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !708, file: !656, line: 507, type: !713, isLocal: true, isDefinition: true, align: 32)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !708, file: !656, line: 512, type: !713, isLocal: true, isDefinition: true, align: 32)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !708, file: !656, line: 516, type: !713, isLocal: true, isDefinition: true, align: 32)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !708, file: !656, line: 523, type: !713, isLocal: true, isDefinition: true, align: 32)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !708, file: !656, line: 527, type: !713, isLocal: true, isDefinition: true, align: 32)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !708, file: !656, line: 581, type: !713, isLocal: true, isDefinition: true, align: 32)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !708, file: !656, line: 586, type: !713, isLocal: true, isDefinition: true, align: 32)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !708, file: !656, line: 591, type: !713, isLocal: true, isDefinition: true, align: 32)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !708, file: !656, line: 595, type: !713, isLocal: true, isDefinition: true, align: 32)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 736, elements: !702)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !127, line: 133, baseType: !576)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !744, file: !749, line: 24, type: !775, isLocal: false, isDefinition: true, align: 16)
!744 = distinct !DICompileUnit(language: DW_LANG_C99, file: !745, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !746, splitDebugInlining: false, nameTableKind: None)
!745 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!746 = !{!747, !742, !753, !755, !757, !759, !761, !763, !765, !767, !769, !771, !773}
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !744, file: !749, line: 19, type: !750, isLocal: false, isDefinition: true, align: 16)
!749 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 224, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 14)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !744, file: !749, line: 31, type: !657, isLocal: false, isDefinition: true, align: 16)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !744, file: !749, line: 38, type: !657, isLocal: false, isDefinition: true, align: 16)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !744, file: !749, line: 45, type: !657, isLocal: false, isDefinition: true, align: 16)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !744, file: !749, line: 52, type: !657, isLocal: false, isDefinition: true, align: 16)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !744, file: !749, line: 59, type: !657, isLocal: false, isDefinition: true, align: 16)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !744, file: !749, line: 66, type: !657, isLocal: false, isDefinition: true, align: 16)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_20", scope: !744, file: !749, line: 73, type: !657, isLocal: false, isDefinition: true, align: 16)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !744, file: !749, line: 80, type: !657, isLocal: false, isDefinition: true, align: 16)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_50", scope: !744, file: !749, line: 87, type: !657, isLocal: false, isDefinition: true, align: 16)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_44", scope: !744, file: !749, line: 94, type: !657, isLocal: false, isDefinition: true, align: 16)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_47", scope: !744, file: !749, line: 101, type: !657, isLocal: false, isDefinition: true, align: 16)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 48, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 3)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !780, file: !844, line: 398, type: !877, isLocal: true, isDefinition: true)
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !782, retainedTypes: !795, globals: !841, splitDebugInlining: false, nameTableKind: None)
!781 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!782 = !{!783, !30, !788}
!783 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !784, line: 197, baseType: !32, size: 32, elements: !785)
!784 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!785 = !{!786, !787}
!786 = !DIEnumerator(name: "SUCCESS", value: 0)
!787 = !DIEnumerator(name: "ERROR", value: 1)
!788 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !789, line: 44, baseType: !32, size: 32, elements: !790)
!789 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!790 = !{!791, !792, !793, !794}
!791 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!792 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!793 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!794 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!795 = !{!102, !103, !132, !796, !834, !840}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !127, line: 369, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 335, size: 1152, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !833}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !798, file: !127, line: 337, baseType: !131, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !798, file: !127, line: 338, baseType: !131, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !798, file: !127, line: 339, baseType: !131, size: 32, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !798, file: !127, line: 340, baseType: !131, size: 32, offset: 96)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !798, file: !127, line: 341, baseType: !131, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !798, file: !127, line: 342, baseType: !131, size: 32, offset: 160)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !798, file: !127, line: 343, baseType: !131, size: 32, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !798, file: !127, line: 344, baseType: !132, size: 32, offset: 224)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !798, file: !127, line: 345, baseType: !131, size: 32, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !798, file: !127, line: 346, baseType: !131, size: 32, offset: 288)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !798, file: !127, line: 347, baseType: !811, size: 64, offset: 320)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 64, elements: !397)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !798, file: !127, line: 348, baseType: !131, size: 32, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !798, file: !127, line: 349, baseType: !131, size: 32, offset: 416)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !798, file: !127, line: 350, baseType: !131, size: 32, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !798, file: !127, line: 351, baseType: !132, size: 32, offset: 480)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !798, file: !127, line: 352, baseType: !131, size: 32, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !798, file: !127, line: 353, baseType: !131, size: 32, offset: 544)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !798, file: !127, line: 354, baseType: !811, size: 64, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !798, file: !127, line: 355, baseType: !131, size: 32, offset: 640)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !798, file: !127, line: 356, baseType: !131, size: 32, offset: 672)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !798, file: !127, line: 357, baseType: !131, size: 32, offset: 704)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !798, file: !127, line: 358, baseType: !132, size: 32, offset: 736)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !798, file: !127, line: 359, baseType: !131, size: 32, offset: 768)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !798, file: !127, line: 360, baseType: !131, size: 32, offset: 800)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !798, file: !127, line: 361, baseType: !811, size: 64, offset: 832)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !798, file: !127, line: 362, baseType: !131, size: 32, offset: 896)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !798, file: !127, line: 363, baseType: !131, size: 32, offset: 928)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !798, file: !127, line: 364, baseType: !811, size: 64, offset: 960)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !798, file: !127, line: 365, baseType: !131, size: 32, offset: 1024)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !798, file: !127, line: 366, baseType: !131, size: 32, offset: 1056)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !798, file: !127, line: 367, baseType: !832, size: 32, offset: 1088)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 32, elements: !496)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !798, file: !127, line: 368, baseType: !131, size: 32, offset: 1120)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !836, line: 343, size: 64, elements: !837)
!836 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !835, file: !836, line: 344, baseType: !132, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !835, file: !836, line: 345, baseType: !132, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!841 = !{!842, !848, !864, !875, !778}
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !780, file: !844, line: 752, type: !845, isLocal: false, isDefinition: true, align: 16)
!844 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 640, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 40)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !780, file: !844, line: 752, type: !850, isLocal: false, isDefinition: true, align: 32)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !152, line: 378, size: 192, elements: !852)
!852 = !{!853, !854, !855, !856, !862, !863}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !851, file: !152, line: 380, baseType: !155, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !851, file: !152, line: 382, baseType: !13, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !851, file: !152, line: 384, baseType: !13, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !851, file: !152, line: 386, baseType: !857, size: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !152, line: 351, size: 16, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !858, file: !152, line: 359, baseType: !163, size: 8)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !858, file: !152, line: 364, baseType: !166, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !851, file: !152, line: 388, baseType: !102, size: 32, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !851, file: !152, line: 396, baseType: !169, size: 32, offset: 160)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !780, file: !844, line: 752, type: !866, isLocal: true, isDefinition: true, align: 32)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !143, line: 51, size: 64, elements: !868)
!868 = !{!869, !874}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !867, file: !143, line: 60, baseType: !870, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DISubroutineType(types: !872)
!872 = !{!103, !873}
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !867, file: !143, line: 65, baseType: !873, size: 32, offset: 32)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !780, file: !844, line: 752, type: !858, isLocal: true, isDefinition: true, align: 8)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !789, line: 100, size: 224, elements: !878)
!878 = !{!879, !885, !886, !895, !900, !905, !911}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !877, file: !789, line: 101, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !789, line: 76, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DISubroutineType(types: !883)
!883 = !{!103, !873, !884}
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !789, line: 56, baseType: !102)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !877, file: !789, line: 102, baseType: !880, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !877, file: !789, line: 103, baseType: !887, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !789, line: 83, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DISubroutineType(types: !890)
!890 = !{!103, !873, !884, !891, !102}
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !789, line: 72, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !873, !884, !102}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !877, file: !789, line: 104, baseType: !896, size: 32, offset: 96)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !789, line: 79, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DISubroutineType(types: !899)
!899 = !{!103, !873, !884, !840}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !877, file: !789, line: 105, baseType: !901, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !789, line: 88, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DISubroutineType(types: !904)
!904 = !{!788, !873, !884}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !877, file: !789, line: 106, baseType: !906, size: 32, offset: 160)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !789, line: 92, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DISubroutineType(types: !909)
!909 = !{!103, !873, !884, !910}
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !789, line: 64, baseType: !102)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !877, file: !789, line: 107, baseType: !912, size: 32, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !789, line: 96, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DISubroutineType(types: !915)
!915 = !{!103, !873, !884, !102}
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "debug_hook_in", scope: !918, file: !922, line: 43, type: !1114, isLocal: true, isDefinition: true)
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !920, retainedTypes: !929, globals: !1009, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/subsys/console/echo")
!920 = !{!30, !921}
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !922, line: 214, baseType: !32, size: 32, elements: !923)
!922 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!923 = !{!924, !925, !926, !927, !928}
!924 = !DIEnumerator(name: "ESC_ESC", value: 0)
!925 = !DIEnumerator(name: "ESC_ANSI", value: 1)
!926 = !DIEnumerator(name: "ESC_ANSI_FIRST", value: 2)
!927 = !DIEnumerator(name: "ESC_ANSI_VAL", value: 3)
!928 = !DIEnumerator(name: "ESC_ANSI_VAL_2", value: 4)
!929 = !{!102, !103, !930, !32, !24}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !212, line: 336, size: 608, elements: !933)
!933 = !{!934, !953, !957, !961, !974, !979, !983, !987, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !932, file: !212, line: 365, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DISubroutineType(types: !937)
!937 = !{!103, !938, !233}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !152, line: 378, size: 192, elements: !941)
!941 = !{!942, !943, !944, !945, !951, !952}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !940, file: !152, line: 380, baseType: !155, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !940, file: !152, line: 382, baseType: !13, size: 32, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !940, file: !152, line: 384, baseType: !13, size: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !940, file: !152, line: 386, baseType: !946, size: 32, offset: 96)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !152, line: 351, size: 16, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !947, file: !152, line: 359, baseType: !163, size: 8)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !947, file: !152, line: 364, baseType: !166, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !940, file: !152, line: 388, baseType: !102, size: 32, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !940, file: !152, line: 396, baseType: !169, size: 32, offset: 160)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !932, file: !212, line: 366, baseType: !954, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !938, !164}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !932, file: !212, line: 374, baseType: !958, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = !DISubroutineType(types: !960)
!960 = !{!103, !938}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !932, file: !212, line: 377, baseType: !962, size: 32, offset: 96)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DISubroutineType(types: !964)
!964 = !{!103, !938, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !212, line: 122, size: 64, elements: !968)
!968 = !{!969, !970, !971, !972, !973}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !967, file: !212, line: 123, baseType: !132, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !967, file: !212, line: 124, baseType: !163, size: 8, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !967, file: !212, line: 125, baseType: !163, size: 8, offset: 40)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !967, file: !212, line: 126, baseType: !163, size: 8, offset: 48)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !967, file: !212, line: 127, baseType: !163, size: 8, offset: 56)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !932, file: !212, line: 379, baseType: !975, size: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{!103, !938, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !932, file: !212, line: 384, baseType: !980, size: 32, offset: 160)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DISubroutineType(types: !982)
!982 = !{!103, !938, !264, !103}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !932, file: !212, line: 393, baseType: !984, size: 32, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{!103, !938, !270, !271}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !932, file: !212, line: 402, baseType: !988, size: 32, offset: 224)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !938}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !932, file: !212, line: 405, baseType: !988, size: 32, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !932, file: !212, line: 408, baseType: !958, size: 32, offset: 288)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !932, file: !212, line: 411, baseType: !988, size: 32, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !932, file: !212, line: 414, baseType: !988, size: 32, offset: 352)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !932, file: !212, line: 417, baseType: !958, size: 32, offset: 384)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !932, file: !212, line: 420, baseType: !958, size: 32, offset: 416)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !932, file: !212, line: 423, baseType: !988, size: 32, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !932, file: !212, line: 426, baseType: !988, size: 32, offset: 480)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !932, file: !212, line: 429, baseType: !958, size: 32, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !932, file: !212, line: 432, baseType: !958, size: 32, offset: 544)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !932, file: !212, line: 435, baseType: !1002, size: 32, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !938, !1005, !102}
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !212, line: 142, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 32)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{null, !938, !102}
!1009 = !{!1010, !916, !1017, !1059, !1061, !1067, !1074, !1077, !1102, !1106, !1108, !1110, !1112}
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !918, file: !922, line: 603, type: !1012, isLocal: true, isDefinition: true, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !143, line: 51, size: 64, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1013, file: !143, line: 60, baseType: !958, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1013, file: !143, line: 65, baseType: !938, size: 32, offset: 32)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "avail_queue", scope: !918, file: !922, line: 108, type: !1019, isLocal: true, isDefinition: true)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !312, line: 2208, size: 128, elements: !1021)
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !1020, file: !312, line: 2209, baseType: !1023, size: 128)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !312, line: 1709, size: 128, elements: !1024)
!1024 = !{!1025, !1038, !1040}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !1023, file: !312, line: 1710, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !1027, line: 46, baseType: !1028)
!1027 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !1027, line: 41, size: 64, elements: !1029)
!1029 = !{!1030, !1037}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1028, file: !1027, line: 42, baseType: !1031, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !1027, line: 39, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !1027, line: 35, size: 32, elements: !1034)
!1034 = !{!1035}
