; ModuleID = 'build/actinius_icarus_ns/kernel/metairq_dispatch/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !120, line: 10, type: !346, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !117, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/metairq_dispatch/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !105, !106, !107, !111, !113, !114, !116}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !110)
!110 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 214, baseType: !32)
!112 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !115)
!115 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !105)
!117 = !{!25, !118, !271, !275, !282, !315, !320, !324, !326}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "_k_thread_data_metairq_thread", scope: !27, file: !120, line: 28, type: !121, isLocal: false, isDefinition: true, align: 32)
!120 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !122, line: 620, size: 384, elements: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !{!124, !244, !252, !253, !258, !259, !260, !261, !262, !263, !264, !268}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !121, file: !122, line: 621, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !127, line: 245, size: 1024, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !198, !211, !212, !213, !214, !220, !239}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !126, file: !127, line: 247, baseType: !130, size: 384)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !127, line: 57, size: 384, elements: !131)
!131 = !{!132, !160, !168, !171, !172, !185, !186, !187}
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !127, line: 60, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !127, line: 60, size: 64, elements: !134)
!134 = !{!135, !151}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !133, file: !127, line: 61, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !139)
!139 = !{!140, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !137, line: 38, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !137, line: 38, size: 32, elements: !142)
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !137, line: 39, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !137, line: 40, baseType: !144, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !137, line: 42, baseType: !147, size: 32, offset: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !137, line: 42, size: 32, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !147, file: !137, line: 43, baseType: !144, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !137, line: 44, baseType: !144, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !133, file: !127, line: 62, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !153, line: 49, size: 64, elements: !154)
!153 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !152, file: !153, line: 50, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !158)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!158 = !{!159}
!159 = !DISubrange(count: 2)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !130, file: !127, line: 68, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !164)
!163 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !165)
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !164, file: !163, line: 232, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !138)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !130, file: !127, line: 71, baseType: !169, size: 8, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !170)
!170 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !130, file: !127, line: 74, baseType: !169, size: 8, offset: 104)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !127, line: 90, baseType: !173, size: 16, offset: 112)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !127, line: 90, size: 16, elements: !174)
!174 = !{!175, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, scope: !173, file: !127, line: 91, baseType: !176, size: 16)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !127, line: 91, size: 16, elements: !177)
!177 = !{!178, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !176, file: !127, line: 96, baseType: !179, size: 8)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !180)
!180 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !176, file: !127, line: 97, baseType: !169, size: 8, offset: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !173, file: !127, line: 100, baseType: !183, size: 16)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !184)
!184 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !130, file: !127, line: 107, baseType: !113, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !130, file: !127, line: 127, baseType: !104, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !130, file: !127, line: 131, baseType: !188, size: 192, offset: 192)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !189)
!189 = !{!190, !191, !197}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !188, file: !163, line: 245, baseType: !136, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !188, file: !163, line: 246, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !188, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !126, file: !127, line: 250, baseType: !199, size: 288, offset: 384)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !200, line: 25, size: 288, elements: !201)
!200 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !199, file: !200, line: 26, baseType: !113, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !199, file: !200, line: 27, baseType: !113, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !199, file: !200, line: 28, baseType: !113, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !199, file: !200, line: 29, baseType: !113, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !199, file: !200, line: 30, baseType: !113, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !199, file: !200, line: 31, baseType: !113, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !199, file: !200, line: 32, baseType: !113, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !199, file: !200, line: 33, baseType: !113, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !199, file: !200, line: 34, baseType: !113, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !126, file: !127, line: 253, baseType: !104, size: 32, offset: 672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !126, file: !127, line: 256, baseType: !162, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !126, file: !127, line: 294, baseType: !105, size: 32, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !126, file: !127, line: 300, baseType: !215, size: 96, offset: 800)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !127, line: 149, size: 96, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !215, file: !127, line: 153, baseType: !22, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !127, line: 162, baseType: !111, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !215, file: !127, line: 168, baseType: !111, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !126, file: !127, line: 325, baseType: !221, size: 32, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !122, line: 5073, size: 192, elements: !223)
!223 = !{!224, !233, !234}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !222, file: !122, line: 5074, baseType: !225, size: 96)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !226, line: 56, size: 96, elements: !227)
!226 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!227 = !{!228, !231, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !225, file: !226, line: 57, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !226, line: 57, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !225, file: !226, line: 58, baseType: !104, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !225, file: !226, line: 59, baseType: !111, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !222, file: !122, line: 5075, baseType: !162, size: 64, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !222, file: !122, line: 5076, baseType: !235, size: 32, offset: 160)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !237)
!236 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !235, file: !236, line: 52, baseType: !22, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !126, file: !127, line: 343, baseType: !240, size: 64, offset: 928)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !200, line: 60, size: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !240, file: !200, line: 63, baseType: !113, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !240, file: !200, line: 66, baseType: !113, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !121, file: !122, line: 622, baseType: !245, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !247, line: 44, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !249, line: 47, size: 8, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !248, file: !249, line: 48, baseType: !103, size: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !121, file: !122, line: 623, baseType: !32, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !121, file: !122, line: 624, baseType: !254, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !247, line: 46, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !104, !104, !104}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !121, file: !122, line: 625, baseType: !104, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !121, file: !122, line: 626, baseType: !104, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !121, file: !122, line: 627, baseType: !104, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !121, file: !122, line: 628, baseType: !105, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !121, file: !122, line: 629, baseType: !113, size: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !121, file: !122, line: 630, baseType: !116, size: 32, offset: 288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !121, file: !122, line: 631, baseType: !265, size: 32, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{null}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !121, file: !122, line: 632, baseType: !269, size: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "metairq_thread", scope: !27, file: !120, line: 28, type: !273, isLocal: false, isDefinition: true)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !127, line: 347, baseType: !125)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "report_cookie", scope: !27, file: !120, line: 46, type: !277, isLocal: false, isDefinition: true, align: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !122, line: 2909, size: 128, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !277, file: !122, line: 2910, baseType: !162, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !277, file: !122, line: 2911, baseType: !32, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !277, file: !122, line: 2912, baseType: !32, size: 32, offset: 96)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "threads", scope: !27, file: !120, line: 22, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 15872, elements: !313)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_rec", file: !120, line: 18, size: 3968, elements: !286)
!286 = !{!287, !288, !301}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !285, file: !120, line: 19, baseType: !126, size: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !285, file: !120, line: 20, baseType: !289, size: 352, offset: 1024)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !122, line: 4204, size: 352, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !289, file: !122, line: 4206, baseType: !162, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !289, file: !122, line: 4208, baseType: !235, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !289, file: !122, line: 4210, baseType: !111, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !289, file: !122, line: 4212, baseType: !113, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !289, file: !122, line: 4214, baseType: !102, size: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !289, file: !122, line: 4216, baseType: !102, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !289, file: !122, line: 4218, baseType: !102, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !289, file: !122, line: 4220, baseType: !102, size: 32, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !289, file: !122, line: 4222, baseType: !113, size: 32, offset: 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !289, file: !122, line: 4227, baseType: !169, size: 8, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "msgq_buf", scope: !285, file: !120, line: 21, baseType: !302, size: 2560, offset: 1376)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 2560, elements: !311)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msg", file: !304, line: 44, size: 160, elements: !305)
!304 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/msgdev.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !303, file: !304, line: 46, baseType: !113, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !303, file: !304, line: 49, baseType: !113, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !303, file: !304, line: 52, baseType: !113, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "proc_cyc", scope: !303, file: !304, line: 55, baseType: !113, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "metairq_latency", scope: !303, file: !304, line: 58, baseType: !113, size: 32, offset: 128)
!311 = !{!312}
!312 = !DISubrange(count: 16)
!313 = !{!314}
!314 = !DISubrange(count: 4)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "thread_stacks", scope: !27, file: !120, line: 24, type: !317, isLocal: false, isDefinition: true, align: 64)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 65536, elements: !318)
!318 = !{!314, !319}
!319 = !DISubrange(count: 2048)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "_k_thread_stack_metairq_thread", scope: !27, file: !120, line: 28, type: !322, isLocal: false, isDefinition: true, align: 64)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 16384, elements: !323)
!323 = !{!319}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "_k_thread_obj_metairq_thread", scope: !27, file: !120, line: 28, type: !126, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "stats", scope: !27, file: !120, line: 41, type: !328, isLocal: false, isDefinition: true)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 34, size: 4000, elements: !329)
!329 = !{!330, !333, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_mirq", scope: !328, file: !120, line: 35, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !332, line: 22, baseType: !106)
!332 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mirq_latencies", scope: !328, file: !120, line: 36, baseType: !334, size: 1280, offset: 32)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 1280, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 40)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !328, file: !120, line: 40, baseType: !338, size: 2688, offset: 1312)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 2688, elements: !313)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !120, line: 37, size: 672, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nevt", scope: !339, file: !120, line: 38, baseType: !113, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "latencies", scope: !339, file: !120, line: 39, baseType: !343, size: 640, offset: 32)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 640, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 20)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !349)
!348 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !347, file: !348, line: 17, baseType: !269, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !347, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "hw_msgs", scope: !354, file: !360, line: 27, type: !398, isLocal: false, isDefinition: true, align: 32)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !356, globals: !357, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/metairq_dispatch/src/msgdev.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!356 = !{!107, !104, !105, !113, !114}
!357 = !{!352, !358, !385, !387, !389, !392}
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "timeout", scope: !354, file: !360, line: 17, type: !361, isLocal: true, isDefinition: true)
!360 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/msgdev.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !362)
!362 = !{!363, !378, !384}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !361, file: !163, line: 245, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !366)
!366 = !{!367, !373}
!367 = !DIDerivedType(tag: DW_TAG_member, scope: !365, file: !137, line: 38, baseType: !368, size: 32)
!368 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !137, line: 38, size: 32, elements: !369)
!369 = !{!370, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !368, file: !137, line: 39, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !137, line: 40, baseType: !371, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, scope: !365, file: !137, line: 42, baseType: !374, size: 32, offset: 32)
!374 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !137, line: 42, size: 32, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !374, file: !137, line: 43, baseType: !371, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !374, file: !137, line: 44, baseType: !371, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !361, file: !163, line: 246, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !361, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "max_duty_cyc", scope: !354, file: !360, line: 23, type: !113, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "msg_seq", scope: !354, file: !360, line: 25, type: !113, isLocal: false, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "_k_fifo_buf_hw_msgs", scope: !354, file: !360, line: 27, type: !391, isLocal: true, isDefinition: true, align: 32)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 320, elements: !335)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "state", scope: !394, file: !360, line: 38, type: !114, isLocal: true, isDefinition: true)
!394 = distinct !DISubprogram(name: "rand32", scope: !360, file: !360, line: 36, type: !395, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !354, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!113}
!397 = !{}
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !122, line: 4204, size: 352, elements: !399)
!399 = !{!400, !406, !410, !411, !412, !413, !414, !415, !416, !417}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !398, file: !122, line: 4206, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !402, file: !163, line: 232, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !365)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !398, file: !122, line: 4208, baseType: !407, size: 32, offset: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !407, file: !236, line: 52, baseType: !22, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !398, file: !122, line: 4210, baseType: !111, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !398, file: !122, line: 4212, baseType: !113, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !398, file: !122, line: 4214, baseType: !102, size: 32, offset: 160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !398, file: !122, line: 4216, baseType: !102, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !398, file: !122, line: 4218, baseType: !102, size: 32, offset: 224)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !398, file: !122, line: 4220, baseType: !102, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !398, file: !122, line: 4222, baseType: !113, size: 32, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !398, file: !122, line: 4227, baseType: !169, size: 8, offset: 320)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !420, file: !434, line: 18, type: !435, isLocal: false, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !422, globals: !433, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!422 = !{!22, !104, !24, !423, !425, !427, !111, !105, !428, !429, !430, !431, !102, !432, !183, !269}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!433 = !{!418}
!434 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !436, file: !348, line: 17, baseType: !269, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !436, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "_char_out", scope: !442, file: !446, line: 54, type: !447, isLocal: false, isDefinition: true)
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !444, globals: !445, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!444 = !{!104, !105}
!445 = !{!440}
!446 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DISubroutineType(types: !449)
!449 = !{!105, !105}
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !452, file: !509, line: 35, type: !526, isLocal: false, isDefinition: true)
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !454, globals: !506, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!454 = !{!104, !105, !455, !113, !466}
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !457, file: !456, line: 167, baseType: !465)
!456 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !456, file: !456, line: 134, type: !458, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !452, retainedNodes: !460)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !113}
!460 = !{!461, !462, !464}
!461 = !DILocalVariable(name: "time_us", arg: 1, scope: !457, file: !456, line: 134, type: !113)
!462 = !DILocalVariable(name: "delay_cycles", scope: !457, file: !456, line: 168, type: !463)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!464 = !DILocalVariable(name: "cycles", scope: !457, file: !456, line: 171, type: !113)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !468, line: 1928, baseType: !469)
!468 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 1909, size: 11360, elements: !470)
!470 = !{!471, !477, !478, !479, !480, !484, !485, !486, !487, !491, !492, !496, !497, !498, !499, !500, !504, !505}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !469, file: !468, line: 1910, baseType: !472, size: 8192)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 8192, elements: !475)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!475 = !{!476}
!476 = !DISubrange(count: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !469, file: !468, line: 1911, baseType: !473, size: 32, offset: 8192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !469, file: !468, line: 1912, baseType: !473, size: 32, offset: 8224)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !469, file: !468, line: 1913, baseType: !473, size: 32, offset: 8256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !469, file: !468, line: 1914, baseType: !481, size: 1984, offset: 8288)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 1984, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 62)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !469, file: !468, line: 1915, baseType: !474, size: 32, offset: 10272)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !469, file: !468, line: 1916, baseType: !473, size: 32, offset: 10304)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !469, file: !468, line: 1917, baseType: !474, size: 32, offset: 10336)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !469, file: !468, line: 1918, baseType: !488, size: 96, offset: 10368)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 96, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 3)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !469, file: !468, line: 1919, baseType: !474, size: 32, offset: 10464)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !469, file: !468, line: 1920, baseType: !493, size: 256, offset: 10496)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 256, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 8)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !469, file: !468, line: 1921, baseType: !474, size: 32, offset: 10752)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !469, file: !468, line: 1922, baseType: !473, size: 32, offset: 10784)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !469, file: !468, line: 1923, baseType: !474, size: 32, offset: 10816)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !469, file: !468, line: 1924, baseType: !474, size: 32, offset: 10848)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !469, file: !468, line: 1925, baseType: !501, size: 416, offset: 10880)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 416, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 13)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !469, file: !468, line: 1926, baseType: !474, size: 32, offset: 11296)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !469, file: !468, line: 1927, baseType: !474, size: 32, offset: 11328)
!506 = !{!450, !507, !522}
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !452, file: !509, line: 65, type: !510, isLocal: true, isDefinition: true, align: 32)
!509 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !512, line: 51, size: 64, elements: !513)
!512 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!513 = !{!514, !521}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !511, file: !512, line: 60, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DISubroutineType(types: !517)
!517 = !{!105, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !512, line: 48, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !511, file: !512, line: 65, baseType: !518, size: 32, offset: 32)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !457, file: !456, line: 161, type: !524, isLocal: true, isDefinition: true, align: 128)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 48, elements: !489)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !527, file: !348, line: 17, baseType: !269, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !527, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !533, file: !567, line: 22, type: !597, isLocal: false, isDefinition: true)
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !535, retainedTypes: !547, globals: !564, splitDebugInlining: false, nameTableKind: None)
!534 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!535 = !{!536, !30}
!536 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !537, line: 27, baseType: !32, size: 32, elements: !538)
!537 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546}
!539 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!540 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!541 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!542 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!543 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!544 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!545 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!546 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!547 = !{!104, !107, !105, !24, !548, !102, !113, !114}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !550, line: 54, size: 96, elements: !551)
!550 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!551 = !{!552, !559, !563}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !549, file: !550, line: 55, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !554, line: 33, baseType: !555)
!554 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !554, line: 29, size: 32, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !555, file: !554, line: 30, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !549, file: !550, line: 60, baseType: !560, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !536}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !549, file: !550, line: 65, baseType: !560, size: 32, offset: 64)
!564 = !{!531, !565, !571, !576, !578, !587, !589}
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !533, file: !567, line: 27, type: !568, isLocal: true, isDefinition: true)
!567 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 32, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 1)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !533, file: !567, line: 44, type: !573, isLocal: true, isDefinition: true)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !574)
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !573, file: !236, line: 52, baseType: !22, size: 32)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !533, file: !567, line: 49, type: !573, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !533, file: !567, line: 36, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 128, elements: !569)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !537, line: 114, size: 128, elements: !582)
!582 = !{!583, !584, !585, !586}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !581, file: !537, line: 115, baseType: !536, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !581, file: !537, line: 141, baseType: !169, size: 8, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !581, file: !537, line: 149, baseType: !113, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !581, file: !537, line: 156, baseType: !113, size: 32, offset: 96)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !533, file: !567, line: 40, type: !580, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !533, file: !567, line: 28, type: !591, isLocal: true, isDefinition: true)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !554, line: 40, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !554, line: 35, size: 64, elements: !593)
!593 = !{!594, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !592, file: !554, line: 36, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !592, file: !554, line: 37, baseType: !595, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !598, file: !348, line: 17, baseType: !269, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !598, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!602 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!603 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !606, file: !634, line: 50, type: !116, isLocal: true, isDefinition: true)
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !535, retainedTypes: !608, globals: !631, splitDebugInlining: false, nameTableKind: None)
!607 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!608 = !{!609, !107, !111, !105, !104, !113, !114, !611, !102, !116, !622}
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !610)
!610 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !613, line: 45, size: 64, elements: !614)
!613 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!614 = !{!615, !621}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !612, file: !613, line: 46, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !554, line: 33, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !554, line: 29, size: 32, elements: !618)
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !617, file: !554, line: 30, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !612, file: !613, line: 48, baseType: !113, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !613, line: 38, size: 64, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !623, file: !613, line: 39, baseType: !616, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !623, file: !613, line: 41, baseType: !627, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !613, line: 35, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !116}
!631 = !{!632, !638, !646, !604, !648, !658}
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "latency_lock", scope: !606, file: !634, line: 44, type: !635, isLocal: true, isDefinition: true)
!634 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !635, file: !236, line: 52, baseType: !22, size: 32)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !606, file: !634, line: 46, type: !640, isLocal: true, isDefinition: true)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !554, line: 40, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !554, line: 35, size: 64, elements: !642)
!642 = !{!643, !645}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !641, file: !554, line: 36, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !641, file: !554, line: 37, baseType: !644, size: 32, offset: 32)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "latency_subs", scope: !606, file: !634, line: 52, type: !640, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !606, file: !634, line: 39, type: !650, isLocal: true, isDefinition: true)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, elements: !656)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 35, size: 96, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !651, file: !634, line: 36, baseType: !536, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !651, file: !634, line: 37, baseType: !169, size: 8, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !651, file: !634, line: 38, baseType: !331, size: 32, offset: 64)
!656 = !{!657}
!657 = !DISubrange(count: 0)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !606, file: !634, line: 48, type: !116, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !662, file: !669, line: 47, type: !683, isLocal: true, isDefinition: true)
!662 = distinct !DICompileUnit(language: DW_LANG_C99, file: !663, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !664, retainedTypes: !665, globals: !666, splitDebugInlining: false, nameTableKind: None)
!663 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!664 = !{!536}
!665 = !{!111, !105}
!666 = !{!667, !660, !679}
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "cpus_states", scope: !662, file: !669, line: 50, type: !670, isLocal: true, isDefinition: true)
!669 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 32, elements: !569)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !537, line: 114, size: 128, elements: !674)
!674 = !{!675, !676, !677, !678}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !673, file: !537, line: 115, baseType: !536, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !673, file: !537, line: 141, baseType: !169, size: 8, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !673, file: !537, line: 149, baseType: !113, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !673, file: !537, line: 156, baseType: !113, size: 32, offset: 96)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !662, file: !669, line: 55, type: !681, isLocal: true, isDefinition: true)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 8, elements: !569)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, elements: !656)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !686, file: !693, line: 17, type: !818, isLocal: false, isDefinition: true)
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !688, globals: !689, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!688 = !{!111, !105, !113, !104}
!689 = !{!684, !690, !814}
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !692, file: !693, line: 198, type: !801, isLocal: true, isDefinition: true)
!692 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !693, file: !693, line: 175, type: !694, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !686, retainedNodes: !798)
!693 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!694 = !DISubroutineType(types: !695)
!695 = !{null, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !127, line: 245, size: 1024, elements: !698)
!698 = !{!699, !757, !769, !770, !771, !772, !778, !793}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !697, file: !127, line: 247, baseType: !700, size: 384)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !127, line: 57, size: 384, elements: !701)
!701 = !{!702, !726, !733, !734, !735, !744, !745, !746}
!702 = !DIDerivedType(tag: DW_TAG_member, scope: !700, file: !127, line: 60, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !700, file: !127, line: 60, size: 64, elements: !704)
!704 = !{!705, !720}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !703, file: !127, line: 61, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !708)
!708 = !{!709, !715}
!709 = !DIDerivedType(tag: DW_TAG_member, scope: !707, file: !137, line: 38, baseType: !710, size: 32)
!710 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !707, file: !137, line: 38, size: 32, elements: !711)
!711 = !{!712, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !710, file: !137, line: 39, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !710, file: !137, line: 40, baseType: !713, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, scope: !707, file: !137, line: 42, baseType: !716, size: 32, offset: 32)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !707, file: !137, line: 42, size: 32, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !716, file: !137, line: 43, baseType: !713, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !716, file: !137, line: 44, baseType: !713, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !703, file: !127, line: 62, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !153, line: 49, size: 64, elements: !722)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !721, file: !153, line: 50, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 64, elements: !158)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !700, file: !127, line: 68, baseType: !727, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !730)
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !729, file: !163, line: 232, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !707)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !700, file: !127, line: 71, baseType: !169, size: 8, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !700, file: !127, line: 74, baseType: !169, size: 8, offset: 104)
!735 = !DIDerivedType(tag: DW_TAG_member, scope: !700, file: !127, line: 90, baseType: !736, size: 16, offset: 112)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !700, file: !127, line: 90, size: 16, elements: !737)
!737 = !{!738, !743}
!738 = !DIDerivedType(tag: DW_TAG_member, scope: !736, file: !127, line: 91, baseType: !739, size: 16)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !127, line: 91, size: 16, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !739, file: !127, line: 96, baseType: !179, size: 8)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !739, file: !127, line: 97, baseType: !169, size: 8, offset: 8)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !736, file: !127, line: 100, baseType: !183, size: 16)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !700, file: !127, line: 107, baseType: !113, size: 32, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !700, file: !127, line: 127, baseType: !104, size: 32, offset: 160)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !700, file: !127, line: 131, baseType: !747, size: 192, offset: 192)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !748)
!748 = !{!749, !750, !756}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !747, file: !163, line: 245, baseType: !706, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !747, file: !163, line: 246, baseType: !751, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !755}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !747, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !697, file: !127, line: 250, baseType: !758, size: 288, offset: 384)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !200, line: 25, size: 288, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !758, file: !200, line: 26, baseType: !113, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !758, file: !200, line: 27, baseType: !113, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !758, file: !200, line: 28, baseType: !113, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !758, file: !200, line: 29, baseType: !113, size: 32, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !758, file: !200, line: 30, baseType: !113, size: 32, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !758, file: !200, line: 31, baseType: !113, size: 32, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !758, file: !200, line: 32, baseType: !113, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !758, file: !200, line: 33, baseType: !113, size: 32, offset: 224)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !758, file: !200, line: 34, baseType: !113, size: 32, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !697, file: !127, line: 253, baseType: !104, size: 32, offset: 672)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !697, file: !127, line: 256, baseType: !728, size: 64, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !697, file: !127, line: 294, baseType: !105, size: 32, offset: 768)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !697, file: !127, line: 300, baseType: !773, size: 96, offset: 800)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !127, line: 149, size: 96, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !773, file: !127, line: 153, baseType: !22, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !773, file: !127, line: 162, baseType: !111, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !773, file: !127, line: 168, baseType: !111, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !697, file: !127, line: 325, baseType: !779, size: 32, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !122, line: 5073, size: 192, elements: !781)
!781 = !{!782, !788, !789}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !780, file: !122, line: 5074, baseType: !783, size: 96)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !226, line: 56, size: 96, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !783, file: !226, line: 57, baseType: !229, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !783, file: !226, line: 58, baseType: !104, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !783, file: !226, line: 59, baseType: !111, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !780, file: !122, line: 5075, baseType: !728, size: 64, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !780, file: !122, line: 5076, baseType: !790, size: 32, offset: 160)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !790, file: !236, line: 52, baseType: !22, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !697, file: !127, line: 343, baseType: !794, size: 64, offset: 928)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !200, line: 60, size: 64, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !794, file: !200, line: 63, baseType: !113, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !794, file: !200, line: 66, baseType: !113, size: 32, offset: 32)
!798 = !{!799, !800}
!799 = !DILocalVariable(name: "thread", arg: 1, scope: !692, file: !693, line: 175, type: !696)
!800 = !DILocalVariable(name: "region_num", scope: !692, file: !693, line: 200, type: !169)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, elements: !656)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !803, line: 52, size: 96, elements: !804)
!803 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!804 = !{!805, !806, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !802, file: !803, line: 53, baseType: !22, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !802, file: !803, line: 54, baseType: !111, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !802, file: !803, line: 55, baseType: !808, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !809, line: 304, baseType: !810)
!809 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !809, line: 301, size: 32, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !810, file: !809, line: 302, baseType: !183, size: 16)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !810, file: !809, line: 303, baseType: !183, size: 16, offset: 16)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "static_regions", scope: !686, file: !693, line: 62, type: !816, isLocal: true, isDefinition: true)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 96, elements: !569)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !819, file: !348, line: 17, baseType: !269, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !819, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !825, file: !879, line: 39, type: !169, isLocal: true, isDefinition: true)
!825 = distinct !DICompileUnit(language: DW_LANG_C99, file: !826, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !827, globals: !870, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!827 = !{!828, !104, !105, !856}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !830, line: 1495, baseType: !831)
!830 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 1474, size: 448, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !846}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !831, file: !830, line: 1476, baseType: !473, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !831, file: !830, line: 1477, baseType: !474, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !831, file: !830, line: 1478, baseType: !474, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !831, file: !830, line: 1479, baseType: !474, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !831, file: !830, line: 1480, baseType: !474, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !831, file: !830, line: 1481, baseType: !474, size: 32, offset: 160)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !831, file: !830, line: 1482, baseType: !474, size: 32, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !831, file: !830, line: 1483, baseType: !474, size: 32, offset: 224)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !831, file: !830, line: 1484, baseType: !474, size: 32, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !831, file: !830, line: 1485, baseType: !474, size: 32, offset: 288)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !831, file: !830, line: 1486, baseType: !474, size: 32, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !831, file: !830, line: 1487, baseType: !845, size: 32, offset: 352)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 32, elements: !569)
!846 = !DIDerivedType(tag: DW_TAG_member, scope: !831, file: !830, line: 1488, baseType: !847, size: 64, offset: 384)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !831, file: !830, line: 1488, size: 64, elements: !848)
!848 = !{!849, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !847, file: !830, line: 1489, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 64, elements: !158)
!851 = !DIDerivedType(tag: DW_TAG_member, scope: !847, file: !830, line: 1490, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !847, file: !830, line: 1490, size: 64, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !852, file: !830, line: 1491, baseType: !474, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !852, file: !830, line: 1492, baseType: !474, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !859, line: 27, size: 128, elements: !860)
!859 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !858, file: !859, line: 29, baseType: !113, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !858, file: !859, line: 31, baseType: !269, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !858, file: !859, line: 37, baseType: !864, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !809, line: 298, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !809, line: 289, size: 64, elements: !866)
!866 = !{!867, !868, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !865, file: !809, line: 291, baseType: !169, size: 5, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !865, file: !809, line: 293, baseType: !169, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !865, file: !809, line: 295, baseType: !113, size: 32, offset: 32)
!870 = !{!823, !871}
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !825, file: !873, line: 31, type: !874, isLocal: true, isDefinition: true)
!873 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !875, size: 160, elements: !569)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !873, line: 21, size: 160, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !875, file: !873, line: 22, baseType: !105, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !875, file: !873, line: 23, baseType: !858, size: 128, offset: 32)
!879 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !882, file: !889, line: 21, type: !447, isLocal: true, isDefinition: true)
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !884, globals: !888, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!884 = !{!885, !105, !104}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !887, line: 22, baseType: !105)
!887 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!888 = !{!880}
!889 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !892, file: !897, line: 13, type: !916, isLocal: true, isDefinition: true)
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !894, splitDebugInlining: false, nameTableKind: None)
!893 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!894 = !{!895, !890}
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "mpu_config", scope: !892, file: !897, line: 37, type: !898, isLocal: false, isDefinition: true)
!897 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !859, line: 41, size: 64, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !899, file: !859, line: 43, baseType: !113, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !899, file: !859, line: 45, baseType: !903, size: 32, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !859, line: 27, size: 128, elements: !906)
!906 = !{!907, !908, !909}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !905, file: !859, line: 29, baseType: !113, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !905, file: !859, line: 31, baseType: !269, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !905, file: !859, line: 37, baseType: !910, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !809, line: 298, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !809, line: 289, size: 64, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !911, file: !809, line: 291, baseType: !169, size: 5, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !911, file: !809, line: 293, baseType: !169, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !911, file: !809, line: 295, baseType: !113, size: 32, offset: 32)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 256, elements: !158)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "log_const_board_control", scope: !919, file: !1022, line: 12, type: !1031, isLocal: false, isDefinition: true)
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !921, retainedTypes: !933, globals: !1019, splitDebugInlining: false, nameTableKind: None)
!920 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/kernel/metairq_dispatch")
!921 = !{!922, !928}
!922 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !923, line: 506, baseType: !32, size: 32, elements: !924)
!923 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!924 = !{!925, !926, !927}
!925 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!926 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!927 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!928 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !923, line: 512, baseType: !32, size: 32, elements: !929)
!929 = !{!930, !931, !932}
!930 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!931 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!932 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!933 = !{!934, !1008, !1013, !974, !928, !922, !1018, !104}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !923, line: 523, size: 288, elements: !937)
!937 = !{!938, !964, !970, !975, !979, !980, !981, !985, !1004}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !936, file: !923, line: 524, baseType: !939, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DISubroutineType(types: !941)
!941 = !{!105, !942, !962, !963}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !945, line: 378, size: 192, elements: !946)
!945 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!946 = !{!947, !948, !949, !950, !957, !958}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !944, file: !945, line: 380, baseType: !269, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !944, file: !945, line: 382, baseType: !13, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !944, file: !945, line: 384, baseType: !13, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !944, file: !945, line: 386, baseType: !951, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !945, line: 351, size: 16, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !952, file: !945, line: 359, baseType: !169, size: 8)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !952, file: !945, line: 364, baseType: !956, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!956 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !944, file: !945, line: 388, baseType: !104, size: 32, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !944, file: !945, line: 396, baseType: !959, size: 32, offset: 160)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !945, line: 43, baseType: !609)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !923, line: 237, baseType: !169)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !923, line: 257, baseType: !113)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !936, file: !923, line: 530, baseType: !965, size: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{!105, !942, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !923, line: 229, baseType: !113)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !936, file: !923, line: 532, baseType: !971, size: 32, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!972 = !DISubroutineType(types: !973)
!973 = !{!105, !942, !974, !969}
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !923, line: 216, baseType: !113)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !936, file: !923, line: 535, baseType: !976, size: 32, offset: 96)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DISubroutineType(types: !978)
!978 = !{!105, !942, !974}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !936, file: !923, line: 537, baseType: !976, size: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !936, file: !923, line: 539, baseType: !976, size: 32, offset: 160)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !936, file: !923, line: 541, baseType: !982, size: 32, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{!105, !942, !962, !922, !928}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !936, file: !923, line: 544, baseType: !986, size: 32, offset: 224)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{!105, !942, !989, !956}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !923, line: 478, size: 96, elements: !991)
!991 = !{!992, !998, !1003}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !990, file: !923, line: 482, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !554, line: 33, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !554, line: 29, size: 32, elements: !995)
!995 = !{!996}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !994, file: !554, line: 30, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !990, file: !923, line: 485, baseType: !999, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !923, line: 464, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !942, !989, !974}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !990, file: !923, line: 493, baseType: !974, size: 32, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !936, file: !923, line: 547, baseType: !1005, size: 32, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!113, !942}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !923, line: 428, size: 32, elements: !1011)
!1011 = !{!1012}
