; ModuleID = 'build/actinius_icarus_som_ns/subsys/zbus/benchmark/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.zbus_observer = type { i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_bm_channel", scope: !27, file: !114, line: 16, type: !136, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !290, !292, !294, !296, !298, !300, !302, !304, !306, !339, !343, !348, !350, !357, !362}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "bm_channel", scope: !27, file: !114, line: 16, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 192, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !123, !125, !126, !134, !259}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !120, size: 16)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !124, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !13, !132}
!131 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 214, baseType: !32)
!133 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !135, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !137, line: 2720, size: 160, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !160, !257, !258}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !136, file: !137, line: 2722, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !141, line: 233, baseType: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 231, size: 64, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !142, file: !141, line: 232, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !146, line: 48, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !146, line: 37, size: 64, elements: !148)
!148 = !{!149, !155}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 38, baseType: !150, size: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 38, size: 32, elements: !151)
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !150, file: !146, line: 39, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !146, line: 40, baseType: !153, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 42, baseType: !156, size: 32, offset: 32)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 42, size: 32, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !156, file: !146, line: 43, baseType: !153, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !146, line: 44, baseType: !153, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !136, file: !137, line: 2724, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !163, line: 245, size: 1024, elements: !164)
!163 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = !{!165, !212, !225, !226, !227, !228, !234, !252}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !162, file: !163, line: 247, baseType: !166, size: 384)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !163, line: 57, size: 384, elements: !167)
!167 = !{!168, !182, !184, !187, !188, !199, !200, !201}
!168 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 60, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 60, size: 64, elements: !170)
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !169, file: !163, line: 61, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !146, line: 49, baseType: !147)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !169, file: !163, line: 62, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !175, line: 49, size: 64, elements: !176)
!175 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !174, file: !175, line: 50, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!180 = !{!181}
!181 = !DISubrange(count: 2)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !166, file: !163, line: 68, baseType: !183, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !166, file: !163, line: 71, baseType: !185, size: 8, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !186)
!186 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !166, file: !163, line: 74, baseType: !185, size: 8, offset: 104)
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 90, baseType: !189, size: 16, offset: 112)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 90, size: 16, elements: !190)
!190 = !{!191, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !163, line: 91, baseType: !192, size: 16)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !163, line: 91, size: 16, elements: !193)
!193 = !{!194, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !192, file: !163, line: 96, baseType: !195, size: 8)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !196)
!196 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !192, file: !163, line: 97, baseType: !185, size: 8, offset: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !189, file: !163, line: 100, baseType: !121, size: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !166, file: !163, line: 107, baseType: !108, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !166, file: !163, line: 127, baseType: !102, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !166, file: !163, line: 131, baseType: !202, size: 192, offset: 192)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !141, line: 244, size: 192, elements: !203)
!203 = !{!204, !205, !211}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !202, file: !141, line: 245, baseType: !172, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !202, file: !141, line: 246, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !141, line: 242, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !202, file: !141, line: 249, baseType: !106, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !162, file: !163, line: 250, baseType: !213, size: 288, offset: 384)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !214, line: 25, size: 288, elements: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !213, file: !214, line: 26, baseType: !108, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !213, file: !214, line: 27, baseType: !108, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !213, file: !214, line: 28, baseType: !108, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !213, file: !214, line: 29, baseType: !108, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !213, file: !214, line: 30, baseType: !108, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !213, file: !214, line: 31, baseType: !108, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !213, file: !214, line: 32, baseType: !108, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !213, file: !214, line: 33, baseType: !108, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !213, file: !214, line: 34, baseType: !108, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !162, file: !163, line: 253, baseType: !102, size: 32, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !162, file: !163, line: 256, baseType: !140, size: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !162, file: !163, line: 294, baseType: !103, size: 32, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !162, file: !163, line: 300, baseType: !229, size: 96, offset: 800)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !163, line: 149, size: 96, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !229, file: !163, line: 153, baseType: !22, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !163, line: 162, baseType: !132, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !229, file: !163, line: 168, baseType: !132, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !162, file: !163, line: 325, baseType: !235, size: 32, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !137, line: 5073, size: 160, elements: !237)
!237 = !{!238, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !236, file: !137, line: 5074, baseType: !239, size: 96)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !240, line: 57, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !240, line: 57, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !239, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !239, file: !240, line: 59, baseType: !132, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !236, file: !137, line: 5075, baseType: !140, size: 64, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !236, file: !137, line: 5076, baseType: !249, offset: 160)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !162, file: !163, line: 343, baseType: !253, size: 64, offset: 928)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !214, line: 60, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !253, file: !214, line: 63, baseType: !108, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !253, file: !214, line: 66, baseType: !108, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !136, file: !137, line: 2727, baseType: !108, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !136, file: !137, line: 2730, baseType: !103, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !260, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 96, elements: !265)
!265 = !{!266, !267, !284}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !264, file: !117, line: 91, baseType: !131, size: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !264, file: !117, line: 93, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !137, line: 4204, size: 320, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !279, !280, !281, !282, !283}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !270, file: !137, line: 4206, baseType: !140, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !270, file: !137, line: 4208, baseType: !249, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !270, file: !137, line: 4210, baseType: !132, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !270, file: !137, line: 4212, baseType: !108, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !270, file: !137, line: 4214, baseType: !277, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !270, file: !137, line: 4216, baseType: !277, size: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !270, file: !137, line: 4218, baseType: !277, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !270, file: !137, line: 4220, baseType: !277, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !270, file: !137, line: 4222, baseType: !108, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !270, file: !137, line: 4227, baseType: !185, size: 8, offset: 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !264, file: !117, line: 96, baseType: !285, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "s1", scope: !27, file: !114, line: 126, type: !264, isLocal: false, isDefinition: true, align: 32)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "s2", scope: !27, file: !114, line: 129, type: !264, isLocal: false, isDefinition: true, align: 32)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "s3", scope: !27, file: !114, line: 131, type: !264, isLocal: false, isDefinition: true, align: 32)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "s4", scope: !27, file: !114, line: 132, type: !264, isLocal: false, isDefinition: true, align: 32)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "s5", scope: !27, file: !114, line: 134, type: !264, isLocal: false, isDefinition: true, align: 32)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "s6", scope: !27, file: !114, line: 135, type: !264, isLocal: false, isDefinition: true, align: 32)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "s7", scope: !27, file: !114, line: 136, type: !264, isLocal: false, isDefinition: true, align: 32)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "s8", scope: !27, file: !114, line: 137, type: !264, isLocal: false, isDefinition: true, align: 32)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "_k_thread_data_producer_thread_id", scope: !27, file: !114, line: 216, type: !308, isLocal: false, isDefinition: true, align: 32)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !137, line: 620, size: 384, elements: !309)
!309 = !{!310, !311, !319, !320, !325, !326, !327, !328, !329, !330, !332, !336}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !308, file: !137, line: 621, baseType: !161, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !308, file: !137, line: 622, baseType: !312, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !314, line: 44, baseType: !315)
!314 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !316, line: 47, size: 8, elements: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !316, line: 48, baseType: !278, size: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !308, file: !137, line: 623, baseType: !32, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !308, file: !137, line: 624, baseType: !321, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !314, line: 46, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !102, !102, !102}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !308, file: !137, line: 625, baseType: !102, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !308, file: !137, line: 626, baseType: !102, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !308, file: !137, line: 627, baseType: !102, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !308, file: !137, line: 628, baseType: !103, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !308, file: !137, line: 629, baseType: !108, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !308, file: !137, line: 630, baseType: !331, size: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !308, file: !137, line: 631, baseType: !333, size: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{null}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !308, file: !137, line: 632, baseType: !337, size: 32, offset: 352)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "producer_thread_id", scope: !27, file: !114, line: 216, type: !341, isLocal: false, isDefinition: true)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !163, line: 347, baseType: !161)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "_k_thread_stack_producer_thread_id", scope: !27, file: !114, line: 216, type: !345, isLocal: false, isDefinition: true, align: 64)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 8192, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 1024)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_k_thread_obj_producer_thread_id", scope: !27, file: !114, line: 216, type: !162, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "_zbus_message_bm_channel", scope: !27, file: !114, line: 16, type: !352, isLocal: true, isDefinition: true)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_data_msg", file: !353, line: 10, size: 64, elements: !354)
!353 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !352, file: !353, line: 11, baseType: !102, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !352, file: !353, line: 12, baseType: !132, size: 32, offset: 32)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "_zbus_observers_bm_channel", scope: !27, file: !114, line: 16, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 288, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 9)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 44, type: !109, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !366, file: !381, line: 18, type: !382, isLocal: false, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !368, globals: !380, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!368 = !{!22, !102, !24, !369, !371, !373, !132, !103, !374, !375, !377, !378, !277, !379, !121, !337}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!380 = !{!364}
!381 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !385)
!384 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !384, line: 17, baseType: !337, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !383, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "_char_out", scope: !390, file: !394, line: 54, type: !395, isLocal: false, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !392, globals: !393, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!392 = !{!102, !103}
!393 = !{!388}
!394 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!103, !103}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !400, file: !457, line: 35, type: !473, isLocal: false, isDefinition: true)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !402, globals: !454, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!402 = !{!102, !103, !403, !108, !414}
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !405, file: !404, line: 167, baseType: !413)
!404 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!405 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !404, file: !404, line: 134, type: !406, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !400, retainedNodes: !408)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !108}
!408 = !{!409, !410, !412}
!409 = !DILocalVariable(name: "time_us", arg: 1, scope: !405, file: !404, line: 134, type: !108)
!410 = !DILocalVariable(name: "delay_cycles", scope: !405, file: !404, line: 168, type: !411)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!412 = !DILocalVariable(name: "cycles", scope: !405, file: !404, line: 171, type: !108)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !416, line: 1928, baseType: !417)
!416 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 1909, size: 11360, elements: !418)
!418 = !{!419, !425, !426, !427, !428, !432, !433, !434, !435, !439, !440, !444, !445, !446, !447, !448, !452, !453}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !417, file: !416, line: 1910, baseType: !420, size: 8192)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 8192, elements: !423)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!423 = !{!424}
!424 = !DISubrange(count: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !417, file: !416, line: 1911, baseType: !421, size: 32, offset: 8192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !417, file: !416, line: 1912, baseType: !421, size: 32, offset: 8224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !417, file: !416, line: 1913, baseType: !421, size: 32, offset: 8256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !417, file: !416, line: 1914, baseType: !429, size: 1984, offset: 8288)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 1984, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 62)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !417, file: !416, line: 1915, baseType: !422, size: 32, offset: 10272)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !417, file: !416, line: 1916, baseType: !421, size: 32, offset: 10304)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !417, file: !416, line: 1917, baseType: !422, size: 32, offset: 10336)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !417, file: !416, line: 1918, baseType: !436, size: 96, offset: 10368)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 96, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 3)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !417, file: !416, line: 1919, baseType: !422, size: 32, offset: 10464)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !417, file: !416, line: 1920, baseType: !441, size: 256, offset: 10496)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 256, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !417, file: !416, line: 1921, baseType: !422, size: 32, offset: 10752)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !417, file: !416, line: 1922, baseType: !421, size: 32, offset: 10784)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !417, file: !416, line: 1923, baseType: !422, size: 32, offset: 10816)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !417, file: !416, line: 1924, baseType: !422, size: 32, offset: 10848)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !417, file: !416, line: 1925, baseType: !449, size: 416, offset: 10880)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 416, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 13)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !417, file: !416, line: 1926, baseType: !422, size: 32, offset: 11296)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !417, file: !416, line: 1927, baseType: !422, size: 32, offset: 11328)
!454 = !{!398, !455, !470}
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !400, file: !457, line: 65, type: !458, isLocal: true, isDefinition: true, align: 32)
!457 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !460, line: 51, size: 64, elements: !461)
!460 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!461 = !{!462, !469}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !459, file: !460, line: 60, baseType: !463, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = !DISubroutineType(types: !465)
!465 = !{!103, !466}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !460, line: 48, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !459, file: !460, line: 65, baseType: !466, size: 32, offset: 32)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !405, file: !404, line: 161, type: !472, isLocal: true, isDefinition: true, align: 128)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 48, elements: !437)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !474, file: !384, line: 17, baseType: !337, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !474, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !480, file: !514, line: 22, type: !544, isLocal: false, isDefinition: true)
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !482, retainedTypes: !494, globals: !511, splitDebugInlining: false, nameTableKind: None)
!481 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!482 = !{!483, !30}
!483 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !484, line: 27, baseType: !32, size: 32, elements: !485)
!484 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!485 = !{!486, !487, !488, !489, !490, !491, !492, !493}
!486 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!487 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!488 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!489 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!490 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!491 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!492 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!493 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!494 = !{!102, !104, !103, !24, !495, !277, !108, !109}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !497, line: 54, size: 96, elements: !498)
!497 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!498 = !{!499, !506, !510}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !496, file: !497, line: 55, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !501, line: 33, baseType: !502)
!501 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !501, line: 29, size: 32, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !501, line: 30, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !496, file: !497, line: 60, baseType: !507, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !483}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !496, file: !497, line: 65, baseType: !507, size: 32, offset: 64)
!511 = !{!478, !512, !520, !523, !525, !534, !536}
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !480, file: !514, line: 27, type: !515, isLocal: true, isDefinition: true)
!514 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 32, elements: !518)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !517, line: 22, baseType: !376)
!517 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = !{!519}
!519 = !DISubrange(count: 1)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !480, file: !514, line: 44, type: !522, isLocal: true, isDefinition: true)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !480, file: !514, line: 49, type: !522, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !480, file: !514, line: 36, type: !527, isLocal: true, isDefinition: true)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 128, elements: !518)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !484, line: 114, size: 128, elements: !529)
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !528, file: !484, line: 115, baseType: !483, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !528, file: !484, line: 141, baseType: !185, size: 8, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !528, file: !484, line: 149, baseType: !108, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !528, file: !484, line: 156, baseType: !108, size: 32, offset: 96)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !480, file: !514, line: 40, type: !527, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !480, file: !514, line: 28, type: !538, isLocal: true, isDefinition: true)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !501, line: 40, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !501, line: 35, size: 64, elements: !540)
!540 = !{!541, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !539, file: !501, line: 36, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !539, file: !501, line: 37, baseType: !542, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !384, line: 17, baseType: !337, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !545, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!549 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!550 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !553, file: !581, line: 50, type: !331, isLocal: true, isDefinition: true)
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !482, retainedTypes: !555, globals: !578, splitDebugInlining: false, nameTableKind: None)
!554 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!555 = !{!556, !104, !132, !103, !102, !108, !109, !558, !277, !331, !569}
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !557)
!557 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !560, line: 45, size: 64, elements: !561)
!560 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!561 = !{!562, !568}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !559, file: !560, line: 46, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !501, line: 33, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !501, line: 29, size: 32, elements: !565)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !501, line: 30, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !559, file: !560, line: 48, baseType: !108, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !560, line: 38, size: 64, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !570, file: !560, line: 39, baseType: !563, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !570, file: !560, line: 41, baseType: !574, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !560, line: 35, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !331}
!578 = !{!579, !583, !591, !551, !593, !603}
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "latency_lock", scope: !553, file: !581, line: 44, type: !582, isLocal: true, isDefinition: true)
!581 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !553, file: !581, line: 46, type: !585, isLocal: true, isDefinition: true)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !501, line: 40, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !501, line: 35, size: 64, elements: !587)
!587 = !{!588, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !586, file: !501, line: 36, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !586, file: !501, line: 37, baseType: !589, size: 32, offset: 32)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "latency_subs", scope: !553, file: !581, line: 52, type: !585, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !553, file: !581, line: 39, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, elements: !601)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 35, size: 96, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !596, file: !581, line: 36, baseType: !483, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !596, file: !581, line: 37, baseType: !185, size: 8, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !596, file: !581, line: 38, baseType: !516, size: 32, offset: 64)
!601 = !{!602}
!602 = !DISubrange(count: 0)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !553, file: !581, line: 48, type: !331, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !607, file: !614, line: 47, type: !628, isLocal: true, isDefinition: true)
!607 = distinct !DICompileUnit(language: DW_LANG_C99, file: !608, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !609, retainedTypes: !610, globals: !611, splitDebugInlining: false, nameTableKind: None)
!608 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!609 = !{!483}
!610 = !{!132, !103}
!611 = !{!612, !605, !624}
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "cpus_states", scope: !607, file: !614, line: 50, type: !615, isLocal: true, isDefinition: true)
!614 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 32, elements: !518)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !484, line: 114, size: 128, elements: !619)
!619 = !{!620, !621, !622, !623}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !618, file: !484, line: 115, baseType: !483, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !618, file: !484, line: 141, baseType: !185, size: 8, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !618, file: !484, line: 149, baseType: !108, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !618, file: !484, line: 156, baseType: !108, size: 32, offset: 96)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !607, file: !614, line: 55, type: !626, isLocal: true, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 8, elements: !518)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, elements: !601)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !631, file: !638, line: 17, type: !761, isLocal: false, isDefinition: true)
!631 = distinct !DICompileUnit(language: DW_LANG_C99, file: !632, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !633, globals: !634, splitDebugInlining: false, nameTableKind: None)
!632 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!633 = !{!132, !103, !108, !102}
!634 = !{!629, !635, !757}
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !637, file: !638, line: 198, type: !744, isLocal: true, isDefinition: true)
!637 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !638, file: !638, line: 175, type: !639, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !631, retainedNodes: !741)
!638 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!639 = !DISubroutineType(types: !640)
!640 = !{null, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !163, line: 245, size: 1024, elements: !643)
!643 = !{!644, !702, !714, !715, !716, !717, !723, !736}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !642, file: !163, line: 247, baseType: !645, size: 384)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !163, line: 57, size: 384, elements: !646)
!646 = !{!647, !671, !678, !679, !680, !689, !690, !691}
!647 = !DIDerivedType(tag: DW_TAG_member, scope: !645, file: !163, line: 60, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !645, file: !163, line: 60, size: 64, elements: !649)
!649 = !{!650, !665}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !648, file: !163, line: 61, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !146, line: 49, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !146, line: 37, size: 64, elements: !653)
!653 = !{!654, !660}
!654 = !DIDerivedType(tag: DW_TAG_member, scope: !652, file: !146, line: 38, baseType: !655, size: 32)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !652, file: !146, line: 38, size: 32, elements: !656)
!656 = !{!657, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !655, file: !146, line: 39, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !655, file: !146, line: 40, baseType: !658, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, scope: !652, file: !146, line: 42, baseType: !661, size: 32, offset: 32)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !652, file: !146, line: 42, size: 32, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !661, file: !146, line: 43, baseType: !658, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !661, file: !146, line: 44, baseType: !658, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !648, file: !163, line: 62, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !175, line: 49, size: 64, elements: !667)
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !666, file: !175, line: 50, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 64, elements: !180)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !645, file: !163, line: 68, baseType: !672, size: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !141, line: 233, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 231, size: 64, elements: !675)
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !674, file: !141, line: 232, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !146, line: 48, baseType: !652)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !645, file: !163, line: 71, baseType: !185, size: 8, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !645, file: !163, line: 74, baseType: !185, size: 8, offset: 104)
!680 = !DIDerivedType(tag: DW_TAG_member, scope: !645, file: !163, line: 90, baseType: !681, size: 16, offset: 112)
!681 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !645, file: !163, line: 90, size: 16, elements: !682)
!682 = !{!683, !688}
!683 = !DIDerivedType(tag: DW_TAG_member, scope: !681, file: !163, line: 91, baseType: !684, size: 16)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !681, file: !163, line: 91, size: 16, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !684, file: !163, line: 96, baseType: !195, size: 8)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !684, file: !163, line: 97, baseType: !185, size: 8, offset: 8)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !681, file: !163, line: 100, baseType: !121, size: 16)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !645, file: !163, line: 107, baseType: !108, size: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !645, file: !163, line: 127, baseType: !102, size: 32, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !645, file: !163, line: 131, baseType: !692, size: 192, offset: 192)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !141, line: 244, size: 192, elements: !693)
!693 = !{!694, !695, !701}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !692, file: !141, line: 245, baseType: !651, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !692, file: !141, line: 246, baseType: !696, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !141, line: 242, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !700}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !692, file: !141, line: 249, baseType: !106, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !642, file: !163, line: 250, baseType: !703, size: 288, offset: 384)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !214, line: 25, size: 288, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !703, file: !214, line: 26, baseType: !108, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !703, file: !214, line: 27, baseType: !108, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !703, file: !214, line: 28, baseType: !108, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !703, file: !214, line: 29, baseType: !108, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !703, file: !214, line: 30, baseType: !108, size: 32, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !703, file: !214, line: 31, baseType: !108, size: 32, offset: 160)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !703, file: !214, line: 32, baseType: !108, size: 32, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !703, file: !214, line: 33, baseType: !108, size: 32, offset: 224)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !703, file: !214, line: 34, baseType: !108, size: 32, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !642, file: !163, line: 253, baseType: !102, size: 32, offset: 672)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !642, file: !163, line: 256, baseType: !673, size: 64, offset: 704)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !642, file: !163, line: 294, baseType: !103, size: 32, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !642, file: !163, line: 300, baseType: !718, size: 96, offset: 800)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !163, line: 149, size: 96, elements: !719)
!719 = !{!720, !721, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !718, file: !163, line: 153, baseType: !22, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !718, file: !163, line: 162, baseType: !132, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !718, file: !163, line: 168, baseType: !132, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !642, file: !163, line: 325, baseType: !724, size: 32, offset: 896)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !137, line: 5073, size: 160, elements: !726)
!726 = !{!727, !733, !734}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !725, file: !137, line: 5074, baseType: !728, size: 96)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !728, file: !240, line: 57, baseType: !243, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !728, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !728, file: !240, line: 59, baseType: !132, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !725, file: !137, line: 5075, baseType: !673, size: 64, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !725, file: !137, line: 5076, baseType: !735, offset: 160)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !642, file: !163, line: 343, baseType: !737, size: 64, offset: 928)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !214, line: 60, size: 64, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !737, file: !214, line: 63, baseType: !108, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !737, file: !214, line: 66, baseType: !108, size: 32, offset: 32)
!741 = !{!742, !743}
!742 = !DILocalVariable(name: "thread", arg: 1, scope: !637, file: !638, line: 175, type: !641)
!743 = !DILocalVariable(name: "region_num", scope: !637, file: !638, line: 200, type: !185)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, elements: !601)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !746, line: 52, size: 96, elements: !747)
!746 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !745, file: !746, line: 53, baseType: !22, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !745, file: !746, line: 54, baseType: !132, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !745, file: !746, line: 55, baseType: !751, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !752, line: 304, baseType: !753)
!752 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 301, size: 32, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !753, file: !752, line: 302, baseType: !121, size: 16)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !753, file: !752, line: 303, baseType: !121, size: 16, offset: 16)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "static_regions", scope: !631, file: !638, line: 62, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 96, elements: !518)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !745)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !762, file: !384, line: 17, baseType: !337, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !762, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !768, file: !822, line: 39, type: !185, isLocal: true, isDefinition: true)
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !770, globals: !813, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!770 = !{!771, !102, !103, !799}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !773, line: 1495, baseType: !774)
!773 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !773, line: 1474, size: 448, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !789}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !774, file: !773, line: 1476, baseType: !421, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !774, file: !773, line: 1477, baseType: !422, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !774, file: !773, line: 1478, baseType: !422, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !774, file: !773, line: 1479, baseType: !422, size: 32, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !774, file: !773, line: 1480, baseType: !422, size: 32, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !774, file: !773, line: 1481, baseType: !422, size: 32, offset: 160)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !774, file: !773, line: 1482, baseType: !422, size: 32, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !774, file: !773, line: 1483, baseType: !422, size: 32, offset: 224)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !774, file: !773, line: 1484, baseType: !422, size: 32, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !774, file: !773, line: 1485, baseType: !422, size: 32, offset: 288)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !774, file: !773, line: 1486, baseType: !422, size: 32, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !774, file: !773, line: 1487, baseType: !788, size: 32, offset: 352)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 32, elements: !518)
!789 = !DIDerivedType(tag: DW_TAG_member, scope: !774, file: !773, line: 1488, baseType: !790, size: 64, offset: 384)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !774, file: !773, line: 1488, size: 64, elements: !791)
!791 = !{!792, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !790, file: !773, line: 1489, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 64, elements: !180)
!794 = !DIDerivedType(tag: DW_TAG_member, scope: !790, file: !773, line: 1490, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !790, file: !773, line: 1490, size: 64, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !795, file: !773, line: 1491, baseType: !422, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !795, file: !773, line: 1492, baseType: !422, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !802, line: 27, size: 128, elements: !803)
!802 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !801, file: !802, line: 29, baseType: !108, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !801, file: !802, line: 31, baseType: !337, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !801, file: !802, line: 37, baseType: !807, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !752, line: 298, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !752, line: 289, size: 64, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !808, file: !752, line: 291, baseType: !185, size: 5, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !808, file: !752, line: 293, baseType: !185, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !808, file: !752, line: 295, baseType: !108, size: 32, offset: 32)
!813 = !{!766, !814}
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !768, file: !816, line: 31, type: !817, isLocal: true, isDefinition: true)
!816 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 160, elements: !518)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !816, line: 21, size: 160, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !818, file: !816, line: 22, baseType: !103, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !818, file: !816, line: 23, baseType: !801, size: 128, offset: 32)
!822 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !825, file: !832, line: 21, type: !395, isLocal: true, isDefinition: true)
!825 = distinct !DICompileUnit(language: DW_LANG_C99, file: !826, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !827, globals: !831, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!827 = !{!828, !103, !102}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !830, line: 22, baseType: !103)
!830 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!831 = !{!823}
!832 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !835, file: !840, line: 13, type: !859, isLocal: true, isDefinition: true)
!835 = distinct !DICompileUnit(language: DW_LANG_C99, file: !836, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !837, splitDebugInlining: false, nameTableKind: None)
!836 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!837 = !{!838, !833}
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "mpu_config", scope: !835, file: !840, line: 37, type: !841, isLocal: false, isDefinition: true)
!840 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !802, line: 41, size: 64, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !842, file: !802, line: 43, baseType: !108, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !842, file: !802, line: 45, baseType: !846, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !802, line: 27, size: 128, elements: !849)
!849 = !{!850, !851, !852}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !848, file: !802, line: 29, baseType: !108, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !848, file: !802, line: 31, baseType: !337, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !848, file: !802, line: 37, baseType: !853, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !752, line: 298, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !752, line: 289, size: 64, elements: !855)
!855 = !{!856, !857, !858}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !854, file: !752, line: 291, baseType: !185, size: 5, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !854, file: !752, line: 293, baseType: !185, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !854, file: !752, line: 295, baseType: !108, size: 32, offset: 32)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 256, elements: !180)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "log_const_board_control", scope: !862, file: !964, line: 12, type: !973, isLocal: false, isDefinition: true)
!862 = distinct !DICompileUnit(language: DW_LANG_C99, file: !863, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !864, retainedTypes: !876, globals: !961, splitDebugInlining: false, nameTableKind: None)
!863 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_som/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!864 = !{!865, !871}
!865 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !866, line: 506, baseType: !32, size: 32, elements: !867)
!866 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!867 = !{!868, !869, !870}
!868 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!869 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!870 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!871 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !866, line: 512, baseType: !32, size: 32, elements: !872)
!872 = !{!873, !874, !875}
!873 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!874 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!875 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!876 = !{!877, !950, !955, !916, !871, !865, !960, !102}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !866, line: 523, size: 288, elements: !880)
!880 = !{!881, !906, !912, !917, !921, !922, !923, !927, !946}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !879, file: !866, line: 524, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DISubroutineType(types: !884)
!884 = !{!103, !885, !904, !905}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !888, line: 378, size: 192, elements: !889)
!888 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!889 = !{!890, !891, !892, !893, !899, !900}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !887, file: !888, line: 380, baseType: !337, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !887, file: !888, line: 382, baseType: !13, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !887, file: !888, line: 384, baseType: !13, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !887, file: !888, line: 386, baseType: !894, size: 32, offset: 96)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !888, line: 351, size: 16, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !895, file: !888, line: 359, baseType: !185, size: 8)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !895, file: !888, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !887, file: !888, line: 388, baseType: !102, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !887, file: !888, line: 396, baseType: !901, size: 32, offset: 160)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !888, line: 43, baseType: !556)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !866, line: 237, baseType: !185)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !866, line: 257, baseType: !108)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !879, file: !866, line: 530, baseType: !907, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DISubroutineType(types: !909)
!909 = !{!103, !885, !910}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !866, line: 229, baseType: !108)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !879, file: !866, line: 532, baseType: !913, size: 32, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DISubroutineType(types: !915)
!915 = !{!103, !885, !916, !911}
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !866, line: 216, baseType: !108)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !879, file: !866, line: 535, baseType: !918, size: 32, offset: 96)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DISubroutineType(types: !920)
!920 = !{!103, !885, !916}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !879, file: !866, line: 537, baseType: !918, size: 32, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !879, file: !866, line: 539, baseType: !918, size: 32, offset: 160)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !879, file: !866, line: 541, baseType: !924, size: 32, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 32)
!925 = !DISubroutineType(types: !926)
!926 = !{!103, !885, !904, !865, !871}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !879, file: !866, line: 544, baseType: !928, size: 32, offset: 224)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DISubroutineType(types: !930)
!930 = !{!103, !885, !931, !131}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !866, line: 478, size: 96, elements: !933)
!933 = !{!934, !940, !945}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !932, file: !866, line: 482, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !501, line: 33, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !501, line: 29, size: 32, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !501, line: 30, baseType: !939, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !932, file: !866, line: 485, baseType: !941, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !866, line: 464, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !885, !931, !916}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !932, file: !866, line: 493, baseType: !916, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !879, file: !866, line: 547, baseType: !947, size: 32, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = !DISubroutineType(types: !949)
!949 = !{!108, !885}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !866, line: 428, size: 32, elements: !953)
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !952, file: !866, line: 434, baseType: !916, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !866, line: 441, size: 32, elements: !958)
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !957, file: !866, line: 447, baseType: !916, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!961 = !{!860, !962}
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_som_init", scope: !862, file: !964, line: 39, type: !965, isLocal: true, isDefinition: true, align: 32)
!964 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_som/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !460, line: 51, size: 64, elements: !967)
!967 = !{!968, !972}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !966, file: !460, line: 60, baseType: !969, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{!103, !885}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !966, file: !460, line: 65, baseType: !885, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !974, file: !384, line: 17, baseType: !337, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !974, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !980, file: !984, line: 10, type: !985, isLocal: false, isDefinition: true)
!980 = distinct !DICompileUnit(language: DW_LANG_C99, file: !981, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !982, globals: !983, splitDebugInlining: false, nameTableKind: None)
!981 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!982 = !{!104, !102, !103}
!983 = !{!978}
!984 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !384, line: 17, baseType: !337, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !986, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !992, file: !1195, line: 18, type: !1422, isLocal: false, isDefinition: true)
!992 = distinct !DICompileUnit(language: DW_LANG_C99, file: !993, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !994, retainedTypes: !1112, globals: !1191, splitDebugInlining: false, nameTableKind: None)
!993 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/zbus/benchmark")
!994 = !{!995, !1001, !30, !1006, !1011, !1015, !1019, !1023, !1029, !1033, !1077, !1084, !1103}
!995 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !996, line: 23, baseType: !32, size: 32, elements: !997)
!996 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!997 = !{!998, !999, !1000}
!998 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!999 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!1000 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!1001 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !996, line: 48, baseType: !32, size: 32, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!1004 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!1005 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1007, line: 167, baseType: !32, size: 32, elements: !1008)
!1007 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1008 = !{!1009, !1010}
!1009 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!1010 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!1011 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1007, line: 107, baseType: !32, size: 32, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
