; ModuleID = 'build/96b_aerocore2/minimal/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 103, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5824, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 91)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2912, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 501, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f427xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 492, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 494, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 495, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 496, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 497, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 498, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 499, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 500, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "static_regions", scope: !197, file: !206, line: 62, type: !347, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !199, globals: !202, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!199 = !{!200, !103, !121, !102}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 214, baseType: !32)
!201 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !195}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !205, file: !206, line: 198, type: !333, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !206, file: !206, line: 175, type: !207, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !328)
!206 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !211, line: 245, size: 1024, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !282, !295, !296, !297, !298, !304, !323}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !210, file: !211, line: 247, baseType: !214, size: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !211, line: 57, size: 384, elements: !215)
!215 = !{!216, !244, !252, !253, !254, !267, !268, !269}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 60, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 60, size: 64, elements: !218)
!218 = !{!219, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !217, file: !211, line: 61, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !221, line: 49, baseType: !222)
!221 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !221, line: 37, size: 64, elements: !223)
!223 = !{!224, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 38, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 38, size: 32, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !221, line: 39, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !221, line: 40, baseType: !228, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 42, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 42, size: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !221, line: 43, baseType: !228, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !221, line: 44, baseType: !228, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !217, file: !211, line: 62, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !237, line: 49, size: 64, elements: !238)
!237 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !236, file: !237, line: 50, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !214, file: !211, line: 68, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !221, line: 48, baseType: !222)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !214, file: !211, line: 71, baseType: !154, size: 8, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !214, file: !211, line: 74, baseType: !154, size: 8, offset: 104)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 90, baseType: !255, size: 16, offset: 112)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 90, size: 16, elements: !256)
!256 = !{!257, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !211, line: 91, baseType: !258, size: 16)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !211, line: 91, size: 16, elements: !259)
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !258, file: !211, line: 96, baseType: !261, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !262)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !258, file: !211, line: 97, baseType: !154, size: 8, offset: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !255, file: !211, line: 100, baseType: !265, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !266)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !214, file: !211, line: 107, baseType: !121, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !214, file: !211, line: 127, baseType: !102, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !214, file: !211, line: 131, baseType: !270, size: 192, offset: 192)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !271)
!271 = !{!272, !273, !279}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !270, file: !247, line: 245, baseType: !220, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !270, file: !247, line: 246, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !270, file: !247, line: 249, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !281)
!281 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !210, file: !211, line: 250, baseType: !283, size: 288, offset: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !284, line: 25, size: 288, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !283, file: !284, line: 26, baseType: !121, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !283, file: !284, line: 27, baseType: !121, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !283, file: !284, line: 28, baseType: !121, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !283, file: !284, line: 29, baseType: !121, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !283, file: !284, line: 30, baseType: !121, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !283, file: !284, line: 31, baseType: !121, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !283, file: !284, line: 32, baseType: !121, size: 32, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !283, file: !284, line: 33, baseType: !121, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !283, file: !284, line: 34, baseType: !121, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !210, file: !211, line: 253, baseType: !102, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !210, file: !211, line: 256, baseType: !246, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !210, file: !211, line: 294, baseType: !103, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !210, file: !211, line: 300, baseType: !299, size: 96, offset: 800)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !211, line: 149, size: 96, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !299, file: !211, line: 153, baseType: !22, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !211, line: 162, baseType: !200, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !299, file: !211, line: 168, baseType: !200, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !210, file: !211, line: 325, baseType: !305, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !307, line: 5073, size: 160, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 5074, baseType: !310, size: 96)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !311, line: 56, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !310, file: !311, line: 57, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !311, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !310, file: !311, line: 58, baseType: !102, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !310, file: !311, line: 59, baseType: !200, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !306, file: !307, line: 5075, baseType: !246, size: 64, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !307, line: 5076, baseType: !320, offset: 160)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !321, line: 43, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !210, file: !211, line: 343, baseType: !324, size: 64, offset: 928)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !284, line: 60, size: 64, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !324, file: !284, line: 63, baseType: !121, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !324, file: !284, line: 66, baseType: !121, size: 32, offset: 32)
!328 = !{!329, !330, !331, !332}
!329 = !DILocalVariable(name: "thread", arg: 1, scope: !205, file: !206, line: 175, type: !209)
!330 = !DILocalVariable(name: "region_num", scope: !205, file: !206, line: 200, type: !154)
!331 = !DILocalVariable(name: "guard_start", scope: !205, file: !206, line: 265, type: !22)
!332 = !DILocalVariable(name: "guard_size", scope: !205, file: !206, line: 266, type: !200)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 96, elements: !345)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !335, line: 52, size: 96, elements: !336)
!335 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !334, file: !335, line: 53, baseType: !22, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !334, file: !335, line: 54, baseType: !200, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !334, file: !335, line: 55, baseType: !340, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !341, line: 151, baseType: !342)
!341 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 149, size: 32, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !342, file: !341, line: 150, baseType: !121, size: 32)
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 96, elements: !345)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !351, file: !384, line: 39, type: !154, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !353, globals: !383, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!353 = !{!354, !102, !103, !371, !154}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !356, line: 1226, baseType: !357)
!356 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 1213, size: 352, elements: !358)
!358 = !{!359, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !357, file: !356, line: 1215, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !357, file: !356, line: 1216, baseType: !120, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !357, file: !356, line: 1217, baseType: !120, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !357, file: !356, line: 1218, baseType: !120, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !357, file: !356, line: 1219, baseType: !120, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !357, file: !356, line: 1220, baseType: !120, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !357, file: !356, line: 1221, baseType: !120, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !357, file: !356, line: 1222, baseType: !120, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !357, file: !356, line: 1223, baseType: !120, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !357, file: !356, line: 1224, baseType: !120, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !357, file: !356, line: 1225, baseType: !120, size: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !373, file: !374, line: 29, baseType: !121, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !373, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !373, file: !374, line: 37, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !380, file: !341, line: 143, baseType: !121, size: 32)
!383 = !{!349}
!384 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !387, file: !394, line: 21, type: !106, isLocal: true, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !389, globals: !393, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!389 = !{!390, !103, !102}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !392, line: 22, baseType: !103)
!392 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!385}
!394 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !397, file: !402, line: 13, type: !419, isLocal: true, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !399, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!399 = !{!400, !395}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "mpu_config", scope: !397, file: !402, line: 37, type: !403, isLocal: false, isDefinition: true)
!402 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !374, line: 41, size: 64, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !404, file: !374, line: 43, baseType: !121, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !404, file: !374, line: 45, baseType: !408, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !410, file: !374, line: 29, baseType: !121, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !410, file: !374, line: 37, baseType: !415, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !416, file: !341, line: 143, baseType: !121, size: 32)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 192, elements: !242)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !422, file: !537, line: 72, type: !621, isLocal: true, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !424, retainedTypes: !523, globals: !534, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!424 = !{!30, !425}
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!427 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!428 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!429 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!430 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!431 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!432 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!433 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!434 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!435 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!436 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!437 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!438 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!439 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!440 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!441 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!442 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!443 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!444 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!445 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!446 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!447 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!448 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!449 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!450 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!451 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!452 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!453 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!454 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!455 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!456 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!457 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!458 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!459 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!460 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!461 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!462 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!463 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!464 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!465 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!466 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!467 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!468 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!469 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!470 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!471 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!472 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!473 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!474 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!475 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!476 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!477 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!478 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!479 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!480 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!481 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!482 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!483 = !DIEnumerator(name: "FMC_IRQn", value: 48)
!484 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!485 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!486 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!487 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!488 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!489 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!490 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!491 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!492 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!493 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!494 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!495 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!496 = !DIEnumerator(name: "ETH_IRQn", value: 61)
!497 = !DIEnumerator(name: "ETH_WKUP_IRQn", value: 62)
!498 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!499 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!500 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!501 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!502 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!503 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!504 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!505 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!506 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!507 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!508 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!509 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!510 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!511 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!512 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!513 = !DIEnumerator(name: "DCMI_IRQn", value: 78)
!514 = !DIEnumerator(name: "HASH_RNG_IRQn", value: 80)
!515 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!516 = !DIEnumerator(name: "UART7_IRQn", value: 82)
!517 = !DIEnumerator(name: "UART8_IRQn", value: 83)
!518 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!519 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!520 = !DIEnumerator(name: "SPI6_IRQn", value: 86)
!521 = !DIEnumerator(name: "SAI1_IRQn", value: 87)
!522 = !DIEnumerator(name: "DMA2D_IRQn", value: 90)
!523 = !{!200, !103, !102, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 486, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 478, size: 192, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !526, file: !116, line: 480, baseType: !120, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !526, file: !116, line: 481, baseType: !120, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !526, file: !116, line: 482, baseType: !120, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !526, file: !116, line: 483, baseType: !120, size: 32, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !526, file: !116, line: 484, baseType: !120, size: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !526, file: !116, line: 485, baseType: !120, size: 32, offset: 160)
!534 = !{!535, !541, !557, !568, !585, !420, !587, !601, !603, !605, !607, !609, !611, !613, !615, !617, !619}
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !422, file: !537, line: 424, type: !538, isLocal: false, isDefinition: true, align: 16)
!537 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 4)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "__device_dts_ord_42", scope: !422, file: !537, line: 424, type: !543, isLocal: false, isDefinition: true, align: 32)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !545)
!545 = !{!546, !547, !548, !549, !555, !556}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !544, file: !141, line: 380, baseType: !144, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !544, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !544, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !544, file: !141, line: 386, baseType: !550, size: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !551, file: !141, line: 359, baseType: !154, size: 8)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !551, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !544, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !544, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_42", scope: !422, file: !537, line: 424, type: !559, isLocal: true, isDefinition: true, align: 32)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !561)
!561 = !{!562, !567}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !560, file: !132, line: 60, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DISubroutineType(types: !565)
!565 = !{!103, !566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !560, file: !132, line: 65, baseType: !566, size: 32, offset: 32)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "exti_data", scope: !422, file: !537, line: 423, type: !570, isLocal: true, isDefinition: true)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !537, line: 107, size: 1472, elements: !571)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !570, file: !537, line: 109, baseType: !573, size: 1472)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 1472, elements: !583)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !537, line: 101, size: 64, elements: !575)
!575 = !{!576, !582}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !574, file: !537, line: 102, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !578, line: 63, baseType: !579)
!578 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !103, !102}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !574, file: !537, line: 103, baseType: !102, size: 32, offset: 32)
!583 = !{!584}
!584 = !DISubrange(count: 23)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_42", scope: !422, file: !537, line: 424, type: !551, isLocal: true, isDefinition: true, align: 8)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !589, file: !537, line: 493, type: !594, isLocal: true, isDefinition: true, align: 32)
!589 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !537, file: !537, line: 460, type: !590, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !422, retainedNodes: !592)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !566}
!592 = !{!593}
!593 = !DILocalVariable(name: "dev", arg: 1, scope: !589, file: !537, line: 460, type: !566)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !595)
!595 = !{!596, !598, !599, !600}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !594, file: !10, line: 55, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !594, file: !10, line: 57, baseType: !597, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !594, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !594, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !589, file: !537, line: 497, type: !594, isLocal: true, isDefinition: true, align: 32)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !589, file: !537, line: 507, type: !594, isLocal: true, isDefinition: true, align: 32)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !589, file: !537, line: 512, type: !594, isLocal: true, isDefinition: true, align: 32)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !589, file: !537, line: 516, type: !594, isLocal: true, isDefinition: true, align: 32)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !589, file: !537, line: 523, type: !594, isLocal: true, isDefinition: true, align: 32)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !589, file: !537, line: 527, type: !594, isLocal: true, isDefinition: true, align: 32)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !589, file: !537, line: 581, type: !594, isLocal: true, isDefinition: true, align: 32)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !589, file: !537, line: 586, type: !594, isLocal: true, isDefinition: true, align: 32)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !589, file: !537, line: 591, type: !594, isLocal: true, isDefinition: true, align: 32)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !589, file: !537, line: 595, type: !594, isLocal: true, isDefinition: true, align: 32)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 736, elements: !583)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 165, baseType: !425)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !626, file: !631, line: 29, type: !667, isLocal: false, isDefinition: true, align: 16)
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !628, splitDebugInlining: false, nameTableKind: None)
!627 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!628 = !{!629, !624, !635, !637, !639, !641, !643, !645, !647, !649, !651, !653, !655, !657, !659, !661, !663, !665}
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !626, file: !631, line: 24, type: !632, isLocal: false, isDefinition: true, align: 16)
!631 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 304, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 19)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_106", scope: !626, file: !631, line: 36, type: !538, isLocal: false, isDefinition: true, align: 16)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_105", scope: !626, file: !631, line: 43, type: !538, isLocal: false, isDefinition: true, align: 16)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_104", scope: !626, file: !631, line: 50, type: !538, isLocal: false, isDefinition: true, align: 16)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_103", scope: !626, file: !631, line: 57, type: !538, isLocal: false, isDefinition: true, align: 16)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_102", scope: !626, file: !631, line: 64, type: !538, isLocal: false, isDefinition: true, align: 16)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_101", scope: !626, file: !631, line: 71, type: !538, isLocal: false, isDefinition: true, align: 16)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !626, file: !631, line: 78, type: !538, isLocal: false, isDefinition: true, align: 16)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_100", scope: !626, file: !631, line: 85, type: !538, isLocal: false, isDefinition: true, align: 16)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_99", scope: !626, file: !631, line: 92, type: !538, isLocal: false, isDefinition: true, align: 16)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_98", scope: !626, file: !631, line: 99, type: !538, isLocal: false, isDefinition: true, align: 16)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_97", scope: !626, file: !631, line: 106, type: !538, isLocal: false, isDefinition: true, align: 16)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_60", scope: !626, file: !631, line: 113, type: !538, isLocal: false, isDefinition: true, align: 16)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_57", scope: !626, file: !631, line: 120, type: !538, isLocal: false, isDefinition: true, align: 16)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_52", scope: !626, file: !631, line: 127, type: !538, isLocal: false, isDefinition: true, align: 16)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_49", scope: !626, file: !631, line: 134, type: !538, isLocal: false, isDefinition: true, align: 16)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_63", scope: !626, file: !631, line: 141, type: !538, isLocal: false, isDefinition: true, align: 16)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 3)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !672, file: !735, line: 398, type: !768, isLocal: true, isDefinition: true)
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !674, retainedTypes: !687, globals: !732, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!674 = !{!675, !30, !680}
!675 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !676, line: 197, baseType: !32, size: 32, elements: !677)
!676 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!677 = !{!678, !679}
!678 = !DIEnumerator(name: "SUCCESS", value: 0)
!679 = !DIEnumerator(name: "ERROR", value: 1)
!680 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !681, line: 44, baseType: !32, size: 32, elements: !682)
!681 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!682 = !{!683, !684, !685, !686}
!683 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!684 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!685 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!686 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!687 = !{!102, !103, !121, !688, !725, !731}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 677, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 643, size: 1152, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !690, file: !116, line: 645, baseType: !120, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !690, file: !116, line: 646, baseType: !120, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !690, file: !116, line: 647, baseType: !120, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !690, file: !116, line: 648, baseType: !120, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !690, file: !116, line: 649, baseType: !120, size: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !690, file: !116, line: 650, baseType: !120, size: 32, offset: 160)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !690, file: !116, line: 651, baseType: !120, size: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !690, file: !116, line: 652, baseType: !121, size: 32, offset: 224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !690, file: !116, line: 653, baseType: !120, size: 32, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !690, file: !116, line: 654, baseType: !120, size: 32, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !690, file: !116, line: 655, baseType: !703, size: 64, offset: 320)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !242)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !690, file: !116, line: 656, baseType: !120, size: 32, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !690, file: !116, line: 657, baseType: !120, size: 32, offset: 416)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !690, file: !116, line: 658, baseType: !120, size: 32, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !690, file: !116, line: 659, baseType: !121, size: 32, offset: 480)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !690, file: !116, line: 660, baseType: !120, size: 32, offset: 512)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !690, file: !116, line: 661, baseType: !120, size: 32, offset: 544)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !690, file: !116, line: 662, baseType: !703, size: 64, offset: 576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !690, file: !116, line: 663, baseType: !120, size: 32, offset: 640)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !690, file: !116, line: 664, baseType: !120, size: 32, offset: 672)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !690, file: !116, line: 665, baseType: !120, size: 32, offset: 704)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !690, file: !116, line: 666, baseType: !121, size: 32, offset: 736)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !690, file: !116, line: 667, baseType: !120, size: 32, offset: 768)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !690, file: !116, line: 668, baseType: !120, size: 32, offset: 800)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !690, file: !116, line: 669, baseType: !703, size: 64, offset: 832)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !690, file: !116, line: 670, baseType: !120, size: 32, offset: 896)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !690, file: !116, line: 671, baseType: !120, size: 32, offset: 928)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !690, file: !116, line: 672, baseType: !703, size: 64, offset: 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !690, file: !116, line: 673, baseType: !120, size: 32, offset: 1024)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !690, file: !116, line: 674, baseType: !120, size: 32, offset: 1056)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSAICFGR", scope: !690, file: !116, line: 675, baseType: !120, size: 32, offset: 1088)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !690, file: !116, line: 676, baseType: !120, size: 32, offset: 1120)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 32)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !727, line: 343, size: 64, elements: !728)
!727 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !726, file: !727, line: 344, baseType: !121, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !726, file: !727, line: 345, baseType: !121, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!732 = !{!733, !739, !755, !766, !670}
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !672, file: !735, line: 752, type: !736, isLocal: false, isDefinition: true, align: 16)
!735 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1024, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 64)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !672, file: !735, line: 752, type: !741, isLocal: false, isDefinition: true, align: 32)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !743)
!743 = !{!744, !745, !746, !747, !753, !754}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !742, file: !141, line: 380, baseType: !144, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !742, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !742, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !742, file: !141, line: 386, baseType: !748, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !749, file: !141, line: 359, baseType: !154, size: 8)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !749, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !742, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !742, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !672, file: !735, line: 752, type: !757, isLocal: true, isDefinition: true, align: 32)
!757 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !759)
!759 = !{!760, !765}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !758, file: !132, line: 60, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DISubroutineType(types: !763)
!763 = !{!103, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !758, file: !132, line: 65, baseType: !764, size: 32, offset: 32)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !672, file: !735, line: 752, type: !749, isLocal: true, isDefinition: true, align: 8)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !681, line: 100, size: 224, elements: !769)
!769 = !{!770, !776, !777, !786, !791, !796, !802}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !768, file: !681, line: 101, baseType: !771, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !681, line: 76, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DISubroutineType(types: !774)
!774 = !{!103, !764, !775}
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !681, line: 56, baseType: !102)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !768, file: !681, line: 102, baseType: !771, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !768, file: !681, line: 103, baseType: !778, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !681, line: 83, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = !DISubroutineType(types: !781)
!781 = !{!103, !764, !775, !782, !102}
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !681, line: 72, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !764, !775, !102}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !768, file: !681, line: 104, baseType: !787, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !681, line: 79, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = !DISubroutineType(types: !790)
!790 = !{!103, !764, !775, !731}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !768, file: !681, line: 105, baseType: !792, size: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !681, line: 88, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = !DISubroutineType(types: !795)
!795 = !{!680, !764, !775}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !768, file: !681, line: 106, baseType: !797, size: 32, offset: 160)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !681, line: 92, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DISubroutineType(types: !800)
!800 = !{!103, !764, !775, !801}
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !681, line: 64, baseType: !102)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !768, file: !681, line: 107, baseType: !803, size: 32, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !681, line: 96, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DISubroutineType(types: !806)
!806 = !{!103, !764, !775, !102}
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !809, file: !866, line: 603, type: !868, isLocal: true, isDefinition: true, align: 32)
!809 = distinct !DICompileUnit(language: DW_LANG_C99, file: !810, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !811, globals: !863, splitDebugInlining: false, nameTableKind: None)
!810 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!811 = !{!102, !103, !812}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !815, line: 336, size: 160, elements: !816)
!815 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !{!817, !837, !841, !845, !858}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !814, file: !815, line: 365, baseType: !818, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DISubroutineType(types: !820)
!820 = !{!103, !821, !836}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !824)
!824 = !{!825, !826, !827, !828, !834, !835}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !823, file: !141, line: 380, baseType: !144, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !823, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !823, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !823, file: !141, line: 386, baseType: !829, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !830, file: !141, line: 359, baseType: !154, size: 8)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !830, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !823, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !823, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !814, file: !815, line: 366, baseType: !838, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !821, !155}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !814, file: !815, line: 374, baseType: !842, size: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DISubroutineType(types: !844)
!844 = !{!103, !821}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !814, file: !815, line: 377, baseType: !846, size: 32, offset: 96)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DISubroutineType(types: !848)
!848 = !{!103, !821, !849}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !815, line: 122, size: 64, elements: !852)
!852 = !{!853, !854, !855, !856, !857}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !851, file: !815, line: 123, baseType: !121, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !851, file: !815, line: 124, baseType: !154, size: 8, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !851, file: !815, line: 125, baseType: !154, size: 8, offset: 40)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !851, file: !815, line: 126, baseType: !154, size: 8, offset: 48)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !851, file: !815, line: 127, baseType: !154, size: 8, offset: 56)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !814, file: !815, line: 379, baseType: !859, size: 32, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DISubroutineType(types: !861)
!861 = !{!103, !821, !862}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!863 = !{!807, !864}
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !809, file: !866, line: 38, type: !867, isLocal: true, isDefinition: true)
!866 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !869, file: !132, line: 60, baseType: !842, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !869, file: !132, line: 65, baseType: !821, size: 32, offset: 32)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !875, file: !1045, line: 762, type: !1184, isLocal: true, isDefinition: true)
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !877, retainedTypes: !895, globals: !1042, splitDebugInlining: false, nameTableKind: None)
!876 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_aerocore2/minimal")
!877 = !{!30, !878, !884, !889, !680}
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !879, line: 506, baseType: !32, size: 32, elements: !880)
!879 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!880 = !{!881, !882, !883}
!881 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!882 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!883 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !879, line: 512, baseType: !32, size: 32, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!887 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!888 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !578, line: 43, baseType: !32, size: 32, elements: !890)
!890 = !{!891, !892, !893, !894}
!891 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!892 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!893 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!894 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!895 = !{!102, !103, !896, !966, !971, !931, !884, !878, !976, !977, !121, !991, !946, !1001, !1002, !1003}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !879, line: 523, size: 288, elements: !899)
!899 = !{!900, !921, !927, !932, !936, !937, !938, !942, !962}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !898, file: !879, line: 524, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{!103, !904, !919, !920}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !907)
!907 = !{!908, !909, !910, !911, !917, !918}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !906, file: !141, line: 380, baseType: !144, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !906, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !906, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !906, file: !141, line: 386, baseType: !912, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !913, file: !141, line: 359, baseType: !154, size: 8)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !913, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !906, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !906, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !879, line: 237, baseType: !154)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !879, line: 257, baseType: !121)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !898, file: !879, line: 530, baseType: !922, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DISubroutineType(types: !924)
!924 = !{!103, !904, !925}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !879, line: 229, baseType: !121)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !898, file: !879, line: 532, baseType: !928, size: 32, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DISubroutineType(types: !930)
!930 = !{!103, !904, !931, !926}
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !879, line: 216, baseType: !121)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !898, file: !879, line: 535, baseType: !933, size: 32, offset: 96)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = !DISubroutineType(types: !935)
!935 = !{!103, !904, !931}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !898, file: !879, line: 537, baseType: !933, size: 32, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !898, file: !879, line: 539, baseType: !933, size: 32, offset: 160)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !898, file: !879, line: 541, baseType: !939, size: 32, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DISubroutineType(types: !941)
!941 = !{!103, !904, !919, !878, !884}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !898, file: !879, line: 544, baseType: !943, size: 32, offset: 224)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DISubroutineType(types: !945)
!945 = !{!103, !904, !946, !157}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !879, line: 478, size: 96, elements: !948)
!948 = !{!949, !956, !961}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !947, file: !879, line: 482, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !951, line: 33, baseType: !952)
!951 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !951, line: 29, size: 32, elements: !953)
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !951, line: 30, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !947, file: !879, line: 485, baseType: !957, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !879, line: 464, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !904, !946, !931}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !947, file: !879, line: 493, baseType: !931, size: 32, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !898, file: !879, line: 547, baseType: !963, size: 32, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = !DISubroutineType(types: !965)
!965 = !{!121, !904}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !879, line: 428, size: 32, elements: !969)
!969 = !{!970}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !968, file: !879, line: 434, baseType: !931, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !879, line: 441, size: 32, elements: !974)
!974 = !{!975}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !973, file: !879, line: 447, baseType: !931, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 583, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 572, size: 320, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !986, !987, !988, !989}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !979, file: !116, line: 574, baseType: !120, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !979, file: !116, line: 575, baseType: !120, size: 32, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !979, file: !116, line: 576, baseType: !120, size: 32, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !979, file: !116, line: 577, baseType: !120, size: 32, offset: 96)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !979, file: !116, line: 578, baseType: !120, size: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !979, file: !116, line: 579, baseType: !120, size: 32, offset: 160)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !979, file: !116, line: 580, baseType: !120, size: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !979, file: !116, line: 581, baseType: !120, size: 32, offset: 224)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !979, file: !116, line: 582, baseType: !990, size: 64, offset: 256)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !242)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 596, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 589, size: 288, elements: !994)
!994 = !{!995, !996, !997, !999, !1000}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !993, file: !116, line: 591, baseType: !120, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !993, file: !116, line: 592, baseType: !120, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !993, file: !116, line: 593, baseType: !998, size: 128, offset: 64)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !539)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !993, file: !116, line: 594, baseType: !703, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !993, file: !116, line: 595, baseType: !120, size: 32, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !681, line: 100, size: 224, elements: !1006)
!1006 = !{!1007, !1012, !1013, !1022, !1027, !1032, !1037}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1005, file: !681, line: 101, baseType: !1008, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !681, line: 76, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!103, !904, !775}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1005, file: !681, line: 102, baseType: !1008, size: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1005, file: !681, line: 103, baseType: !1014, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !681, line: 83, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!103, !904, !775, !1018, !102}
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !681, line: 72, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{null, !904, !775, !102}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1005, file: !681, line: 104, baseType: !1023, size: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !681, line: 79, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!103, !904, !775, !731}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1005, file: !681, line: 105, baseType: !1028, size: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !681, line: 88, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!680, !904, !775}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !1005, file: !681, line: 106, baseType: !1033, size: 32, offset: 160)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !681, line: 92, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!103, !904, !775, !801}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1005, file: !681, line: 107, baseType: !1038, size: 32, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !681, line: 96, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!103, !904, !775, !102}
!1042 = !{!1043, !1049, !1051, !1061, !1063, !1065, !1067, !1069, !1071, !1073, !1075, !1077, !1079, !1084, !1086, !1088, !1090, !1092, !1094, !1096, !1098, !1100, !1102, !1104, !1106, !1108, !1110, !1112, !1114, !1116, !1118, !1120, !1122, !1124, !1138, !1140, !1142, !1144, !1146, !1148, !1150, !1152, !1154, !1156, !1158, !1160, !1162, !1164, !1166, !1168, !1170, !1172, !1174, !1176, !1178, !873, !1180, !1182, !1195, !1197, !1199, !1201, !1203, !1205, !1207, !1209, !1211}
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_97", scope: !875, file: !1045, line: 762, type: !1046, isLocal: false, isDefinition: true, align: 16)
!1045 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 80, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 5)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "__device_dts_ord_97", scope: !875, file: !1045, line: 762, type: !905, isLocal: false, isDefinition: true, align: 32)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_97", scope: !875, file: !1045, line: 762, type: !1053, isLocal: true, isDefinition: true, align: 32)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !1055)
!1055 = !{!1056, !1060}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1054, file: !132, line: 60, baseType: !1057, size: 32)
