; ModuleID = 'build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 94, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5248, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 82)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2624, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 369, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f405xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 360, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 362, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 363, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 364, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 365, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 366, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 367, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 368, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "static_regions", scope: !197, file: !206, line: 62, type: !347, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !199, globals: !202, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!199 = !{!200, !103, !121, !102}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 214, baseType: !32)
!201 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !195}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !205, file: !206, line: 198, type: !333, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !206, file: !206, line: 175, type: !207, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !328)
!206 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !211, line: 245, size: 1024, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !282, !295, !296, !297, !298, !304, !323}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !210, file: !211, line: 247, baseType: !214, size: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !211, line: 57, size: 384, elements: !215)
!215 = !{!216, !244, !252, !253, !254, !267, !268, !269}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 60, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 60, size: 64, elements: !218)
!218 = !{!219, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !217, file: !211, line: 61, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !221, line: 49, baseType: !222)
!221 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !221, line: 37, size: 64, elements: !223)
!223 = !{!224, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 38, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 38, size: 32, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !221, line: 39, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !221, line: 40, baseType: !228, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 42, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 42, size: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !221, line: 43, baseType: !228, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !221, line: 44, baseType: !228, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !217, file: !211, line: 62, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !237, line: 49, size: 64, elements: !238)
!237 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !236, file: !237, line: 50, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !214, file: !211, line: 68, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !221, line: 48, baseType: !222)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !214, file: !211, line: 71, baseType: !154, size: 8, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !214, file: !211, line: 74, baseType: !154, size: 8, offset: 104)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 90, baseType: !255, size: 16, offset: 112)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 90, size: 16, elements: !256)
!256 = !{!257, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !211, line: 91, baseType: !258, size: 16)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !211, line: 91, size: 16, elements: !259)
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !258, file: !211, line: 96, baseType: !261, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !262)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !258, file: !211, line: 97, baseType: !154, size: 8, offset: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !255, file: !211, line: 100, baseType: !265, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !266)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !214, file: !211, line: 107, baseType: !121, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !214, file: !211, line: 127, baseType: !102, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !214, file: !211, line: 131, baseType: !270, size: 192, offset: 192)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !271)
!271 = !{!272, !273, !279}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !270, file: !247, line: 245, baseType: !220, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !270, file: !247, line: 246, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !270, file: !247, line: 249, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !281)
!281 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !210, file: !211, line: 250, baseType: !283, size: 288, offset: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !284, line: 25, size: 288, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !283, file: !284, line: 26, baseType: !121, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !283, file: !284, line: 27, baseType: !121, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !283, file: !284, line: 28, baseType: !121, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !283, file: !284, line: 29, baseType: !121, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !283, file: !284, line: 30, baseType: !121, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !283, file: !284, line: 31, baseType: !121, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !283, file: !284, line: 32, baseType: !121, size: 32, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !283, file: !284, line: 33, baseType: !121, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !283, file: !284, line: 34, baseType: !121, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !210, file: !211, line: 253, baseType: !102, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !210, file: !211, line: 256, baseType: !246, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !210, file: !211, line: 294, baseType: !103, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !210, file: !211, line: 300, baseType: !299, size: 96, offset: 800)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !211, line: 149, size: 96, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !299, file: !211, line: 153, baseType: !22, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !211, line: 162, baseType: !200, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !299, file: !211, line: 168, baseType: !200, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !210, file: !211, line: 325, baseType: !305, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !307, line: 5073, size: 160, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 5074, baseType: !310, size: 96)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !311, line: 56, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !310, file: !311, line: 57, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !311, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !310, file: !311, line: 58, baseType: !102, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !310, file: !311, line: 59, baseType: !200, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !306, file: !307, line: 5075, baseType: !246, size: 64, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !307, line: 5076, baseType: !320, offset: 160)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !321, line: 43, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !210, file: !211, line: 343, baseType: !324, size: 64, offset: 928)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !284, line: 60, size: 64, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !324, file: !284, line: 63, baseType: !121, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !324, file: !284, line: 66, baseType: !121, size: 32, offset: 32)
!328 = !{!329, !330, !331, !332}
!329 = !DILocalVariable(name: "thread", arg: 1, scope: !205, file: !206, line: 175, type: !209)
!330 = !DILocalVariable(name: "region_num", scope: !205, file: !206, line: 200, type: !154)
!331 = !DILocalVariable(name: "guard_start", scope: !205, file: !206, line: 265, type: !22)
!332 = !DILocalVariable(name: "guard_size", scope: !205, file: !206, line: 266, type: !200)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 96, elements: !345)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !335, line: 52, size: 96, elements: !336)
!335 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !334, file: !335, line: 53, baseType: !22, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !334, file: !335, line: 54, baseType: !200, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !334, file: !335, line: 55, baseType: !340, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !341, line: 151, baseType: !342)
!341 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 149, size: 32, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !342, file: !341, line: 150, baseType: !121, size: 32)
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 96, elements: !345)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !351, file: !384, line: 39, type: !154, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !353, globals: !383, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!353 = !{!354, !102, !103, !371, !154}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !356, line: 1226, baseType: !357)
!356 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 1213, size: 352, elements: !358)
!358 = !{!359, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !357, file: !356, line: 1215, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !357, file: !356, line: 1216, baseType: !120, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !357, file: !356, line: 1217, baseType: !120, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !357, file: !356, line: 1218, baseType: !120, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !357, file: !356, line: 1219, baseType: !120, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !357, file: !356, line: 1220, baseType: !120, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !357, file: !356, line: 1221, baseType: !120, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !357, file: !356, line: 1222, baseType: !120, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !357, file: !356, line: 1223, baseType: !120, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !357, file: !356, line: 1224, baseType: !120, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !357, file: !356, line: 1225, baseType: !120, size: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !373, file: !374, line: 29, baseType: !121, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !373, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !373, file: !374, line: 37, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !380, file: !341, line: 143, baseType: !121, size: 32)
!383 = !{!349}
!384 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !387, file: !392, line: 13, type: !409, isLocal: true, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !389, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!389 = !{!390, !385}
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "mpu_config", scope: !387, file: !392, line: 37, type: !393, isLocal: false, isDefinition: true)
!392 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !374, line: 41, size: 64, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !394, file: !374, line: 43, baseType: !121, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !394, file: !374, line: 45, baseType: !398, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !401)
!401 = !{!402, !403, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !400, file: !374, line: 29, baseType: !121, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !400, file: !374, line: 37, baseType: !405, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !406, file: !341, line: 143, baseType: !121, size: 32)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 192, elements: !242)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !412, file: !517, line: 72, type: !601, isLocal: true, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !414, retainedTypes: !503, globals: !514, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!414 = !{!30, !415}
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!417 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!418 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!419 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!420 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!421 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!422 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!423 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!424 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!425 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!426 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!427 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!428 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!429 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!430 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!431 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!432 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!433 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!434 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!435 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!436 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!437 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!438 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!439 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!440 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!441 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!442 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!443 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!444 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!445 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!446 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!447 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!448 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!449 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!450 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!451 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!452 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!453 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!454 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!455 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!456 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!457 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!458 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!459 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!460 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!461 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!462 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!463 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!464 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!465 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!466 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!467 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!468 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!469 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!470 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!471 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!472 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!473 = !DIEnumerator(name: "FSMC_IRQn", value: 48)
!474 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!475 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!476 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!477 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!478 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!479 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!480 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!481 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!482 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!483 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!484 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!485 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!486 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!487 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!488 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!489 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!490 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!491 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!492 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!493 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!494 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!495 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!496 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!497 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!498 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!499 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!500 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!501 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!502 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!503 = !{!200, !103, !102, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 354, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 346, size: 192, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !506, file: !116, line: 348, baseType: !120, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !506, file: !116, line: 349, baseType: !120, size: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !506, file: !116, line: 350, baseType: !120, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !506, file: !116, line: 351, baseType: !120, size: 32, offset: 96)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !506, file: !116, line: 352, baseType: !120, size: 32, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !506, file: !116, line: 353, baseType: !120, size: 32, offset: 160)
!514 = !{!515, !521, !537, !548, !565, !410, !567, !581, !583, !585, !587, !589, !591, !593, !595, !597, !599}
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !412, file: !517, line: 424, type: !518, isLocal: false, isDefinition: true, align: 16)
!517 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 4)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "__device_dts_ord_37", scope: !412, file: !517, line: 424, type: !523, isLocal: false, isDefinition: true, align: 32)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !525)
!525 = !{!526, !527, !528, !529, !535, !536}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !524, file: !141, line: 380, baseType: !144, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !524, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !524, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !524, file: !141, line: 386, baseType: !530, size: 32, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !531, file: !141, line: 359, baseType: !154, size: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !531, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !524, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !524, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_37", scope: !412, file: !517, line: 424, type: !539, isLocal: true, isDefinition: true, align: 32)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !541)
!541 = !{!542, !547}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !540, file: !132, line: 60, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DISubroutineType(types: !545)
!545 = !{!103, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !540, file: !132, line: 65, baseType: !546, size: 32, offset: 32)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "exti_data", scope: !412, file: !517, line: 423, type: !550, isLocal: true, isDefinition: true)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !517, line: 107, size: 1472, elements: !551)
!551 = !{!552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !550, file: !517, line: 109, baseType: !553, size: 1472)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 1472, elements: !563)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !517, line: 101, size: 64, elements: !555)
!555 = !{!556, !562}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !554, file: !517, line: 102, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !558, line: 63, baseType: !559)
!558 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !103, !102}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !554, file: !517, line: 103, baseType: !102, size: 32, offset: 32)
!563 = !{!564}
!564 = !DISubrange(count: 23)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_37", scope: !412, file: !517, line: 424, type: !531, isLocal: true, isDefinition: true, align: 8)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !569, file: !517, line: 493, type: !574, isLocal: true, isDefinition: true, align: 32)
!569 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !517, file: !517, line: 460, type: !570, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !412, retainedNodes: !572)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !546}
!572 = !{!573}
!573 = !DILocalVariable(name: "dev", arg: 1, scope: !569, file: !517, line: 460, type: !546)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !575)
!575 = !{!576, !578, !579, !580}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !574, file: !10, line: 55, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !574, file: !10, line: 57, baseType: !577, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !574, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !574, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !569, file: !517, line: 497, type: !574, isLocal: true, isDefinition: true, align: 32)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !569, file: !517, line: 507, type: !574, isLocal: true, isDefinition: true, align: 32)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !569, file: !517, line: 512, type: !574, isLocal: true, isDefinition: true, align: 32)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !569, file: !517, line: 516, type: !574, isLocal: true, isDefinition: true, align: 32)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !569, file: !517, line: 523, type: !574, isLocal: true, isDefinition: true, align: 32)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !569, file: !517, line: 527, type: !574, isLocal: true, isDefinition: true, align: 32)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !569, file: !517, line: 581, type: !574, isLocal: true, isDefinition: true, align: 32)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !569, file: !517, line: 586, type: !574, isLocal: true, isDefinition: true, align: 32)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !569, file: !517, line: 591, type: !574, isLocal: true, isDefinition: true, align: 32)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !569, file: !517, line: 595, type: !574, isLocal: true, isDefinition: true, align: 32)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 736, elements: !563)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 155, baseType: !415)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !606, file: !611, line: 23, type: !635, isLocal: false, isDefinition: true, align: 16)
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !608, splitDebugInlining: false, nameTableKind: None)
!607 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!608 = !{!609, !604, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633}
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !606, file: !611, line: 18, type: !612, isLocal: false, isDefinition: true, align: 16)
!611 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 208, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 13)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !606, file: !611, line: 30, type: !518, isLocal: false, isDefinition: true, align: 16)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !606, file: !611, line: 37, type: !518, isLocal: false, isDefinition: true, align: 16)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !606, file: !611, line: 44, type: !518, isLocal: false, isDefinition: true, align: 16)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !606, file: !611, line: 51, type: !518, isLocal: false, isDefinition: true, align: 16)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !606, file: !611, line: 58, type: !518, isLocal: false, isDefinition: true, align: 16)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !606, file: !611, line: 65, type: !518, isLocal: false, isDefinition: true, align: 16)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !606, file: !611, line: 72, type: !518, isLocal: false, isDefinition: true, align: 16)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !606, file: !611, line: 79, type: !518, isLocal: false, isDefinition: true, align: 16)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !606, file: !611, line: 86, type: !518, isLocal: false, isDefinition: true, align: 16)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !606, file: !611, line: 93, type: !518, isLocal: false, isDefinition: true, align: 16)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 3)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !640, file: !701, line: 398, type: !734, isLocal: true, isDefinition: true)
!640 = distinct !DICompileUnit(language: DW_LANG_C99, file: !641, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !642, retainedTypes: !655, globals: !698, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!642 = !{!643, !30, !648}
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !644, line: 197, baseType: !32, size: 32, elements: !645)
!644 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!645 = !{!646, !647}
!646 = !DIEnumerator(name: "SUCCESS", value: 0)
!647 = !DIEnumerator(name: "ERROR", value: 1)
!648 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !649, line: 44, baseType: !32, size: 32, elements: !650)
!649 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!650 = !{!651, !652, !653, !654}
!651 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!652 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!653 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!654 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!655 = !{!102, !103, !121, !656, !691, !697}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 532, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 500, size: 1088, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !658, file: !116, line: 502, baseType: !120, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !658, file: !116, line: 503, baseType: !120, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !658, file: !116, line: 504, baseType: !120, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !658, file: !116, line: 505, baseType: !120, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !658, file: !116, line: 506, baseType: !120, size: 32, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !658, file: !116, line: 507, baseType: !120, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !658, file: !116, line: 508, baseType: !120, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !658, file: !116, line: 509, baseType: !121, size: 32, offset: 224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !658, file: !116, line: 510, baseType: !120, size: 32, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !658, file: !116, line: 511, baseType: !120, size: 32, offset: 288)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !658, file: !116, line: 512, baseType: !671, size: 64, offset: 320)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !242)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !658, file: !116, line: 513, baseType: !120, size: 32, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !658, file: !116, line: 514, baseType: !120, size: 32, offset: 416)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !658, file: !116, line: 515, baseType: !120, size: 32, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !658, file: !116, line: 516, baseType: !121, size: 32, offset: 480)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !658, file: !116, line: 517, baseType: !120, size: 32, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !658, file: !116, line: 518, baseType: !120, size: 32, offset: 544)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !658, file: !116, line: 519, baseType: !671, size: 64, offset: 576)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !658, file: !116, line: 520, baseType: !120, size: 32, offset: 640)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !658, file: !116, line: 521, baseType: !120, size: 32, offset: 672)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !658, file: !116, line: 522, baseType: !120, size: 32, offset: 704)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !658, file: !116, line: 523, baseType: !121, size: 32, offset: 736)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !658, file: !116, line: 524, baseType: !120, size: 32, offset: 768)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !658, file: !116, line: 525, baseType: !120, size: 32, offset: 800)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !658, file: !116, line: 526, baseType: !671, size: 64, offset: 832)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !658, file: !116, line: 527, baseType: !120, size: 32, offset: 896)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !658, file: !116, line: 528, baseType: !120, size: 32, offset: 928)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !658, file: !116, line: 529, baseType: !671, size: 64, offset: 960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !658, file: !116, line: 530, baseType: !120, size: 32, offset: 1024)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !658, file: !116, line: 531, baseType: !120, size: 32, offset: 1056)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !693, line: 343, size: 64, elements: !694)
!693 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !692, file: !693, line: 344, baseType: !121, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !692, file: !693, line: 345, baseType: !121, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!698 = !{!699, !705, !721, !732, !638}
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !640, file: !701, line: 752, type: !702, isLocal: false, isDefinition: true, align: 16)
!701 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 928, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 58)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !640, file: !701, line: 752, type: !707, isLocal: false, isDefinition: true, align: 32)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !709)
!709 = !{!710, !711, !712, !713, !719, !720}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !708, file: !141, line: 380, baseType: !144, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !708, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !708, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !708, file: !141, line: 386, baseType: !714, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !715, file: !141, line: 359, baseType: !154, size: 8)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !715, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !708, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !708, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !640, file: !701, line: 752, type: !723, isLocal: true, isDefinition: true, align: 32)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !725)
!725 = !{!726, !731}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !724, file: !132, line: 60, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DISubroutineType(types: !729)
!729 = !{!103, !730}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !724, file: !132, line: 65, baseType: !730, size: 32, offset: 32)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !640, file: !701, line: 752, type: !715, isLocal: true, isDefinition: true, align: 8)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !649, line: 100, size: 224, elements: !735)
!735 = !{!736, !742, !743, !752, !757, !762, !768}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !734, file: !649, line: 101, baseType: !737, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !649, line: 76, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DISubroutineType(types: !740)
!740 = !{!103, !730, !741}
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !649, line: 56, baseType: !102)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !734, file: !649, line: 102, baseType: !737, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !734, file: !649, line: 103, baseType: !744, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !649, line: 83, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DISubroutineType(types: !747)
!747 = !{!103, !730, !741, !748, !102}
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !649, line: 72, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !730, !741, !102}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !734, file: !649, line: 104, baseType: !753, size: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !649, line: 79, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = !DISubroutineType(types: !756)
!756 = !{!103, !730, !741, !697}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !734, file: !649, line: 105, baseType: !758, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !649, line: 88, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DISubroutineType(types: !761)
!761 = !{!648, !730, !741}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !734, file: !649, line: 106, baseType: !763, size: 32, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !649, line: 92, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DISubroutineType(types: !766)
!766 = !{!103, !730, !741, !767}
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !649, line: 64, baseType: !102)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !734, file: !649, line: 107, baseType: !769, size: 32, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !649, line: 96, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!771 = !DISubroutineType(types: !772)
!772 = !{!103, !730, !741, !102}
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !775, file: !832, line: 603, type: !834, isLocal: true, isDefinition: true, align: 32)
!775 = distinct !DICompileUnit(language: DW_LANG_C99, file: !776, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !777, globals: !829, splitDebugInlining: false, nameTableKind: None)
!776 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!777 = !{!102, !103, !778}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !781, line: 336, size: 160, elements: !782)
!781 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!782 = !{!783, !803, !807, !811, !824}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !780, file: !781, line: 365, baseType: !784, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DISubroutineType(types: !786)
!786 = !{!103, !787, !802}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !790)
!790 = !{!791, !792, !793, !794, !800, !801}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !789, file: !141, line: 380, baseType: !144, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !789, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !789, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !789, file: !141, line: 386, baseType: !795, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !796, file: !141, line: 359, baseType: !154, size: 8)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !796, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !789, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !789, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !780, file: !781, line: 366, baseType: !804, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !787, !155}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !780, file: !781, line: 374, baseType: !808, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{!103, !787}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !780, file: !781, line: 377, baseType: !812, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DISubroutineType(types: !814)
!814 = !{!103, !787, !815}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !781, line: 122, size: 64, elements: !818)
!818 = !{!819, !820, !821, !822, !823}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !817, file: !781, line: 123, baseType: !121, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !817, file: !781, line: 124, baseType: !154, size: 8, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !817, file: !781, line: 125, baseType: !154, size: 8, offset: 40)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !817, file: !781, line: 126, baseType: !154, size: 8, offset: 48)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !817, file: !781, line: 127, baseType: !154, size: 8, offset: 56)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !780, file: !781, line: 379, baseType: !825, size: 32, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DISubroutineType(types: !827)
!827 = !{!103, !787, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!829 = !{!773, !830}
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !775, file: !832, line: 38, type: !833, isLocal: true, isDefinition: true)
!832 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !835, file: !132, line: 60, baseType: !808, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !835, file: !132, line: 65, baseType: !787, size: 32, offset: 32)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !841, file: !1011, line: 762, type: !1130, isLocal: true, isDefinition: true)
!841 = distinct !DICompileUnit(language: DW_LANG_C99, file: !842, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !843, retainedTypes: !861, globals: !1008, splitDebugInlining: false, nameTableKind: None)
!842 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/drivers/ipm/ipm_mcux/remote")
!843 = !{!30, !844, !850, !855, !648}
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !845, line: 506, baseType: !32, size: 32, elements: !846)
!845 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!846 = !{!847, !848, !849}
!847 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!848 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!849 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !845, line: 512, baseType: !32, size: 32, elements: !851)
!851 = !{!852, !853, !854}
!852 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!853 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!854 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !558, line: 43, baseType: !32, size: 32, elements: !856)
!856 = !{!857, !858, !859, !860}
!857 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!858 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!859 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!860 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!861 = !{!102, !103, !862, !932, !937, !897, !850, !844, !942, !943, !121, !957, !912, !967, !968, !969}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !845, line: 523, size: 288, elements: !865)
!865 = !{!866, !887, !893, !898, !902, !903, !904, !908, !928}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !864, file: !845, line: 524, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DISubroutineType(types: !869)
!869 = !{!103, !870, !885, !886}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !873)
!873 = !{!874, !875, !876, !877, !883, !884}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !872, file: !141, line: 380, baseType: !144, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !872, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !872, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !872, file: !141, line: 386, baseType: !878, size: 32, offset: 96)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !879, file: !141, line: 359, baseType: !154, size: 8)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !879, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !872, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !872, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !845, line: 237, baseType: !154)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !845, line: 257, baseType: !121)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !864, file: !845, line: 530, baseType: !888, size: 32, offset: 32)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DISubroutineType(types: !890)
!890 = !{!103, !870, !891}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !845, line: 229, baseType: !121)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !864, file: !845, line: 532, baseType: !894, size: 32, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!895 = !DISubroutineType(types: !896)
!896 = !{!103, !870, !897, !892}
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !845, line: 216, baseType: !121)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !864, file: !845, line: 535, baseType: !899, size: 32, offset: 96)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32)
!900 = !DISubroutineType(types: !901)
!901 = !{!103, !870, !897}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !864, file: !845, line: 537, baseType: !899, size: 32, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !864, file: !845, line: 539, baseType: !899, size: 32, offset: 160)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !864, file: !845, line: 541, baseType: !905, size: 32, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DISubroutineType(types: !907)
!907 = !{!103, !870, !885, !844, !850}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !864, file: !845, line: 544, baseType: !909, size: 32, offset: 224)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DISubroutineType(types: !911)
!911 = !{!103, !870, !912, !157}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !845, line: 478, size: 96, elements: !914)
!914 = !{!915, !922, !927}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !913, file: !845, line: 482, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !917, line: 33, baseType: !918)
!917 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !917, line: 29, size: 32, elements: !919)
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !918, file: !917, line: 30, baseType: !921, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !913, file: !845, line: 485, baseType: !923, size: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !845, line: 464, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 32)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !870, !912, !897}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !913, file: !845, line: 493, baseType: !897, size: 32, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !864, file: !845, line: 547, baseType: !929, size: 32, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DISubroutineType(types: !931)
!931 = !{!121, !870}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !845, line: 428, size: 32, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !934, file: !845, line: 434, baseType: !897, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !845, line: 441, size: 32, elements: !940)
!940 = !{!941}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !939, file: !845, line: 447, baseType: !897, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 441, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 430, size: 320, elements: !946)
!946 = !{!947, !948, !949, !950, !951, !952, !953, !954, !955}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !945, file: !116, line: 432, baseType: !120, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !945, file: !116, line: 433, baseType: !120, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !945, file: !116, line: 434, baseType: !120, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !945, file: !116, line: 435, baseType: !120, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !945, file: !116, line: 436, baseType: !120, size: 32, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !945, file: !116, line: 437, baseType: !120, size: 32, offset: 160)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !945, file: !116, line: 438, baseType: !120, size: 32, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !945, file: !116, line: 439, baseType: !120, size: 32, offset: 224)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !945, file: !116, line: 440, baseType: !956, size: 64, offset: 256)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !242)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 454, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 447, size: 288, elements: !960)
!960 = !{!961, !962, !963, !965, !966}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !959, file: !116, line: 449, baseType: !120, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !959, file: !116, line: 450, baseType: !120, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !959, file: !116, line: 451, baseType: !964, size: 128, offset: 64)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !519)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !959, file: !116, line: 452, baseType: !671, size: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !959, file: !116, line: 453, baseType: !120, size: 32, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !649, line: 100, size: 224, elements: !972)
!972 = !{!973, !978, !979, !988, !993, !998, !1003}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !971, file: !649, line: 101, baseType: !974, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !649, line: 76, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{!103, !870, !741}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !971, file: !649, line: 102, baseType: !974, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !971, file: !649, line: 103, baseType: !980, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !649, line: 83, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DISubroutineType(types: !983)
!983 = !{!103, !870, !741, !984, !102}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !649, line: 72, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !870, !741, !102}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !971, file: !649, line: 104, baseType: !989, size: 32, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !649, line: 79, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DISubroutineType(types: !992)
!992 = !{!103, !870, !741, !697}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !971, file: !649, line: 105, baseType: !994, size: 32, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !649, line: 88, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DISubroutineType(types: !997)
!997 = !{!648, !870, !741}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !971, file: !649, line: 106, baseType: !999, size: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !649, line: 92, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!103, !870, !741, !767}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !971, file: !649, line: 107, baseType: !1004, size: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !649, line: 96, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!103, !870, !741, !102}
!1008 = !{!1009, !1015, !1017, !1027, !1032, !1034, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1064, !1066, !1068, !1070, !1072, !1074, !1076, !1078, !1092, !1094, !1096, !1098, !1100, !1102, !1104, !1106, !1108, !1110, !1112, !1114, !1116, !1118, !1120, !1122, !1124, !839, !1126, !1128, !1141, !1143, !1145, !1147, !1149, !1151, !1153}
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !841, file: !1011, line: 762, type: !1012, isLocal: false, isDefinition: true, align: 16)
!1011 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 96, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 6)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "__device_dts_ord_74", scope: !841, file: !1011, line: 762, type: !871, isLocal: false, isDefinition: true, align: 32)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_74", scope: !841, file: !1011, line: 762, type: !1019, isLocal: true, isDefinition: true, align: 32)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !1021)
!1021 = !{!1022, !1026}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1020, file: !132, line: 60, baseType: !1023, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!103, !870}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1020, file: !132, line: 65, baseType: !870, size: 32, offset: 32)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !841, file: !1011, line: 766, type: !1029, isLocal: false, isDefinition: true, align: 16)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 80, elements: !1030)
!1030 = !{!1031}
!1031 = !DISubrange(count: 5)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(name: "__device_dts_ord_67", scope: !841, file: !1011, line: 766, type: !871, isLocal: false, isDefinition: true, align: 32)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_67", scope: !841, file: !1011, line: 766, type: !1019, isLocal: true, isDefinition: true, align: 32)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !841, file: !1011, line: 770, type: !1012, isLocal: false, isDefinition: true, align: 16)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !841, file: !1011, line: 770, type: !871, isLocal: false, isDefinition: true, align: 32)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !841, file: !1011, line: 770, type: !1019, isLocal: true, isDefinition: true, align: 32)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !841, file: !1011, line: 774, type: !1029, isLocal: false, isDefinition: true, align: 16)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "__device_dts_ord_68", scope: !841, file: !1011, line: 774, type: !871, isLocal: false, isDefinition: true, align: 32)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_68", scope: !841, file: !1011, line: 774, type: !1019, isLocal: true, isDefinition: true, align: 32)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !841, file: !1011, line: 778, type: !1029, isLocal: false, isDefinition: true, align: 16)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
