; ModuleID = 'build/actinius_icarus_ns/subsys/testsuite/integration/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.ztest_suite_stats = type { i32, i32, i32 }
%struct.ztest_suite_node = type { i8*, i8* ()*, void (i8*)*, void (i8*)*, void (i8*)*, i1 (i8*)*, %struct.ztest_suite_stats* }
%struct.ztest_unit_test_stats = type { i32, i32, i32, i32, i32 }
%struct.ztest_unit_test = type { i8*, i8*, void (i8*)*, i32, %struct.ztest_unit_test_stats* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct.k_spinlock = type { i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "z_ztest_suite_node_stats_framework_tests", scope: !27, file: !111, line: 10, type: !149, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !108, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/testsuite/integration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_NODE", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_STATS", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_ZTEST_UNIT_TEST", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_ZTEST_TEST_RULE", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 68)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 69)
!104 = !DIEnumerator(name: "K_OBJ_LAST", value: 70)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !{!109, !155, !25, !173}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_ztest_test_node_framework_tests", scope: !27, file: !111, line: 10, type: !112, isLocal: true, isDefinition: true, align: 32)
!111 = !DIFile(filename: "zephyr/samples/subsys/testsuite/integration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !115)
!114 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/include/zephyr/ztest_test_new.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !{!116, !121, !127, !133, !136, !139, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 179, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !113, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_setup_t", file: !114, line: 141, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!106}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !113, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_before_t", file: !114, line: 148, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !106}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !113, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_after_t", file: !114, line: 155, baseType: !130)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !113, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_teardown_t", file: !114, line: 162, baseType: !130)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !113, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_predicate_t", file: !114, line: 171, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !13}
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !113, file: !114, line: 197, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !150)
!150 = !{!151, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !149, file: !114, line: 116, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !149, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !149, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "z_ztest_unit_test__framework_tests__test_assert", scope: !27, file: !111, line: 18, type: !157, isLocal: true, isDefinition: true, align: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test", file: !114, line: 97, size: 160, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "test_suite_name", scope: !157, file: !114, line: 98, baseType: !118, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !114, line: 99, baseType: !118, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !157, file: !114, line: 100, baseType: !130, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "thread_options", scope: !157, file: !114, line: 101, baseType: !152, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !157, file: !114, line: 104, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test_stats", file: !114, line: 123, size: 160, elements: !167)
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !166, file: !114, line: 125, baseType: !152, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !166, file: !114, line: 127, baseType: !152, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !166, file: !114, line: 129, baseType: !152, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pass_count", scope: !166, file: !114, line: 131, baseType: !152, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "duration_worst_ms", scope: !166, file: !114, line: 133, baseType: !152, size: 32, offset: 128)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_ztest_unit_test_stats_framework_tests_test_assert", scope: !27, file: !111, line: 18, type: !166, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !177, file: !200, line: 18, type: !201, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !179, globals: !199, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!179 = !{!22, !106, !24, !180, !182, !184, !185, !107, !187, !188, !190, !192, !193, !194, !197, !118}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 214, baseType: !32)
!186 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !196)
!196 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !198)
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !{!175}
!200 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 17, baseType: !118, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "_char_out", scope: !209, file: !212, line: 54, type: !213, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !211, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!211 = !{!207}
!212 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!107, !107}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !218, file: !275, line: 35, type: !292, isLocal: false, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !220, globals: !272, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!220 = !{!106, !107, !221, !152, !232}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !223, file: !222, line: 167, baseType: !231)
!222 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !222, file: !222, line: 134, type: !224, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !218, retainedNodes: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !152}
!226 = !{!227, !228, !230}
!227 = !DILocalVariable(name: "time_us", arg: 1, scope: !223, file: !222, line: 134, type: !152)
!228 = !DILocalVariable(name: "delay_cycles", scope: !223, file: !222, line: 168, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!230 = !DILocalVariable(name: "cycles", scope: !223, file: !222, line: 171, type: !152)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !234, line: 1928, baseType: !235)
!234 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 1909, size: 11360, elements: !236)
!236 = !{!237, !243, !244, !245, !246, !250, !251, !252, !253, !257, !258, !262, !263, !264, !265, !266, !270, !271}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !235, file: !234, line: 1910, baseType: !238, size: 8192)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 8192, elements: !241)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !152)
!241 = !{!242}
!242 = !DISubrange(count: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !235, file: !234, line: 1911, baseType: !239, size: 32, offset: 8192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !235, file: !234, line: 1912, baseType: !239, size: 32, offset: 8224)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !235, file: !234, line: 1913, baseType: !239, size: 32, offset: 8256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !235, file: !234, line: 1914, baseType: !247, size: 1984, offset: 8288)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 1984, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 62)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !235, file: !234, line: 1915, baseType: !240, size: 32, offset: 10272)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !235, file: !234, line: 1916, baseType: !239, size: 32, offset: 10304)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !235, file: !234, line: 1917, baseType: !240, size: 32, offset: 10336)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !235, file: !234, line: 1918, baseType: !254, size: 96, offset: 10368)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 96, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 3)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !235, file: !234, line: 1919, baseType: !240, size: 32, offset: 10464)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !235, file: !234, line: 1920, baseType: !259, size: 256, offset: 10496)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 256, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !235, file: !234, line: 1921, baseType: !240, size: 32, offset: 10752)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !235, file: !234, line: 1922, baseType: !239, size: 32, offset: 10784)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !235, file: !234, line: 1923, baseType: !240, size: 32, offset: 10816)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !235, file: !234, line: 1924, baseType: !240, size: 32, offset: 10848)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !235, file: !234, line: 1925, baseType: !267, size: 416, offset: 10880)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 416, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 13)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !235, file: !234, line: 1926, baseType: !240, size: 32, offset: 11296)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !235, file: !234, line: 1927, baseType: !240, size: 32, offset: 11328)
!272 = !{!216, !273, !288}
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !218, file: !275, line: 65, type: !276, isLocal: true, isDefinition: true, align: 32)
!275 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !278, line: 51, size: 64, elements: !279)
!278 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !{!280, !287}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !277, file: !278, line: 60, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DISubroutineType(types: !283)
!283 = !{!107, !284}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !278, line: 48, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !277, file: !278, line: 65, baseType: !284, size: 32, offset: 32)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !223, file: !222, line: 161, type: !290, isLocal: true, isDefinition: true, align: 128)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 48, elements: !255)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !203, line: 17, baseType: !118, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !293, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !299, file: !338, line: 22, type: !371, isLocal: false, isDefinition: true)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !301, retainedTypes: !313, globals: !335, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!301 = !{!302, !30}
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !303, line: 27, baseType: !32, size: 32, elements: !304)
!303 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312}
!305 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!306 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!307 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!308 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!309 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!310 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!311 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!312 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!313 = !{!106, !314, !107, !24, !317, !193, !152, !333}
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !315, line: 46, baseType: !316)
!315 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !191)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !319, line: 54, size: 96, elements: !320)
!319 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = !{!321, !328, !332}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !318, file: !319, line: 55, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !323, line: 33, baseType: !324)
!323 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !323, line: 29, size: 32, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !323, line: 30, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !318, file: !319, line: 60, baseType: !329, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !302}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !318, file: !319, line: 65, baseType: !329, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !334)
!334 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!335 = !{!297, !336, !344, !350, !352, !361, !363}
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !299, file: !338, line: 27, type: !339, isLocal: true, isDefinition: true)
!338 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 32, elements: !342)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !341, line: 22, baseType: !189)
!341 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = !{!343}
!343 = !DISubrange(count: 1)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !299, file: !338, line: 44, type: !346, isLocal: true, isDefinition: true)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !347, line: 43, size: 32, elements: !348)
!347 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !346, file: !347, line: 52, baseType: !22, size: 32)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !299, file: !338, line: 49, type: !346, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !299, file: !338, line: 36, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 128, elements: !342)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !303, line: 114, size: 128, elements: !356)
!356 = !{!357, !358, !359, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !355, file: !303, line: 115, baseType: !302, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !355, file: !303, line: 141, baseType: !195, size: 8, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !355, file: !303, line: 149, baseType: !152, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !355, file: !303, line: 156, baseType: !152, size: 32, offset: 96)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !299, file: !338, line: 40, type: !354, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !299, file: !338, line: 28, type: !365, isLocal: true, isDefinition: true)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !323, line: 40, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !323, line: 35, size: 64, elements: !367)
!367 = !{!368, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !366, file: !323, line: 36, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !366, file: !323, line: 37, baseType: !369, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !203, line: 17, baseType: !118, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !372, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!376 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!377 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !380, file: !409, line: 50, type: !396, isLocal: true, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !301, retainedTypes: !382, globals: !406, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!382 = !{!383, !314, !185, !107, !106, !152, !333, !385, !193, !396, !397}
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !384)
!384 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !387, line: 45, size: 64, elements: !388)
!387 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !{!389, !395}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !386, file: !387, line: 46, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !323, line: 33, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !323, line: 29, size: 32, elements: !392)
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !391, file: !323, line: 30, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !386, file: !387, line: 48, baseType: !152, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !387, line: 38, size: 64, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !398, file: !387, line: 39, baseType: !390, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !398, file: !387, line: 41, baseType: !402, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !387, line: 35, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !396}
!406 = !{!407, !413, !421, !378, !423, !433}
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "latency_lock", scope: !380, file: !409, line: 44, type: !410, isLocal: true, isDefinition: true)
!409 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !347, line: 43, size: 32, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !410, file: !347, line: 52, baseType: !22, size: 32)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !380, file: !409, line: 46, type: !415, isLocal: true, isDefinition: true)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !323, line: 40, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !323, line: 35, size: 64, elements: !417)
!417 = !{!418, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !416, file: !323, line: 36, baseType: !419, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !416, file: !323, line: 37, baseType: !419, size: 32, offset: 32)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "latency_subs", scope: !380, file: !409, line: 52, type: !415, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !380, file: !409, line: 39, type: !425, isLocal: true, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, elements: !431)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 35, size: 96, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !426, file: !409, line: 36, baseType: !302, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !426, file: !409, line: 37, baseType: !195, size: 8, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !426, file: !409, line: 38, baseType: !340, size: 32, offset: 64)
!431 = !{!432}
!432 = !DISubrange(count: 0)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !380, file: !409, line: 48, type: !396, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !437, file: !444, line: 47, type: !458, isLocal: true, isDefinition: true)
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !439, retainedTypes: !440, globals: !441, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!439 = !{!302}
!440 = !{!185, !107}
!441 = !{!442, !435, !454}
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "cpus_states", scope: !437, file: !444, line: 50, type: !445, isLocal: true, isDefinition: true)
!444 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 32, elements: !342)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !303, line: 114, size: 128, elements: !449)
!449 = !{!450, !451, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !448, file: !303, line: 115, baseType: !302, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !448, file: !303, line: 141, baseType: !195, size: 8, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !448, file: !303, line: 149, baseType: !152, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !448, file: !303, line: 156, baseType: !152, size: 32, offset: 96)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !437, file: !444, line: 55, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 8, elements: !342)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, elements: !431)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !461, file: !468, line: 17, type: !610, isLocal: false, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !463, globals: !464, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!463 = !{!185, !107, !152, !106}
!464 = !{!459, !465, !606}
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !467, file: !468, line: 198, type: !593, isLocal: true, isDefinition: true)
!467 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !468, file: !468, line: 175, type: !469, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !461, retainedNodes: !590)
!468 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = !DISubroutineType(types: !470)
!470 = !{null, !471}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !473, line: 245, size: 1280, elements: !474)
!473 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!474 = !{!475, !540, !553, !554, !555, !559, !560, !566, !585}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !472, file: !473, line: 247, baseType: !476, size: 384)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !473, line: 57, size: 384, elements: !477)
!477 = !{!478, !506, !514, !515, !516, !527, !528, !529}
!478 = !DIDerivedType(tag: DW_TAG_member, scope: !476, file: !473, line: 60, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !476, file: !473, line: 60, size: 64, elements: !480)
!480 = !{!481, !497}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !479, file: !473, line: 61, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !483, line: 49, baseType: !484)
!483 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !483, line: 37, size: 64, elements: !485)
!485 = !{!486, !492}
!486 = !DIDerivedType(tag: DW_TAG_member, scope: !484, file: !483, line: 38, baseType: !487, size: 32)
!487 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !484, file: !483, line: 38, size: 32, elements: !488)
!488 = !{!489, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !487, file: !483, line: 39, baseType: !490, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !487, file: !483, line: 40, baseType: !490, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, scope: !484, file: !483, line: 42, baseType: !493, size: 32, offset: 32)
!493 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !484, file: !483, line: 42, size: 32, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !493, file: !483, line: 43, baseType: !490, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !493, file: !483, line: 44, baseType: !490, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !479, file: !473, line: 62, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !499, line: 49, size: 64, elements: !500)
!499 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !498, file: !499, line: 50, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 64, elements: !504)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!504 = !{!505}
!505 = !DISubrange(count: 2)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !476, file: !473, line: 68, baseType: !507, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !509, line: 233, baseType: !510)
!509 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 231, size: 64, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !510, file: !509, line: 232, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !483, line: 48, baseType: !484)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !476, file: !473, line: 71, baseType: !195, size: 8, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !476, file: !473, line: 74, baseType: !195, size: 8, offset: 104)
!516 = !DIDerivedType(tag: DW_TAG_member, scope: !476, file: !473, line: 90, baseType: !517, size: 16, offset: 112)
!517 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !476, file: !473, line: 90, size: 16, elements: !518)
!518 = !{!519, !526}
!519 = !DIDerivedType(tag: DW_TAG_member, scope: !517, file: !473, line: 91, baseType: !520, size: 16)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !517, file: !473, line: 91, size: 16, elements: !521)
!521 = !{!522, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !520, file: !473, line: 96, baseType: !523, size: 8)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !524)
!524 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !520, file: !473, line: 97, baseType: !195, size: 8, offset: 8)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !517, file: !473, line: 100, baseType: !197, size: 16)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !476, file: !473, line: 107, baseType: !152, size: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !476, file: !473, line: 127, baseType: !106, size: 32, offset: 160)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !476, file: !473, line: 131, baseType: !530, size: 192, offset: 192)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !509, line: 244, size: 192, elements: !531)
!531 = !{!532, !533, !539}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !530, file: !509, line: 245, baseType: !482, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !530, file: !509, line: 246, baseType: !534, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !509, line: 242, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !530, file: !509, line: 249, baseType: !316, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !472, file: !473, line: 250, baseType: !541, size: 288, offset: 384)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !542, line: 25, size: 288, elements: !543)
!542 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !541, file: !542, line: 26, baseType: !152, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !541, file: !542, line: 27, baseType: !152, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !541, file: !542, line: 28, baseType: !152, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !541, file: !542, line: 29, baseType: !152, size: 32, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !541, file: !542, line: 30, baseType: !152, size: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !541, file: !542, line: 31, baseType: !152, size: 32, offset: 160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !541, file: !542, line: 32, baseType: !152, size: 32, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !541, file: !542, line: 33, baseType: !152, size: 32, offset: 224)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !541, file: !542, line: 34, baseType: !152, size: 32, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !472, file: !473, line: 253, baseType: !106, size: 32, offset: 672)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !472, file: !473, line: 256, baseType: !508, size: 64, offset: 704)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !472, file: !473, line: 279, baseType: !556, size: 256, offset: 768)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !472, file: !473, line: 294, baseType: !107, size: 32, offset: 1024)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !472, file: !473, line: 300, baseType: !561, size: 96, offset: 1056)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !473, line: 149, size: 96, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !561, file: !473, line: 153, baseType: !22, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !561, file: !473, line: 162, baseType: !185, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !561, file: !473, line: 168, baseType: !185, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !472, file: !473, line: 325, baseType: !567, size: 32, offset: 1152)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !569, line: 5073, size: 192, elements: !570)
!569 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = !{!571, !580, !581}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !568, file: !569, line: 5074, baseType: !572, size: 96)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !573, line: 56, size: 96, elements: !574)
!573 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!574 = !{!575, !578, !579}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !572, file: !573, line: 57, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !573, line: 57, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !572, file: !573, line: 58, baseType: !106, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !572, file: !573, line: 59, baseType: !185, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !568, file: !569, line: 5075, baseType: !508, size: 64, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !568, file: !569, line: 5076, baseType: !582, size: 32, offset: 160)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !347, line: 43, size: 32, elements: !583)
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !582, file: !347, line: 52, baseType: !22, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !472, file: !473, line: 343, baseType: !586, size: 64, offset: 1184)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !542, line: 60, size: 64, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !586, file: !542, line: 63, baseType: !152, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !586, file: !542, line: 66, baseType: !152, size: 32, offset: 32)
!590 = !{!591, !592}
!591 = !DILocalVariable(name: "thread", arg: 1, scope: !467, file: !468, line: 175, type: !471)
!592 = !DILocalVariable(name: "region_num", scope: !467, file: !468, line: 200, type: !195)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, elements: !431)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !595, line: 52, size: 96, elements: !596)
!595 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!596 = !{!597, !598, !599}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !594, file: !595, line: 53, baseType: !22, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !594, file: !595, line: 54, baseType: !185, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !594, file: !595, line: 55, baseType: !600, size: 32, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !601, line: 304, baseType: !602)
!601 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 301, size: 32, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !602, file: !601, line: 302, baseType: !197, size: 16)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !602, file: !601, line: 303, baseType: !197, size: 16, offset: 16)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "static_regions", scope: !461, file: !468, line: 62, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 96, elements: !342)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !203, line: 17, baseType: !118, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !611, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !617, file: !671, line: 39, type: !195, isLocal: true, isDefinition: true)
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !619, globals: !662, splitDebugInlining: false, nameTableKind: None)
!618 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!619 = !{!620, !106, !107, !648}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !622, line: 1495, baseType: !623)
!622 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !622, line: 1474, size: 448, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !638}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !623, file: !622, line: 1476, baseType: !239, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !623, file: !622, line: 1477, baseType: !240, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !623, file: !622, line: 1478, baseType: !240, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !623, file: !622, line: 1479, baseType: !240, size: 32, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !623, file: !622, line: 1480, baseType: !240, size: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !623, file: !622, line: 1481, baseType: !240, size: 32, offset: 160)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !623, file: !622, line: 1482, baseType: !240, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !623, file: !622, line: 1483, baseType: !240, size: 32, offset: 224)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !623, file: !622, line: 1484, baseType: !240, size: 32, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !623, file: !622, line: 1485, baseType: !240, size: 32, offset: 288)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !623, file: !622, line: 1486, baseType: !240, size: 32, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !623, file: !622, line: 1487, baseType: !637, size: 32, offset: 352)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 32, elements: !342)
!638 = !DIDerivedType(tag: DW_TAG_member, scope: !623, file: !622, line: 1488, baseType: !639, size: 64, offset: 384)
!639 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !623, file: !622, line: 1488, size: 64, elements: !640)
!640 = !{!641, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !639, file: !622, line: 1489, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 64, elements: !504)
!643 = !DIDerivedType(tag: DW_TAG_member, scope: !639, file: !622, line: 1490, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !639, file: !622, line: 1490, size: 64, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !644, file: !622, line: 1491, baseType: !240, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !644, file: !622, line: 1492, baseType: !240, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !651, line: 27, size: 128, elements: !652)
!651 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !650, file: !651, line: 29, baseType: !152, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !650, file: !651, line: 31, baseType: !118, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !650, file: !651, line: 37, baseType: !656, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !601, line: 298, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !601, line: 289, size: 64, elements: !658)
!658 = !{!659, !660, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !657, file: !601, line: 291, baseType: !195, size: 5, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !657, file: !601, line: 293, baseType: !195, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !657, file: !601, line: 295, baseType: !152, size: 32, offset: 32)
!662 = !{!615, !663}
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !617, file: !665, line: 31, type: !666, isLocal: true, isDefinition: true)
!665 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 160, elements: !342)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !665, line: 21, size: 160, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !667, file: !665, line: 22, baseType: !107, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !667, file: !665, line: 23, baseType: !650, size: 128, offset: 32)
!671 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !674, file: !681, line: 21, type: !213, isLocal: true, isDefinition: true)
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !676, globals: !680, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!676 = !{!677, !107, !106}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !679, line: 22, baseType: !107)
!679 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!680 = !{!672}
!681 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !684, file: !689, line: 13, type: !708, isLocal: true, isDefinition: true)
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !686, splitDebugInlining: false, nameTableKind: None)
!685 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!686 = !{!687, !682}
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "mpu_config", scope: !684, file: !689, line: 37, type: !690, isLocal: false, isDefinition: true)
!689 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !651, line: 41, size: 64, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !691, file: !651, line: 43, baseType: !152, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !691, file: !651, line: 45, baseType: !695, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !651, line: 27, size: 128, elements: !698)
!698 = !{!699, !700, !701}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !697, file: !651, line: 29, baseType: !152, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !697, file: !651, line: 31, baseType: !118, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !697, file: !651, line: 37, baseType: !702, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !601, line: 298, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !601, line: 289, size: 64, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !703, file: !601, line: 291, baseType: !195, size: 5, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !703, file: !601, line: 293, baseType: !195, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !703, file: !601, line: 295, baseType: !152, size: 32, offset: 32)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 256, elements: !504)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "log_const_board_control", scope: !711, file: !813, line: 12, type: !822, isLocal: false, isDefinition: true)
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !713, retainedTypes: !725, globals: !810, splitDebugInlining: false, nameTableKind: None)
!712 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!713 = !{!714, !720}
!714 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !715, line: 506, baseType: !32, size: 32, elements: !716)
!715 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!716 = !{!717, !718, !719}
!717 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!718 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!719 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!720 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !715, line: 512, baseType: !32, size: 32, elements: !721)
!721 = !{!722, !723, !724}
!722 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!723 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!724 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!725 = !{!726, !799, !804, !765, !720, !714, !809, !106}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !715, line: 523, size: 288, elements: !729)
!729 = !{!730, !755, !761, !766, !770, !771, !772, !776, !795}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !728, file: !715, line: 524, baseType: !731, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 32)
!732 = !DISubroutineType(types: !733)
!733 = !{!107, !734, !753, !754}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !737, line: 378, size: 192, elements: !738)
!737 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!738 = !{!739, !740, !741, !742, !748, !749}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !736, file: !737, line: 380, baseType: !118, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !736, file: !737, line: 382, baseType: !13, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !736, file: !737, line: 384, baseType: !13, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !736, file: !737, line: 386, baseType: !743, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !737, line: 351, size: 16, elements: !745)
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !744, file: !737, line: 359, baseType: !195, size: 8)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !744, file: !737, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !736, file: !737, line: 388, baseType: !106, size: 32, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !736, file: !737, line: 396, baseType: !750, size: 32, offset: 160)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !737, line: 43, baseType: !383)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !715, line: 237, baseType: !195)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !715, line: 257, baseType: !152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !728, file: !715, line: 530, baseType: !756, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!757 = !DISubroutineType(types: !758)
!758 = !{!107, !734, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !715, line: 229, baseType: !152)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !728, file: !715, line: 532, baseType: !762, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DISubroutineType(types: !764)
!764 = !{!107, !734, !765, !760}
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !715, line: 216, baseType: !152)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !728, file: !715, line: 535, baseType: !767, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = !DISubroutineType(types: !769)
!769 = !{!107, !734, !765}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !728, file: !715, line: 537, baseType: !767, size: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !728, file: !715, line: 539, baseType: !767, size: 32, offset: 160)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !728, file: !715, line: 541, baseType: !773, size: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DISubroutineType(types: !775)
!775 = !{!107, !734, !753, !714, !720}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !728, file: !715, line: 544, baseType: !777, size: 32, offset: 224)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DISubroutineType(types: !779)
!779 = !{!107, !734, !780, !145}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !715, line: 478, size: 96, elements: !782)
!782 = !{!783, !789, !794}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !781, file: !715, line: 482, baseType: !784, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !323, line: 33, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !323, line: 29, size: 32, elements: !786)
!786 = !{!787}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !785, file: !323, line: 30, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !781, file: !715, line: 485, baseType: !790, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !715, line: 464, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !734, !780, !765}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !781, file: !715, line: 493, baseType: !765, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !728, file: !715, line: 547, baseType: !796, size: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DISubroutineType(types: !798)
!798 = !{!152, !734}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !715, line: 428, size: 32, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !801, file: !715, line: 434, baseType: !765, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !715, line: 441, size: 32, elements: !807)
!807 = !{!808}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !806, file: !715, line: 447, baseType: !765, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!810 = !{!709, !811}
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_init", scope: !711, file: !813, line: 86, type: !814, isLocal: true, isDefinition: true, align: 32)
!813 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !278, line: 51, size: 64, elements: !816)
!816 = !{!817, !821}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !815, file: !278, line: 60, baseType: !818, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DISubroutineType(types: !820)
!820 = !{!107, !734}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !815, file: !278, line: 65, baseType: !734, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !823, file: !203, line: 17, baseType: !118, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !823, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "phase", scope: !829, file: !833, line: 61, type: !832, isLocal: false, isDefinition: true)
!829 = distinct !DICompileUnit(language: DW_LANG_C99, file: !830, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !831, retainedTypes: !858, globals: !864, splitDebugInlining: false, nameTableKind: None)
!830 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!831 = !{!832, !841, !849, !30, !854}
!832 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_phase", file: !833, line: 40, baseType: !32, size: 32, elements: !834)
!833 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!834 = !{!835, !836, !837, !838, !839, !840}
!835 = !DIEnumerator(name: "TEST_PHASE_SETUP", value: 0)
!836 = !DIEnumerator(name: "TEST_PHASE_BEFORE", value: 1)
!837 = !DIEnumerator(name: "TEST_PHASE_TEST", value: 2)
!838 = !DIEnumerator(name: "TEST_PHASE_AFTER", value: 3)
!839 = !DIEnumerator(name: "TEST_PHASE_TEARDOWN", value: 4)
!840 = !DIEnumerator(name: "TEST_PHASE_FRAMEWORK", value: 5)
!841 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_result", file: !833, line: 226, baseType: !32, size: 32, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !848}
!843 = !DIEnumerator(name: "ZTEST_RESULT_PENDING", value: 0)
!844 = !DIEnumerator(name: "ZTEST_RESULT_PASS", value: 1)
!845 = !DIEnumerator(name: "ZTEST_RESULT_FAIL", value: 2)
!846 = !DIEnumerator(name: "ZTEST_RESULT_SKIP", value: 3)
!847 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_SKIP", value: 4)
!848 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_FAIL", value: 5)
!849 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_status", file: !833, line: 52, baseType: !32, size: 32, elements: !850)
!850 = !{!851, !852, !853}
!851 = !DIEnumerator(name: "ZTEST_STATUS_OK", value: 0)
!852 = !DIEnumerator(name: "ZTEST_STATUS_HAS_FAILURE", value: 1)
!853 = !DIEnumerator(name: "ZTEST_STATUS_CRITICAL_ERROR", value: 2)
!854 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_expected_result", file: !114, line: 36, baseType: !32, size: 32, elements: !855)
!855 = !{!856, !857}
!856 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_FAIL", value: 0)
!857 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_SKIP", value: 1)
!858 = !{!106, !107, !185, !859, !314, !152, !333}
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !860, line: 46, baseType: !861)
!860 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !106, !106, !106}
!864 = !{!827, !865, !867, !869, !878, !880, !984, !987}
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "test_result", scope: !829, file: !833, line: 234, type: !841, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "current_test_failed_assumption", scope: !829, file: !833, line: 294, type: !145, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "ztest_thread_stack", scope: !829, file: !833, line: 430, type: !871, isLocal: false, isDefinition: true, align: 64)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 8192, elements: !876)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !873, line: 47, size: 8, elements: !874)
!873 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !872, file: !873, line: 48, baseType: !120, size: 8)
!876 = !{!877}
!877 = !DISubrange(count: 1024)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "test_status", scope: !829, file: !833, line: 63, type: !849, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "ztest_thread", scope: !829, file: !833, line: 17, type: !882, isLocal: true, isDefinition: true)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !473, line: 245, size: 1280, elements: !883)
!883 = !{!884, !942, !954, !955, !956, !957, !958, !964, !979}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !882, file: !473, line: 247, baseType: !885, size: 384)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !473, line: 57, size: 384, elements: !886)
!886 = !{!887, !911, !918, !919, !920, !929, !930, !931}
!887 = !DIDerivedType(tag: DW_TAG_member, scope: !885, file: !473, line: 60, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !885, file: !473, line: 60, size: 64, elements: !889)
!889 = !{!890, !905}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !888, file: !473, line: 61, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !483, line: 49, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !483, line: 37, size: 64, elements: !893)
!893 = !{!894, !900}
!894 = !DIDerivedType(tag: DW_TAG_member, scope: !892, file: !483, line: 38, baseType: !895, size: 32)
!895 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !892, file: !483, line: 38, size: 32, elements: !896)
!896 = !{!897, !899}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !895, file: !483, line: 39, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !895, file: !483, line: 40, baseType: !898, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, scope: !892, file: !483, line: 42, baseType: !901, size: 32, offset: 32)
!901 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !892, file: !483, line: 42, size: 32, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !901, file: !483, line: 43, baseType: !898, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !901, file: !483, line: 44, baseType: !898, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !888, file: !473, line: 62, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !499, line: 49, size: 64, elements: !907)
!907 = !{!908}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !906, file: !499, line: 50, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 64, elements: !504)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !885, file: !473, line: 68, baseType: !912, size: 32, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !509, line: 233, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 231, size: 64, elements: !915)
!915 = !{!916}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !914, file: !509, line: 232, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !483, line: 48, baseType: !892)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !885, file: !473, line: 71, baseType: !195, size: 8, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !885, file: !473, line: 74, baseType: !195, size: 8, offset: 104)
!920 = !DIDerivedType(tag: DW_TAG_member, scope: !885, file: !473, line: 90, baseType: !921, size: 16, offset: 112)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !885, file: !473, line: 90, size: 16, elements: !922)
!922 = !{!923, !928}
!923 = !DIDerivedType(tag: DW_TAG_member, scope: !921, file: !473, line: 91, baseType: !924, size: 16)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !921, file: !473, line: 91, size: 16, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !924, file: !473, line: 96, baseType: !523, size: 8)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !924, file: !473, line: 97, baseType: !195, size: 8, offset: 8)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !921, file: !473, line: 100, baseType: !197, size: 16)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !885, file: !473, line: 107, baseType: !152, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !885, file: !473, line: 127, baseType: !106, size: 32, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !885, file: !473, line: 131, baseType: !932, size: 192, offset: 192)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !509, line: 244, size: 192, elements: !933)
!933 = !{!934, !935, !941}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !932, file: !509, line: 245, baseType: !891, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !932, file: !509, line: 246, baseType: !936, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !509, line: 242, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !932, file: !509, line: 249, baseType: !316, size: 64, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !882, file: !473, line: 250, baseType: !943, size: 288, offset: 384)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !542, line: 25, size: 288, elements: !944)
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952, !953}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !943, file: !542, line: 26, baseType: !152, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !943, file: !542, line: 27, baseType: !152, size: 32, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !943, file: !542, line: 28, baseType: !152, size: 32, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !943, file: !542, line: 29, baseType: !152, size: 32, offset: 96)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !943, file: !542, line: 30, baseType: !152, size: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !943, file: !542, line: 31, baseType: !152, size: 32, offset: 160)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !943, file: !542, line: 32, baseType: !152, size: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !943, file: !542, line: 33, baseType: !152, size: 32, offset: 224)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !943, file: !542, line: 34, baseType: !152, size: 32, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !882, file: !473, line: 253, baseType: !106, size: 32, offset: 672)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !882, file: !473, line: 256, baseType: !913, size: 64, offset: 704)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !882, file: !473, line: 279, baseType: !556, size: 256, offset: 768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !882, file: !473, line: 294, baseType: !107, size: 32, offset: 1024)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !882, file: !473, line: 300, baseType: !959, size: 96, offset: 1056)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !473, line: 149, size: 96, elements: !960)
!960 = !{!961, !962, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !959, file: !473, line: 153, baseType: !22, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !959, file: !473, line: 162, baseType: !185, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !959, file: !473, line: 168, baseType: !185, size: 32, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !882, file: !473, line: 325, baseType: !965, size: 32, offset: 1152)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !569, line: 5073, size: 192, elements: !967)
!967 = !{!968, !974, !975}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !966, file: !569, line: 5074, baseType: !969, size: 96)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !573, line: 56, size: 96, elements: !970)
!970 = !{!971, !972, !973}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !969, file: !573, line: 57, baseType: !576, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !969, file: !573, line: 58, baseType: !106, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !969, file: !573, line: 59, baseType: !185, size: 32, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !966, file: !569, line: 5075, baseType: !913, size: 64, offset: 96)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !966, file: !569, line: 5076, baseType: !976, size: 32, offset: 160)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !347, line: 43, size: 32, elements: !977)
!977 = !{!978}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !976, file: !347, line: 52, baseType: !22, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !882, file: !473, line: 343, baseType: !980, size: 64, offset: 1184)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !542, line: 60, size: 64, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !980, file: !542, line: 63, baseType: !152, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !980, file: !542, line: 66, baseType: !152, size: 32, offset: 32)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "tc_start_time", scope: !829, file: !986, line: 95, type: !152, isLocal: true, isDefinition: true)
!986 = !DIFile(filename: "zephyr/subsys/testsuite/include/zephyr/tc_util.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "tc_spend_time", scope: !829, file: !986, line: 96, type: !152, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "ztest_api", scope: !992, file: !995, line: 70, type: !996, isLocal: false, isDefinition: true)
!992 = distinct !DICompileUnit(language: DW_LANG_C99, file: !993, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !994, splitDebugInlining: false, nameTableKind: None)
!993 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/testsuite/integration")
!994 = !{!990}
!995 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_arch_api", file: !114, line: 499, size: 96, elements: !998)
!998 = !{!999, !1000, !1021}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "run_all", scope: !997, file: !114, line: 500, baseType: !16, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "should_suite_run", scope: !997, file: !114, line: 501, baseType: !1001, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!145, !13, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1012, !1013}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1005, file: !114, line: 179, baseType: !117, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1005, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !1005, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !1005, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !1005, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !1005, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1005, file: !114, line: 197, baseType: !1014, size: 32, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !1017)
!1017 = !{!1018, !1019, !1020}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !1016, file: !114, line: 116, baseType: !152, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1016, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !1016, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
