; ModuleID = 'build/adafruit_itsybitsy_m4_express/basic/sys_heap/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, i32, i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.anon.11.12] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.11.12 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam0_dev_cfg = type { %struct.SercomUsart*, i32, i32, i8, i32*, i32, i16, void (%struct.device*)*, %struct.pinctrl_dev_config* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/basic/sys_heap/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/basic/sys_heap")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 149, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/basic/sys_heap")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8768, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 137)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4384, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "heap", scope: !27, file: !107, line: 13, type: !112, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/basic/sys_heap")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "heap_mem", scope: !27, file: !107, line: 12, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !110)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !{!115, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !112, file: !113, line: 57, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !113, line: 57, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !112, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !112, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 214, baseType: !32)
!121 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !127, line: 54, type: !128, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/basic/sys_heap")
!126 = !{!122}
!127 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!103, !103}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "state", scope: !133, file: !134, line: 227, type: !163, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "rand32", scope: !134, file: !134, line: 225, type: !135, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !138, retainedNodes: !162)
!134 = !DIFile(filename: "zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !148, globals: !161, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/basic/sys_heap")
!140 = !{!30, !141}
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !142, line: 54, baseType: !32, size: 32, elements: !143)
!142 = !DIFile(filename: "zephyr/lib/os/heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!145 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!146 = !DIEnumerator(name: "FREE_PREV", value: 2)
!147 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!148 = !{!102, !103, !149, !150, !137, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !142, line: 58, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 58, size: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !155, file: !142, line: 58, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !{!131}
!162 = !{}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !164)
!164 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !167, file: !706, line: 149, type: !707, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !169, globals: !705, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/basic/sys_heap")
!169 = !{!102, !103, !170, !306, !391}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cmcc", file: !172, line: 352, baseType: !173)
!172 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/cmcc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 339, size: 448, elements: !174)
!174 = !{!175, !191, !203, !213, !224, !234, !244, !254, !265, !275, !285, !295}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !173, file: !172, line: 340, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_TYPE_Type", file: !172, line: 57, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 44, size: 32, elements: !180)
!180 = !{!181, !190}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !179, file: !172, line: 55, baseType: !182, size: 32)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !179, file: !172, line: 45, size: 32, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK", scope: !182, file: !172, line: 47, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "RRP", scope: !182, file: !172, line: 49, baseType: !137, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "WAYNUM", scope: !182, file: !172, line: 50, baseType: !137, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "LCKDOWN", scope: !182, file: !172, line: 51, baseType: !137, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZE", scope: !182, file: !172, line: 52, baseType: !137, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "CLSIZE", scope: !182, file: !172, line: 53, baseType: !137, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !179, file: !172, line: 56, baseType: !137, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "CFG", scope: !173, file: !172, line: 341, baseType: !192, size: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CFG_Type", file: !172, line: 124, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 114, size: 32, elements: !195)
!195 = !{!196, !202}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !194, file: !172, line: 122, baseType: !197, size: 32)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !194, file: !172, line: 115, size: 32, elements: !198)
!198 = !{!199, !200, !201}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ICDIS", scope: !197, file: !172, line: 117, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "DCDIS", scope: !197, file: !172, line: 118, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZESW", scope: !197, file: !172, line: 120, baseType: !137, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !194, file: !172, line: 123, baseType: !137, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !173, file: !172, line: 342, baseType: !204, size: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CTRL_Type", file: !172, line: 161, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 155, size: 32, elements: !207)
!207 = !{!208, !212}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !206, file: !172, line: 159, baseType: !209, size: 32)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !206, file: !172, line: 156, size: 32, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !209, file: !172, line: 157, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !206, file: !172, line: 160, baseType: !137, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !173, file: !172, line: 343, baseType: !214, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_SR_Type", file: !172, line: 179, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 173, size: 32, elements: !218)
!218 = !{!219, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !217, file: !172, line: 177, baseType: !220, size: 32)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !172, line: 174, size: 32, elements: !221)
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "CSTS", scope: !220, file: !172, line: 175, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !217, file: !172, line: 178, baseType: !137, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !173, file: !172, line: 344, baseType: !225, size: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_LCKWAY_Type", file: !172, line: 197, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 191, size: 32, elements: !228)
!228 = !{!229, !233}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !227, file: !172, line: 195, baseType: !230, size: 32)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !227, file: !172, line: 192, size: 32, elements: !231)
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !230, file: !172, line: 193, baseType: !137, size: 4, flags: DIFlagBitField, extraData: i64 0)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !227, file: !172, line: 196, baseType: !137, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !173, file: !172, line: 345, baseType: !235, size: 96, offset: 160)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 96, elements: !242)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !237, line: 53, baseType: !238)
!237 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/samd51g19a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !241)
!241 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!242 = !{!243}
!243 = !DISubrange(count: 12)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT0", scope: !173, file: !172, line: 346, baseType: !245, size: 32, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT0_Type", file: !172, line: 216, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 210, size: 32, elements: !248)
!248 = !{!249, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !247, file: !172, line: 214, baseType: !250, size: 32)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !247, file: !172, line: 211, size: 32, elements: !251)
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "INVALL", scope: !250, file: !172, line: 212, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !247, file: !172, line: 215, baseType: !137, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT1", scope: !173, file: !172, line: 347, baseType: !255, size: 32, offset: 288)
!255 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT1_Type", file: !172, line: 236, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 228, size: 32, elements: !258)
!258 = !{!259, !264}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !257, file: !172, line: 234, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !172, line: 229, size: 32, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "INDEX", scope: !260, file: !172, line: 231, baseType: !137, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "WAY", scope: !260, file: !172, line: 233, baseType: !137, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !257, file: !172, line: 235, baseType: !137, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "MCFG", scope: !173, file: !172, line: 348, baseType: !266, size: 32, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCFG_Type", file: !172, line: 266, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 260, size: 32, elements: !269)
!269 = !{!270, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !268, file: !172, line: 264, baseType: !271, size: 32)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !172, line: 261, size: 32, elements: !272)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !271, file: !172, line: 262, baseType: !137, size: 2, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !268, file: !172, line: 265, baseType: !137, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "MEN", scope: !173, file: !172, line: 349, baseType: !276, size: 32, offset: 352)
!276 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MEN_Type", file: !172, line: 291, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 285, size: 32, elements: !279)
!279 = !{!280, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !278, file: !172, line: 289, baseType: !281, size: 32)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !278, file: !172, line: 286, size: 32, elements: !282)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "MENABLE", scope: !281, file: !172, line: 287, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !278, file: !172, line: 290, baseType: !137, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "MCTRL", scope: !173, file: !172, line: 350, baseType: !286, size: 32, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCTRL_Type", file: !172, line: 309, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 303, size: 32, elements: !289)
!289 = !{!290, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !288, file: !172, line: 307, baseType: !291, size: 32)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !288, file: !172, line: 304, size: 32, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !291, file: !172, line: 305, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !288, file: !172, line: 308, baseType: !137, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !173, file: !172, line: 351, baseType: !296, size: 32, offset: 416)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MSR_Type", file: !172, line: 326, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 321, size: 32, elements: !300)
!300 = !{!301, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !299, file: !172, line: 324, baseType: !302, size: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !172, line: 322, size: 32, elements: !303)
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "EVENT_CNT", scope: !302, file: !172, line: 323, baseType: !137, size: 32, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !299, file: !172, line: 325, baseType: !137, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !308, line: 267, baseType: !309)
!308 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !308, line: 259, size: 2560, elements: !310)
!310 = !{!311, !321, !325, !352, !356, !374, !378}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !309, file: !308, line: 260, baseType: !312, size: 8)
!312 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRLA_Type", file: !308, line: 50, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !308, line: 44, size: 8, elements: !315)
!315 = !{!316, !320}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !314, file: !308, line: 48, baseType: !317, size: 8)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !314, file: !308, line: 45, size: 8, elements: !318)
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !317, file: !308, line: 46, baseType: !240, size: 1, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !314, file: !308, line: 49, baseType: !240, size: 8)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !309, file: !308, line: 261, baseType: !322, size: 24, offset: 8)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 24, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 3)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !309, file: !308, line: 262, baseType: !326, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_SYNCBUSY_Type", file: !308, line: 86, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !308, line: 62, size: 32, elements: !330)
!330 = !{!331, !347, !351}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !329, file: !308, line: 79, baseType: !332, size: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !308, line: 63, size: 32, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !332, file: !308, line: 64, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL0", scope: !332, file: !308, line: 66, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL1", scope: !332, file: !308, line: 67, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL2", scope: !332, file: !308, line: 68, baseType: !137, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL3", scope: !332, file: !308, line: 69, baseType: !137, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL4", scope: !332, file: !308, line: 70, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL5", scope: !332, file: !308, line: 71, baseType: !137, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL6", scope: !332, file: !308, line: 72, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL7", scope: !332, file: !308, line: 73, baseType: !137, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL8", scope: !332, file: !308, line: 74, baseType: !137, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL9", scope: !332, file: !308, line: 75, baseType: !137, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL10", scope: !332, file: !308, line: 76, baseType: !137, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL11", scope: !332, file: !308, line: 77, baseType: !137, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !329, file: !308, line: 84, baseType: !348, size: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !308, line: 80, size: 32, elements: !349)
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !348, file: !308, line: 82, baseType: !137, size: 12, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !329, file: !308, line: 85, baseType: !137, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !309, file: !308, line: 263, baseType: !353, size: 192, offset: 64)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 192, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 24)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !309, file: !308, line: 264, baseType: !357, size: 384, offset: 256)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 384, elements: !242)
!358 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !308, line: 163, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !308, line: 149, size: 32, elements: !361)
!361 = !{!362, !373}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !360, file: !308, line: 161, baseType: !363, size: 32)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !360, file: !308, line: 150, size: 32, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !363, file: !308, line: 151, baseType: !137, size: 4, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !363, file: !308, line: 153, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !363, file: !308, line: 154, baseType: !137, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !363, file: !308, line: 155, baseType: !137, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !363, file: !308, line: 156, baseType: !137, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !363, file: !308, line: 157, baseType: !137, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !363, file: !308, line: 158, baseType: !137, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !363, file: !308, line: 160, baseType: !137, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !360, file: !308, line: 162, baseType: !137, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !309, file: !308, line: 265, baseType: !375, size: 384, offset: 640)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 384, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 48)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "PCHCTRL", scope: !309, file: !308, line: 266, baseType: !379, size: 1536, offset: 1024)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 1536, elements: !376)
!380 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_PCHCTRL_Type", file: !308, line: 218, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !308, line: 209, size: 32, elements: !383)
!383 = !{!384, !390}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !382, file: !308, line: 216, baseType: !385, size: 32)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !382, file: !308, line: 210, size: 32, elements: !386)
!386 = !{!387, !388, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !385, file: !308, line: 211, baseType: !137, size: 4, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "CHEN", scope: !385, file: !308, line: 213, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !385, file: !308, line: 214, baseType: !137, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !382, file: !308, line: 217, baseType: !137, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "Oscctrl", file: !393, line: 788, baseType: !394)
!393 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/oscctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 771, size: 704, elements: !395)
!395 = !{!396, !411, !412, !443, !474, !507, !542, !566, !578, !579, !596, !597, !609, !621, !634, !635}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "EVCTRL", scope: !394, file: !393, line: 772, baseType: !397, size: 8)
!397 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_EVCTRL_Type", file: !393, line: 55, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 44, size: 8, elements: !400)
!400 = !{!401, !406, !410}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !399, file: !393, line: 49, baseType: !402, size: 8)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !399, file: !393, line: 45, size: 8, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO0", scope: !402, file: !393, line: 46, baseType: !240, size: 1, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO1", scope: !402, file: !393, line: 47, baseType: !240, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !399, file: !393, line: 53, baseType: !407, size: 8)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !399, file: !393, line: 50, size: 8, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO", scope: !407, file: !393, line: 51, baseType: !240, size: 2, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !399, file: !393, line: 54, baseType: !240, size: 8)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !394, file: !393, line: 773, baseType: !322, size: 24, offset: 8)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !394, file: !393, line: 774, baseType: !413, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENCLR_Type", file: !393, line: 102, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 72, size: 32, elements: !416)
!416 = !{!417, !437, !442}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !415, file: !393, line: 95, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !415, file: !393, line: 73, size: 32, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !418, file: !393, line: 74, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !418, file: !393, line: 75, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !418, file: !393, line: 76, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !418, file: !393, line: 77, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !418, file: !393, line: 79, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !418, file: !393, line: 80, baseType: !137, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !418, file: !393, line: 81, baseType: !137, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !418, file: !393, line: 82, baseType: !137, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !418, file: !393, line: 83, baseType: !137, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !418, file: !393, line: 85, baseType: !137, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !418, file: !393, line: 86, baseType: !137, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !418, file: !393, line: 87, baseType: !137, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !418, file: !393, line: 88, baseType: !137, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !418, file: !393, line: 90, baseType: !137, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !418, file: !393, line: 91, baseType: !137, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !418, file: !393, line: 92, baseType: !137, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !418, file: !393, line: 93, baseType: !137, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !415, file: !393, line: 100, baseType: !438, size: 32)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !415, file: !393, line: 96, size: 32, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !438, file: !393, line: 97, baseType: !137, size: 2, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !438, file: !393, line: 98, baseType: !137, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !415, file: !393, line: 101, baseType: !137, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !394, file: !393, line: 775, baseType: !444, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENSET_Type", file: !393, line: 182, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 152, size: 32, elements: !447)
!447 = !{!448, !468, !473}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !446, file: !393, line: 175, baseType: !449, size: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !446, file: !393, line: 153, size: 32, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !449, file: !393, line: 154, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !449, file: !393, line: 155, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !449, file: !393, line: 156, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !449, file: !393, line: 157, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !449, file: !393, line: 159, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !449, file: !393, line: 160, baseType: !137, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !449, file: !393, line: 161, baseType: !137, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !449, file: !393, line: 162, baseType: !137, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !449, file: !393, line: 163, baseType: !137, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !449, file: !393, line: 165, baseType: !137, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !449, file: !393, line: 166, baseType: !137, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !449, file: !393, line: 167, baseType: !137, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !449, file: !393, line: 168, baseType: !137, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !449, file: !393, line: 170, baseType: !137, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !449, file: !393, line: 171, baseType: !137, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !449, file: !393, line: 172, baseType: !137, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !449, file: !393, line: 173, baseType: !137, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !446, file: !393, line: 180, baseType: !469, size: 32)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !446, file: !393, line: 176, size: 32, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !469, file: !393, line: 177, baseType: !137, size: 2, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !469, file: !393, line: 178, baseType: !137, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !446, file: !393, line: 181, baseType: !137, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !394, file: !393, line: 776, baseType: !475, size: 32, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTFLAG_Type", file: !393, line: 262, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 232, size: 32, elements: !478)
!478 = !{!479, !501, !506}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !477, file: !393, line: 255, baseType: !480, size: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !477, file: !393, line: 233, size: 32, elements: !481)
!481 = !{!482, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !480, file: !393, line: 234, baseType: !483, size: 1, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !480, file: !393, line: 235, baseType: !483, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !480, file: !393, line: 236, baseType: !483, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !480, file: !393, line: 237, baseType: !483, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !480, file: !393, line: 239, baseType: !483, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !480, file: !393, line: 240, baseType: !483, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !480, file: !393, line: 241, baseType: !483, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !480, file: !393, line: 242, baseType: !483, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !480, file: !393, line: 243, baseType: !483, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !480, file: !393, line: 245, baseType: !483, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !480, file: !393, line: 246, baseType: !483, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !480, file: !393, line: 247, baseType: !483, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !480, file: !393, line: 248, baseType: !483, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !480, file: !393, line: 250, baseType: !483, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !480, file: !393, line: 251, baseType: !483, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !480, file: !393, line: 252, baseType: !483, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !480, file: !393, line: 253, baseType: !483, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !477, file: !393, line: 260, baseType: !502, size: 32)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !477, file: !393, line: 256, size: 32, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !502, file: !393, line: 257, baseType: !483, size: 2, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !502, file: !393, line: 258, baseType: !483, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !477, file: !393, line: 261, baseType: !137, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !394, file: !393, line: 777, baseType: !508, size: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_STATUS_Type", file: !393, line: 345, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 312, size: 32, elements: !512)
!512 = !{!513, !535, !541}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !511, file: !393, line: 337, baseType: !514, size: 32)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !511, file: !393, line: 313, size: 32, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !514, file: !393, line: 314, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !514, file: !393, line: 315, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !514, file: !393, line: 316, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !514, file: !393, line: 317, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW0", scope: !514, file: !393, line: 318, baseType: !137, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW1", scope: !514, file: !393, line: 319, baseType: !137, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !514, file: !393, line: 321, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !514, file: !393, line: 322, baseType: !137, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !514, file: !393, line: 323, baseType: !137, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !514, file: !393, line: 324, baseType: !137, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !514, file: !393, line: 325, baseType: !137, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !514, file: !393, line: 327, baseType: !137, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !514, file: !393, line: 328, baseType: !137, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0TO", scope: !514, file: !393, line: 329, baseType: !137, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !514, file: !393, line: 330, baseType: !137, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !514, file: !393, line: 332, baseType: !137, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !514, file: !393, line: 333, baseType: !137, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1TO", scope: !514, file: !393, line: 334, baseType: !137, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !514, file: !393, line: 335, baseType: !137, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !511, file: !393, line: 343, baseType: !536, size: 32)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !511, file: !393, line: 338, size: 32, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !536, file: !393, line: 339, baseType: !137, size: 2, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !536, file: !393, line: 340, baseType: !137, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW", scope: !536, file: !393, line: 341, baseType: !137, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !511, file: !393, line: 344, baseType: !137, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCTRL", scope: !394, file: !393, line: 778, baseType: !543, size: 64, offset: 160)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 64, elements: !564)
!544 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_XOSCCTRL_Type", file: !393, line: 422, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 402, size: 32, elements: !547)
!547 = !{!548, !563}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !546, file: !393, line: 420, baseType: !549, size: 32)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !546, file: !393, line: 403, size: 32, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !549, file: !393, line: 405, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !549, file: !393, line: 406, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !549, file: !393, line: 408, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !549, file: !393, line: 409, baseType: !137, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "LOWBUFGAIN", scope: !549, file: !393, line: 410, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "IPTAT", scope: !549, file: !393, line: 411, baseType: !137, size: 2, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "IMULT", scope: !549, file: !393, line: 412, baseType: !137, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ENALC", scope: !549, file: !393, line: 413, baseType: !137, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEN", scope: !549, file: !393, line: 414, baseType: !137, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "SWBEN", scope: !549, file: !393, line: 415, baseType: !137, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !549, file: !393, line: 417, baseType: !137, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "CFDPRESC", scope: !549, file: !393, line: 418, baseType: !137, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !546, file: !393, line: 421, baseType: !137, size: 32)
!564 = !{!565}
!565 = !DISubrange(count: 2)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLA", scope: !394, file: !393, line: 779, baseType: !567, size: 8, offset: 224)
!567 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLA_Type", file: !393, line: 469, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 460, size: 8, elements: !570)
!570 = !{!571, !577}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !569, file: !393, line: 467, baseType: !572, size: 8)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !569, file: !393, line: 461, size: 8, elements: !573)
!573 = !{!574, !575, !576}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !572, file: !393, line: 463, baseType: !240, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !572, file: !393, line: 465, baseType: !240, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !572, file: !393, line: 466, baseType: !240, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !569, file: !393, line: 468, baseType: !240, size: 8)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !394, file: !393, line: 780, baseType: !322, size: 24, offset: 232)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !394, file: !393, line: 781, baseType: !580, size: 8, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLB_Type", file: !393, line: 497, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 485, size: 8, elements: !583)
!583 = !{!584, !595}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !582, file: !393, line: 495, baseType: !585, size: 8)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !582, file: !393, line: 486, size: 8, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !585, file: !393, line: 487, baseType: !240, size: 1, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !585, file: !393, line: 488, baseType: !240, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !585, file: !393, line: 489, baseType: !240, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !585, file: !393, line: 490, baseType: !240, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !585, file: !393, line: 491, baseType: !240, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !585, file: !393, line: 492, baseType: !240, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !585, file: !393, line: 493, baseType: !240, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !585, file: !393, line: 494, baseType: !240, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !582, file: !393, line: 496, baseType: !240, size: 8)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !394, file: !393, line: 782, baseType: !322, size: 24, offset: 264)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !394, file: !393, line: 783, baseType: !598, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLVAL_Type", file: !393, line: 531, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 523, size: 32, elements: !601)
!601 = !{!602, !608}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !600, file: !393, line: 529, baseType: !603, size: 32)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !600, file: !393, line: 524, size: 32, elements: !604)
!604 = !{!605, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !603, file: !393, line: 525, baseType: !137, size: 8, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !603, file: !393, line: 527, baseType: !137, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !603, file: !393, line: 528, baseType: !137, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !600, file: !393, line: 530, baseType: !137, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !394, file: !393, line: 784, baseType: !610, size: 32, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLMUL_Type", file: !393, line: 558, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 550, size: 32, elements: !613)
!613 = !{!614, !620}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !612, file: !393, line: 556, baseType: !615, size: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !612, file: !393, line: 551, size: 32, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !615, file: !393, line: 552, baseType: !137, size: 16, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !615, file: !393, line: 553, baseType: !137, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !615, file: !393, line: 555, baseType: !137, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !612, file: !393, line: 557, baseType: !137, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !394, file: !393, line: 785, baseType: !622, size: 8, offset: 352)
!622 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLSYNC_Type", file: !393, line: 587, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 577, size: 8, elements: !625)
!625 = !{!626, !633}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !624, file: !393, line: 585, baseType: !627, size: 8)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !624, file: !393, line: 578, size: 8, elements: !628)
!628 = !{!629, !630, !631, !632}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !627, file: !393, line: 580, baseType: !240, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !627, file: !393, line: 581, baseType: !240, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !627, file: !393, line: 582, baseType: !240, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !627, file: !393, line: 583, baseType: !240, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !624, file: !393, line: 586, baseType: !240, size: 8)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !394, file: !393, line: 786, baseType: !322, size: 24, offset: 360)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Dpll", scope: !394, file: !393, line: 787, baseType: !636, size: 320, offset: 384)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 320, elements: !564)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "OscctrlDpll", file: !393, line: 766, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 759, size: 160, elements: !639)
!639 = !{!640, !652, !653, !664, !681, !693}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !638, file: !393, line: 760, baseType: !641, size: 8)
!641 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLA_Type", file: !393, line: 614, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 605, size: 8, elements: !644)
!644 = !{!645, !651}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !643, file: !393, line: 612, baseType: !646, size: 8)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !643, file: !393, line: 606, size: 8, elements: !647)
!647 = !{!648, !649, !650}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !646, file: !393, line: 608, baseType: !240, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !646, file: !393, line: 610, baseType: !240, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !646, file: !393, line: 611, baseType: !240, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !643, file: !393, line: 613, baseType: !240, size: 8)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !638, file: !393, line: 761, baseType: !322, size: 24, offset: 8)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !638, file: !393, line: 762, baseType: !654, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLRATIO_Type", file: !393, line: 638, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 630, size: 32, elements: !657)
!657 = !{!658, !663}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !656, file: !393, line: 636, baseType: !659, size: 32)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !656, file: !393, line: 631, size: 32, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !659, file: !393, line: 632, baseType: !137, size: 13, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !659, file: !393, line: 634, baseType: !137, size: 5, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !656, file: !393, line: 637, baseType: !137, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !638, file: !393, line: 763, baseType: !665, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLB_Type", file: !393, line: 667, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 654, size: 32, elements: !668)
!668 = !{!669, !680}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !667, file: !393, line: 665, baseType: !670, size: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !667, file: !393, line: 655, size: 32, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !670, file: !393, line: 656, baseType: !137, size: 4, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !670, file: !393, line: 657, baseType: !137, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !670, file: !393, line: 658, baseType: !137, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !670, file: !393, line: 659, baseType: !137, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !670, file: !393, line: 660, baseType: !137, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "DCOFILTER", scope: !670, file: !393, line: 661, baseType: !137, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "DCOEN", scope: !670, file: !393, line: 662, baseType: !137, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !670, file: !393, line: 663, baseType: !137, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !667, file: !393, line: 666, baseType: !137, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSYNCBUSY", scope: !638, file: !393, line: 764, baseType: !682, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSYNCBUSY_Type", file: !393, line: 724, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 716, size: 32, elements: !686)
!686 = !{!687, !692}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !685, file: !393, line: 722, baseType: !688, size: 32)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !685, file: !393, line: 717, size: 32, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !688, file: !393, line: 719, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !688, file: !393, line: 720, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !685, file: !393, line: 723, baseType: !137, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !638, file: !393, line: 765, baseType: !694, size: 32, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSTATUS_Type", file: !393, line: 745, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !393, line: 738, size: 32, elements: !698)
!698 = !{!699, !704}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !697, file: !393, line: 743, baseType: !700, size: 32)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !697, file: !393, line: 739, size: 32, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !700, file: !393, line: 740, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !700, file: !393, line: 741, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !697, file: !393, line: 744, baseType: !137, size: 32)
!705 = !{!165}
!706 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !709, line: 51, size: 64, elements: !710)
!709 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!710 = !{!711, !739}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !708, file: !709, line: 60, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DISubroutineType(types: !714)
!714 = !{!103, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !718, line: 378, size: 192, elements: !719)
!718 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!719 = !{!720, !723, !724, !725, !732, !733}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !718, line: 380, baseType: !721, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !717, file: !718, line: 382, baseType: !13, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !717, file: !718, line: 384, baseType: !13, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !717, file: !718, line: 386, baseType: !726, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !718, line: 351, size: 16, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !727, file: !718, line: 359, baseType: !240, size: 8)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !727, file: !718, line: 364, baseType: !731, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!731 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !717, file: !718, line: 388, baseType: !102, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !717, file: !718, line: 396, baseType: !734, size: 32, offset: 160)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !718, line: 43, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !738)
!738 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !708, file: !709, line: 65, baseType: !715, size: 32, offset: 32)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "static_regions", scope: !742, file: !749, line: 62, type: !880, isLocal: true, isDefinition: true)
!742 = distinct !DICompileUnit(language: DW_LANG_C99, file: !743, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !744, globals: !745, splitDebugInlining: false, nameTableKind: None)
!743 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/basic/sys_heap")
!744 = !{!120, !103, !137, !102}
!745 = !{!746, !740}
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !748, file: !749, line: 198, type: !866, isLocal: true, isDefinition: true)
!748 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !749, file: !749, line: 175, type: !750, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !742, retainedNodes: !863)
!749 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!750 = !DISubroutineType(types: !751)
!751 = !{null, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !754, line: 245, size: 1024, elements: !755)
!754 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!755 = !{!756, !821, !834, !835, !836, !837, !843, !858}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !753, file: !754, line: 247, baseType: !757, size: 384)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !754, line: 57, size: 384, elements: !758)
!758 = !{!759, !785, !793, !794, !795, !806, !807, !808}
!759 = !DIDerivedType(tag: DW_TAG_member, scope: !757, file: !754, line: 60, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !757, file: !754, line: 60, size: 64, elements: !761)
!761 = !{!762, !778}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !760, file: !754, line: 61, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !764, line: 49, baseType: !765)
!764 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !764, line: 37, size: 64, elements: !766)
!766 = !{!767, !773}
!767 = !DIDerivedType(tag: DW_TAG_member, scope: !765, file: !764, line: 38, baseType: !768, size: 32)
!768 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !765, file: !764, line: 38, size: 32, elements: !769)
!769 = !{!770, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !768, file: !764, line: 39, baseType: !771, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !768, file: !764, line: 40, baseType: !771, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, scope: !765, file: !764, line: 42, baseType: !774, size: 32, offset: 32)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !765, file: !764, line: 42, size: 32, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !774, file: !764, line: 43, baseType: !771, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !774, file: !764, line: 44, baseType: !771, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !760, file: !754, line: 62, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !780, line: 49, size: 64, elements: !781)
!780 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!781 = !{!782}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !779, file: !780, line: 50, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 64, elements: !564)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !757, file: !754, line: 68, baseType: !786, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !788, line: 233, baseType: !789)
!788 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 231, size: 64, elements: !790)
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !789, file: !788, line: 232, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !764, line: 48, baseType: !765)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !757, file: !754, line: 71, baseType: !240, size: 8, offset: 96)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !757, file: !754, line: 74, baseType: !240, size: 8, offset: 104)
!795 = !DIDerivedType(tag: DW_TAG_member, scope: !757, file: !754, line: 90, baseType: !796, size: 16, offset: 112)
!796 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !757, file: !754, line: 90, size: 16, elements: !797)
!797 = !{!798, !805}
!798 = !DIDerivedType(tag: DW_TAG_member, scope: !796, file: !754, line: 91, baseType: !799, size: 16)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !796, file: !754, line: 91, size: 16, elements: !800)
!800 = !{!801, !804}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !799, file: !754, line: 96, baseType: !802, size: 8)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !803)
!803 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !799, file: !754, line: 97, baseType: !240, size: 8, offset: 8)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !796, file: !754, line: 100, baseType: !151, size: 16)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !757, file: !754, line: 107, baseType: !137, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !757, file: !754, line: 127, baseType: !102, size: 32, offset: 160)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !757, file: !754, line: 131, baseType: !809, size: 192, offset: 192)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !788, line: 244, size: 192, elements: !810)
!810 = !{!811, !812, !818}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !809, file: !788, line: 245, baseType: !763, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !809, file: !788, line: 246, baseType: !813, size: 32, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !788, line: 242, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !817}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !809, file: !788, line: 249, baseType: !819, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !820)
!820 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !753, file: !754, line: 250, baseType: !822, size: 288, offset: 384)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !823, line: 25, size: 288, elements: !824)
!823 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !822, file: !823, line: 26, baseType: !137, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !822, file: !823, line: 27, baseType: !137, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !822, file: !823, line: 28, baseType: !137, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !822, file: !823, line: 29, baseType: !137, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !822, file: !823, line: 30, baseType: !137, size: 32, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !822, file: !823, line: 31, baseType: !137, size: 32, offset: 160)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !822, file: !823, line: 32, baseType: !137, size: 32, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !822, file: !823, line: 33, baseType: !137, size: 32, offset: 224)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !822, file: !823, line: 34, baseType: !137, size: 32, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !753, file: !754, line: 253, baseType: !102, size: 32, offset: 672)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !753, file: !754, line: 256, baseType: !787, size: 64, offset: 704)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !753, file: !754, line: 294, baseType: !103, size: 32, offset: 768)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !753, file: !754, line: 300, baseType: !838, size: 96, offset: 800)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !754, line: 149, size: 96, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !838, file: !754, line: 153, baseType: !22, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !838, file: !754, line: 162, baseType: !120, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !838, file: !754, line: 168, baseType: !120, size: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !753, file: !754, line: 325, baseType: !844, size: 32, offset: 896)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !846, line: 5073, size: 160, elements: !847)
!846 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!847 = !{!848, !854, !855}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !845, file: !846, line: 5074, baseType: !849, size: 96)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !850)
!850 = !{!851, !852, !853}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !849, file: !113, line: 57, baseType: !116, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !849, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !849, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !845, file: !846, line: 5075, baseType: !787, size: 64, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !845, file: !846, line: 5076, baseType: !856, offset: 160)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !857, line: 43, elements: !162)
!857 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!858 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !753, file: !754, line: 343, baseType: !859, size: 64, offset: 928)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !823, line: 60, size: 64, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !859, file: !823, line: 63, baseType: !137, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !859, file: !823, line: 66, baseType: !137, size: 32, offset: 32)
!863 = !{!864, !865}
!864 = !DILocalVariable(name: "thread", arg: 1, scope: !748, file: !749, line: 175, type: !752)
!865 = !DILocalVariable(name: "region_num", scope: !748, file: !749, line: 200, type: !240)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, elements: !878)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !868, line: 52, size: 96, elements: !869)
!868 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!869 = !{!870, !871, !872}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !867, file: !868, line: 53, baseType: !22, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !867, file: !868, line: 54, baseType: !120, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !867, file: !868, line: 55, baseType: !873, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !874, line: 151, baseType: !875)
!874 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !874, line: 149, size: 32, elements: !876)
!876 = !{!877}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !875, file: !874, line: 150, baseType: !137, size: 32)
!878 = !{!879}
!879 = !DISubrange(count: 0)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 96, elements: !882)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!882 = !{!883}
!883 = !DISubrange(count: 1)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !886, file: !918, line: 39, type: !240, isLocal: true, isDefinition: true)
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !888, globals: !917, splitDebugInlining: false, nameTableKind: None)
!887 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/basic/sys_heap")
!888 = !{!889, !102, !103, !905, !240}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !891, line: 1226, baseType: !892)
!891 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !891, line: 1213, size: 352, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !892, file: !891, line: 1215, baseType: !483, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !892, file: !891, line: 1216, baseType: !484, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !892, file: !891, line: 1217, baseType: !484, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !892, file: !891, line: 1218, baseType: !484, size: 32, offset: 96)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !892, file: !891, line: 1219, baseType: !484, size: 32, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !892, file: !891, line: 1220, baseType: !484, size: 32, offset: 160)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !892, file: !891, line: 1221, baseType: !484, size: 32, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !892, file: !891, line: 1222, baseType: !484, size: 32, offset: 224)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !892, file: !891, line: 1223, baseType: !484, size: 32, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !892, file: !891, line: 1224, baseType: !484, size: 32, offset: 288)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !892, file: !891, line: 1225, baseType: !484, size: 32, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !908, line: 27, size: 96, elements: !909)
!908 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !907, file: !908, line: 29, baseType: !137, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !907, file: !908, line: 31, baseType: !721, size: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !907, file: !908, line: 37, baseType: !913, size: 32, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !874, line: 146, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !874, line: 141, size: 32, elements: !915)
!915 = !{!916}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !914, file: !874, line: 143, baseType: !137, size: 32)
!917 = !{!884}
!918 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
