; ModuleID = 'build/96b_carbon_nrf51/echo_bot/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "uart_msgq", scope: !27, file: !209, line: 19, type: !223, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !206, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !111, line: 336, size: 608, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !145, !149, !153, !167, !172, !178, !184, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !110, file: !111, line: 365, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DISubroutineType(types: !116)
!116 = !{!107, !117, !144}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !121)
!120 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = !{!122, !126, !127, !128, !137, !138}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 380, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !119, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !119, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !119, file: !120, line: 386, baseType: !129, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !131)
!131 = !{!132, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !130, file: !120, line: 359, baseType: !133, size: 8)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !130, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !119, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !120, line: 43, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !143)
!143 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !110, file: !111, line: 366, baseType: !146, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !117, !134}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !110, file: !111, line: 374, baseType: !150, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DISubroutineType(types: !152)
!152 = !{!107, !117}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !110, file: !111, line: 377, baseType: !154, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DISubroutineType(types: !156)
!156 = !{!107, !117, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !111, line: 122, size: 64, elements: !160)
!160 = !{!161, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !159, file: !111, line: 123, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !159, file: !111, line: 124, baseType: !133, size: 8, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !159, file: !111, line: 125, baseType: !133, size: 8, offset: 40)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !159, file: !111, line: 126, baseType: !133, size: 8, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !159, file: !111, line: 127, baseType: !133, size: 8, offset: 56)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !110, file: !111, line: 379, baseType: !168, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{!107, !117, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !110, file: !111, line: 384, baseType: !173, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{!107, !117, !176, !107}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !110, file: !111, line: 393, baseType: !179, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!107, !117, !182, !183}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !110, file: !111, line: 402, baseType: !185, size: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !117}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !110, file: !111, line: 405, baseType: !185, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !110, file: !111, line: 408, baseType: !150, size: 32, offset: 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !110, file: !111, line: 411, baseType: !185, size: 32, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !110, file: !111, line: 414, baseType: !185, size: 32, offset: 352)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !110, file: !111, line: 417, baseType: !150, size: 32, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !110, file: !111, line: 420, baseType: !150, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !110, file: !111, line: 423, baseType: !185, size: 32, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !110, file: !111, line: 426, baseType: !185, size: 32, offset: 480)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !110, file: !111, line: 429, baseType: !150, size: 32, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !110, file: !111, line: 432, baseType: !150, size: 32, offset: 544)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !110, file: !111, line: 435, baseType: !199, size: 32, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !117, !202, !102}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !111, line: 142, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !117, !102}
!206 = !{!25, !207, !211, !216, !221}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "uart_dev", scope: !27, file: !209, line: 21, type: !210, isLocal: true, isDefinition: true)
!209 = !DIFile(filename: "zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "_k_fifo_buf_uart_msgq", scope: !27, file: !209, line: 19, type: !213, isLocal: true, isDefinition: true, align: 32)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 2560, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 320)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "rx_buf", scope: !27, file: !209, line: 24, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 256, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 32)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "rx_buf_pos", scope: !27, file: !209, line: 25, type: !107, isLocal: true, isDefinition: true)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !224, line: 4204, size: 320, elements: !225)
!224 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = !{!226, !247, !251, !254, !255, !257, !258, !259, !260, !261}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !223, file: !224, line: 4206, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !228, line: 233, baseType: !229)
!228 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 231, size: 64, elements: !230)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !229, file: !228, line: 232, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !233, line: 48, baseType: !234)
!233 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !233, line: 37, size: 64, elements: !235)
!235 = !{!236, !242}
!236 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 38, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 38, size: 32, elements: !238)
!238 = !{!239, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !237, file: !233, line: 39, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !233, line: 40, baseType: !240, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 42, baseType: !243, size: 32, offset: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 42, size: 32, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !243, file: !233, line: 43, baseType: !240, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !233, line: 44, baseType: !240, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !223, file: !224, line: 4208, baseType: !248, offset: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !223, file: !224, line: 4210, baseType: !252, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !253, line: 214, baseType: !32)
!253 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !223, file: !224, line: 4212, baseType: !162, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !223, file: !224, line: 4214, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !223, file: !224, line: 4216, baseType: !256, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !223, file: !224, line: 4218, baseType: !256, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !223, file: !224, line: 4220, baseType: !256, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !223, file: !224, line: 4222, baseType: !162, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !224, line: 4227, baseType: !133, size: 8, offset: 288)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "_char_out", scope: !264, file: !268, line: 54, type: !269, isLocal: false, isDefinition: true)
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !266, globals: !267, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!266 = !{!102, !107}
!267 = !{!262}
!268 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!107, !107}
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !274, file: !310, line: 27, type: !335, isLocal: true, isDefinition: true)
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !276, retainedTypes: !288, globals: !307, splitDebugInlining: false, nameTableKind: None)
!275 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!276 = !{!277, !30}
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !278, line: 27, baseType: !32, size: 32, elements: !279)
!278 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287}
!280 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!281 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!282 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!283 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!284 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!285 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!286 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!287 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!288 = !{!102, !103, !107, !24, !289, !256, !162, !305}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !291, line: 54, size: 96, elements: !292)
!291 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = !{!293, !300, !304}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !290, file: !291, line: 55, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !295, line: 33, baseType: !296)
!295 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !295, line: 29, size: 32, elements: !297)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !295, line: 30, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !290, file: !291, line: 60, baseType: !301, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !277}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !290, file: !291, line: 65, baseType: !301, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !306)
!306 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!307 = !{!272, !308, !312, !314, !325, !327}
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !274, file: !310, line: 44, type: !311, isLocal: true, isDefinition: true)
!310 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !274, file: !310, line: 49, type: !311, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !274, file: !310, line: 36, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 128, elements: !323)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !278, line: 114, size: 128, elements: !318)
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !317, file: !278, line: 115, baseType: !277, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !317, file: !278, line: 141, baseType: !133, size: 8, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !317, file: !278, line: 149, baseType: !162, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !317, file: !278, line: 156, baseType: !162, size: 32, offset: 96)
!323 = !{!324}
!324 = !DISubrange(count: 1)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !274, file: !310, line: 40, type: !316, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !274, file: !310, line: 28, type: !329, isLocal: true, isDefinition: true)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !295, line: 40, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !295, line: 35, size: 64, elements: !331)
!331 = !{!332, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !330, file: !295, line: 36, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !330, file: !295, line: 37, baseType: !333, size: 32, offset: 32)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 32, elements: !323)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !337, line: 22, baseType: !338)
!337 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!338 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!339 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!340 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !343, file: !370, line: 50, type: !357, isLocal: true, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !276, retainedTypes: !345, globals: !367, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!345 = !{!142, !103, !252, !107, !102, !162, !305, !346, !256, !357, !358}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !348, line: 45, size: 64, elements: !349)
!348 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350, !356}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !347, file: !348, line: 46, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !295, line: 33, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !295, line: 29, size: 32, elements: !353)
!353 = !{!354}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !352, file: !295, line: 30, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !347, file: !348, line: 48, baseType: !162, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !348, line: 38, size: 64, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !359, file: !348, line: 39, baseType: !351, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !359, file: !348, line: 41, baseType: !363, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !348, line: 35, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !357}
!367 = !{!368, !372, !380, !341, !382, !392}
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "latency_lock", scope: !343, file: !370, line: 44, type: !371, isLocal: true, isDefinition: true)
!370 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !343, file: !370, line: 46, type: !374, isLocal: true, isDefinition: true)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !295, line: 40, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !295, line: 35, size: 64, elements: !376)
!376 = !{!377, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !375, file: !295, line: 36, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !375, file: !295, line: 37, baseType: !378, size: 32, offset: 32)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "latency_subs", scope: !343, file: !370, line: 52, type: !374, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !343, file: !370, line: 39, type: !384, isLocal: true, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, elements: !390)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 35, size: 96, elements: !386)
!386 = !{!387, !388, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !385, file: !370, line: 36, baseType: !277, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !385, file: !370, line: 37, baseType: !133, size: 8, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !385, file: !370, line: 38, baseType: !336, size: 32, offset: 64)
!390 = !{!391}
!391 = !DISubrange(count: 0)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !343, file: !370, line: 48, type: !357, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !396, file: !403, line: 47, type: !416, isLocal: true, isDefinition: true)
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !398, retainedTypes: !399, globals: !400, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!398 = !{!277}
!399 = !{!252, !107}
!400 = !{!401, !394, !413}
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "cpus_states", scope: !396, file: !403, line: 50, type: !404, isLocal: true, isDefinition: true)
!403 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 32, elements: !323)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !278, line: 114, size: 128, elements: !408)
!408 = !{!409, !410, !411, !412}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !407, file: !278, line: 115, baseType: !277, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !407, file: !278, line: 141, baseType: !133, size: 8, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !407, file: !278, line: 149, baseType: !162, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !407, file: !278, line: 156, baseType: !162, size: 32, offset: 96)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !396, file: !403, line: 55, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 8, elements: !323)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, elements: !390)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !419, file: !426, line: 21, type: !269, isLocal: true, isDefinition: true)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !421, globals: !425, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!421 = !{!422, !107, !102}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !424, line: 22, baseType: !107)
!424 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!425 = !{!417}
!426 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !429, file: !534, line: 71, type: !535, isLocal: true, isDefinition: true, align: 32)
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !431, globals: !527, splitDebugInlining: false, nameTableKind: None)
!430 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!431 = !{!432, !133, !102, !107, !500, !501, !516, !162}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !434, line: 247, baseType: !435)
!434 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 216, size: 20576, elements: !436)
!436 = !{!437, !443, !444, !445, !449, !450, !454, !455, !456, !460, !461, !465, !466, !470, !471, !475, !476, !480, !481, !482, !483, !487, !488, !489, !490, !494, !495, !499}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !435, file: !434, line: 217, baseType: !438, size: 960)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 960, elements: !441)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !162)
!441 = !{!442}
!442 = !DISubrange(count: 30)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !435, file: !434, line: 218, baseType: !440, size: 32, offset: 960)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !435, file: !434, line: 219, baseType: !440, size: 32, offset: 992)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !435, file: !434, line: 220, baseType: !446, size: 1088, offset: 1024)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 1088, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 34)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !435, file: !434, line: 221, baseType: !440, size: 32, offset: 2112)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !435, file: !434, line: 222, baseType: !451, size: 4032, offset: 2144)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 4032, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 126)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !435, file: !434, line: 223, baseType: !440, size: 32, offset: 6176)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !435, file: !434, line: 224, baseType: !440, size: 32, offset: 6208)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !435, file: !434, line: 225, baseType: !457, size: 1952, offset: 6240)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 1952, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 61)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !435, file: !434, line: 226, baseType: !440, size: 32, offset: 8192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !435, file: !434, line: 227, baseType: !462, size: 288, offset: 8224)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 288, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 9)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !435, file: !434, line: 228, baseType: !439, size: 32, offset: 8512)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !435, file: !434, line: 229, baseType: !467, size: 1696, offset: 8544)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 1696, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 53)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !435, file: !434, line: 230, baseType: !440, size: 32, offset: 10240)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !435, file: !434, line: 231, baseType: !472, size: 96, offset: 10272)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 96, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 3)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !435, file: !434, line: 232, baseType: !440, size: 32, offset: 10368)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !435, file: !434, line: 233, baseType: !477, size: 64, offset: 10400)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 64, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 2)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !435, file: !434, line: 234, baseType: !440, size: 32, offset: 10464)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !435, file: !434, line: 236, baseType: !439, size: 32, offset: 10496)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !435, file: !434, line: 237, baseType: !440, size: 32, offset: 10528)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !435, file: !434, line: 238, baseType: !484, size: 224, offset: 10560)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 224, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 7)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !435, file: !434, line: 239, baseType: !440, size: 32, offset: 10784)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !435, file: !434, line: 241, baseType: !472, size: 96, offset: 10816)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !435, file: !434, line: 242, baseType: !440, size: 32, offset: 10912)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !435, file: !434, line: 243, baseType: !491, size: 256, offset: 10944)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 256, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 8)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !435, file: !434, line: 244, baseType: !440, size: 32, offset: 11200)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !435, file: !434, line: 245, baseType: !496, size: 9312, offset: 11232)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 9312, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 291)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !435, file: !434, line: 246, baseType: !440, size: 32, offset: 20544)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !503, line: 352, baseType: !504)
!503 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 341, size: 320, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !515}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !504, file: !503, line: 343, baseType: !439, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !504, file: !503, line: 344, baseType: !440, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !504, file: !503, line: 345, baseType: !162, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !504, file: !503, line: 346, baseType: !440, size: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !504, file: !503, line: 347, baseType: !440, size: 32, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !504, file: !503, line: 348, baseType: !440, size: 32, offset: 160)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !504, file: !503, line: 349, baseType: !162, size: 32, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !504, file: !503, line: 350, baseType: !514, size: 64, offset: 224)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 64, elements: !478)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !504, file: !503, line: 351, baseType: !440, size: 32, offset: 288)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !518, file: !517, line: 167, baseType: !526)
!517 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !517, file: !517, line: 134, type: !519, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !429, retainedNodes: !521)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !162}
!521 = !{!522, !523, !525}
!522 = !DILocalVariable(name: "time_us", arg: 1, scope: !518, file: !517, line: 134, type: !162)
!523 = !DILocalVariable(name: "delay_cycles", scope: !518, file: !517, line: 168, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!525 = !DILocalVariable(name: "cycles", scope: !518, file: !517, line: 171, type: !162)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!527 = !{!427, !528}
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !518, file: !517, line: 161, type: !530, isLocal: true, isDefinition: true, align: 128)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 48, elements: !473)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !533)
!533 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!534 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !537, line: 51, size: 64, elements: !538)
!537 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!538 = !{!539, !546}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !536, file: !537, line: 60, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DISubroutineType(types: !542)
!542 = !{!107, !543}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !537, line: 48, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !536, file: !537, line: 65, baseType: !543, size: 32, offset: 32)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !549, file: !746, line: 733, type: !847, isLocal: false, isDefinition: true, align: 32)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !551, retainedTypes: !666, globals: !742, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!551 = !{!552, !558, !30, !563, !568, !573, !579, !585, !594, !598, !631, !638, !657}
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !553, line: 23, baseType: !32, size: 32, elements: !554)
!553 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!554 = !{!555, !556, !557}
!555 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!556 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!557 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!558 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !553, line: 48, baseType: !32, size: 32, elements: !559)
!559 = !{!560, !561, !562}
!560 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!561 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!562 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !564, line: 167, baseType: !32, size: 32, elements: !565)
!564 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!565 = !{!566, !567}
!566 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!567 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!568 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !564, line: 107, baseType: !32, size: 32, elements: !569)
!569 = !{!570, !571, !572}
!570 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!571 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!572 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!573 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !564, line: 208, baseType: !32, size: 32, elements: !574)
!574 = !{!575, !576, !577, !578}
!575 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!576 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!577 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!578 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !564, line: 261, baseType: !32, size: 32, elements: !580)
!580 = !{!581, !582, !583, !584}
!581 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!582 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!583 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!584 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!585 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !564, line: 237, baseType: !32, size: 32, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593}
!587 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!588 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!589 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!590 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!591 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!592 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!593 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !564, line: 152, baseType: !32, size: 32, elements: !595)
!595 = !{!596, !597}
!596 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!597 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!598 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !434, line: 71, baseType: !107, size: 32, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!600 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!601 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!602 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!603 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!604 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!605 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!606 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!607 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!608 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!609 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!610 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!611 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!612 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!613 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!614 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!615 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!616 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!617 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!618 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!619 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!620 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!621 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!622 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!623 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!624 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!625 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!626 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!627 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!628 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!629 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!630 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!631 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !632, line: 44, baseType: !32, size: 32, elements: !633)
!632 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!633 = !{!634, !635, !636, !637}
!634 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!635 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!636 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!637 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!638 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !639, line: 54, baseType: !32, size: 32, elements: !640)
!639 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!641 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!642 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!643 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!644 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!645 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!646 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!647 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!648 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!649 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!650 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!651 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!652 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!653 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!654 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!655 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!656 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !658, line: 53, baseType: !32, size: 32, elements: !659)
!658 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!659 = !{!660, !661, !662, !663, !664, !665}
!660 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!661 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!662 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!663 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!664 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!665 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!666 = !{!552, !102, !107, !667, !715, !716, !717, !718, !103, !162, !305, !136, !500, !182, !357, !719, !741, !252}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !434, line: 291, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 260, size: 10912, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !682, !683, !684, !685, !686, !687, !691, !692, !693, !697, !698, !699, !700, !701, !702, !703, !707, !708, !709, !710, !714}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !669, file: !434, line: 261, baseType: !440, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !669, file: !434, line: 262, baseType: !440, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !669, file: !434, line: 263, baseType: !440, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !669, file: !434, line: 264, baseType: !440, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !669, file: !434, line: 265, baseType: !440, size: 32, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !669, file: !434, line: 266, baseType: !440, size: 32, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !669, file: !434, line: 267, baseType: !440, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !669, file: !434, line: 268, baseType: !679, size: 1824, offset: 224)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 1824, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 57)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !669, file: !434, line: 269, baseType: !440, size: 32, offset: 2048)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !669, file: !434, line: 270, baseType: !440, size: 32, offset: 2080)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !669, file: !434, line: 271, baseType: !439, size: 32, offset: 2112)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !669, file: !434, line: 272, baseType: !440, size: 32, offset: 2144)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !669, file: !434, line: 273, baseType: !440, size: 32, offset: 2176)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !669, file: !434, line: 274, baseType: !688, size: 3968, offset: 2208)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 3968, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 124)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !669, file: !434, line: 275, baseType: !440, size: 32, offset: 6176)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !669, file: !434, line: 276, baseType: !440, size: 32, offset: 6208)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !669, file: !434, line: 277, baseType: !694, size: 2016, offset: 6240)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 2016, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 63)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !669, file: !434, line: 278, baseType: !439, size: 32, offset: 8256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !669, file: !434, line: 279, baseType: !439, size: 32, offset: 8288)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !669, file: !434, line: 280, baseType: !439, size: 32, offset: 8320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !669, file: !434, line: 281, baseType: !439, size: 32, offset: 8352)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !669, file: !434, line: 282, baseType: !439, size: 32, offset: 8384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !669, file: !434, line: 283, baseType: !439, size: 32, offset: 8416)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !669, file: !434, line: 285, baseType: !704, size: 1984, offset: 8448)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 1984, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 62)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !669, file: !434, line: 286, baseType: !440, size: 32, offset: 10432)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !669, file: !434, line: 287, baseType: !484, size: 224, offset: 10464)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !669, file: !434, line: 288, baseType: !440, size: 32, offset: 10688)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !669, file: !434, line: 289, baseType: !711, size: 160, offset: 10720)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 160, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 5)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "XTALFREQ", scope: !669, file: !434, line: 290, baseType: !440, size: 32, offset: 10880)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !564, line: 146, baseType: !568)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !564, line: 164, baseType: !594)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !503, line: 326, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 314, size: 6400, elements: !722)
!722 = !{!723, !725, !729, !730, !731, !732, !733, !734, !735, !739}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !721, file: !503, line: 316, baseType: !724, size: 32)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 32, elements: !323)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !721, file: !503, line: 317, baseType: !726, size: 992, offset: 32)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 992, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 31)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !721, file: !503, line: 318, baseType: !724, size: 32, offset: 1024)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !721, file: !503, line: 319, baseType: !726, size: 992, offset: 1056)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !721, file: !503, line: 320, baseType: !724, size: 32, offset: 2048)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !721, file: !503, line: 321, baseType: !726, size: 992, offset: 2080)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !721, file: !503, line: 322, baseType: !724, size: 32, offset: 3072)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !721, file: !503, line: 323, baseType: !726, size: 992, offset: 3104)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !721, file: !503, line: 324, baseType: !736, size: 2048, offset: 4096)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 2048, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !721, file: !503, line: 325, baseType: !740, size: 256, offset: 6144)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 256, elements: !492)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !632, line: 56, baseType: !102)
!742 = !{!743, !793, !834, !547, !837, !862, !864, !881, !883, !893, !896, !911, !949, !963}
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "on", scope: !745, file: !746, line: 549, type: !336, isLocal: true, isDefinition: true)
!745 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !746, file: !746, line: 547, type: !747, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !549, retainedNodes: !749)
!746 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!747 = !DISubroutineType(types: !748)
!748 = !{null, !558}
!749 = !{!750, !751, !754}
!750 = !DILocalVariable(name: "start_mode", arg: 1, scope: !745, file: !746, line: 547, type: !558)
!751 = !DILocalVariable(name: "err", scope: !752, file: !746, line: 553, type: !107)
!752 = distinct !DILexicalBlock(scope: !753, file: !746, line: 552, column: 31)
!753 = distinct !DILexicalBlock(scope: !745, file: !746, line: 552, column: 6)
!754 = !DILocalVariable(name: "mgr", scope: !752, file: !746, line: 554, type: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !757, line: 154, size: 224, elements: !758)
!757 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!758 = !{!759, !771, !772, !788, !790, !791, !792}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !756, file: !757, line: 158, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !295, line: 40, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !295, line: 35, size: 64, elements: !762)
!762 = !{!763, !770}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !761, file: !295, line: 36, baseType: !764, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !295, line: 33, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !295, line: 29, size: 32, elements: !767)
!767 = !{!768}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !766, file: !295, line: 30, baseType: !769, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !761, file: !295, line: 37, baseType: !764, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !756, file: !757, line: 163, baseType: !760, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !756, file: !757, line: 166, baseType: !773, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !757, line: 133, size: 96, elements: !776)
!776 = !{!777, !786, !787}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !775, file: !757, line: 135, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !757, line: 129, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !755, !782}
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !757, line: 101, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !755, !107}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !775, file: !757, line: 138, baseType: !778, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !775, file: !757, line: 143, baseType: !778, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !756, file: !757, line: 169, baseType: !789, offset: 160)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !756, file: !757, line: 172, baseType: !107, size: 32, offset: 160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !756, file: !757, line: 175, baseType: !532, size: 16, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !756, file: !757, line: 178, baseType: !532, size: 16, offset: 208)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "cli", scope: !745, file: !746, line: 550, type: !795, isLocal: true, isDefinition: true)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !757, line: 273, size: 128, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !795, file: !757, line: 280, baseType: !765, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !795, file: !757, line: 283, baseType: !799, size: 96, offset: 32)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !800, line: 138, size: 96, elements: !801)
!800 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!801 = !{!802, !831, !832}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !799, file: !800, line: 149, baseType: !803, size: 32)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !800, line: 139, size: 32, elements: !804)
!804 = !{!805, !826}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !803, file: !800, line: 145, baseType: !806, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !224, line: 5397, size: 128, elements: !808)
!808 = !{!809, !824, !825}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !807, file: !224, line: 5399, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !233, line: 48, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !233, line: 37, size: 64, elements: !812)
!812 = !{!813, !819}
!813 = !DIDerivedType(tag: DW_TAG_member, scope: !811, file: !233, line: 38, baseType: !814, size: 32)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !811, file: !233, line: 38, size: 32, elements: !815)
!815 = !{!816, !818}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !814, file: !233, line: 39, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !814, file: !233, line: 40, baseType: !817, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, scope: !811, file: !233, line: 42, baseType: !820, size: 32, offset: 32)
!820 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !811, file: !233, line: 42, size: 32, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !820, file: !233, line: 43, baseType: !817, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !820, file: !233, line: 44, baseType: !817, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !807, file: !224, line: 5405, baseType: !32, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !807, file: !224, line: 5408, baseType: !107, size: 32, offset: 96)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !803, file: !800, line: 148, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !800, line: 98, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DISubroutineType(types: !830)
!830 = !{null, null}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !799, file: !800, line: 165, baseType: !440, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !799, file: !800, line: 174, baseType: !833, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !107)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !549, file: !746, line: 733, type: !836, isLocal: false, isDefinition: true, align: 16)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 80, elements: !712)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !549, file: !746, line: 733, type: !839, isLocal: true, isDefinition: true, align: 32)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !537, line: 51, size: 64, elements: !841)
!841 = !{!842, !861}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !840, file: !537, line: 60, baseType: !843, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{!107, !846}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !849)
!849 = !{!850, !851, !852, !853, !859, !860}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !848, file: !120, line: 380, baseType: !123, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !848, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !848, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !848, file: !120, line: 386, baseType: !854, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !855, file: !120, line: 359, baseType: !133, size: 8)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !855, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !848, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !848, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !840, file: !537, line: 65, baseType: !846, size: 32, offset: 32)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !549, file: !746, line: 79, type: !336, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "data", scope: !549, file: !746, line: 702, type: !866, isLocal: true, isDefinition: true)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !746, line: 69, size: 640, elements: !867)
!867 = !{!868, !870}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !866, file: !746, line: 70, baseType: !869, size: 448)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 448, elements: !478)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !866, file: !746, line: 71, baseType: !871, size: 192, offset: 448)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 192, elements: !478)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !746, line: 52, size: 96, elements: !873)
!873 = !{!874, !879, !880}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !872, file: !746, line: 53, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !632, line: 72, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !846, !741, !102}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !872, file: !746, line: 54, baseType: !102, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !872, file: !746, line: 55, baseType: !162, size: 32, offset: 64)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_23", scope: !549, file: !746, line: 733, type: !855, isLocal: true, isDefinition: true, align: 8)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "d", scope: !885, file: !746, line: 476, type: !891, isLocal: true, isDefinition: true)
!885 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !746, file: !746, line: 474, type: !747, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !549, retainedNodes: !886)
!886 = !{!887, !888, !889, !890}
!887 = !DILocalVariable(name: "mode", arg: 1, scope: !885, file: !746, line: 474, type: !558)
!888 = !DILocalVariable(name: "type", scope: !885, file: !746, line: 486, type: !715)
!889 = !DILocalVariable(name: "isr_mode", scope: !885, file: !746, line: 500, type: !136)
!890 = !DILocalVariable(name: "key", scope: !885, file: !746, line: 501, type: !107)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !564, line: 177, baseType: !563)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "target_type", scope: !885, file: !746, line: 477, type: !895, isLocal: true, isDefinition: true)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "config", scope: !549, file: !746, line: 704, type: !898, isLocal: true, isDefinition: true)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !746, line: 74, size: 128, elements: !900)
!900 = !{!901}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !899, file: !746, line: 76, baseType: !902, size: 128)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 128, elements: !478)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !746, line: 61, size: 64, elements: !904)
!904 = !{!905, !910}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !903, file: !746, line: 62, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !746, line: 58, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DISubroutineType(types: !909)
!909 = !{null}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !903, file: !746, line: 63, baseType: !906, size: 32, offset: 32)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !549, file: !746, line: 695, type: !913, isLocal: true, isDefinition: true)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !632, line: 100, size: 224, elements: !915)
!915 = !{!916, !921, !922, !927, !933, !938, !944}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !914, file: !632, line: 101, baseType: !917, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !632, line: 76, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DISubroutineType(types: !920)
!920 = !{!107, !846, !741}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !914, file: !632, line: 102, baseType: !917, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !914, file: !632, line: 103, baseType: !923, size: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !632, line: 83, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 32)
!925 = !DISubroutineType(types: !926)
!926 = !{!107, !846, !741, !875, !102}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !914, file: !632, line: 104, baseType: !928, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !632, line: 79, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DISubroutineType(types: !931)
!931 = !{!107, !846, !741, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !914, file: !632, line: 105, baseType: !934, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !632, line: 88, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DISubroutineType(types: !937)
!937 = !{!631, !846, !741}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !914, file: !632, line: 106, baseType: !939, size: 32, offset: 160)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !632, line: 92, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(types: !942)
!942 = !{!107, !846, !741, !943}
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !632, line: 64, baseType: !102)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !914, file: !632, line: 107, baseType: !945, size: 32, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !632, line: 96, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = !DISubroutineType(types: !948)
!948 = !{!107, !846, !741, !102}
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "transitions", scope: !951, file: !746, line: 655, type: !774, isLocal: true, isDefinition: true)
!951 = distinct !DISubprogram(name: "clk_init", scope: !746, file: !746, line: 651, type: !844, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !549, retainedNodes: !952)
!952 = !{!953, !954, !956, !957, !959}
!953 = !DILocalVariable(name: "dev", arg: 1, scope: !951, file: !746, line: 651, type: !846)
!954 = !DILocalVariable(name: "nrfx_err", scope: !951, file: !746, line: 653, type: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !639, line: 72, baseType: !638)
!956 = !DILocalVariable(name: "err", scope: !951, file: !746, line: 654, type: !107)
!957 = !DILocalVariable(name: "i", scope: !958, file: !746, line: 678, type: !552)
!958 = distinct !DILexicalBlock(scope: !951, file: !746, line: 678, column: 2)
!959 = !DILocalVariable(name: "subdata", scope: !960, file: !746, line: 680, type: !962)
!960 = distinct !DILexicalBlock(scope: !961, file: !746, line: 679, column: 42)
!961 = distinct !DILexicalBlock(scope: !958, file: !746, line: 678, column: 2)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "__isr_nrfx_isr_irq_0", scope: !951, file: !746, line: 660, type: !965, isLocal: true, isDefinition: true, align: 32)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !966)
!966 = !{!967, !968, !969, !970}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !965, file: !10, line: 55, baseType: !357, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !965, file: !10, line: 57, baseType: !357, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !965, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !965, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !973, file: !978, line: 7, type: !979, isLocal: false, isDefinition: true, align: 16)
!973 = distinct !DICompileUnit(language: DW_LANG_C99, file: !974, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !975, splitDebugInlining: false, nameTableKind: None)
!974 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!975 = !{!971, !976, !980}
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !973, file: !978, line: 12, type: !979, isLocal: false, isDefinition: true, align: 16)
!978 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 48, elements: !473)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_49", scope: !973, file: !978, line: 17, type: !979, isLocal: false, isDefinition: true, align: 16)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !984, file: !1069, line: 603, type: !1071, isLocal: true, isDefinition: true, align: 32)
!984 = distinct !DICompileUnit(language: DW_LANG_C99, file: !985, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !986, globals: !1066, splitDebugInlining: false, nameTableKind: None)
!985 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/echo_bot")
!986 = !{!102, !107, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !111, line: 336, size: 608, elements: !990)
!990 = !{!991, !1010, !1014, !1018, !1031, !1036, !1040, !1044, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !989, file: !111, line: 365, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DISubroutineType(types: !994)
!994 = !{!107, !995, !144}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1008, !1009}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !120, line: 380, baseType: !123, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !997, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !997, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !997, file: !120, line: 386, baseType: !1003, size: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1004, file: !120, line: 359, baseType: !133, size: 8)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1004, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !997, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !997, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !989, file: !111, line: 366, baseType: !1011, size: 32, offset: 32)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 32)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{null, !995, !134}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !989, file: !111, line: 374, baseType: !1015, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!107, !995}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !989, file: !111, line: 377, baseType: !1019, size: 32, offset: 96)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!107, !995, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !111, line: 122, size: 64, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1024, file: !111, line: 123, baseType: !162, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1024, file: !111, line: 124, baseType: !133, size: 8, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1024, file: !111, line: 125, baseType: !133, size: 8, offset: 40)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !1024, file: !111, line: 126, baseType: !133, size: 8, offset: 48)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !1024, file: !111, line: 127, baseType: !133, size: 8, offset: 56)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !989, file: !111, line: 379, baseType: !1032, size: 32, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!107, !995, !1035}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !989, file: !111, line: 384, baseType: !1037, size: 32, offset: 160)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 32)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!107, !995, !176, !107}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !989, file: !111, line: 393, baseType: !1041, size: 32, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 32)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!107, !995, !182, !183}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !989, file: !111, line: 402, baseType: !1045, size: 32, offset: 224)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{null, !995}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !989, file: !111, line: 405, baseType: !1045, size: 32, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !989, file: !111, line: 408, baseType: !1015, size: 32, offset: 288)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !989, file: !111, line: 411, baseType: !1045, size: 32, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !989, file: !111, line: 414, baseType: !1045, size: 32, offset: 352)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !989, file: !111, line: 417, baseType: !1015, size: 32, offset: 384)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !989, file: !111, line: 420, baseType: !1015, size: 32, offset: 416)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !989, file: !111, line: 423, baseType: !1045, size: 32, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !989, file: !111, line: 426, baseType: !1045, size: 32, offset: 480)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !989, file: !111, line: 429, baseType: !1015, size: 32, offset: 512)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !989, file: !111, line: 432, baseType: !1015, size: 32, offset: 544)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !989, file: !111, line: 435, baseType: !1059, size: 32, offset: 576)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 32)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{null, !995, !1062, !102}
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !111, line: 142, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 32)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null, !995, !102}
!1066 = !{!982, !1067}
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !984, file: !1069, line: 38, type: !1070, isLocal: true, isDefinition: true)
!1069 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!1071 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !537, line: 51, size: 64, elements: !1073)
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1072, file: !537, line: 60, baseType: !1015, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1072, file: !537, line: 65, baseType: !995, size: 32, offset: 32)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(name: "gpio_nrfx_p0_cfg", scope: !1078, file: !1243, line: 424, type: !1284, isLocal: true, isDefinition: true)
!1078 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1079, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1080, retainedTypes: !1137, globals: !1240, splitDebugInlining: false, nameTableKind: None)
