; ModuleID = 'build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type { i8 }
%struct._thread_arch = type { i32, i32 }
%class.cpp_semaphore = type { %class.semaphore, %struct.k_sem }
%class.semaphore = type { i32 (...)** }
%struct.k_sem = type { %union.anon, i32, i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "coop_thread", scope: !27, file: !45, line: 40, type: !120, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, globals: !105, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/cpp/cpp_synchronization/src/main.cpp", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!29 = !{!30, !34, !40, !42, !44, !48}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !31, line: 46, baseType: !32)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !33)
!33 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !35, line: 46, baseType: !36)
!35 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39, !39, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !43)
!43 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!44 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "cpp_semaphore", file: !45, line: 50, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !46, vtableHolder: !48)
!45 = !DIFile(filename: "zephyr/samples/subsys/cpp/cpp_synchronization/src/main.cpp", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !66, !93, !97, !98, !101, !104}
!47 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !44, baseType: !48, flags: DIFlagPublic, extraData: i32 0)
!48 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "semaphore", file: !45, line: 29, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !49, vtableHolder: !48, identifier: "_ZTS9semaphore")
!49 = !{!50, !56, !60, !63}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$semaphore", scope: !45, file: !45, baseType: !51, size: 32, flags: DIFlagArtificial)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !53, size: 32)
!53 = !DISubroutineType(types: !54)
!54 = !{!55}
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DISubprogram(name: "wait", linkageName: "_ZN9semaphore4waitEv", scope: !48, file: !45, line: 31, type: !57, scopeLine: 31, containingType: !48, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!57 = !DISubroutineType(types: !58)
!58 = !{!55, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!60 = !DISubprogram(name: "wait", linkageName: "_ZN9semaphore4waitEi", scope: !48, file: !45, line: 32, type: !61, scopeLine: 32, containingType: !48, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!61 = !DISubroutineType(types: !62)
!62 = !{!55, !59, !55}
!63 = !DISubprogram(name: "give", linkageName: "_ZN9semaphore4giveEv", scope: !48, file: !45, line: 33, type: !64, scopeLine: 33, containingType: !48, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !59}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_sema_internal", scope: !44, file: !45, line: 52, baseType: !67, size: 128, offset: 32, flags: DIFlagProtected)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !68, line: 2909, size: 128, flags: DIFlagTypePassByValue, elements: !69, identifier: "_ZTS5k_sem")
!68 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!69 = !{!70, !91, !92}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !67, file: !68, line: 2910, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !73)
!72 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, flags: DIFlagTypePassByValue, elements: !74, identifier: "_ZTS9_wait_q_t")
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !73, file: !72, line: 232, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !78)
!77 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, flags: DIFlagTypePassByValue, elements: !79, identifier: "_ZTS6_dnode")
!79 = !{!80, !86}
!80 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 38, baseType: !81, size: 32)
!81 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 38, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !82, identifier: "_ZTSN6_dnodeUt_E")
!82 = !{!83, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !81, file: !77, line: 39, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !77, line: 40, baseType: !84, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 42, baseType: !87, size: 32, offset: 32)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 42, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !88, identifier: "_ZTSN6_dnodeUt0_E")
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !87, file: !77, line: 43, baseType: !84, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !77, line: 44, baseType: !84, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !67, file: !68, line: 2911, baseType: !41, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !67, file: !68, line: 2912, baseType: !41, size: 32, offset: 96)
!93 = !DISubprogram(name: "cpp_semaphore", scope: !44, file: !45, line: 54, type: !94, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!97 = !DISubprogram(name: "~cpp_semaphore", scope: !44, file: !45, line: 55, type: !94, scopeLine: 55, containingType: !44, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!98 = !DISubprogram(name: "wait", linkageName: "_ZN13cpp_semaphore4waitEv", scope: !44, file: !45, line: 56, type: !99, scopeLine: 56, containingType: !44, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!99 = !DISubroutineType(types: !100)
!100 = !{!55, !96}
!101 = !DISubprogram(name: "wait", linkageName: "_ZN13cpp_semaphore4waitEi", scope: !44, file: !45, line: 57, type: !102, scopeLine: 57, containingType: !44, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!102 = !DISubroutineType(types: !103)
!103 = !{!55, !96, !55}
!104 = !DISubprogram(name: "give", linkageName: "_ZN13cpp_semaphore4giveEv", scope: !44, file: !45, line: 58, type: !94, scopeLine: 58, containingType: !44, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!105 = !{!25, !106, !116, !118}
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "coop_stack", scope: !27, file: !45, line: 41, type: !108, isLocal: false, isDefinition: true, align: 64)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 16000, elements: !114)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !110, line: 47, size: 8, flags: DIFlagTypePassByValue, elements: !111, identifier: "_ZTS22z_thread_stack_element")
!110 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 48, baseType: !113, size: 8)
!113 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!114 = !{!115}
!115 = !DISubrange(count: 2000)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "sem_main", scope: !27, file: !45, line: 110, type: !44, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "sem_coop", scope: !27, file: !45, line: 111, type: !44, isLocal: false, isDefinition: true)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 1024, flags: DIFlagTypePassByValue, elements: !122, identifier: "_ZTS8k_thread")
!121 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123, !172, !185, !186, !187, !188, !196, !199}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !120, file: !121, line: 247, baseType: !124, size: 384)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, flags: DIFlagTypePassByValue, elements: !125, identifier: "_ZTS12_thread_base")
!125 = !{!126, !140, !142, !145, !146, !159, !160, !161}
!126 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !121, line: 60, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !121, line: 60, size: 64, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !128, identifier: "_ZTSN12_thread_baseUt_E")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !127, file: !121, line: 61, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !78)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !127, file: !121, line: 62, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, flags: DIFlagTypePassByValue, elements: !134, identifier: "_ZTS6rbnode")
!133 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !132, file: !133, line: 50, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !138)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!138 = !{!139}
!139 = !DISubrange(count: 2)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !124, file: !121, line: 68, baseType: !141, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !124, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !144)
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !124, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !121, line: 90, baseType: !147, size: 16, offset: 112)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !121, line: 90, size: 16, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !148, identifier: "_ZTSN12_thread_baseUt0_E")
!148 = !{!149, !156}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !121, line: 91, baseType: !150, size: 16)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !147, file: !121, line: 91, size: 16, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !151, identifier: "_ZTSN12_thread_baseUt0_Ut_E")
!151 = !{!152, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !150, file: !121, line: 96, baseType: !153, size: 8)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !154)
!154 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !150, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !147, file: !121, line: 100, baseType: !157, size: 16)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !158)
!158 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !124, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !124, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !124, file: !121, line: 131, baseType: !162, size: 192, offset: 192)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, flags: DIFlagTypePassByValue, elements: !163, identifier: "_ZTS8_timeout")
!163 = !{!164, !165, !171}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !162, file: !72, line: 245, baseType: !130, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !162, file: !72, line: 246, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !162, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !120, file: !121, line: 250, baseType: !173, size: 288, offset: 384)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, flags: DIFlagTypePassByValue, elements: !175, identifier: "_ZTS13_callee_saved")
!174 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !173, file: !174, line: 26, baseType: !40, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !173, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !173, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !173, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !173, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !173, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !173, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !173, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !173, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !120, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !120, file: !121, line: 256, baseType: !71, size: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !120, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !120, file: !121, line: 300, baseType: !189, size: 96, offset: 800)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !121, line: 149, size: 96, flags: DIFlagTypePassByValue, elements: !190, identifier: "_ZTS18_thread_stack_info")
!190 = !{!191, !192, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !189, file: !121, line: 153, baseType: !22, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !189, file: !121, line: 162, baseType: !193, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !194, line: 214, baseType: !41)
!194 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !189, file: !121, line: 168, baseType: !193, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !120, file: !121, line: 325, baseType: !197, size: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, flags: DIFlagFwdDecl, identifier: "_ZTS6k_heap")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !120, file: !121, line: 343, baseType: !200, size: 64, offset: 928)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, flags: DIFlagTypePassByValue, elements: !201, identifier: "_ZTS12_thread_arch")
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !200, file: !174, line: 63, baseType: !40, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !200, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "_char_out", scope: !206, file: !281, line: 54, type: !282, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !279, globals: !280, splitDebugInlining: false, nameTableKind: None)
!207 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!208 = !{!209}
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !210, line: 27, baseType: !41, size: 32, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278}
!212 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!213 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!214 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!215 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!216 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!217 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!218 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!219 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!220 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!221 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!222 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!223 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!224 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!225 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!226 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!227 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!228 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!229 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!230 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!231 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!232 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!233 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!234 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!235 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!236 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!237 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!238 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!239 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!240 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!241 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!242 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!243 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!244 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!245 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!246 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!247 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!248 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!249 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!250 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!251 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!252 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!253 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!254 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!255 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!256 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!257 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!258 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!259 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!260 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!261 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!262 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!263 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!264 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!265 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!266 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!267 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!268 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!269 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!270 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!271 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!272 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!273 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!274 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!275 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!276 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!277 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!278 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!279 = !{!39, !55}
!280 = !{!204}
!281 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DISubroutineType(types: !284)
!284 = !{!55, !55}
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !287, file: !346, line: 65, type: !347, isLocal: true, isDefinition: true, align: 32)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !289, globals: !341, splitDebugInlining: false, nameTableKind: None)
!288 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!289 = !{!39, !55, !290, !40, !301}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !292, file: !291, line: 167, baseType: !300)
!291 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !291, file: !291, line: 134, type: !293, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !287, retainedNodes: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !40}
!295 = !{!296, !297, !299}
!296 = !DILocalVariable(name: "time_us", arg: 1, scope: !292, file: !291, line: 134, type: !40)
!297 = !DILocalVariable(name: "delay_cycles", scope: !292, file: !291, line: 168, type: !298)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!299 = !DILocalVariable(name: "cycles", scope: !292, file: !291, line: 171, type: !40)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !303, line: 1928, baseType: !304)
!303 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 1909, size: 11360, elements: !305)
!305 = !{!306, !312, !313, !314, !315, !319, !320, !321, !322, !326, !327, !331, !332, !333, !334, !335, !339, !340}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !304, file: !303, line: 1910, baseType: !307, size: 8192)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 8192, elements: !310)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !40)
!310 = !{!311}
!311 = !DISubrange(count: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !304, file: !303, line: 1911, baseType: !308, size: 32, offset: 8192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !304, file: !303, line: 1912, baseType: !308, size: 32, offset: 8224)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !304, file: !303, line: 1913, baseType: !308, size: 32, offset: 8256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !304, file: !303, line: 1914, baseType: !316, size: 1984, offset: 8288)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 1984, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 62)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !304, file: !303, line: 1915, baseType: !309, size: 32, offset: 10272)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !304, file: !303, line: 1916, baseType: !308, size: 32, offset: 10304)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !304, file: !303, line: 1917, baseType: !309, size: 32, offset: 10336)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !304, file: !303, line: 1918, baseType: !323, size: 96, offset: 10368)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 96, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 3)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !304, file: !303, line: 1919, baseType: !309, size: 32, offset: 10464)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !304, file: !303, line: 1920, baseType: !328, size: 256, offset: 10496)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 256, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 8)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !304, file: !303, line: 1921, baseType: !309, size: 32, offset: 10752)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !304, file: !303, line: 1922, baseType: !308, size: 32, offset: 10784)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !304, file: !303, line: 1923, baseType: !309, size: 32, offset: 10816)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !304, file: !303, line: 1924, baseType: !309, size: 32, offset: 10848)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !304, file: !303, line: 1925, baseType: !336, size: 416, offset: 10880)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 416, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 13)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !304, file: !303, line: 1926, baseType: !309, size: 32, offset: 11296)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !304, file: !303, line: 1927, baseType: !309, size: 32, offset: 11328)
!341 = !{!285, !342}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !292, file: !291, line: 161, type: !344, isLocal: true, isDefinition: true, align: 128)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 48, elements: !324)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!346 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !349, line: 51, size: 64, elements: !350)
!349 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!350 = !{!351, !358}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !348, file: !349, line: 60, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DISubroutineType(types: !354)
!354 = !{!55, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !349, line: 48, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !348, file: !349, line: 65, baseType: !355, size: 32, offset: 32)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "__dso_handle", scope: !361, file: !364, line: 15, type: !39, isLocal: false, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !363, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/cpp/cpp_dtors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!363 = !{!359}
!364 = !DIFile(filename: "zephyr/subsys/cpp/cpp_dtors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !367, file: !402, line: 27, type: !430, isLocal: true, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !381, globals: !399, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!369 = !{!370, !209}
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !371, line: 27, baseType: !41, size: 32, elements: !372)
!371 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380}
!373 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!374 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!375 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!376 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!377 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!378 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!379 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!380 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!381 = !{!39, !30, !55, !24, !382, !398, !40, !42}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !384, line: 54, size: 96, elements: !385)
!384 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !{!386, !393, !397}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !383, file: !384, line: 55, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !388, line: 33, baseType: !389)
!388 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !388, line: 29, size: 32, elements: !390)
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !389, file: !388, line: 30, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !383, file: !384, line: 60, baseType: !394, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !370}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !383, file: !384, line: 65, baseType: !394, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!399 = !{!365, !400, !407, !409, !420, !422}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !367, file: !402, line: 44, type: !403, isLocal: true, isDefinition: true)
!402 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !404, line: 43, size: 8, elements: !405)
!404 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !403, file: !404, line: 75, baseType: !113, size: 8)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !367, file: !402, line: 49, type: !403, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !367, file: !402, line: 36, type: !411, isLocal: true, isDefinition: true)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 128, elements: !418)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !371, line: 114, size: 128, elements: !413)
!413 = !{!414, !415, !416, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !412, file: !371, line: 115, baseType: !370, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !412, file: !371, line: 141, baseType: !143, size: 8, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !412, file: !371, line: 149, baseType: !40, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !412, file: !371, line: 156, baseType: !40, size: 32, offset: 96)
!418 = !{!419}
!419 = !DISubrange(count: 1)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !367, file: !402, line: 40, type: !411, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !367, file: !402, line: 28, type: !424, isLocal: true, isDefinition: true)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !388, line: 40, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !388, line: 35, size: 64, elements: !426)
!426 = !{!427, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !425, file: !388, line: 36, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !425, file: !388, line: 37, baseType: !428, size: 32, offset: 32)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 32, elements: !418)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !432, line: 22, baseType: !433)
!432 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!433 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!434 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!435 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !438, file: !467, line: 50, type: !454, isLocal: true, isDefinition: true)
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !440, globals: !464, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!440 = !{!441, !30, !193, !55, !39, !40, !42, !443, !398, !454, !455}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !442)
!442 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !445, line: 45, size: 64, elements: !446)
!445 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = !{!447, !453}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !444, file: !445, line: 46, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !388, line: 33, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !388, line: 29, size: 32, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !449, file: !388, line: 30, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !444, file: !445, line: 48, baseType: !40, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !55)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !445, line: 38, size: 64, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !456, file: !445, line: 39, baseType: !448, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !456, file: !445, line: 41, baseType: !460, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !445, line: 35, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !454}
!464 = !{!465, !471, !479, !436, !481, !491}
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "latency_lock", scope: !438, file: !467, line: 44, type: !468, isLocal: true, isDefinition: true)
!467 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !404, line: 43, size: 8, elements: !469)
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !468, file: !404, line: 75, baseType: !113, size: 8)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !438, file: !467, line: 46, type: !473, isLocal: true, isDefinition: true)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !388, line: 40, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !388, line: 35, size: 64, elements: !475)
!475 = !{!476, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !474, file: !388, line: 36, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !474, file: !388, line: 37, baseType: !477, size: 32, offset: 32)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "latency_subs", scope: !438, file: !467, line: 52, type: !473, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !438, file: !467, line: 39, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, elements: !489)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !467, line: 35, size: 96, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !484, file: !467, line: 36, baseType: !370, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !484, file: !467, line: 37, baseType: !143, size: 8, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !484, file: !467, line: 38, baseType: !431, size: 32, offset: 64)
!489 = !{!490}
!490 = !DISubrange(count: 0)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !438, file: !467, line: 48, type: !454, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !495, file: !502, line: 47, type: !516, isLocal: true, isDefinition: true)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !497, retainedTypes: !498, globals: !499, splitDebugInlining: false, nameTableKind: None)
!496 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!497 = !{!370}
!498 = !{!193, !55}
!499 = !{!500, !493, !512}
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "cpus_states", scope: !495, file: !502, line: 50, type: !503, isLocal: true, isDefinition: true)
!502 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 32, elements: !418)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !371, line: 114, size: 128, elements: !507)
!507 = !{!508, !509, !510, !511}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !506, file: !371, line: 115, baseType: !370, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !506, file: !371, line: 141, baseType: !143, size: 8, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !506, file: !371, line: 149, baseType: !40, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !506, file: !371, line: 156, baseType: !40, size: 32, offset: 96)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !495, file: !502, line: 55, type: !514, isLocal: true, isDefinition: true)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 8, elements: !418)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, elements: !489)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "static_regions", scope: !519, file: !526, line: 62, type: !650, isLocal: true, isDefinition: true)
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !521, globals: !522, splitDebugInlining: false, nameTableKind: None)
!520 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!521 = !{!193, !55, !40, !39}
!522 = !{!523, !517}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !525, file: !526, line: 198, type: !637, isLocal: true, isDefinition: true)
!525 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !526, file: !526, line: 175, type: !527, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !519, retainedNodes: !634)
!526 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !DISubroutineType(types: !528)
!528 = !{null, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 1024, elements: !531)
!531 = !{!532, !590, !602, !603, !604, !605, !611, !629}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !530, file: !121, line: 247, baseType: !533, size: 384)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, elements: !534)
!534 = !{!535, !559, !566, !567, !568, !577, !578, !579}
!535 = !DIDerivedType(tag: DW_TAG_member, scope: !533, file: !121, line: 60, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !121, line: 60, size: 64, elements: !537)
!537 = !{!538, !553}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !536, file: !121, line: 61, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, elements: !541)
!541 = !{!542, !548}
!542 = !DIDerivedType(tag: DW_TAG_member, scope: !540, file: !77, line: 38, baseType: !543, size: 32)
!543 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !540, file: !77, line: 38, size: 32, elements: !544)
!544 = !{!545, !547}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !543, file: !77, line: 39, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !543, file: !77, line: 40, baseType: !546, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, scope: !540, file: !77, line: 42, baseType: !549, size: 32, offset: 32)
!549 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !540, file: !77, line: 42, size: 32, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !549, file: !77, line: 43, baseType: !546, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !549, file: !77, line: 44, baseType: !546, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !536, file: !121, line: 62, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !554, file: !133, line: 50, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 64, elements: !138)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !533, file: !121, line: 68, baseType: !560, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, elements: !563)
!563 = !{!564}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !562, file: !72, line: 232, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !540)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !533, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !533, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!568 = !DIDerivedType(tag: DW_TAG_member, scope: !533, file: !121, line: 90, baseType: !569, size: 16, offset: 112)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !121, line: 90, size: 16, elements: !570)
!570 = !{!571, !576}
!571 = !DIDerivedType(tag: DW_TAG_member, scope: !569, file: !121, line: 91, baseType: !572, size: 16)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !569, file: !121, line: 91, size: 16, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !572, file: !121, line: 96, baseType: !153, size: 8)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !572, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !569, file: !121, line: 100, baseType: !157, size: 16)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !533, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !533, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !533, file: !121, line: 131, baseType: !580, size: 192, offset: 192)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, elements: !581)
!581 = !{!582, !583, !589}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !580, file: !72, line: 245, baseType: !539, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !580, file: !72, line: 246, baseType: !584, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !580, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !530, file: !121, line: 250, baseType: !591, size: 288, offset: 384)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !591, file: !174, line: 26, baseType: !40, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !591, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !591, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !591, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !591, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !591, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !591, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !591, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !591, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !530, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !530, file: !121, line: 256, baseType: !561, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !530, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !530, file: !121, line: 300, baseType: !606, size: 96, offset: 800)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !121, line: 149, size: 96, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !606, file: !121, line: 153, baseType: !22, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !606, file: !121, line: 162, baseType: !193, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !606, file: !121, line: 168, baseType: !193, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !530, file: !121, line: 325, baseType: !612, size: 32, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, elements: !614)
!614 = !{!615, !624, !625}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !613, file: !68, line: 5074, baseType: !616, size: 96)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !617, line: 56, size: 96, elements: !618)
!617 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!618 = !{!619, !622, !623}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !616, file: !617, line: 57, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !617, line: 57, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !616, file: !617, line: 58, baseType: !39, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !616, file: !617, line: 59, baseType: !193, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !613, file: !68, line: 5075, baseType: !561, size: 64, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !613, file: !68, line: 5076, baseType: !626, size: 8, offset: 160)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !404, line: 43, size: 8, elements: !627)
!627 = !{!628}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !626, file: !404, line: 75, baseType: !113, size: 8)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !530, file: !121, line: 343, baseType: !630, size: 64, offset: 928)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !630, file: !174, line: 63, baseType: !40, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !630, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!634 = !{!635, !636}
!635 = !DILocalVariable(name: "thread", arg: 1, scope: !525, file: !526, line: 175, type: !529)
!636 = !DILocalVariable(name: "region_num", scope: !525, file: !526, line: 200, type: !143)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, elements: !489)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !639, line: 52, size: 96, elements: !640)
!639 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !638, file: !639, line: 53, baseType: !22, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !638, file: !639, line: 54, baseType: !193, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !638, file: !639, line: 55, baseType: !644, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !645, line: 304, baseType: !646)
!645 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !645, line: 301, size: 32, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !646, file: !645, line: 302, baseType: !157, size: 16)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !646, file: !645, line: 303, baseType: !157, size: 16, offset: 16)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 96, elements: !418)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !654, file: !710, line: 39, type: !143, isLocal: true, isDefinition: true)
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !656, globals: !701, splitDebugInlining: false, nameTableKind: None)
!655 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!656 = !{!657, !39, !55, !685}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !659, line: 1495, baseType: !660)
!659 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !659, line: 1474, size: 448, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !675}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !660, file: !659, line: 1476, baseType: !308, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !660, file: !659, line: 1477, baseType: !309, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !660, file: !659, line: 1478, baseType: !309, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !660, file: !659, line: 1479, baseType: !309, size: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !660, file: !659, line: 1480, baseType: !309, size: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !660, file: !659, line: 1481, baseType: !309, size: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !660, file: !659, line: 1482, baseType: !309, size: 32, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !660, file: !659, line: 1483, baseType: !309, size: 32, offset: 224)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !660, file: !659, line: 1484, baseType: !309, size: 32, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !660, file: !659, line: 1485, baseType: !309, size: 32, offset: 288)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !660, file: !659, line: 1486, baseType: !309, size: 32, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !660, file: !659, line: 1487, baseType: !674, size: 32, offset: 352)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 32, elements: !418)
!675 = !DIDerivedType(tag: DW_TAG_member, scope: !660, file: !659, line: 1488, baseType: !676, size: 64, offset: 384)
!676 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !660, file: !659, line: 1488, size: 64, elements: !677)
!677 = !{!678, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !676, file: !659, line: 1489, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 64, elements: !138)
!680 = !DIDerivedType(tag: DW_TAG_member, scope: !676, file: !659, line: 1490, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !676, file: !659, line: 1490, size: 64, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !681, file: !659, line: 1491, baseType: !309, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !681, file: !659, line: 1492, baseType: !309, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !688, line: 27, size: 128, elements: !689)
!688 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!689 = !{!690, !691, !694}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !687, file: !688, line: 29, baseType: !40, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !687, file: !688, line: 31, baseType: !692, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !687, file: !688, line: 37, baseType: !695, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !645, line: 298, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !645, line: 289, size: 64, elements: !697)
!697 = !{!698, !699, !700}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !696, file: !645, line: 291, baseType: !143, size: 5, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !696, file: !645, line: 293, baseType: !143, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !696, file: !645, line: 295, baseType: !40, size: 32, offset: 32)
!701 = !{!652, !702}
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !654, file: !704, line: 31, type: !705, isLocal: true, isDefinition: true)
!704 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 160, elements: !418)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !704, line: 21, size: 160, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !706, file: !704, line: 22, baseType: !55, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !706, file: !704, line: 23, baseType: !687, size: 128, offset: 32)
!710 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "z_malloc_heap_mutex", scope: !713, file: !719, line: 35, type: !737, isLocal: false, isDefinition: true)
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !715, globals: !716, splitDebugInlining: false, nameTableKind: None)
!714 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdlib/malloc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!715 = !{!30, !39, !55}
!716 = !{!717, !725, !711, !732}
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "__init_malloc_prepare", scope: !713, file: !719, line: 119, type: !720, isLocal: true, isDefinition: true, align: 32)
!719 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdlib/malloc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !349, line: 51, size: 64, elements: !722)
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !721, file: !349, line: 60, baseType: !352, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !721, file: !349, line: 65, baseType: !355, size: 32, offset: 32)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "z_malloc_heap", scope: !713, file: !719, line: 34, type: !727, isLocal: true, isDefinition: true)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !617, line: 56, size: 96, elements: !728)
!728 = !{!729, !730, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !727, file: !617, line: 57, baseType: !620, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !727, file: !617, line: 58, baseType: !39, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !727, file: !617, line: 59, baseType: !193, size: 32, offset: 64)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "z_malloc_heap_mem", scope: !713, file: !719, line: 36, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 1024, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 128)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_mutex", file: !738, line: 137, size: 160, elements: !739)
!738 = !DIFile(filename: "zephyr/include/zephyr/sys/mutex.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_mutex", scope: !737, file: !738, line: 138, baseType: !741, size: 160)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !68, line: 2720, size: 160, elements: !742)
!742 = !{!743, !762, !842, !843}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !741, file: !68, line: 2722, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, elements: !746)
!746 = !{!747}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !745, file: !72, line: 232, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, elements: !750)
!750 = !{!751, !757}
!751 = !DIDerivedType(tag: DW_TAG_member, scope: !749, file: !77, line: 38, baseType: !752, size: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !749, file: !77, line: 38, size: 32, elements: !753)
!753 = !{!754, !756}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !752, file: !77, line: 39, baseType: !755, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !752, file: !77, line: 40, baseType: !755, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, scope: !749, file: !77, line: 42, baseType: !758, size: 32, offset: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !749, file: !77, line: 42, size: 32, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !758, file: !77, line: 43, baseType: !755, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !758, file: !77, line: 44, baseType: !755, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !741, file: !68, line: 2724, baseType: !763, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 1024, elements: !765)
!765 = !{!766, !806, !818, !819, !820, !821, !827, !837}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !764, file: !121, line: 247, baseType: !767, size: 384)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, elements: !768)
!768 = !{!769, !780, !782, !783, !784, !793, !794, !795}
!769 = !DIDerivedType(tag: DW_TAG_member, scope: !767, file: !121, line: 60, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !767, file: !121, line: 60, size: 64, elements: !771)
!771 = !{!772, !774}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !770, file: !121, line: 61, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !749)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !770, file: !121, line: 62, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, elements: !776)
!776 = !{!777}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !775, file: !133, line: 50, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !779, size: 64, elements: !138)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !767, file: !121, line: 68, baseType: !781, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !767, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !767, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!784 = !DIDerivedType(tag: DW_TAG_member, scope: !767, file: !121, line: 90, baseType: !785, size: 16, offset: 112)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !767, file: !121, line: 90, size: 16, elements: !786)
!786 = !{!787, !792}
!787 = !DIDerivedType(tag: DW_TAG_member, scope: !785, file: !121, line: 91, baseType: !788, size: 16)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !785, file: !121, line: 91, size: 16, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !788, file: !121, line: 96, baseType: !153, size: 8)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !788, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !785, file: !121, line: 100, baseType: !157, size: 16)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !767, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !767, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !767, file: !121, line: 131, baseType: !796, size: 192, offset: 192)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, elements: !797)
!797 = !{!798, !799, !805}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !796, file: !72, line: 245, baseType: !773, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !796, file: !72, line: 246, baseType: !800, size: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !796, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !764, file: !121, line: 250, baseType: !807, size: 288, offset: 384)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !807, file: !174, line: 26, baseType: !40, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !807, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !807, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !807, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !807, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !807, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !807, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !807, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !807, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !764, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !764, file: !121, line: 256, baseType: !744, size: 64, offset: 704)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !764, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !764, file: !121, line: 300, baseType: !822, size: 96, offset: 800)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !121, line: 149, size: 96, elements: !823)
!823 = !{!824, !825, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !822, file: !121, line: 153, baseType: !22, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !822, file: !121, line: 162, baseType: !193, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !822, file: !121, line: 168, baseType: !193, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !764, file: !121, line: 325, baseType: !828, size: 32, offset: 896)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, elements: !830)
!830 = !{!831, !832, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !829, file: !68, line: 5074, baseType: !727, size: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !829, file: !68, line: 5075, baseType: !744, size: 64, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !829, file: !68, line: 5076, baseType: !834, size: 8, offset: 160)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !404, line: 43, size: 8, elements: !835)
!835 = !{!836}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !834, file: !404, line: 75, baseType: !113, size: 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !764, file: !121, line: 343, baseType: !838, size: 64, offset: 928)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !838, file: !174, line: 63, baseType: !40, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !838, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !741, file: !68, line: 2727, baseType: !40, size: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !741, file: !68, line: 2730, baseType: !55, size: 32, offset: 128)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !846, file: !853, line: 21, type: !282, isLocal: true, isDefinition: true)
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !848, globals: !852, splitDebugInlining: false, nameTableKind: None)
!847 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!848 = !{!849, !55, !39}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !851, line: 22, baseType: !55)
!851 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!852 = !{!844}
!853 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !856, file: !861, line: 13, type: !880, isLocal: true, isDefinition: true)
!856 = distinct !DICompileUnit(language: DW_LANG_C99, file: !857, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !858, splitDebugInlining: false, nameTableKind: None)
!857 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!858 = !{!859, !854}
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "mpu_config", scope: !856, file: !861, line: 37, type: !862, isLocal: false, isDefinition: true)
!861 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!862 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !688, line: 41, size: 64, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !863, file: !688, line: 43, baseType: !40, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !863, file: !688, line: 45, baseType: !867, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !688, line: 27, size: 128, elements: !870)
!870 = !{!871, !872, !873}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !869, file: !688, line: 29, baseType: !40, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !869, file: !688, line: 31, baseType: !692, size: 32, offset: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !869, file: !688, line: 37, baseType: !874, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !645, line: 298, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !645, line: 289, size: 64, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !875, file: !645, line: 291, baseType: !143, size: 5, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !875, file: !645, line: 293, baseType: !143, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !875, file: !645, line: 295, baseType: !40, size: 32, offset: 32)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !868, size: 256, elements: !138)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_som_init", scope: !883, file: !984, line: 39, type: !985, isLocal: true, isDefinition: true, align: 32)
!883 = distinct !DICompileUnit(language: DW_LANG_C99, file: !884, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !885, retainedTypes: !897, globals: !983, splitDebugInlining: false, nameTableKind: None)
!884 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_som/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/cpp/cpp_synchronization")
!885 = !{!886, !892}
!886 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !887, line: 506, baseType: !41, size: 32, elements: !888)
!887 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!888 = !{!889, !890, !891}
!889 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!890 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!891 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!892 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !887, line: 512, baseType: !41, size: 32, elements: !893)
!893 = !{!894, !895, !896}
!894 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!895 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!896 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!897 = !{!898, !972, !977, !938, !892, !886, !982, !39}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !887, line: 523, size: 288, elements: !901)
!901 = !{!902, !928, !934, !939, !943, !944, !945, !949, !968}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !900, file: !887, line: 524, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DISubroutineType(types: !905)
!905 = !{!55, !906, !926, !927}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !909, line: 378, size: 192, elements: !910)
!909 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!910 = !{!911, !912, !913, !914, !921, !922}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !909, line: 380, baseType: !692, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !908, file: !909, line: 382, baseType: !13, size: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !908, file: !909, line: 384, baseType: !13, size: 32, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !908, file: !909, line: 386, baseType: !915, size: 32, offset: 96)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !909, line: 351, size: 16, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !916, file: !909, line: 359, baseType: !143, size: 8)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !916, file: !909, line: 364, baseType: !920, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!920 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !908, file: !909, line: 388, baseType: !39, size: 32, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !908, file: !909, line: 396, baseType: !923, size: 32, offset: 160)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !909, line: 43, baseType: !441)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !887, line: 237, baseType: !143)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !887, line: 257, baseType: !40)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !900, file: !887, line: 530, baseType: !929, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DISubroutineType(types: !931)
!931 = !{!55, !906, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !887, line: 229, baseType: !40)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !900, file: !887, line: 532, baseType: !935, size: 32, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DISubroutineType(types: !937)
!937 = !{!55, !906, !938, !933}
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !887, line: 216, baseType: !40)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !900, file: !887, line: 535, baseType: !940, size: 32, offset: 96)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(types: !942)
!942 = !{!55, !906, !938}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !900, file: !887, line: 537, baseType: !940, size: 32, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !900, file: !887, line: 539, baseType: !940, size: 32, offset: 160)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !900, file: !887, line: 541, baseType: !946, size: 32, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = !DISubroutineType(types: !948)
!948 = !{!55, !906, !926, !886, !892}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !900, file: !887, line: 544, baseType: !950, size: 32, offset: 224)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DISubroutineType(types: !952)
!952 = !{!55, !906, !953, !920}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !887, line: 478, size: 96, elements: !955)
!955 = !{!956, !962, !967}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !954, file: !887, line: 482, baseType: !957, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !388, line: 33, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !388, line: 29, size: 32, elements: !959)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !958, file: !388, line: 30, baseType: !961, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !954, file: !887, line: 485, baseType: !963, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !887, line: 464, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !906, !953, !938}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !954, file: !887, line: 493, baseType: !938, size: 32, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !900, file: !887, line: 547, baseType: !969, size: 32, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{!40, !906}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !887, line: 428, size: 32, elements: !975)
!975 = !{!976}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !974, file: !887, line: 434, baseType: !938, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !887, line: 441, size: 32, elements: !980)
!980 = !{!981}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !979, file: !887, line: 447, baseType: !938, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!983 = !{!881}
!984 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_som/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !349, line: 51, size: 64, elements: !987)
!987 = !{!988, !992}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !986, file: !349, line: 60, baseType: !989, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = !DISubroutineType(types: !991)
!991 = !{!55, !906}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !986, file: !349, line: 65, baseType: !906, size: 32, offset: 32)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "__device_dts_ord_29", scope: !995, file: !1199, line: 733, type: !1304, isLocal: false, isDefinition: true, align: 32)
