; ModuleID = 'build/96b_neonkey/cpp_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type { i8 }
%struct._thread_arch = type { i32, i32 }
%class.cpp_semaphore = type { %class.semaphore, %struct.k_sem }
%class.semaphore = type { i32 (...)** }
%struct.k_sem = type { %union.anon, i32, i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 98, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5504, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 86)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2752, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "coop_thread", scope: !27, file: !45, line: 40, type: !120, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, globals: !105, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/cpp/cpp_synchronization/src/main.cpp", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!29 = !{!30, !34, !40, !42, !44, !48}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !31, line: 46, baseType: !32)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !33)
!33 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !35, line: 46, baseType: !36)
!35 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39, !39, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !43)
!43 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!44 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "cpp_semaphore", file: !45, line: 50, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !46, vtableHolder: !48)
!45 = !DIFile(filename: "zephyr/samples/subsys/cpp/cpp_synchronization/src/main.cpp", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !66, !93, !97, !98, !101, !104}
!47 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !44, baseType: !48, flags: DIFlagPublic, extraData: i32 0)
!48 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "semaphore", file: !45, line: 29, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !49, vtableHolder: !48, identifier: "_ZTS9semaphore")
!49 = !{!50, !56, !60, !63}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$semaphore", scope: !45, file: !45, baseType: !51, size: 32, flags: DIFlagArtificial)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !53, size: 32)
!53 = !DISubroutineType(types: !54)
!54 = !{!55}
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DISubprogram(name: "wait", linkageName: "_ZN9semaphore4waitEv", scope: !48, file: !45, line: 31, type: !57, scopeLine: 31, containingType: !48, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!57 = !DISubroutineType(types: !58)
!58 = !{!55, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!60 = !DISubprogram(name: "wait", linkageName: "_ZN9semaphore4waitEi", scope: !48, file: !45, line: 32, type: !61, scopeLine: 32, containingType: !48, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!61 = !DISubroutineType(types: !62)
!62 = !{!55, !59, !55}
!63 = !DISubprogram(name: "give", linkageName: "_ZN9semaphore4giveEv", scope: !48, file: !45, line: 33, type: !64, scopeLine: 33, containingType: !48, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !59}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_sema_internal", scope: !44, file: !45, line: 52, baseType: !67, size: 128, offset: 32, flags: DIFlagProtected)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !68, line: 2909, size: 128, flags: DIFlagTypePassByValue, elements: !69, identifier: "_ZTS5k_sem")
!68 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!69 = !{!70, !91, !92}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !67, file: !68, line: 2910, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !73)
!72 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, flags: DIFlagTypePassByValue, elements: !74, identifier: "_ZTS9_wait_q_t")
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !73, file: !72, line: 232, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !78)
!77 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, flags: DIFlagTypePassByValue, elements: !79, identifier: "_ZTS6_dnode")
!79 = !{!80, !86}
!80 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 38, baseType: !81, size: 32)
!81 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 38, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !82, identifier: "_ZTSN6_dnodeUt_E")
!82 = !{!83, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !81, file: !77, line: 39, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !77, line: 40, baseType: !84, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 42, baseType: !87, size: 32, offset: 32)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 42, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !88, identifier: "_ZTSN6_dnodeUt0_E")
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !87, file: !77, line: 43, baseType: !84, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !77, line: 44, baseType: !84, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !67, file: !68, line: 2911, baseType: !41, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !67, file: !68, line: 2912, baseType: !41, size: 32, offset: 96)
!93 = !DISubprogram(name: "cpp_semaphore", scope: !44, file: !45, line: 54, type: !94, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!97 = !DISubprogram(name: "~cpp_semaphore", scope: !44, file: !45, line: 55, type: !94, scopeLine: 55, containingType: !44, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!98 = !DISubprogram(name: "wait", linkageName: "_ZN13cpp_semaphore4waitEv", scope: !44, file: !45, line: 56, type: !99, scopeLine: 56, containingType: !44, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!99 = !DISubroutineType(types: !100)
!100 = !{!55, !96}
!101 = !DISubprogram(name: "wait", linkageName: "_ZN13cpp_semaphore4waitEi", scope: !44, file: !45, line: 57, type: !102, scopeLine: 57, containingType: !44, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!102 = !DISubroutineType(types: !103)
!103 = !{!55, !96, !55}
!104 = !DISubprogram(name: "give", linkageName: "_ZN13cpp_semaphore4giveEv", scope: !44, file: !45, line: 58, type: !94, scopeLine: 58, containingType: !44, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!105 = !{!25, !106, !116, !118}
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "coop_stack", scope: !27, file: !45, line: 41, type: !108, isLocal: false, isDefinition: true, align: 512)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 16512, elements: !114)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !110, line: 47, size: 8, flags: DIFlagTypePassByValue, elements: !111, identifier: "_ZTS22z_thread_stack_element")
!110 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 48, baseType: !113, size: 8)
!113 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!114 = !{!115}
!115 = !DISubrange(count: 2064)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "sem_main", scope: !27, file: !45, line: 110, type: !44, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "sem_coop", scope: !27, file: !45, line: 111, type: !44, isLocal: false, isDefinition: true)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 1024, flags: DIFlagTypePassByValue, elements: !122, identifier: "_ZTS8k_thread")
!121 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123, !172, !185, !186, !187, !188, !196, !199}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !120, file: !121, line: 247, baseType: !124, size: 384)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, flags: DIFlagTypePassByValue, elements: !125, identifier: "_ZTS12_thread_base")
!125 = !{!126, !140, !142, !145, !146, !159, !160, !161}
!126 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !121, line: 60, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !121, line: 60, size: 64, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !128, identifier: "_ZTSN12_thread_baseUt_E")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !127, file: !121, line: 61, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !78)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !127, file: !121, line: 62, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, flags: DIFlagTypePassByValue, elements: !134, identifier: "_ZTS6rbnode")
!133 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !132, file: !133, line: 50, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !138)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!138 = !{!139}
!139 = !DISubrange(count: 2)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !124, file: !121, line: 68, baseType: !141, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !124, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !144)
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !124, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !121, line: 90, baseType: !147, size: 16, offset: 112)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !121, line: 90, size: 16, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !148, identifier: "_ZTSN12_thread_baseUt0_E")
!148 = !{!149, !156}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !121, line: 91, baseType: !150, size: 16)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !147, file: !121, line: 91, size: 16, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !151, identifier: "_ZTSN12_thread_baseUt0_Ut_E")
!151 = !{!152, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !150, file: !121, line: 96, baseType: !153, size: 8)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !154)
!154 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !150, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !147, file: !121, line: 100, baseType: !157, size: 16)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !158)
!158 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !124, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !124, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !124, file: !121, line: 131, baseType: !162, size: 192, offset: 192)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, flags: DIFlagTypePassByValue, elements: !163, identifier: "_ZTS8_timeout")
!163 = !{!164, !165, !171}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !162, file: !72, line: 245, baseType: !130, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !162, file: !72, line: 246, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !162, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !120, file: !121, line: 250, baseType: !173, size: 288, offset: 384)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, flags: DIFlagTypePassByValue, elements: !175, identifier: "_ZTS13_callee_saved")
!174 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !173, file: !174, line: 26, baseType: !40, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !173, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !173, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !173, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !173, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !173, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !173, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !173, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !173, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !120, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !120, file: !121, line: 256, baseType: !71, size: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !120, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !120, file: !121, line: 300, baseType: !189, size: 96, offset: 800)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !121, line: 149, size: 96, flags: DIFlagTypePassByValue, elements: !190, identifier: "_ZTS18_thread_stack_info")
!190 = !{!191, !192, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !189, file: !121, line: 153, baseType: !22, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !189, file: !121, line: 162, baseType: !193, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !194, line: 214, baseType: !41)
!194 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !189, file: !121, line: 168, baseType: !193, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !120, file: !121, line: 325, baseType: !197, size: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, flags: DIFlagFwdDecl, identifier: "_ZTS6k_heap")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !120, file: !121, line: 343, baseType: !200, size: 64, offset: 928)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, flags: DIFlagTypePassByValue, elements: !201, identifier: "_ZTS12_thread_arch")
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !200, file: !174, line: 63, baseType: !40, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !200, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "_char_out", scope: !206, file: !281, line: 54, type: !282, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !279, globals: !280, splitDebugInlining: false, nameTableKind: None)
!207 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!208 = !{!209}
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !210, line: 27, baseType: !41, size: 32, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278}
!212 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!213 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!214 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!215 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!216 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!217 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!218 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!219 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!220 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!221 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!222 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!223 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!224 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!225 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!226 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!227 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!228 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!229 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!230 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!231 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!232 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!233 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!234 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!235 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!236 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!237 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!238 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!239 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!240 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!241 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!242 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!243 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!244 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!245 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!246 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!247 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!248 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!249 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!250 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!251 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!252 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!253 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!254 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!255 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!256 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!257 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!258 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!259 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!260 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!261 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!262 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!263 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!264 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!265 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!266 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!267 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!268 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!269 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!270 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!271 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!272 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!273 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!274 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!275 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!276 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!277 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!278 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!279 = !{!39, !55}
!280 = !{!204}
!281 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DISubroutineType(types: !284)
!284 = !{!55, !55}
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !287, file: !304, line: 56, type: !305, isLocal: true, isDefinition: true, align: 32)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !289, globals: !303, splitDebugInlining: false, nameTableKind: None)
!288 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !292, line: 259, baseType: !293)
!292 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f411xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !292, line: 250, size: 224, elements: !294)
!294 = !{!295, !297, !298, !299, !300, !301, !302}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !293, file: !292, line: 252, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !40)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !293, file: !292, line: 253, baseType: !296, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !293, file: !292, line: 254, baseType: !296, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !293, file: !292, line: 255, baseType: !296, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !293, file: !292, line: 256, baseType: !296, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !293, file: !292, line: 257, baseType: !296, size: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !293, file: !292, line: 258, baseType: !296, size: 32, offset: 192)
!303 = !{!285}
!304 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !307, line: 51, size: 64, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !337}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !306, file: !307, line: 60, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DISubroutineType(types: !312)
!312 = !{!55, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !316, line: 378, size: 192, elements: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !{!318, !321, !322, !323, !330, !331}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !316, line: 380, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !315, file: !316, line: 382, baseType: !13, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !315, file: !316, line: 384, baseType: !13, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !315, file: !316, line: 386, baseType: !324, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !316, line: 351, size: 16, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !325, file: !316, line: 359, baseType: !143, size: 8)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !325, file: !316, line: 364, baseType: !329, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!329 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !316, line: 388, baseType: !39, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !315, file: !316, line: 396, baseType: !332, size: 32, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !316, line: 43, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !336)
!336 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !306, file: !307, line: 65, baseType: !313, size: 32, offset: 32)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !340, file: !343, line: 71, type: !344, isLocal: true, isDefinition: true, align: 32)
!340 = distinct !DICompileUnit(language: DW_LANG_C99, file: !341, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !342, splitDebugInlining: false, nameTableKind: None)
!341 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!342 = !{!338}
!343 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !307, line: 51, size: 64, elements: !346)
!346 = !{!347, !366}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !345, file: !307, line: 60, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DISubroutineType(types: !350)
!350 = !{!55, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !316, line: 378, size: 192, elements: !354)
!354 = !{!355, !356, !357, !358, !364, !365}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !353, file: !316, line: 380, baseType: !319, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !353, file: !316, line: 382, baseType: !13, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !353, file: !316, line: 384, baseType: !13, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !353, file: !316, line: 386, baseType: !359, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !316, line: 351, size: 16, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !360, file: !316, line: 359, baseType: !143, size: 8)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !360, file: !316, line: 364, baseType: !329, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !353, file: !316, line: 388, baseType: !39, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !353, file: !316, line: 396, baseType: !332, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !345, file: !307, line: 65, baseType: !351, size: 32, offset: 32)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "__dso_handle", scope: !369, file: !372, line: 15, type: !39, isLocal: false, isDefinition: true)
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !371, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/cpp/cpp_dtors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!371 = !{!367}
!372 = !DIFile(filename: "zephyr/subsys/cpp/cpp_dtors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "static_regions", scope: !375, file: !382, line: 62, type: !510, isLocal: true, isDefinition: true)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !377, globals: !378, splitDebugInlining: false, nameTableKind: None)
!376 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!377 = !{!193, !55, !40, !39}
!378 = !{!379, !373}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !381, file: !382, line: 198, type: !496, isLocal: true, isDefinition: true)
!381 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !382, file: !382, line: 175, type: !383, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !375, retainedNodes: !491)
!382 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!383 = !DISubroutineType(types: !384)
!384 = !{null, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 1024, elements: !387)
!387 = !{!388, !446, !458, !459, !460, !461, !467, !486}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !386, file: !121, line: 247, baseType: !389, size: 384)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, elements: !390)
!390 = !{!391, !415, !422, !423, !424, !433, !434, !435}
!391 = !DIDerivedType(tag: DW_TAG_member, scope: !389, file: !121, line: 60, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !389, file: !121, line: 60, size: 64, elements: !393)
!393 = !{!394, !409}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !392, file: !121, line: 61, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, elements: !397)
!397 = !{!398, !404}
!398 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !77, line: 38, baseType: !399, size: 32)
!399 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !77, line: 38, size: 32, elements: !400)
!400 = !{!401, !403}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !399, file: !77, line: 39, baseType: !402, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !399, file: !77, line: 40, baseType: !402, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !77, line: 42, baseType: !405, size: 32, offset: 32)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !77, line: 42, size: 32, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !405, file: !77, line: 43, baseType: !402, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !405, file: !77, line: 44, baseType: !402, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !392, file: !121, line: 62, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !410, file: !133, line: 50, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 64, elements: !138)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !389, file: !121, line: 68, baseType: !416, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, elements: !419)
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !418, file: !72, line: 232, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !396)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !389, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !389, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!424 = !DIDerivedType(tag: DW_TAG_member, scope: !389, file: !121, line: 90, baseType: !425, size: 16, offset: 112)
!425 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !389, file: !121, line: 90, size: 16, elements: !426)
!426 = !{!427, !432}
!427 = !DIDerivedType(tag: DW_TAG_member, scope: !425, file: !121, line: 91, baseType: !428, size: 16)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !425, file: !121, line: 91, size: 16, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !428, file: !121, line: 96, baseType: !153, size: 8)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !428, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !425, file: !121, line: 100, baseType: !157, size: 16)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !389, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !389, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !389, file: !121, line: 131, baseType: !436, size: 192, offset: 192)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, elements: !437)
!437 = !{!438, !439, !445}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !436, file: !72, line: 245, baseType: !395, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !436, file: !72, line: 246, baseType: !440, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !436, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !386, file: !121, line: 250, baseType: !447, size: 288, offset: 384)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !447, file: !174, line: 26, baseType: !40, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !447, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !447, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !447, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !447, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !447, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !447, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !447, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !447, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !386, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !386, file: !121, line: 256, baseType: !417, size: 64, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !386, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !386, file: !121, line: 300, baseType: !462, size: 96, offset: 800)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !121, line: 149, size: 96, elements: !463)
!463 = !{!464, !465, !466}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !462, file: !121, line: 153, baseType: !22, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !462, file: !121, line: 162, baseType: !193, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !462, file: !121, line: 168, baseType: !193, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !386, file: !121, line: 325, baseType: !468, size: 32, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, elements: !470)
!470 = !{!471, !480, !481}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !469, file: !68, line: 5074, baseType: !472, size: 96)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !473, line: 56, size: 96, elements: !474)
!473 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!474 = !{!475, !478, !479}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !472, file: !473, line: 57, baseType: !476, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !473, line: 57, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !472, file: !473, line: 58, baseType: !39, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !472, file: !473, line: 59, baseType: !193, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !469, file: !68, line: 5075, baseType: !417, size: 64, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !469, file: !68, line: 5076, baseType: !482, size: 8, offset: 160)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !483, line: 43, size: 8, elements: !484)
!483 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !482, file: !483, line: 75, baseType: !113, size: 8)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !386, file: !121, line: 343, baseType: !487, size: 64, offset: 928)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !487, file: !174, line: 63, baseType: !40, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !487, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!491 = !{!492, !493, !494, !495}
!492 = !DILocalVariable(name: "thread", arg: 1, scope: !381, file: !382, line: 175, type: !385)
!493 = !DILocalVariable(name: "region_num", scope: !381, file: !382, line: 200, type: !143)
!494 = !DILocalVariable(name: "guard_start", scope: !381, file: !382, line: 265, type: !22)
!495 = !DILocalVariable(name: "guard_size", scope: !381, file: !382, line: 266, type: !193)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 96, elements: !508)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !498, line: 52, size: 96, elements: !499)
!498 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !497, file: !498, line: 53, baseType: !22, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !497, file: !498, line: 54, baseType: !193, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !497, file: !498, line: 55, baseType: !503, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !504, line: 151, baseType: !505)
!504 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !504, line: 149, size: 32, elements: !506)
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !505, file: !504, line: 150, baseType: !40, size: 32)
!508 = !{!509}
!509 = !DISubrange(count: 1)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 96, elements: !508)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !514, file: !547, line: 39, type: !143, isLocal: true, isDefinition: true)
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !516, globals: !546, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!516 = !{!517, !39, !55, !534, !143}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !519, line: 1226, baseType: !520)
!519 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 1213, size: 352, elements: !521)
!521 = !{!522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !520, file: !519, line: 1215, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !520, file: !519, line: 1216, baseType: !296, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !520, file: !519, line: 1217, baseType: !296, size: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !520, file: !519, line: 1218, baseType: !296, size: 32, offset: 96)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !520, file: !519, line: 1219, baseType: !296, size: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !520, file: !519, line: 1220, baseType: !296, size: 32, offset: 160)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !520, file: !519, line: 1221, baseType: !296, size: 32, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !520, file: !519, line: 1222, baseType: !296, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !520, file: !519, line: 1223, baseType: !296, size: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !520, file: !519, line: 1224, baseType: !296, size: 32, offset: 288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !520, file: !519, line: 1225, baseType: !296, size: 32, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !537, line: 27, size: 96, elements: !538)
!537 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!538 = !{!539, !540, !541}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !536, file: !537, line: 29, baseType: !40, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !536, file: !537, line: 31, baseType: !319, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !536, file: !537, line: 37, baseType: !542, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !504, line: 146, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !504, line: 141, size: 32, elements: !544)
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !543, file: !504, line: 143, baseType: !40, size: 32)
!546 = !{!512}
!547 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "z_malloc_heap_mutex", scope: !550, file: !556, line: 35, type: !580, isLocal: false, isDefinition: true)
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !552, globals: !553, splitDebugInlining: false, nameTableKind: None)
!551 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdlib/malloc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!552 = !{!30, !39, !55}
!553 = !{!554, !568, !548, !575}
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "__init_malloc_prepare", scope: !550, file: !556, line: 119, type: !557, isLocal: true, isDefinition: true, align: 32)
!556 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdlib/malloc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !307, line: 51, size: 64, elements: !559)
!559 = !{!560, !567}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !558, file: !307, line: 60, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = !DISubroutineType(types: !563)
!563 = !{!55, !564}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !307, line: 48, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !558, file: !307, line: 65, baseType: !564, size: 32, offset: 32)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "z_malloc_heap", scope: !550, file: !556, line: 34, type: !570, isLocal: true, isDefinition: true)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !473, line: 56, size: 96, elements: !571)
!571 = !{!572, !573, !574}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !570, file: !473, line: 57, baseType: !476, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !570, file: !473, line: 58, baseType: !39, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !570, file: !473, line: 59, baseType: !193, size: 32, offset: 64)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "z_malloc_heap_mem", scope: !550, file: !556, line: 36, type: !577, isLocal: true, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 1024, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 128)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_mutex", file: !581, line: 137, size: 160, elements: !582)
!581 = !DIFile(filename: "zephyr/include/zephyr/sys/mutex.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_mutex", scope: !580, file: !581, line: 138, baseType: !584, size: 160)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !68, line: 2720, size: 160, elements: !585)
!585 = !{!586, !605, !685, !686}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !584, file: !68, line: 2722, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, elements: !589)
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !588, file: !72, line: 232, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, elements: !593)
!593 = !{!594, !600}
!594 = !DIDerivedType(tag: DW_TAG_member, scope: !592, file: !77, line: 38, baseType: !595, size: 32)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !592, file: !77, line: 38, size: 32, elements: !596)
!596 = !{!597, !599}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !595, file: !77, line: 39, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !595, file: !77, line: 40, baseType: !598, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, scope: !592, file: !77, line: 42, baseType: !601, size: 32, offset: 32)
!601 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !592, file: !77, line: 42, size: 32, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !601, file: !77, line: 43, baseType: !598, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !601, file: !77, line: 44, baseType: !598, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !584, file: !68, line: 2724, baseType: !606, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 1024, elements: !608)
!608 = !{!609, !649, !661, !662, !663, !664, !670, !680}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !607, file: !121, line: 247, baseType: !610, size: 384)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, elements: !611)
!611 = !{!612, !623, !625, !626, !627, !636, !637, !638}
!612 = !DIDerivedType(tag: DW_TAG_member, scope: !610, file: !121, line: 60, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !610, file: !121, line: 60, size: 64, elements: !614)
!614 = !{!615, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !613, file: !121, line: 61, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !592)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !613, file: !121, line: 62, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, elements: !619)
!619 = !{!620}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !618, file: !133, line: 50, baseType: !621, size: 64)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 64, elements: !138)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !610, file: !121, line: 68, baseType: !624, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !610, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !610, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!627 = !DIDerivedType(tag: DW_TAG_member, scope: !610, file: !121, line: 90, baseType: !628, size: 16, offset: 112)
!628 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !610, file: !121, line: 90, size: 16, elements: !629)
!629 = !{!630, !635}
!630 = !DIDerivedType(tag: DW_TAG_member, scope: !628, file: !121, line: 91, baseType: !631, size: 16)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !628, file: !121, line: 91, size: 16, elements: !632)
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !631, file: !121, line: 96, baseType: !153, size: 8)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !631, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !628, file: !121, line: 100, baseType: !157, size: 16)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !610, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !610, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !610, file: !121, line: 131, baseType: !639, size: 192, offset: 192)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, elements: !640)
!640 = !{!641, !642, !648}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !639, file: !72, line: 245, baseType: !616, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !639, file: !72, line: 246, baseType: !643, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !639, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !607, file: !121, line: 250, baseType: !650, size: 288, offset: 384)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !650, file: !174, line: 26, baseType: !40, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !650, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !650, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !650, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !650, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !650, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !650, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !650, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !650, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !607, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !607, file: !121, line: 256, baseType: !587, size: 64, offset: 704)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !607, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !607, file: !121, line: 300, baseType: !665, size: 96, offset: 800)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !121, line: 149, size: 96, elements: !666)
!666 = !{!667, !668, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !665, file: !121, line: 153, baseType: !22, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !665, file: !121, line: 162, baseType: !193, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !665, file: !121, line: 168, baseType: !193, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !607, file: !121, line: 325, baseType: !671, size: 32, offset: 896)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, elements: !673)
!673 = !{!674, !675, !676}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !672, file: !68, line: 5074, baseType: !570, size: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !672, file: !68, line: 5075, baseType: !587, size: 64, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !672, file: !68, line: 5076, baseType: !677, size: 8, offset: 160)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !483, line: 43, size: 8, elements: !678)
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !677, file: !483, line: 75, baseType: !113, size: 8)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !607, file: !121, line: 343, baseType: !681, size: 64, offset: 928)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !681, file: !174, line: 63, baseType: !40, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !681, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !584, file: !68, line: 2727, baseType: !40, size: 32, offset: 96)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !584, file: !68, line: 2730, baseType: !55, size: 32, offset: 128)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !689, file: !696, line: 21, type: !282, isLocal: true, isDefinition: true)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !691, globals: !695, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!691 = !{!692, !55, !39}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !694, line: 22, baseType: !55)
!694 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!695 = !{!687}
!696 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !699, file: !704, line: 13, type: !721, isLocal: true, isDefinition: true)
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !701, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!701 = !{!702, !697}
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "mpu_config", scope: !699, file: !704, line: 37, type: !705, isLocal: false, isDefinition: true)
!704 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !537, line: 41, size: 64, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !706, file: !537, line: 43, baseType: !40, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !706, file: !537, line: 45, baseType: !710, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !537, line: 27, size: 96, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !712, file: !537, line: 29, baseType: !40, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !712, file: !537, line: 31, baseType: !319, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !712, file: !537, line: 37, baseType: !717, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !504, line: 146, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !504, line: 141, size: 32, elements: !719)
!719 = !{!720}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !718, file: !504, line: 143, baseType: !40, size: 32)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 192, elements: !138)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !724, file: !808, line: 72, type: !892, isLocal: true, isDefinition: true)
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !726, retainedTypes: !794, globals: !805, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!726 = !{!209, !727}
!727 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !292, line: 65, baseType: !55, size: 32, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!729 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!730 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!731 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!732 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!733 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!734 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!735 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!736 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!737 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!738 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!739 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!740 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!741 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!742 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!743 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!744 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!745 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!746 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!747 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!748 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!749 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!750 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!751 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!752 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!753 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!754 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!755 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!756 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!757 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!758 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!759 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!760 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!761 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!762 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!763 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!764 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!765 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!766 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!767 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!768 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!769 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!770 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!771 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!772 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!773 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!774 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!775 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!776 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!777 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!778 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!779 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!780 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!781 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!782 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!783 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!784 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!785 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!786 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!787 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!788 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!789 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!790 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!791 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!792 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!793 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!794 = !{!193, !55, !39, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !292, line: 244, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !292, line: 236, size: 192, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !797, file: !292, line: 238, baseType: !296, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !797, file: !292, line: 239, baseType: !296, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !797, file: !292, line: 240, baseType: !296, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !797, file: !292, line: 241, baseType: !296, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !797, file: !292, line: 242, baseType: !296, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !797, file: !292, line: 243, baseType: !296, size: 32, offset: 160)
!805 = !{!806, !812, !828, !839, !856, !722, !858, !872, !874, !876, !878, !880, !882, !884, !886, !888, !890}
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !724, file: !808, line: 424, type: !809, isLocal: false, isDefinition: true, align: 16)
!808 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 64, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 4)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !724, file: !808, line: 424, type: !814, isLocal: false, isDefinition: true, align: 32)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !316, line: 378, size: 192, elements: !816)
!816 = !{!817, !818, !819, !820, !826, !827}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !815, file: !316, line: 380, baseType: !319, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !815, file: !316, line: 382, baseType: !13, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !815, file: !316, line: 384, baseType: !13, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !815, file: !316, line: 386, baseType: !821, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !316, line: 351, size: 16, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !822, file: !316, line: 359, baseType: !143, size: 8)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !822, file: !316, line: 364, baseType: !329, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !815, file: !316, line: 388, baseType: !39, size: 32, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !815, file: !316, line: 396, baseType: !332, size: 32, offset: 160)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !724, file: !808, line: 424, type: !830, isLocal: true, isDefinition: true, align: 32)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !307, line: 51, size: 64, elements: !832)
!832 = !{!833, !838}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !831, file: !307, line: 60, baseType: !834, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DISubroutineType(types: !836)
!836 = !{!55, !837}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !831, file: !307, line: 65, baseType: !837, size: 32, offset: 32)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "exti_data", scope: !724, file: !808, line: 423, type: !841, isLocal: true, isDefinition: true)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !808, line: 107, size: 1472, elements: !842)
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !841, file: !808, line: 109, baseType: !844, size: 1472)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 1472, elements: !854)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !808, line: 101, size: 64, elements: !846)
!846 = !{!847, !853}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !845, file: !808, line: 102, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !849, line: 63, baseType: !850)
!849 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !55, !39}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !845, file: !808, line: 103, baseType: !39, size: 32, offset: 32)
!854 = !{!855}
!855 = !DISubrange(count: 23)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_39", scope: !724, file: !808, line: 424, type: !822, isLocal: true, isDefinition: true, align: 8)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !860, file: !808, line: 493, type: !865, isLocal: true, isDefinition: true, align: 32)
!860 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !808, file: !808, line: 460, type: !861, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !724, retainedNodes: !863)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !837}
!863 = !{!864}
!864 = !DILocalVariable(name: "dev", arg: 1, scope: !860, file: !808, line: 460, type: !837)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !866)
!866 = !{!867, !869, !870, !871}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !865, file: !10, line: 55, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !55)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !865, file: !10, line: 57, baseType: !868, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !865, file: !10, line: 59, baseType: !39, size: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !865, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !860, file: !808, line: 497, type: !865, isLocal: true, isDefinition: true, align: 32)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !860, file: !808, line: 507, type: !865, isLocal: true, isDefinition: true, align: 32)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !860, file: !808, line: 512, type: !865, isLocal: true, isDefinition: true, align: 32)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !860, file: !808, line: 516, type: !865, isLocal: true, isDefinition: true, align: 32)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !860, file: !808, line: 523, type: !865, isLocal: true, isDefinition: true, align: 32)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !860, file: !808, line: 527, type: !865, isLocal: true, isDefinition: true, align: 32)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !860, file: !808, line: 581, type: !865, isLocal: true, isDefinition: true, align: 32)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !860, file: !808, line: 586, type: !865, isLocal: true, isDefinition: true, align: 32)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !860, file: !808, line: 591, type: !865, isLocal: true, isDefinition: true, align: 32)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !860, file: !808, line: 595, type: !865, isLocal: true, isDefinition: true, align: 32)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 736, elements: !854)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !292, line: 134, baseType: !727)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !897, file: !902, line: 22, type: !924, isLocal: false, isDefinition: true, align: 16)
!897 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !899, splitDebugInlining: false, nameTableKind: None)
!898 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!899 = !{!900, !895, !906, !908, !910, !912, !914, !916, !918, !920, !922}
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !897, file: !902, line: 17, type: !903, isLocal: false, isDefinition: true, align: 16)
!902 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 192, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 12)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !897, file: !902, line: 29, type: !809, isLocal: false, isDefinition: true, align: 16)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !897, file: !902, line: 36, type: !809, isLocal: false, isDefinition: true, align: 16)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !897, file: !902, line: 43, type: !809, isLocal: false, isDefinition: true, align: 16)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !897, file: !902, line: 50, type: !809, isLocal: false, isDefinition: true, align: 16)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !897, file: !902, line: 57, type: !809, isLocal: false, isDefinition: true, align: 16)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !897, file: !902, line: 64, type: !809, isLocal: false, isDefinition: true, align: 16)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !897, file: !902, line: 71, type: !809, isLocal: false, isDefinition: true, align: 16)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !897, file: !902, line: 78, type: !809, isLocal: false, isDefinition: true, align: 16)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !897, file: !902, line: 85, type: !809, isLocal: false, isDefinition: true, align: 16)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 48, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 3)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !929, file: !993, line: 398, type: !1026, isLocal: true, isDefinition: true)
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !931, retainedTypes: !944, globals: !990, splitDebugInlining: false, nameTableKind: None)
!930 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/cpp_synchronization")
!931 = !{!932, !209, !937}
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !933, line: 197, baseType: !41, size: 32, elements: !934)
!933 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!934 = !{!935, !936}
!935 = !DIEnumerator(name: "SUCCESS", value: 0)
!936 = !DIEnumerator(name: "ERROR", value: 1)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !938, line: 44, baseType: !41, size: 32, elements: !939)
!938 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!939 = !{!940, !941, !942, !943}
!940 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!941 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!942 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!943 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!944 = !{!39, !55, !40, !945, !983, !989}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !292, line: 370, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !292, line: 336, size: 1152, elements: !948)
!948 = !{!949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !982}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !947, file: !292, line: 338, baseType: !296, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !947, file: !292, line: 339, baseType: !296, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !947, file: !292, line: 340, baseType: !296, size: 32, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !947, file: !292, line: 341, baseType: !296, size: 32, offset: 96)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !947, file: !292, line: 342, baseType: !296, size: 32, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !947, file: !292, line: 343, baseType: !296, size: 32, offset: 160)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !947, file: !292, line: 344, baseType: !296, size: 32, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !947, file: !292, line: 345, baseType: !40, size: 32, offset: 224)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !947, file: !292, line: 346, baseType: !296, size: 32, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !947, file: !292, line: 347, baseType: !296, size: 32, offset: 288)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !947, file: !292, line: 348, baseType: !960, size: 64, offset: 320)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !138)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !947, file: !292, line: 349, baseType: !296, size: 32, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !947, file: !292, line: 350, baseType: !296, size: 32, offset: 416)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !947, file: !292, line: 351, baseType: !296, size: 32, offset: 448)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !947, file: !292, line: 352, baseType: !40, size: 32, offset: 480)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !947, file: !292, line: 353, baseType: !296, size: 32, offset: 512)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !947, file: !292, line: 354, baseType: !296, size: 32, offset: 544)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !947, file: !292, line: 355, baseType: !960, size: 64, offset: 576)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !947, file: !292, line: 356, baseType: !296, size: 32, offset: 640)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !947, file: !292, line: 357, baseType: !296, size: 32, offset: 672)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !947, file: !292, line: 358, baseType: !296, size: 32, offset: 704)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !947, file: !292, line: 359, baseType: !40, size: 32, offset: 736)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !947, file: !292, line: 360, baseType: !296, size: 32, offset: 768)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !947, file: !292, line: 361, baseType: !296, size: 32, offset: 800)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !947, file: !292, line: 362, baseType: !960, size: 64, offset: 832)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !947, file: !292, line: 363, baseType: !296, size: 32, offset: 896)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !947, file: !292, line: 364, baseType: !296, size: 32, offset: 928)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !947, file: !292, line: 365, baseType: !960, size: 64, offset: 960)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !947, file: !292, line: 366, baseType: !296, size: 32, offset: 1024)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !947, file: !292, line: 367, baseType: !296, size: 32, offset: 1056)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !947, file: !292, line: 368, baseType: !981, size: 32, offset: 1088)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 32, elements: !508)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !947, file: !292, line: 369, baseType: !296, size: 32, offset: 1120)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !985, line: 343, size: 64, elements: !986)
!985 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !984, file: !985, line: 344, baseType: !40, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !984, file: !985, line: 345, baseType: !40, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!990 = !{!991, !997, !1013, !1024, !927}
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !929, file: !993, line: 752, type: !994, isLocal: false, isDefinition: true, align: 16)
