; ModuleID = 'build/96b_stm32_sensor_mez/dyn_channel/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type { i32 }
%struct.zbus_channel = type { i8*, i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/dyn_channel/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/dyn_channel")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 109, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/dyn_channel")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 6208, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 97)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 3104, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_consumer_sub", scope: !27, file: !117, line: 13, type: !126, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !114, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/dyn_channel/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/dyn_channel")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !111, !112}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !113)
!113 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!114 = !{!25, !115, !295, !326, !330, !335, !340}
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "consumer_sub", scope: !27, file: !117, line: 13, type: !118, isLocal: false, isDefinition: true, align: 32)
!117 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !119, line: 85, size: 96, elements: !120)
!119 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121, !123, !168}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !118, file: !119, line: 91, baseType: !122, size: 8)
!122 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !118, file: !119, line: 93, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !127, line: 4204, size: 352, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !150, !155, !158, !159, !161, !162, !163, !164, !165}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !126, file: !127, line: 4206, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 233, baseType: !132)
!131 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 231, size: 64, elements: !133)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !132, file: !131, line: 232, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !136, line: 48, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !136, line: 37, size: 64, elements: !138)
!138 = !{!139, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !137, file: !136, line: 38, baseType: !140, size: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !136, line: 38, size: 32, elements: !141)
!141 = !{!142, !144}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !140, file: !136, line: 39, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !136, line: 40, baseType: !143, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, scope: !137, file: !136, line: 42, baseType: !146, size: 32, offset: 32)
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !136, line: 42, size: 32, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !146, file: !136, line: 43, baseType: !143, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !146, file: !136, line: 44, baseType: !143, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !126, file: !127, line: 4208, baseType: !151, size: 32, offset: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !152, line: 43, size: 32, elements: !153)
!152 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !151, file: !152, line: 52, baseType: !22, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !126, file: !127, line: 4210, baseType: !156, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !157, line: 214, baseType: !32)
!157 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !126, file: !127, line: 4212, baseType: !111, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !126, file: !127, line: 4214, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !126, file: !127, line: 4216, baseType: !160, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !126, file: !127, line: 4218, baseType: !160, size: 32, offset: 224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !126, file: !127, line: 4220, baseType: !160, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !126, file: !127, line: 4222, baseType: !111, size: 32, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !127, line: 4227, baseType: !166, size: 8, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !167)
!167 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !118, file: !119, line: 96, baseType: !169, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !119, line: 29, size: 224, elements: !176)
!176 = !{!177, !179, !183, !185, !186, !191, !290}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !119, line: 32, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !175, file: !119, line: 35, baseType: !180, size: 16, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !182)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !175, file: !119, line: 40, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !175, file: !119, line: 45, baseType: !184, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !175, file: !119, line: 51, baseType: !187, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!122, !13, !156}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !175, file: !119, line: 56, baseType: !192, size: 32, offset: 160)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !127, line: 2720, size: 160, elements: !194)
!194 = !{!195, !196, !288, !289}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !193, file: !127, line: 2722, baseType: !130, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !193, file: !127, line: 2724, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !199, line: 245, size: 1024, elements: !200)
!199 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = !{!201, !246, !259, !260, !261, !262, !268, !283}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !198, file: !199, line: 247, baseType: !202, size: 384)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !199, line: 57, size: 384, elements: !203)
!203 = !{!204, !218, !220, !221, !222, !233, !234, !235}
!204 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !199, line: 60, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !202, file: !199, line: 60, size: 64, elements: !206)
!206 = !{!207, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !205, file: !199, line: 61, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !136, line: 49, baseType: !137)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !205, file: !199, line: 62, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !211, line: 49, size: 64, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !210, file: !211, line: 50, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 64, elements: !216)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!216 = !{!217}
!217 = !DISubrange(count: 2)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !202, file: !199, line: 68, baseType: !219, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !202, file: !199, line: 71, baseType: !166, size: 8, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !202, file: !199, line: 74, baseType: !166, size: 8, offset: 104)
!222 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !199, line: 90, baseType: !223, size: 16, offset: 112)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !202, file: !199, line: 90, size: 16, elements: !224)
!224 = !{!225, !232}
!225 = !DIDerivedType(tag: DW_TAG_member, scope: !223, file: !199, line: 91, baseType: !226, size: 16)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !223, file: !199, line: 91, size: 16, elements: !227)
!227 = !{!228, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !226, file: !199, line: 96, baseType: !229, size: 8)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !230)
!230 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !226, file: !199, line: 97, baseType: !166, size: 8, offset: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !223, file: !199, line: 100, baseType: !181, size: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !202, file: !199, line: 107, baseType: !111, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !202, file: !199, line: 127, baseType: !102, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !202, file: !199, line: 131, baseType: !236, size: 192, offset: 192)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 244, size: 192, elements: !237)
!237 = !{!238, !239, !245}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !236, file: !131, line: 245, baseType: !208, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !236, file: !131, line: 246, baseType: !240, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 242, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !236, file: !131, line: 249, baseType: !106, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !198, file: !199, line: 250, baseType: !247, size: 288, offset: 384)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !248, line: 25, size: 288, elements: !249)
!248 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !247, file: !248, line: 26, baseType: !111, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !247, file: !248, line: 27, baseType: !111, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !247, file: !248, line: 28, baseType: !111, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !247, file: !248, line: 29, baseType: !111, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !247, file: !248, line: 30, baseType: !111, size: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !247, file: !248, line: 31, baseType: !111, size: 32, offset: 160)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !247, file: !248, line: 32, baseType: !111, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !247, file: !248, line: 33, baseType: !111, size: 32, offset: 224)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !247, file: !248, line: 34, baseType: !111, size: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !198, file: !199, line: 253, baseType: !102, size: 32, offset: 672)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !198, file: !199, line: 256, baseType: !130, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !198, file: !199, line: 294, baseType: !103, size: 32, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !198, file: !199, line: 300, baseType: !263, size: 96, offset: 800)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !199, line: 149, size: 96, elements: !264)
!264 = !{!265, !266, !267}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !263, file: !199, line: 153, baseType: !22, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !263, file: !199, line: 162, baseType: !156, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !263, file: !199, line: 168, baseType: !156, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !198, file: !199, line: 325, baseType: !269, size: 32, offset: 896)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !127, line: 5073, size: 192, elements: !271)
!271 = !{!272, !281, !282}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !270, file: !127, line: 5074, baseType: !273, size: 96)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !274, line: 56, size: 96, elements: !275)
!274 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!275 = !{!276, !279, !280}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !273, file: !274, line: 57, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !274, line: 57, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !273, file: !274, line: 58, baseType: !102, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !273, file: !274, line: 59, baseType: !156, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !270, file: !127, line: 5075, baseType: !130, size: 64, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !270, file: !127, line: 5076, baseType: !151, size: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !198, file: !199, line: 343, baseType: !284, size: 64, offset: 928)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !248, line: 60, size: 64, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !284, file: !248, line: 63, baseType: !111, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !284, file: !248, line: 66, baseType: !111, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !193, file: !127, line: 2727, baseType: !111, size: 32, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !193, file: !127, line: 2730, baseType: !103, size: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !175, file: !119, line: 67, baseType: !291, size: 32, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "_k_thread_data_consumer_thread_id", scope: !27, file: !117, line: 44, type: !297, isLocal: false, isDefinition: true, align: 32)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !127, line: 620, size: 384, elements: !298)
!298 = !{!299, !300, !308, !309, !314, !315, !316, !317, !318, !319, !321, !325}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !297, file: !127, line: 621, baseType: !197, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !297, file: !127, line: 622, baseType: !301, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !303, line: 44, baseType: !304)
!303 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !305, line: 47, size: 8, elements: !306)
!305 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !305, line: 48, baseType: !110, size: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !297, file: !127, line: 623, baseType: !32, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !297, file: !127, line: 624, baseType: !310, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !303, line: 46, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !102, !102, !102}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !297, file: !127, line: 625, baseType: !102, size: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !297, file: !127, line: 626, baseType: !102, size: 32, offset: 160)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !297, file: !127, line: 627, baseType: !102, size: 32, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !297, file: !127, line: 628, baseType: !103, size: 32, offset: 224)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !297, file: !127, line: 629, baseType: !111, size: 32, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !297, file: !127, line: 630, baseType: !320, size: 32, offset: 288)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !297, file: !127, line: 631, baseType: !322, size: 32, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{null}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !297, file: !127, line: 632, baseType: !108, size: 32, offset: 352)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "consumer_thread_id", scope: !27, file: !117, line: 44, type: !328, isLocal: false, isDefinition: true)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !199, line: 347, baseType: !197)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_consumer_sub", scope: !27, file: !117, line: 13, type: !332, isLocal: true, isDefinition: true, align: 32)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 128, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 16)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "_k_thread_stack_consumer_thread_id", scope: !27, file: !117, line: 44, type: !337, isLocal: false, isDefinition: true, align: 512)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 8704, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 1088)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "_k_thread_obj_consumer_thread_id", scope: !27, file: !117, line: 44, type: !198, isLocal: false, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "_zbus_mutex_pkt_chan", scope: !344, file: !350, line: 15, type: !361, isLocal: true, isDefinition: true, align: 32)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !345, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !346, globals: !347, splitDebugInlining: false, nameTableKind: None)
!345 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/dyn_channel/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/dyn_channel")
!346 = !{!102, !103}
!347 = !{!342, !348, !498, !500, !502, !504, !506, !508, !510, !512, !519, !522, !529, !534, !539, !541, !543}
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "pkt_chan", scope: !344, file: !350, line: 15, type: !351, isLocal: false, isDefinition: true, align: 32)
!350 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !119, line: 29, size: 224, elements: !353)
!353 = !{!354, !355, !356, !357, !358, !359, !469}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !352, file: !119, line: 32, baseType: !178, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !352, file: !119, line: 35, baseType: !180, size: 16, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !352, file: !119, line: 40, baseType: !184, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !352, file: !119, line: 45, baseType: !184, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !352, file: !119, line: 51, baseType: !187, size: 32, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !352, file: !119, line: 56, baseType: !360, size: 32, offset: 160)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !127, line: 2720, size: 160, elements: !362)
!362 = !{!363, !382, !467, !468}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !361, file: !127, line: 2722, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 233, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 231, size: 64, elements: !366)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !365, file: !131, line: 232, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !136, line: 48, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !136, line: 37, size: 64, elements: !370)
!370 = !{!371, !377}
!371 = !DIDerivedType(tag: DW_TAG_member, scope: !369, file: !136, line: 38, baseType: !372, size: 32)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !369, file: !136, line: 38, size: 32, elements: !373)
!373 = !{!374, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !372, file: !136, line: 39, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !136, line: 40, baseType: !375, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, scope: !369, file: !136, line: 42, baseType: !378, size: 32, offset: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !369, file: !136, line: 42, size: 32, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !378, file: !136, line: 43, baseType: !375, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !378, file: !136, line: 44, baseType: !375, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !361, file: !127, line: 2724, baseType: !383, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !199, line: 245, size: 1024, elements: !385)
!385 = !{!386, !426, !438, !439, !440, !441, !447, !462}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !384, file: !199, line: 247, baseType: !387, size: 384)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !199, line: 57, size: 384, elements: !388)
!388 = !{!389, !400, !402, !403, !404, !413, !414, !415}
!389 = !DIDerivedType(tag: DW_TAG_member, scope: !387, file: !199, line: 60, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !387, file: !199, line: 60, size: 64, elements: !391)
!391 = !{!392, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !390, file: !199, line: 61, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !136, line: 49, baseType: !369)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !390, file: !199, line: 62, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !211, line: 49, size: 64, elements: !396)
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !395, file: !211, line: 50, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 64, elements: !216)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !387, file: !199, line: 68, baseType: !401, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !387, file: !199, line: 71, baseType: !166, size: 8, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !387, file: !199, line: 74, baseType: !166, size: 8, offset: 104)
!404 = !DIDerivedType(tag: DW_TAG_member, scope: !387, file: !199, line: 90, baseType: !405, size: 16, offset: 112)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !387, file: !199, line: 90, size: 16, elements: !406)
!406 = !{!407, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, scope: !405, file: !199, line: 91, baseType: !408, size: 16)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !405, file: !199, line: 91, size: 16, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !408, file: !199, line: 96, baseType: !229, size: 8)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !408, file: !199, line: 97, baseType: !166, size: 8, offset: 8)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !405, file: !199, line: 100, baseType: !181, size: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !387, file: !199, line: 107, baseType: !111, size: 32, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !387, file: !199, line: 127, baseType: !102, size: 32, offset: 160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !387, file: !199, line: 131, baseType: !416, size: 192, offset: 192)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 244, size: 192, elements: !417)
!417 = !{!418, !419, !425}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !416, file: !131, line: 245, baseType: !393, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !416, file: !131, line: 246, baseType: !420, size: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 242, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !416, file: !131, line: 249, baseType: !106, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !384, file: !199, line: 250, baseType: !427, size: 288, offset: 384)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !248, line: 25, size: 288, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !427, file: !248, line: 26, baseType: !111, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !427, file: !248, line: 27, baseType: !111, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !427, file: !248, line: 28, baseType: !111, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !427, file: !248, line: 29, baseType: !111, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !427, file: !248, line: 30, baseType: !111, size: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !427, file: !248, line: 31, baseType: !111, size: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !427, file: !248, line: 32, baseType: !111, size: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !427, file: !248, line: 33, baseType: !111, size: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !427, file: !248, line: 34, baseType: !111, size: 32, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !384, file: !199, line: 253, baseType: !102, size: 32, offset: 672)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !384, file: !199, line: 256, baseType: !364, size: 64, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !384, file: !199, line: 294, baseType: !103, size: 32, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !384, file: !199, line: 300, baseType: !442, size: 96, offset: 800)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !199, line: 149, size: 96, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !442, file: !199, line: 153, baseType: !22, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !442, file: !199, line: 162, baseType: !156, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !442, file: !199, line: 168, baseType: !156, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !384, file: !199, line: 325, baseType: !448, size: 32, offset: 896)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !127, line: 5073, size: 192, elements: !450)
!450 = !{!451, !457, !458}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !449, file: !127, line: 5074, baseType: !452, size: 96)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !274, line: 56, size: 96, elements: !453)
!453 = !{!454, !455, !456}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !452, file: !274, line: 57, baseType: !277, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !452, file: !274, line: 58, baseType: !102, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !452, file: !274, line: 59, baseType: !156, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !449, file: !127, line: 5075, baseType: !364, size: 64, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !449, file: !127, line: 5076, baseType: !459, size: 32, offset: 160)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !152, line: 43, size: 32, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !459, file: !152, line: 52, baseType: !22, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !384, file: !199, line: 343, baseType: !463, size: 64, offset: 928)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !248, line: 60, size: 64, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !463, file: !248, line: 63, baseType: !111, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !463, file: !248, line: 66, baseType: !111, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !361, file: !127, line: 2727, baseType: !111, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !361, file: !127, line: 2730, baseType: !103, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !352, file: !119, line: 67, baseType: !470, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !119, line: 85, size: 96, elements: !475)
!475 = !{!476, !477, !492}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !474, file: !119, line: 91, baseType: !122, size: 8)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !474, file: !119, line: 93, baseType: !478, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !127, line: 4204, size: 352, elements: !481)
!481 = !{!482, !483, !484, !485, !486, !487, !488, !489, !490, !491}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !480, file: !127, line: 4206, baseType: !364, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !480, file: !127, line: 4208, baseType: !459, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !480, file: !127, line: 4210, baseType: !156, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !480, file: !127, line: 4212, baseType: !111, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !480, file: !127, line: 4214, baseType: !160, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !480, file: !127, line: 4216, baseType: !160, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !480, file: !127, line: 4218, baseType: !160, size: 32, offset: 224)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !480, file: !127, line: 4220, baseType: !160, size: 32, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !480, file: !127, line: 4222, baseType: !111, size: 32, offset: 288)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !480, file: !127, line: 4227, baseType: !166, size: 8, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !474, file: !119, line: 96, baseType: !493, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !344, file: !350, line: 24, type: !361, isLocal: true, isDefinition: true, align: 32)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "version_chan", scope: !344, file: !350, line: 24, type: !351, isLocal: false, isDefinition: true, align: 32)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "_zbus_mutex_data_ready_chan", scope: !344, file: !350, line: 33, type: !361, isLocal: true, isDefinition: true, align: 32)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "data_ready_chan", scope: !344, file: !350, line: 33, type: !351, isLocal: false, isDefinition: true, align: 32)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "_zbus_mutex_ack", scope: !344, file: !350, line: 42, type: !361, isLocal: true, isDefinition: true, align: 32)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "ack", scope: !344, file: !350, line: 42, type: !351, isLocal: false, isDefinition: true, align: 32)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "filter_lis", scope: !344, file: !350, line: 73, type: !474, isLocal: false, isDefinition: true, align: 32)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "_zbus_message_pkt_chan", scope: !344, file: !350, line: 15, type: !514, isLocal: true, isDefinition: true)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_data_msg", file: !515, line: 16, size: 64, elements: !516)
!515 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !514, file: !515, line: 17, baseType: !102, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !514, file: !515, line: 18, baseType: !156, size: 32, offset: 32)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "_zbus_observers_pkt_chan", scope: !344, file: !350, line: 15, type: !521, isLocal: true, isDefinition: true)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 64, elements: !216)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !344, file: !350, line: 24, type: !524, isLocal: true, isDefinition: true)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !515, line: 10, size: 32, elements: !525)
!525 = !{!526, !527, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !524, file: !515, line: 11, baseType: !166, size: 8)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !524, file: !515, line: 12, baseType: !166, size: 8, offset: 8)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !524, file: !515, line: 13, baseType: !181, size: 16, offset: 16)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !344, file: !350, line: 24, type: !531, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 32, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 1)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "_zbus_message_data_ready_chan", scope: !344, file: !350, line: 33, type: !536, isLocal: true, isDefinition: true)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ack_msg", file: !515, line: 21, size: 8, elements: !537)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !536, file: !515, line: 22, baseType: !166, size: 8)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "_zbus_observers_data_ready_chan", scope: !344, file: !350, line: 33, type: !521, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "_zbus_message_ack", scope: !344, file: !350, line: 42, type: !536, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "_zbus_observers_ack", scope: !344, file: !350, line: 42, type: !521, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_producer_sub", scope: !547, file: !554, line: 13, type: !561, isLocal: false, isDefinition: true, align: 32)
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !549, globals: !551, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/dyn_channel/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/dyn_channel")
!549 = !{!102, !103, !550, !104, !111, !112}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!551 = !{!545, !552, !702, !723, !727, !729, !732}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "producer_sub", scope: !547, file: !554, line: 13, type: !555, isLocal: false, isDefinition: true, align: 32)
!554 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !119, line: 85, size: 96, elements: !556)
!556 = !{!557, !558, !594}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !555, file: !119, line: 91, baseType: !122, size: 8)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !555, file: !119, line: 93, baseType: !559, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !127, line: 4204, size: 352, elements: !562)
!562 = !{!563, !582, !586, !587, !588, !589, !590, !591, !592, !593}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !561, file: !127, line: 4206, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 233, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 231, size: 64, elements: !566)
!566 = !{!567}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !565, file: !131, line: 232, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !136, line: 48, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !136, line: 37, size: 64, elements: !570)
!570 = !{!571, !577}
!571 = !DIDerivedType(tag: DW_TAG_member, scope: !569, file: !136, line: 38, baseType: !572, size: 32)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !569, file: !136, line: 38, size: 32, elements: !573)
!573 = !{!574, !576}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !572, file: !136, line: 39, baseType: !575, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !572, file: !136, line: 40, baseType: !575, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, scope: !569, file: !136, line: 42, baseType: !578, size: 32, offset: 32)
!578 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !569, file: !136, line: 42, size: 32, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !578, file: !136, line: 43, baseType: !575, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !578, file: !136, line: 44, baseType: !575, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !561, file: !127, line: 4208, baseType: !583, size: 32, offset: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !152, line: 43, size: 32, elements: !584)
!584 = !{!585}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !583, file: !152, line: 52, baseType: !22, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !561, file: !127, line: 4210, baseType: !156, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !561, file: !127, line: 4212, baseType: !111, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !561, file: !127, line: 4214, baseType: !160, size: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !561, file: !127, line: 4216, baseType: !160, size: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !561, file: !127, line: 4218, baseType: !160, size: 32, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !561, file: !127, line: 4220, baseType: !160, size: 32, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !561, file: !127, line: 4222, baseType: !111, size: 32, offset: 288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !561, file: !127, line: 4227, baseType: !166, size: 8, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !555, file: !119, line: 96, baseType: !595, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !119, line: 29, size: 224, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !697}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !601, file: !119, line: 32, baseType: !178, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !601, file: !119, line: 35, baseType: !180, size: 16, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !601, file: !119, line: 40, baseType: !184, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !601, file: !119, line: 45, baseType: !184, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !601, file: !119, line: 51, baseType: !187, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !601, file: !119, line: 56, baseType: !609, size: 32, offset: 160)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !127, line: 2720, size: 160, elements: !611)
!611 = !{!612, !613, !695, !696}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !610, file: !127, line: 2722, baseType: !564, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !610, file: !127, line: 2724, baseType: !614, size: 32, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !199, line: 245, size: 1024, elements: !616)
!616 = !{!617, !657, !669, !670, !671, !672, !678, !690}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !615, file: !199, line: 247, baseType: !618, size: 384)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !199, line: 57, size: 384, elements: !619)
!619 = !{!620, !631, !633, !634, !635, !644, !645, !646}
!620 = !DIDerivedType(tag: DW_TAG_member, scope: !618, file: !199, line: 60, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !618, file: !199, line: 60, size: 64, elements: !622)
!622 = !{!623, !625}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !621, file: !199, line: 61, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !136, line: 49, baseType: !569)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !621, file: !199, line: 62, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !211, line: 49, size: 64, elements: !627)
!627 = !{!628}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !626, file: !211, line: 50, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 64, elements: !216)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !618, file: !199, line: 68, baseType: !632, size: 32, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !618, file: !199, line: 71, baseType: !166, size: 8, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !618, file: !199, line: 74, baseType: !166, size: 8, offset: 104)
!635 = !DIDerivedType(tag: DW_TAG_member, scope: !618, file: !199, line: 90, baseType: !636, size: 16, offset: 112)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !618, file: !199, line: 90, size: 16, elements: !637)
!637 = !{!638, !643}
!638 = !DIDerivedType(tag: DW_TAG_member, scope: !636, file: !199, line: 91, baseType: !639, size: 16)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !636, file: !199, line: 91, size: 16, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !639, file: !199, line: 96, baseType: !229, size: 8)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !639, file: !199, line: 97, baseType: !166, size: 8, offset: 8)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !636, file: !199, line: 100, baseType: !181, size: 16)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !618, file: !199, line: 107, baseType: !111, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !618, file: !199, line: 127, baseType: !102, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !618, file: !199, line: 131, baseType: !647, size: 192, offset: 192)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 244, size: 192, elements: !648)
!648 = !{!649, !650, !656}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !647, file: !131, line: 245, baseType: !624, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !647, file: !131, line: 246, baseType: !651, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 242, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !647, file: !131, line: 249, baseType: !106, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !615, file: !199, line: 250, baseType: !658, size: 288, offset: 384)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !248, line: 25, size: 288, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !658, file: !248, line: 26, baseType: !111, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !658, file: !248, line: 27, baseType: !111, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !658, file: !248, line: 28, baseType: !111, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !658, file: !248, line: 29, baseType: !111, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !658, file: !248, line: 30, baseType: !111, size: 32, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !658, file: !248, line: 31, baseType: !111, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !658, file: !248, line: 32, baseType: !111, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !658, file: !248, line: 33, baseType: !111, size: 32, offset: 224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !658, file: !248, line: 34, baseType: !111, size: 32, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !615, file: !199, line: 253, baseType: !102, size: 32, offset: 672)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !615, file: !199, line: 256, baseType: !564, size: 64, offset: 704)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !615, file: !199, line: 294, baseType: !103, size: 32, offset: 768)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !615, file: !199, line: 300, baseType: !673, size: 96, offset: 800)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !199, line: 149, size: 96, elements: !674)
!674 = !{!675, !676, !677}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !673, file: !199, line: 153, baseType: !22, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !673, file: !199, line: 162, baseType: !156, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !673, file: !199, line: 168, baseType: !156, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !615, file: !199, line: 325, baseType: !679, size: 32, offset: 896)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !127, line: 5073, size: 192, elements: !681)
!681 = !{!682, !688, !689}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !680, file: !127, line: 5074, baseType: !683, size: 96)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !274, line: 56, size: 96, elements: !684)
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !683, file: !274, line: 57, baseType: !277, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !683, file: !274, line: 58, baseType: !102, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !683, file: !274, line: 59, baseType: !156, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !680, file: !127, line: 5075, baseType: !564, size: 64, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !680, file: !127, line: 5076, baseType: !583, size: 32, offset: 160)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !615, file: !199, line: 343, baseType: !691, size: 64, offset: 928)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !248, line: 60, size: 64, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !691, file: !248, line: 63, baseType: !111, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !691, file: !248, line: 66, baseType: !111, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !610, file: !127, line: 2727, baseType: !111, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !610, file: !127, line: 2730, baseType: !103, size: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !601, file: !119, line: 67, baseType: !698, size: 32, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "_k_thread_data_producer_thread_id", scope: !547, file: !554, line: 40, type: !704, isLocal: false, isDefinition: true, align: 32)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !127, line: 620, size: 384, elements: !705)
!705 = !{!706, !707, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !704, file: !127, line: 621, baseType: !614, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !704, file: !127, line: 622, baseType: !708, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !303, line: 44, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !305, line: 47, size: 8, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !710, file: !305, line: 48, baseType: !110, size: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !704, file: !127, line: 623, baseType: !32, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !704, file: !127, line: 624, baseType: !310, size: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !704, file: !127, line: 625, baseType: !102, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !704, file: !127, line: 626, baseType: !102, size: 32, offset: 160)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !704, file: !127, line: 627, baseType: !102, size: 32, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !704, file: !127, line: 628, baseType: !103, size: 32, offset: 224)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !704, file: !127, line: 629, baseType: !111, size: 32, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !704, file: !127, line: 630, baseType: !320, size: 32, offset: 288)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !704, file: !127, line: 631, baseType: !322, size: 32, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !704, file: !127, line: 632, baseType: !108, size: 32, offset: 352)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "producer_thread_id", scope: !547, file: !554, line: 40, type: !725, isLocal: false, isDefinition: true)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !199, line: 347, baseType: !614)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_producer_sub", scope: !547, file: !554, line: 13, type: !332, isLocal: true, isDefinition: true, align: 32)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "_k_thread_stack_producer_thread_id", scope: !547, file: !554, line: 40, type: !731, isLocal: false, isDefinition: true, align: 512)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 8704, elements: !338)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "_k_thread_obj_producer_thread_id", scope: !547, file: !554, line: 40, type: !615, isLocal: false, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !736, file: !750, line: 18, type: !751, isLocal: false, isDefinition: true)
!736 = distinct !DICompileUnit(language: DW_LANG_C99, file: !737, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !738, globals: !749, splitDebugInlining: false, nameTableKind: None)
!737 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/dyn_channel")
!738 = !{!22, !102, !24, !739, !741, !743, !156, !103, !744, !745, !747, !748, !160, !550, !181, !108}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!749 = !{!734}
!750 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !753, line: 16, size: 64, elements: !754)
!753 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !753, line: 17, baseType: !108, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !752, file: !753, line: 18, baseType: !166, size: 8, offset: 32)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "_char_out", scope: !759, file: !762, line: 54, type: !763, isLocal: false, isDefinition: true)
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !346, globals: !761, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/dyn_channel")
!761 = !{!757}
!762 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DISubroutineType(types: !765)
!765 = !{!103, !103}
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !768, file: !785, line: 56, type: !786, isLocal: true, isDefinition: true, align: 32)
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !770, globals: !784, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/dyn_channel")
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !773, line: 407, baseType: !774)
!773 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f446xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !773, line: 398, size: 224, elements: !775)
!775 = !{!776, !778, !779, !780, !781, !782, !783}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !774, file: !773, line: 400, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !111)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !774, file: !773, line: 401, baseType: !777, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !774, file: !773, line: 402, baseType: !777, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !774, file: !773, line: 403, baseType: !777, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !774, file: !773, line: 404, baseType: !777, size: 32, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !774, file: !773, line: 405, baseType: !777, size: 32, offset: 160)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !774, file: !773, line: 406, baseType: !777, size: 32, offset: 192)
!784 = !{!766}
!785 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !788, line: 51, size: 64, elements: !789)
!788 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!789 = !{!790, !815}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !787, file: !788, line: 60, baseType: !791, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DISubroutineType(types: !793)
!793 = !{!103, !794}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !797, line: 378, size: 192, elements: !798)
!797 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !{!799, !800, !801, !802, !808, !809}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !797, line: 380, baseType: !108, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !796, file: !797, line: 382, baseType: !13, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !796, file: !797, line: 384, baseType: !13, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !796, file: !797, line: 386, baseType: !803, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !797, line: 351, size: 16, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !804, file: !797, line: 359, baseType: !166, size: 8)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !804, file: !797, line: 364, baseType: !122, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !796, file: !797, line: 388, baseType: !102, size: 32, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !796, file: !797, line: 396, baseType: !810, size: 32, offset: 160)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !797, line: 43, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !814)
!814 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !787, file: !788, line: 65, baseType: !794, size: 32, offset: 32)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !818, file: !821, line: 71, type: !822, isLocal: true, isDefinition: true, align: 32)
!818 = distinct !DICompileUnit(language: DW_LANG_C99, file: !819, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !820, splitDebugInlining: false, nameTableKind: None)
!819 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/dyn_channel")
!820 = !{!816}
!821 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !788, line: 51, size: 64, elements: !824)
!824 = !{!825, !844}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !823, file: !788, line: 60, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DISubroutineType(types: !828)
!828 = !{!103, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !797, line: 378, size: 192, elements: !832)
!832 = !{!833, !834, !835, !836, !842, !843}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !831, file: !797, line: 380, baseType: !108, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !831, file: !797, line: 382, baseType: !13, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !831, file: !797, line: 384, baseType: !13, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !831, file: !797, line: 386, baseType: !837, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !797, line: 351, size: 16, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !838, file: !797, line: 359, baseType: !166, size: 8)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !838, file: !797, line: 364, baseType: !122, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !831, file: !797, line: 388, baseType: !102, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !831, file: !797, line: 396, baseType: !810, size: 32, offset: 160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !823, file: !788, line: 65, baseType: !829, size: 32, offset: 32)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !847, file: !854, line: 17, type: !980, isLocal: false, isDefinition: true)
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !849, globals: !850, splitDebugInlining: false, nameTableKind: None)
!848 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/dyn_channel")
!849 = !{!156, !103, !111, !102}
!850 = !{!845, !851, !976}
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !853, file: !854, line: 198, type: !964, isLocal: true, isDefinition: true)
!853 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !854, file: !854, line: 175, type: !855, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !847, retainedNodes: !959)
!854 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!855 = !DISubroutineType(types: !856)
!856 = !{null, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !199, line: 245, size: 1024, elements: !859)
!859 = !{!860, !918, !930, !931, !932, !933, !939, !954}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !858, file: !199, line: 247, baseType: !861, size: 384)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !199, line: 57, size: 384, elements: !862)
!862 = !{!863, !887, !894, !895, !896, !905, !906, !907}
!863 = !DIDerivedType(tag: DW_TAG_member, scope: !861, file: !199, line: 60, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !861, file: !199, line: 60, size: 64, elements: !865)
!865 = !{!866, !881}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !864, file: !199, line: 61, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !136, line: 49, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !136, line: 37, size: 64, elements: !869)
!869 = !{!870, !876}
!870 = !DIDerivedType(tag: DW_TAG_member, scope: !868, file: !136, line: 38, baseType: !871, size: 32)
!871 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !868, file: !136, line: 38, size: 32, elements: !872)
!872 = !{!873, !875}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !871, file: !136, line: 39, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !871, file: !136, line: 40, baseType: !874, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, scope: !868, file: !136, line: 42, baseType: !877, size: 32, offset: 32)
!877 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !868, file: !136, line: 42, size: 32, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !877, file: !136, line: 43, baseType: !874, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !877, file: !136, line: 44, baseType: !874, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !864, file: !199, line: 62, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !211, line: 49, size: 64, elements: !883)
!883 = !{!884}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !882, file: !211, line: 50, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !886, size: 64, elements: !216)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !861, file: !199, line: 68, baseType: !888, size: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 233, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 231, size: 64, elements: !891)
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !890, file: !131, line: 232, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !136, line: 48, baseType: !868)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !861, file: !199, line: 71, baseType: !166, size: 8, offset: 96)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !861, file: !199, line: 74, baseType: !166, size: 8, offset: 104)
!896 = !DIDerivedType(tag: DW_TAG_member, scope: !861, file: !199, line: 90, baseType: !897, size: 16, offset: 112)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !861, file: !199, line: 90, size: 16, elements: !898)
!898 = !{!899, !904}
!899 = !DIDerivedType(tag: DW_TAG_member, scope: !897, file: !199, line: 91, baseType: !900, size: 16)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !897, file: !199, line: 91, size: 16, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !900, file: !199, line: 96, baseType: !229, size: 8)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !900, file: !199, line: 97, baseType: !166, size: 8, offset: 8)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !897, file: !199, line: 100, baseType: !181, size: 16)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !861, file: !199, line: 107, baseType: !111, size: 32, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !861, file: !199, line: 127, baseType: !102, size: 32, offset: 160)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !861, file: !199, line: 131, baseType: !908, size: 192, offset: 192)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 244, size: 192, elements: !909)
!909 = !{!910, !911, !917}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !908, file: !131, line: 245, baseType: !867, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !908, file: !131, line: 246, baseType: !912, size: 32, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 242, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !908, file: !131, line: 249, baseType: !106, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !858, file: !199, line: 250, baseType: !919, size: 288, offset: 384)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !248, line: 25, size: 288, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928, !929}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !919, file: !248, line: 26, baseType: !111, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !919, file: !248, line: 27, baseType: !111, size: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !919, file: !248, line: 28, baseType: !111, size: 32, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !919, file: !248, line: 29, baseType: !111, size: 32, offset: 96)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !919, file: !248, line: 30, baseType: !111, size: 32, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !919, file: !248, line: 31, baseType: !111, size: 32, offset: 160)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !919, file: !248, line: 32, baseType: !111, size: 32, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !919, file: !248, line: 33, baseType: !111, size: 32, offset: 224)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !919, file: !248, line: 34, baseType: !111, size: 32, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !858, file: !199, line: 253, baseType: !102, size: 32, offset: 672)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !858, file: !199, line: 256, baseType: !889, size: 64, offset: 704)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !858, file: !199, line: 294, baseType: !103, size: 32, offset: 768)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !858, file: !199, line: 300, baseType: !934, size: 96, offset: 800)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !199, line: 149, size: 96, elements: !935)
!935 = !{!936, !937, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !934, file: !199, line: 153, baseType: !22, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !934, file: !199, line: 162, baseType: !156, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !934, file: !199, line: 168, baseType: !156, size: 32, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !858, file: !199, line: 325, baseType: !940, size: 32, offset: 896)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !127, line: 5073, size: 192, elements: !942)
!942 = !{!943, !949, !950}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !941, file: !127, line: 5074, baseType: !944, size: 96)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !274, line: 56, size: 96, elements: !945)
!945 = !{!946, !947, !948}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !944, file: !274, line: 57, baseType: !277, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !944, file: !274, line: 58, baseType: !102, size: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !944, file: !274, line: 59, baseType: !156, size: 32, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !941, file: !127, line: 5075, baseType: !889, size: 64, offset: 96)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !941, file: !127, line: 5076, baseType: !951, size: 32, offset: 160)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !152, line: 43, size: 32, elements: !952)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !951, file: !152, line: 52, baseType: !22, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !858, file: !199, line: 343, baseType: !955, size: 64, offset: 928)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !248, line: 60, size: 64, elements: !956)
!956 = !{!957, !958}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !955, file: !248, line: 63, baseType: !111, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !955, file: !248, line: 66, baseType: !111, size: 32, offset: 32)
!959 = !{!960, !961, !962, !963}
!960 = !DILocalVariable(name: "thread", arg: 1, scope: !853, file: !854, line: 175, type: !857)
!961 = !DILocalVariable(name: "region_num", scope: !853, file: !854, line: 200, type: !166)
!962 = !DILocalVariable(name: "guard_start", scope: !853, file: !854, line: 265, type: !22)
!963 = !DILocalVariable(name: "guard_size", scope: !853, file: !854, line: 266, type: !156)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 96, elements: !532)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !966, line: 52, size: 96, elements: !967)
!966 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!967 = !{!968, !969, !970}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !965, file: !966, line: 53, baseType: !22, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !965, file: !966, line: 54, baseType: !156, size: 32, offset: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !965, file: !966, line: 55, baseType: !971, size: 32, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !972, line: 151, baseType: !973)
!972 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !972, line: 149, size: 32, elements: !974)
!974 = !{!975}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !973, file: !972, line: 150, baseType: !111, size: 32)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "static_regions", scope: !847, file: !854, line: 62, type: !978, isLocal: true, isDefinition: true)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 96, elements: !532)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !753, line: 16, size: 64, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !981, file: !753, line: 17, baseType: !108, size: 32)
