; ModuleID = 'build/adafruit_feather_nrf52840/drivers/jesd216/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.jesd216_param_header = type { i8, i8, i8, i8, [3 x i8], i8 }
%struct.jesd216_bfp = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, [0 x i32] }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.jesd216_bfp_dw16 }
%struct.jesd216_bfp_dw16 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.jesd216_bfp_dw16 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "extractor", scope: !27, file: !234, line: 227, type: !281, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !119, globals: !230, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/jesd216/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!29 = !{!30, !101}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "jesd216_mode_type", file: !102, line: 229, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "zephyr/drivers/flash/jesd216.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!104 = !DIEnumerator(name: "JESD216_MODE_044", value: 0)
!105 = !DIEnumerator(name: "JESD216_MODE_088", value: 1)
!106 = !DIEnumerator(name: "JESD216_MODE_111", value: 2)
!107 = !DIEnumerator(name: "JESD216_MODE_112", value: 3)
!108 = !DIEnumerator(name: "JESD216_MODE_114", value: 4)
!109 = !DIEnumerator(name: "JESD216_MODE_118", value: 5)
!110 = !DIEnumerator(name: "JESD216_MODE_122", value: 6)
!111 = !DIEnumerator(name: "JESD216_MODE_144", value: 7)
!112 = !DIEnumerator(name: "JESD216_MODE_188", value: 8)
!113 = !DIEnumerator(name: "JESD216_MODE_222", value: 9)
!114 = !DIEnumerator(name: "JESD216_MODE_444", value: 10)
!115 = !DIEnumerator(name: "JESD216_MODE_44D4D", value: 11)
!116 = !DIEnumerator(name: "JESD216_MODE_888", value: 12)
!117 = !DIEnumerator(name: "JESD216_MODE_8D8D8D", value: 13)
!118 = !DIEnumerator(name: "JESD216_MODE_LIMIT", value: 14)
!119 = !{!120, !121, !137, !138, !139, !224, !179, !101, !226, !228}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jesd216_bfp", file: !102, line: 133, size: 288, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dw1", scope: !122, file: !102, line: 134, baseType: !120, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dw2", scope: !122, file: !102, line: 135, baseType: !120, size: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dw3", scope: !122, file: !102, line: 136, baseType: !120, size: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dw4", scope: !122, file: !102, line: 137, baseType: !120, size: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "dw5", scope: !122, file: !102, line: 138, baseType: !120, size: 32, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "dw6", scope: !122, file: !102, line: 139, baseType: !120, size: 32, offset: 160)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dw7", scope: !122, file: !102, line: 140, baseType: !120, size: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "dw8", scope: !122, file: !102, line: 141, baseType: !120, size: 32, offset: 224)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dw9", scope: !122, file: !102, line: 142, baseType: !120, size: 32, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "dw10", scope: !122, file: !102, line: 143, baseType: !134, offset: 288)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: -1)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!138 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flash_driver_api", file: !142, line: 129, size: 224, elements: !143)
!142 = !DIFile(filename: "zephyr/include/zephyr/drivers/flash.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !181, !186, !191, !203, !216, !218}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !141, file: !142, line: 130, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_read", file: !142, line: 71, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{!138, !149, !176, !137, !179}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !152, line: 378, size: 192, elements: !153)
!152 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!153 = !{!154, !158, !159, !160, !169, !170}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !152, line: 380, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !151, file: !152, line: 382, baseType: !13, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !151, file: !152, line: 384, baseType: !13, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !151, file: !152, line: 386, baseType: !161, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !152, line: 351, size: 16, elements: !163)
!163 = !{!164, !167}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !162, file: !152, line: 359, baseType: !165, size: 8)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !166)
!166 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !162, file: !152, line: 364, baseType: !168, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!168 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !151, file: !152, line: 388, baseType: !137, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !151, file: !152, line: 396, baseType: !171, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !152, line: 43, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !175)
!175 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !177, line: 36, baseType: !178)
!177 = !DIFile(filename: "zephyr/lib/libc/minimal/include/sys/types.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !180, line: 214, baseType: !32)
!180 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !141, file: !142, line: 131, baseType: !182, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_write", file: !142, line: 82, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!138, !149, !176, !13, !179}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "erase", scope: !141, file: !142, line: 132, baseType: !187, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_erase", file: !142, line: 93, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!138, !149, !176, !179}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "get_parameters", scope: !141, file: !142, line: 133, baseType: !192, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_get_parameters", file: !142, line: 96, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!196, !149}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flash_parameters", file: !142, line: 57, size: 64, elements: !199)
!199 = !{!200, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "write_block_size", scope: !198, file: !142, line: 58, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "erase_value", scope: !198, file: !142, line: 59, baseType: !165, size: 8, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "page_layout", scope: !141, file: !142, line: 135, baseType: !204, size: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_pages_layout", file: !142, line: 120, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !149, !208, !215}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flash_pages_layout", file: !142, line: 35, size: 64, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pages_count", scope: !211, file: !142, line: 36, baseType: !179, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pages_size", scope: !211, file: !142, line: 37, baseType: !179, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sfdp_read", scope: !141, file: !142, line: 138, baseType: !217, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_sfdp_read", file: !142, line: 125, baseType: !146)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "read_jedec_id", scope: !141, file: !142, line: 139, baseType: !219, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_api_read_jedec_id", file: !142, line: 127, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DISubroutineType(types: !222)
!222 = !{!138, !149, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !225)
!225 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !227)
!227 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!230 = !{!25, !231, !274, !276}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "addr_bytes", scope: !233, file: !234, line: 53, type: !270, isLocal: true, isDefinition: true)
!233 = distinct !DISubprogram(name: "summarize_dw1", scope: !234, file: !234, line: 45, type: !235, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !252)
!234 = !DIFile(filename: "zephyr/samples/drivers/jesd216/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !DISubroutineType(types: !236)
!236 = !{null, !237, !250}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jesd216_param_header", file: !102, line: 31, size: 64, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !249}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "id_lsb", scope: !239, file: !102, line: 32, baseType: !165, size: 8)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rev_minor", scope: !239, file: !102, line: 33, baseType: !165, size: 8, offset: 8)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rev_major", scope: !239, file: !102, line: 34, baseType: !165, size: 8, offset: 16)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "len_dw", scope: !239, file: !102, line: 35, baseType: !165, size: 8, offset: 24)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ptp", scope: !239, file: !102, line: 36, baseType: !246, size: 24, offset: 32)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 24, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 3)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "id_msb", scope: !239, file: !102, line: 37, baseType: !165, size: 8, offset: 56)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!252 = !{!253, !254, !255, !256, !258, !261, !269}
!253 = !DILocalVariable(name: "php", arg: 1, scope: !233, file: !234, line: 45, type: !237)
!254 = !DILocalVariable(name: "bfp", arg: 2, scope: !233, file: !234, line: 46, type: !250)
!255 = !DILocalVariable(name: "dw1", scope: !233, file: !234, line: 48, type: !120)
!256 = !DILocalVariable(name: "mode", scope: !257, file: !234, line: 73, type: !179)
!257 = distinct !DILexicalBlock(scope: !233, file: !234, line: 73, column: 2)
!258 = !DILocalVariable(name: "tag", scope: !259, file: !234, line: 74, type: !155)
!259 = distinct !DILexicalBlock(scope: !260, file: !234, line: 73, column: 62)
!260 = distinct !DILexicalBlock(scope: !257, file: !234, line: 73, column: 2)
!261 = !DILocalVariable(name: "cmd", scope: !262, file: !234, line: 77, type: !264)
!262 = distinct !DILexicalBlock(scope: !263, file: !234, line: 76, column: 12)
!263 = distinct !DILexicalBlock(scope: !259, file: !234, line: 76, column: 7)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jesd216_instr", file: !102, line: 250, size: 24, elements: !265)
!265 = !{!266, !267, !268}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "instr", scope: !264, file: !102, line: 251, baseType: !165, size: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mode_clocks", scope: !264, file: !102, line: 252, baseType: !165, size: 8, offset: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "wait_states", scope: !264, file: !102, line: 253, baseType: !165, size: 8, offset: 16)
!269 = !DILocalVariable(name: "rc", scope: !262, file: !234, line: 78, type: !138)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 128, elements: !272)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!272 = !{!273}
!273 = !DISubrange(count: 4)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "bsersz", scope: !233, file: !234, line: 63, type: !270, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "mode_tags", scope: !27, file: !234, line: 31, type: !278, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 352, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 11)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 544, elements: !285)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "dw_extractor", file: !234, line: 28, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!285 = !{!286}
!286 = !DISubrange(count: 17)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "_char_out", scope: !289, file: !294, line: 54, type: !295, isLocal: false, isDefinition: true)
!289 = distinct !DICompileUnit(language: DW_LANG_C99, file: !290, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !292, globals: !293, splitDebugInlining: false, nameTableKind: None)
!290 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!291 = !{!30}
!292 = !{!137, !138}
!293 = !{!287}
!294 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{!138, !138}
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !300, file: !339, line: 27, type: !366, isLocal: true, isDefinition: true)
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !301, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !302, retainedTypes: !314, globals: !336, splitDebugInlining: false, nameTableKind: None)
!301 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!302 = !{!303, !30}
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !304, line: 27, baseType: !32, size: 32, elements: !305)
!304 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313}
!306 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!307 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!308 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!309 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!310 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!311 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!312 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!313 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!314 = !{!137, !315, !138, !24, !319, !335, !120, !226}
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !316, line: 46, baseType: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !318)
!318 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !321, line: 54, size: 96, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{!323, !330, !334}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !320, file: !321, line: 55, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !325, line: 33, baseType: !326)
!325 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !325, line: 29, size: 32, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !325, line: 30, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !320, file: !321, line: 60, baseType: !331, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !303}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !320, file: !321, line: 65, baseType: !331, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!336 = !{!298, !337, !343, !345, !356, !358}
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !300, file: !339, line: 44, type: !340, isLocal: true, isDefinition: true)
!339 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !341, line: 43, elements: !342)
!341 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = !{}
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !300, file: !339, line: 49, type: !340, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !300, file: !339, line: 36, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 128, elements: !354)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !304, line: 114, size: 128, elements: !349)
!349 = !{!350, !351, !352, !353}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !348, file: !304, line: 115, baseType: !303, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !348, file: !304, line: 141, baseType: !165, size: 8, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !348, file: !304, line: 149, baseType: !120, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !348, file: !304, line: 156, baseType: !120, size: 32, offset: 96)
!354 = !{!355}
!355 = !DISubrange(count: 1)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !300, file: !339, line: 40, type: !347, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !300, file: !339, line: 28, type: !360, isLocal: true, isDefinition: true)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !325, line: 40, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !325, line: 35, size: 64, elements: !362)
!362 = !{!363, !365}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !361, file: !325, line: 36, baseType: !364, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !361, file: !325, line: 37, baseType: !364, size: 32, offset: 32)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 32, elements: !354)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !368, line: 22, baseType: !178)
!368 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!369 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!370 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !373, file: !400, line: 50, type: !387, isLocal: true, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !302, retainedTypes: !375, globals: !397, splitDebugInlining: false, nameTableKind: None)
!374 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!375 = !{!174, !315, !179, !138, !137, !120, !226, !376, !335, !387, !388}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !378, line: 45, size: 64, elements: !379)
!378 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = !{!380, !386}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !377, file: !378, line: 46, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !325, line: 33, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !325, line: 29, size: 32, elements: !383)
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !382, file: !325, line: 30, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !377, file: !378, line: 48, baseType: !120, size: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !138)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !378, line: 38, size: 64, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !389, file: !378, line: 39, baseType: !381, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !389, file: !378, line: 41, baseType: !393, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !378, line: 35, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !387}
!397 = !{!398, !402, !410, !371, !412, !422}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "latency_lock", scope: !373, file: !400, line: 44, type: !401, isLocal: true, isDefinition: true)
!400 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !341, line: 43, elements: !342)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !373, file: !400, line: 46, type: !404, isLocal: true, isDefinition: true)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !325, line: 40, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !325, line: 35, size: 64, elements: !406)
!406 = !{!407, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !405, file: !325, line: 36, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !405, file: !325, line: 37, baseType: !408, size: 32, offset: 32)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "latency_subs", scope: !373, file: !400, line: 52, type: !404, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !373, file: !400, line: 39, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, elements: !420)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !400, line: 35, size: 96, elements: !416)
!416 = !{!417, !418, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !415, file: !400, line: 36, baseType: !303, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !415, file: !400, line: 37, baseType: !165, size: 8, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !415, file: !400, line: 38, baseType: !367, size: 32, offset: 64)
!420 = !{!421}
!421 = !DISubrange(count: 0)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !373, file: !400, line: 48, type: !387, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !426, file: !433, line: 47, type: !446, isLocal: true, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !428, retainedTypes: !429, globals: !430, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!428 = !{!303}
!429 = !{!179, !138}
!430 = !{!431, !424, !443}
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "cpus_states", scope: !426, file: !433, line: 50, type: !434, isLocal: true, isDefinition: true)
!433 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 32, elements: !354)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !304, line: 114, size: 128, elements: !438)
!438 = !{!439, !440, !441, !442}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !437, file: !304, line: 115, baseType: !303, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !437, file: !304, line: 141, baseType: !165, size: 8, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !437, file: !304, line: 149, baseType: !120, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !437, file: !304, line: 156, baseType: !120, size: 32, offset: 96)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !426, file: !433, line: 55, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 8, elements: !354)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, elements: !420)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "static_regions", scope: !449, file: !456, line: 62, type: !587, isLocal: true, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !451, globals: !452, splitDebugInlining: false, nameTableKind: None)
!450 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!451 = !{!179, !138, !120, !137}
!452 = !{!453, !447}
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !455, file: !456, line: 198, type: !575, isLocal: true, isDefinition: true)
!455 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !456, file: !456, line: 175, type: !457, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !449, retainedNodes: !572)
!456 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = !DISubroutineType(types: !458)
!458 = !{null, !459}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !461, line: 245, size: 1024, elements: !462)
!461 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!462 = !{!463, !528, !541, !542, !543, !544, !550, !567}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !460, file: !461, line: 247, baseType: !464, size: 384)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !461, line: 57, size: 384, elements: !465)
!465 = !{!466, !494, !502, !503, !504, !515, !516, !517}
!466 = !DIDerivedType(tag: DW_TAG_member, scope: !464, file: !461, line: 60, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !464, file: !461, line: 60, size: 64, elements: !468)
!468 = !{!469, !485}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !467, file: !461, line: 61, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !471, line: 49, baseType: !472)
!471 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !471, line: 37, size: 64, elements: !473)
!473 = !{!474, !480}
!474 = !DIDerivedType(tag: DW_TAG_member, scope: !472, file: !471, line: 38, baseType: !475, size: 32)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !472, file: !471, line: 38, size: 32, elements: !476)
!476 = !{!477, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !475, file: !471, line: 39, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !475, file: !471, line: 40, baseType: !478, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, scope: !472, file: !471, line: 42, baseType: !481, size: 32, offset: 32)
!481 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !472, file: !471, line: 42, size: 32, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !481, file: !471, line: 43, baseType: !478, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !481, file: !471, line: 44, baseType: !478, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !467, file: !461, line: 62, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !487, line: 49, size: 64, elements: !488)
!487 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !486, file: !487, line: 50, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 64, elements: !492)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!492 = !{!493}
!493 = !DISubrange(count: 2)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !464, file: !461, line: 68, baseType: !495, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !497, line: 233, baseType: !498)
!497 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 231, size: 64, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !498, file: !497, line: 232, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !471, line: 48, baseType: !472)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !464, file: !461, line: 71, baseType: !165, size: 8, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !464, file: !461, line: 74, baseType: !165, size: 8, offset: 104)
!504 = !DIDerivedType(tag: DW_TAG_member, scope: !464, file: !461, line: 90, baseType: !505, size: 16, offset: 112)
!505 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !464, file: !461, line: 90, size: 16, elements: !506)
!506 = !{!507, !514}
!507 = !DIDerivedType(tag: DW_TAG_member, scope: !505, file: !461, line: 91, baseType: !508, size: 16)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !505, file: !461, line: 91, size: 16, elements: !509)
!509 = !{!510, !513}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !508, file: !461, line: 96, baseType: !511, size: 8)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !512)
!512 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !508, file: !461, line: 97, baseType: !165, size: 8, offset: 8)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !505, file: !461, line: 100, baseType: !224, size: 16)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !464, file: !461, line: 107, baseType: !120, size: 32, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !464, file: !461, line: 127, baseType: !137, size: 32, offset: 160)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !464, file: !461, line: 131, baseType: !518, size: 192, offset: 192)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !497, line: 244, size: 192, elements: !519)
!519 = !{!520, !521, !527}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !518, file: !497, line: 245, baseType: !470, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !518, file: !497, line: 246, baseType: !522, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !497, line: 242, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !518, file: !497, line: 249, baseType: !317, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !460, file: !461, line: 250, baseType: !529, size: 288, offset: 384)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !530, line: 25, size: 288, elements: !531)
!530 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !529, file: !530, line: 26, baseType: !120, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !529, file: !530, line: 27, baseType: !120, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !529, file: !530, line: 28, baseType: !120, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !529, file: !530, line: 29, baseType: !120, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !529, file: !530, line: 30, baseType: !120, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !529, file: !530, line: 31, baseType: !120, size: 32, offset: 160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !529, file: !530, line: 32, baseType: !120, size: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !529, file: !530, line: 33, baseType: !120, size: 32, offset: 224)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !529, file: !530, line: 34, baseType: !120, size: 32, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !460, file: !461, line: 253, baseType: !137, size: 32, offset: 672)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !460, file: !461, line: 256, baseType: !496, size: 64, offset: 704)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !460, file: !461, line: 294, baseType: !138, size: 32, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !460, file: !461, line: 300, baseType: !545, size: 96, offset: 800)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !461, line: 149, size: 96, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !545, file: !461, line: 153, baseType: !22, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !545, file: !461, line: 162, baseType: !179, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !545, file: !461, line: 168, baseType: !179, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !460, file: !461, line: 325, baseType: !551, size: 32, offset: 896)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !553, line: 5073, size: 160, elements: !554)
!553 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!554 = !{!555, !564, !565}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !552, file: !553, line: 5074, baseType: !556, size: 96)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !557, line: 56, size: 96, elements: !558)
!557 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!558 = !{!559, !562, !563}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !556, file: !557, line: 57, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !557, line: 57, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !556, file: !557, line: 58, baseType: !137, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !556, file: !557, line: 59, baseType: !179, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !552, file: !553, line: 5075, baseType: !496, size: 64, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !552, file: !553, line: 5076, baseType: !566, offset: 160)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !341, line: 43, elements: !342)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !460, file: !461, line: 343, baseType: !568, size: 64, offset: 928)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !530, line: 60, size: 64, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !568, file: !530, line: 63, baseType: !120, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !568, file: !530, line: 66, baseType: !120, size: 32, offset: 32)
!572 = !{!573, !574}
!573 = !DILocalVariable(name: "thread", arg: 1, scope: !455, file: !456, line: 175, type: !459)
!574 = !DILocalVariable(name: "region_num", scope: !455, file: !456, line: 200, type: !165)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, elements: !420)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !577, line: 52, size: 96, elements: !578)
!577 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!578 = !{!579, !580, !581}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !576, file: !577, line: 53, baseType: !22, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !576, file: !577, line: 54, baseType: !179, size: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !576, file: !577, line: 55, baseType: !582, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !583, line: 151, baseType: !584)
!583 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !583, line: 149, size: 32, elements: !585)
!585 = !{!586}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !584, file: !583, line: 150, baseType: !120, size: 32)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 96, elements: !354)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !591, file: !625, line: 39, type: !165, isLocal: true, isDefinition: true)
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !593, globals: !624, splitDebugInlining: false, nameTableKind: None)
!592 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!593 = !{!594, !137, !138, !612, !165}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !596, line: 1226, baseType: !597)
!596 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !596, line: 1213, size: 352, elements: !598)
!598 = !{!599, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !597, file: !596, line: 1215, baseType: !600, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !120)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !597, file: !596, line: 1216, baseType: !601, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !597, file: !596, line: 1217, baseType: !601, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !597, file: !596, line: 1218, baseType: !601, size: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !597, file: !596, line: 1219, baseType: !601, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !597, file: !596, line: 1220, baseType: !601, size: 32, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !597, file: !596, line: 1221, baseType: !601, size: 32, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !597, file: !596, line: 1222, baseType: !601, size: 32, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !597, file: !596, line: 1223, baseType: !601, size: 32, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !597, file: !596, line: 1224, baseType: !601, size: 32, offset: 288)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !597, file: !596, line: 1225, baseType: !601, size: 32, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !615, line: 27, size: 96, elements: !616)
!615 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !614, file: !615, line: 29, baseType: !120, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !614, file: !615, line: 31, baseType: !155, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !614, file: !615, line: 37, baseType: !620, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !583, line: 146, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !583, line: 141, size: 32, elements: !622)
!622 = !{!623}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !621, file: !583, line: 143, baseType: !120, size: 32)
!624 = !{!589}
!625 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !628, file: !635, line: 21, type: !295, isLocal: true, isDefinition: true)
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !630, globals: !634, splitDebugInlining: false, nameTableKind: None)
!629 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!630 = !{!631, !138, !137}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !633, line: 22, baseType: !138)
!633 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!634 = !{!626}
!635 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !638, file: !643, line: 13, type: !660, isLocal: true, isDefinition: true)
!638 = distinct !DICompileUnit(language: DW_LANG_C99, file: !639, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !640, splitDebugInlining: false, nameTableKind: None)
!639 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!640 = !{!641, !636}
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "mpu_config", scope: !638, file: !643, line: 37, type: !644, isLocal: false, isDefinition: true)
!643 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !615, line: 41, size: 64, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !645, file: !615, line: 43, baseType: !120, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !645, file: !615, line: 45, baseType: !649, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !615, line: 27, size: 96, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !651, file: !615, line: 29, baseType: !120, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !651, file: !615, line: 31, baseType: !155, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !651, file: !615, line: 37, baseType: !656, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !583, line: 146, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !583, line: 141, size: 32, elements: !658)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !657, file: !583, line: 143, baseType: !120, size: 32)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 192, elements: !492)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !663, file: !829, line: 93, type: !830, isLocal: true, isDefinition: true, align: 32)
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, retainedTypes: !665, globals: !824, splitDebugInlining: false, nameTableKind: None)
!664 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!665 = !{!666, !165, !137, !138, !744, !120, !745, !779, !790}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !668, line: 1071, baseType: !669)
!668 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !668, line: 1035, size: 19584, elements: !670)
!670 = !{!671, !675, !676, !677, !681, !682, !684, !685, !686, !687, !688, !689, !693, !694, !695, !699, !700, !704, !705, !707, !708, !712, !713, !714, !715, !716, !717, !718, !722, !723, !724, !725, !729, !730, !734}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !669, file: !668, line: 1036, baseType: !672, size: 960)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 960, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 30)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !669, file: !668, line: 1037, baseType: !601, size: 32, offset: 960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !669, file: !668, line: 1038, baseType: !601, size: 32, offset: 992)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !669, file: !668, line: 1039, baseType: !678, size: 1088, offset: 1024)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 1088, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 34)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !669, file: !668, line: 1040, baseType: !601, size: 32, offset: 2112)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !669, file: !668, line: 1041, baseType: !683, size: 64, offset: 2144)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 64, elements: !492)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !669, file: !668, line: 1042, baseType: !601, size: 32, offset: 2208)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !669, file: !668, line: 1043, baseType: !601, size: 32, offset: 2240)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !669, file: !668, line: 1044, baseType: !601, size: 32, offset: 2272)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !669, file: !668, line: 1045, baseType: !601, size: 32, offset: 2304)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !669, file: !668, line: 1046, baseType: !601, size: 32, offset: 2336)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !669, file: !668, line: 1047, baseType: !690, size: 3808, offset: 2368)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 3808, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 119)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !669, file: !668, line: 1048, baseType: !601, size: 32, offset: 6176)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !669, file: !668, line: 1049, baseType: !601, size: 32, offset: 6208)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !669, file: !668, line: 1050, baseType: !696, size: 1952, offset: 6240)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 1952, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 61)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !669, file: !668, line: 1051, baseType: !601, size: 32, offset: 8192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !669, file: !668, line: 1052, baseType: !701, size: 288, offset: 8224)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 288, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 9)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !669, file: !668, line: 1053, baseType: !600, size: 32, offset: 8512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !669, file: !668, line: 1054, baseType: !706, size: 96, offset: 8544)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 96, elements: !247)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !669, file: !668, line: 1055, baseType: !600, size: 32, offset: 8640)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !669, file: !668, line: 1056, baseType: !709, size: 1568, offset: 8672)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 1568, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 49)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !669, file: !668, line: 1057, baseType: !601, size: 32, offset: 10240)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !669, file: !668, line: 1058, baseType: !706, size: 96, offset: 10272)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !669, file: !668, line: 1059, baseType: !601, size: 32, offset: 10368)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !669, file: !668, line: 1060, baseType: !683, size: 64, offset: 10400)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !669, file: !668, line: 1061, baseType: !601, size: 32, offset: 10464)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !669, file: !668, line: 1062, baseType: !601, size: 32, offset: 10496)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !669, file: !668, line: 1063, baseType: !719, size: 672, offset: 10528)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 672, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 21)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !669, file: !668, line: 1064, baseType: !601, size: 32, offset: 11200)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !669, file: !668, line: 1065, baseType: !600, size: 32, offset: 11232)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !669, file: !668, line: 1066, baseType: !601, size: 32, offset: 11264)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !669, file: !668, line: 1067, baseType: !726, size: 1504, offset: 11296)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 1504, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 47)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !669, file: !668, line: 1068, baseType: !600, size: 32, offset: 12800)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !669, file: !668, line: 1069, baseType: !731, size: 5600, offset: 12832)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 5600, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 175)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !669, file: !668, line: 1070, baseType: !735, size: 1152, offset: 18432)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 1152, elements: !702)
!736 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !668, line: 278, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !668, line: 272, size: 128, elements: !739)
!739 = !{!740, !741, !742, !743}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !738, file: !668, line: 273, baseType: !601, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !738, file: !668, line: 274, baseType: !601, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !738, file: !668, line: 275, baseType: !601, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !738, file: !668, line: 277, baseType: !600, size: 32, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !596, line: 468, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !596, line: 445, size: 1120, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !772, !776, !778}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !747, file: !596, line: 447, baseType: !600, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !747, file: !596, line: 448, baseType: !601, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !747, file: !596, line: 449, baseType: !601, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !747, file: !596, line: 450, baseType: !601, size: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !747, file: !596, line: 451, baseType: !601, size: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !747, file: !596, line: 452, baseType: !601, size: 32, offset: 160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !747, file: !596, line: 453, baseType: !756, size: 96, offset: 192)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 96, elements: !758)
!757 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !165)
!758 = !{!759}
!759 = !DISubrange(count: 12)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !747, file: !596, line: 454, baseType: !601, size: 32, offset: 288)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !747, file: !596, line: 455, baseType: !601, size: 32, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !747, file: !596, line: 456, baseType: !601, size: 32, offset: 352)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !747, file: !596, line: 457, baseType: !601, size: 32, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !747, file: !596, line: 458, baseType: !601, size: 32, offset: 416)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !747, file: !596, line: 459, baseType: !601, size: 32, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !747, file: !596, line: 460, baseType: !601, size: 32, offset: 480)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !747, file: !596, line: 461, baseType: !683, size: 64, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !747, file: !596, line: 462, baseType: !600, size: 32, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !747, file: !596, line: 463, baseType: !600, size: 32, offset: 608)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !747, file: !596, line: 464, baseType: !771, size: 128, offset: 640)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 128, elements: !272)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !747, file: !596, line: 465, baseType: !773, size: 160, offset: 768)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 160, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 5)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !747, file: !596, line: 466, baseType: !777, size: 160, offset: 928)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 160, elements: !774)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !747, file: !596, line: 467, baseType: !601, size: 32, offset: 1088)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !781, file: !780, line: 167, baseType: !789)
!780 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!781 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !780, file: !780, line: 134, type: !782, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !663, retainedNodes: !784)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !120}
!784 = !{!785, !786, !788}
!785 = !DILocalVariable(name: "time_us", arg: 1, scope: !781, file: !780, line: 134, type: !120)
!786 = !DILocalVariable(name: "delay_cycles", scope: !781, file: !780, line: 168, type: !787)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!788 = !DILocalVariable(name: "cycles", scope: !781, file: !780, line: 171, type: !120)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !668, line: 2399, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !668, line: 2373, size: 10880, elements: !793)
!793 = !{!794, !798, !799, !800, !801, !805, !806, !811, !812, !813, !814, !815, !816, !820, !821, !822, !823}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !792, file: !668, line: 2374, baseType: !795, size: 8192)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 8192, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !792, file: !668, line: 2375, baseType: !600, size: 32, offset: 8192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !792, file: !668, line: 2376, baseType: !600, size: 32, offset: 8224)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !792, file: !668, line: 2377, baseType: !600, size: 32, offset: 8256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !792, file: !668, line: 2378, baseType: !802, size: 1984, offset: 8288)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 1984, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 62)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !792, file: !668, line: 2379, baseType: !601, size: 32, offset: 10272)
!806 = !DIDerivedType(tag: DW_TAG_member, scope: !792, file: !668, line: 2381, baseType: !807, size: 32, offset: 10304)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !792, file: !668, line: 2381, size: 32, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !807, file: !668, line: 2382, baseType: !601, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !807, file: !668, line: 2383, baseType: !601, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !792, file: !668, line: 2386, baseType: !601, size: 32, offset: 10336)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !792, file: !668, line: 2387, baseType: !601, size: 32, offset: 10368)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !792, file: !668, line: 2389, baseType: !601, size: 32, offset: 10400)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !792, file: !668, line: 2391, baseType: !601, size: 32, offset: 10432)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !792, file: !668, line: 2393, baseType: !601, size: 32, offset: 10464)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !792, file: !668, line: 2394, baseType: !817, size: 256, offset: 10496)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 256, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 8)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !792, file: !668, line: 2395, baseType: !601, size: 32, offset: 10752)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !792, file: !668, line: 2396, baseType: !600, size: 32, offset: 10784)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !792, file: !668, line: 2397, baseType: !601, size: 32, offset: 10816)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !792, file: !668, line: 2398, baseType: !601, size: 32, offset: 10848)
!824 = !{!661, !825}
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !781, file: !780, line: 161, type: !827, isLocal: true, isDefinition: true, align: 128)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 48, elements: !247)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!829 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !832, line: 51, size: 64, elements: !833)
!832 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = !{!834, !841}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !831, file: !832, line: 60, baseType: !835, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!836 = !DISubroutineType(types: !837)
!837 = !{!138, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !840)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !832, line: 48, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !831, file: !832, line: 65, baseType: !838, size: 32, offset: 32)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "__device_dts_ord_38", scope: !844, file: !1078, line: 733, type: !1179, isLocal: false, isDefinition: true, align: 32)
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !846, retainedTypes: !989, globals: !1074, splitDebugInlining: false, nameTableKind: None)
!845 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/jesd216")
!846 = !{!847, !853, !30, !858, !863, !870, !878, !886, !895, !899, !954, !961, !980}
!847 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !848, line: 23, baseType: !32, size: 32, elements: !849)
!848 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!849 = !{!850, !851, !852}
!850 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!851 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!852 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!853 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !848, line: 48, baseType: !32, size: 32, elements: !854)
!854 = !{!855, !856, !857}
!855 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!856 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!857 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 167, baseType: !32, size: 32, elements: !860)
!859 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!860 = !{!861, !862}
!861 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!862 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!863 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 107, baseType: !32, size: 32, elements: !864)
!864 = !{!865, !866, !867, !868, !869}
!865 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!866 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!867 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!868 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!869 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 208, baseType: !32, size: 32, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877}
!872 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!873 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!874 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!875 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!876 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!877 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 261, baseType: !32, size: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885}
!880 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!881 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!882 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!883 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!884 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!885 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!886 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 237, baseType: !32, size: 32, elements: !887)
!887 = !{!888, !889, !890, !891, !892, !893, !894}
!888 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!889 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!890 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!891 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!892 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!893 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!894 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!895 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 152, baseType: !32, size: 32, elements: !896)
!896 = !{!897, !898}
!897 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!898 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !668, line: 71, baseType: !138, size: 32, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953}
!901 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!902 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!903 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!904 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!905 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!906 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!907 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!908 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!909 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!910 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!911 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!912 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!913 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!914 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!915 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!916 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!917 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!918 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!919 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!920 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!921 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!922 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!923 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!924 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!925 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!926 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!927 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!928 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!929 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!930 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!931 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!932 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!933 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!934 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!935 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!936 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!937 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!938 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!939 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!940 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!941 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!942 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!943 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!944 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!945 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!946 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!947 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!948 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!949 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!950 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!951 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!952 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!953 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!954 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !955, line: 44, baseType: !32, size: 32, elements: !956)
!955 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!956 = !{!957, !958, !959, !960}
!957 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!958 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!959 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!960 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!961 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !962, line: 54, baseType: !32, size: 32, elements: !963)
!962 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979}
!964 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!965 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!966 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!967 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!968 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!969 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!970 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!971 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!972 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!973 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!974 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!975 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!976 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!977 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!978 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!979 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!980 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !981, line: 53, baseType: !32, size: 32, elements: !982)
!981 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!982 = !{!983, !984, !985, !986, !987, !988}
!983 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!984 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!985 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!986 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!987 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!988 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!989 = !{!847, !137, !138, !990, !1039, !1040, !1041, !1042, !315, !120, !226, !168, !744, !223, !387, !1043, !1073, !179}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !668, line: 1022, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !668, line: 979, size: 11712, elements: !993)
!993 = !{!994, !995, !996, !997, !998, !999, !1000, !1001, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1017, !1018, !1019, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !992, file: !668, line: 980, baseType: !601, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !992, file: !668, line: 981, baseType: !601, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !992, file: !668, line: 982, baseType: !601, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !992, file: !668, line: 983, baseType: !601, size: 32, offset: 96)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !992, file: !668, line: 984, baseType: !601, size: 32, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !992, file: !668, line: 985, baseType: !601, size: 32, offset: 160)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !992, file: !668, line: 986, baseType: !601, size: 32, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !992, file: !668, line: 987, baseType: !1002, size: 1824, offset: 224)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 1824, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 57)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !992, file: !668, line: 988, baseType: !601, size: 32, offset: 2048)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !992, file: !668, line: 989, baseType: !601, size: 32, offset: 2080)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !992, file: !668, line: 990, baseType: !600, size: 32, offset: 2112)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !992, file: !668, line: 991, baseType: !601, size: 32, offset: 2144)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !992, file: !668, line: 992, baseType: !601, size: 32, offset: 2176)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !992, file: !668, line: 993, baseType: !773, size: 160, offset: 2208)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !992, file: !668, line: 994, baseType: !601, size: 32, offset: 2368)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !992, file: !668, line: 996, baseType: !601, size: 32, offset: 2400)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !992, file: !668, line: 998, baseType: !1014, size: 3744, offset: 2432)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 3744, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 117)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !992, file: !668, line: 999, baseType: !601, size: 32, offset: 6176)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !992, file: !668, line: 1000, baseType: !601, size: 32, offset: 6208)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !992, file: !668, line: 1001, baseType: !1020, size: 2016, offset: 6240)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 2016, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 63)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !992, file: !668, line: 1002, baseType: !600, size: 32, offset: 8256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !992, file: !668, line: 1004, baseType: !600, size: 32, offset: 8288)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !992, file: !668, line: 1005, baseType: !600, size: 32, offset: 8320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !992, file: !668, line: 1006, baseType: !600, size: 32, offset: 8352)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !992, file: !668, line: 1008, baseType: !600, size: 32, offset: 8384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !992, file: !668, line: 1009, baseType: !600, size: 32, offset: 8416)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !992, file: !668, line: 1011, baseType: !802, size: 1984, offset: 8448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !992, file: !668, line: 1012, baseType: !601, size: 32, offset: 10432)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !992, file: !668, line: 1013, baseType: !706, size: 96, offset: 10464)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !992, file: !668, line: 1014, baseType: !601, size: 32, offset: 10560)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !992, file: !668, line: 1016, baseType: !706, size: 96, offset: 10592)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !992, file: !668, line: 1017, baseType: !601, size: 32, offset: 10688)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !992, file: !668, line: 1018, baseType: !817, size: 256, offset: 10720)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !992, file: !668, line: 1019, baseType: !601, size: 32, offset: 10976)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !992, file: !668, line: 1020, baseType: !719, size: 672, offset: 11008)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !992, file: !668, line: 1021, baseType: !601, size: 32, offset: 11680)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !859, line: 146, baseType: !863)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !859, line: 164, baseType: !895)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !596, line: 426, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !596, line: 411, size: 28704, elements: !1046)
!1046 = !{!1047, !1049, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1064, !1068, !1072}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1045, file: !596, line: 413, baseType: !1048, size: 256)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 256, elements: !818)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1045, file: !596, line: 414, baseType: !1050, size: 768, offset: 256)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 768, elements: !1051)
!1051 = !{!1052}
!1052 = !DISubrange(count: 24)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1045, file: !596, line: 415, baseType: !1048, size: 256, offset: 1024)
