; ModuleID = 'build/96b_wistrio/philosophers/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__thread_entry = type { void (i8*, i8*, i8*)*, i8*, i8*, i8* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "forks", scope: !27, file: !116, line: 149, type: !278, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !108, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !103)
!103 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!114, !25, !266, !269}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "fork_objs", scope: !27, file: !116, line: 146, type: !117, isLocal: false, isDefinition: true)
!116 = !DIFile(filename: "zephyr/samples/philosophers/src/phil_obj_abstract.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 960, elements: !264)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !119, line: 2720, size: 160, elements: !120)
!119 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121, !142, !262, !263}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !118, file: !119, line: 2722, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !123, line: 233, baseType: !124)
!123 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 231, size: 64, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !124, file: !123, line: 232, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !128, line: 48, baseType: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !128, line: 37, size: 64, elements: !130)
!130 = !{!131, !137}
!131 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !128, line: 38, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !128, line: 38, size: 32, elements: !133)
!133 = !{!134, !136}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !132, file: !128, line: 39, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !128, line: 40, baseType: !135, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !128, line: 42, baseType: !138, size: 32, offset: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !128, line: 42, size: 32, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !138, file: !128, line: 43, baseType: !135, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !128, line: 44, baseType: !135, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !118, file: !119, line: 2724, baseType: !143, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !145, line: 245, size: 1408, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !196, !209, !210, !211, !223, !224, !229, !230, !238, !257}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !144, file: !145, line: 247, baseType: !148, size: 384)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !145, line: 57, size: 384, elements: !149)
!149 = !{!150, !164, !166, !169, !170, !183, !184, !185}
!150 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !145, line: 60, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !145, line: 60, size: 64, elements: !152)
!152 = !{!153, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !151, file: !145, line: 61, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !128, line: 49, baseType: !129)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !151, file: !145, line: 62, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !156, file: !157, line: 50, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!162 = !{!163}
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !148, file: !145, line: 68, baseType: !165, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !148, file: !145, line: 71, baseType: !167, size: 8, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !148, file: !145, line: 74, baseType: !167, size: 8, offset: 104)
!170 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !145, line: 90, baseType: !171, size: 16, offset: 112)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !145, line: 90, size: 16, elements: !172)
!172 = !{!173, !180}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !145, line: 91, baseType: !174, size: 16)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !145, line: 91, size: 16, elements: !175)
!175 = !{!176, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !174, file: !145, line: 96, baseType: !177, size: 8)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !178)
!178 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !174, file: !145, line: 97, baseType: !167, size: 8, offset: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !171, file: !145, line: 100, baseType: !181, size: 16)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !182)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !148, file: !145, line: 107, baseType: !110, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !148, file: !145, line: 127, baseType: !108, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !148, file: !145, line: 131, baseType: !186, size: 192, offset: 192)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !123, line: 244, size: 192, elements: !187)
!187 = !{!188, !189, !195}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !186, file: !123, line: 245, baseType: !154, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !186, file: !123, line: 246, baseType: !190, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !123, line: 242, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !186, file: !123, line: 249, baseType: !106, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !144, file: !145, line: 250, baseType: !197, size: 288, offset: 384)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !198, line: 25, size: 288, elements: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !197, file: !198, line: 26, baseType: !110, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !197, file: !198, line: 27, baseType: !110, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !197, file: !198, line: 28, baseType: !110, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !197, file: !198, line: 29, baseType: !110, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !197, file: !198, line: 30, baseType: !110, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !197, file: !198, line: 31, baseType: !110, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !197, file: !198, line: 32, baseType: !110, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !197, file: !198, line: 33, baseType: !110, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !197, file: !198, line: 34, baseType: !110, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !144, file: !145, line: 253, baseType: !108, size: 32, offset: 672)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !144, file: !145, line: 256, baseType: !122, size: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !144, file: !145, line: 271, baseType: !212, size: 128, offset: 768)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !145, line: 34, size: 128, elements: !213)
!213 = !{!214, !220, !221, !222}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !212, file: !145, line: 35, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !216, line: 46, baseType: !217)
!216 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !108, !108, !108}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !212, file: !145, line: 36, baseType: !108, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !212, file: !145, line: 37, baseType: !108, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !212, file: !145, line: 38, baseType: !108, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !144, file: !145, line: 274, baseType: !143, size: 32, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !145, line: 279, baseType: !225, size: 256, offset: 928)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 256, elements: !227)
!226 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!227 = !{!228}
!228 = !DISubrange(count: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !144, file: !145, line: 294, baseType: !109, size: 32, offset: 1184)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !144, file: !145, line: 300, baseType: !231, size: 96, offset: 1216)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !145, line: 149, size: 96, elements: !232)
!232 = !{!233, !234, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !231, file: !145, line: 153, baseType: !22, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !231, file: !145, line: 162, baseType: !235, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !236, line: 214, baseType: !32)
!236 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !231, file: !145, line: 168, baseType: !235, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !144, file: !145, line: 325, baseType: !239, size: 32, offset: 1312)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !119, line: 5073, size: 192, elements: !241)
!241 = !{!242, !251, !252}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !240, file: !119, line: 5074, baseType: !243, size: 96)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !244, line: 56, size: 96, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{!246, !249, !250}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !243, file: !244, line: 57, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !244, line: 57, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !243, file: !244, line: 58, baseType: !108, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !243, file: !244, line: 59, baseType: !235, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !240, file: !119, line: 5075, baseType: !122, size: 64, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !240, file: !119, line: 5076, baseType: !253, size: 32, offset: 160)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !254, line: 43, size: 32, elements: !255)
!254 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !253, file: !254, line: 52, baseType: !22, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !144, file: !145, line: 343, baseType: !258, size: 64, offset: 1344)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !198, line: 60, size: 64, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !258, file: !198, line: 63, baseType: !110, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !258, file: !198, line: 66, baseType: !110, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !118, file: !119, line: 2727, baseType: !110, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !118, file: !119, line: 2730, baseType: !109, size: 32, offset: 128)
!264 = !{!265}
!265 = !DISubrange(count: 6)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "threads", scope: !27, file: !116, line: 160, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8448, elements: !264)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "stacks", scope: !27, file: !116, line: 159, type: !271, isLocal: true, isDefinition: true, align: 512)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 101376, elements: !276)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !273, line: 47, size: 8, elements: !274)
!273 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !272, file: !273, line: 48, baseType: !226, size: 8)
!276 = !{!265, !277}
!277 = !DISubrange(count: 2112)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 192, elements: !264)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "_char_out", scope: !282, file: !286, line: 54, type: !287, isLocal: false, isDefinition: true)
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !284, globals: !285, splitDebugInlining: false, nameTableKind: None)
!283 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!284 = !{!108, !109}
!285 = !{!280}
!286 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{!109, !109}
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !292, file: !322, line: 60, type: !323, isLocal: true, isDefinition: true, align: 32)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !294, globals: !321, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!294 = !{!295, !315}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !297, line: 386, baseType: !298)
!297 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 370, size: 448, elements: !299)
!299 = !{!300, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !298, file: !297, line: 372, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !298, file: !297, line: 373, baseType: !301, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !298, file: !297, line: 374, baseType: !301, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !298, file: !297, line: 375, baseType: !301, size: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !298, file: !297, line: 376, baseType: !301, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !298, file: !297, line: 377, baseType: !301, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !298, file: !297, line: 378, baseType: !301, size: 32, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !298, file: !297, line: 379, baseType: !301, size: 32, offset: 224)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !298, file: !297, line: 380, baseType: !301, size: 32, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !298, file: !297, line: 381, baseType: !301, size: 32, offset: 288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !298, file: !297, line: 382, baseType: !301, size: 32, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !298, file: !297, line: 383, baseType: !301, size: 32, offset: 352)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !298, file: !297, line: 384, baseType: !301, size: 32, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !298, file: !297, line: 385, baseType: !301, size: 32, offset: 416)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !297, line: 364, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 360, size: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !317, file: !297, line: 362, baseType: !301, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !317, file: !297, line: 363, baseType: !301, size: 32, offset: 32)
!321 = !{!290}
!322 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !325, line: 51, size: 64, elements: !326)
!325 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!326 = !{!327, !355}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !324, file: !325, line: 60, baseType: !328, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DISubroutineType(types: !330)
!330 = !{!109, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !334, line: 378, size: 192, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{!336, !339, !340, !341, !348, !349}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !334, line: 380, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !333, file: !334, line: 382, baseType: !13, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !333, file: !334, line: 384, baseType: !13, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !333, file: !334, line: 386, baseType: !342, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !334, line: 351, size: 16, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !343, file: !334, line: 359, baseType: !167, size: 8)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !343, file: !334, line: 364, baseType: !347, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!347 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !333, file: !334, line: 388, baseType: !108, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !333, file: !334, line: 396, baseType: !350, size: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !334, line: 43, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !354)
!354 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !324, file: !325, line: 65, baseType: !331, size: 32, offset: 32)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !358, file: !361, line: 71, type: !362, isLocal: true, isDefinition: true, align: 32)
!358 = distinct !DICompileUnit(language: DW_LANG_C99, file: !359, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !360, splitDebugInlining: false, nameTableKind: None)
!359 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!360 = !{!356}
!361 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !325, line: 51, size: 64, elements: !364)
!364 = !{!365, !384}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !363, file: !325, line: 60, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!367 = !DISubroutineType(types: !368)
!368 = !{!109, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !334, line: 378, size: 192, elements: !372)
!372 = !{!373, !374, !375, !376, !382, !383}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !371, file: !334, line: 380, baseType: !337, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !371, file: !334, line: 382, baseType: !13, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !371, file: !334, line: 384, baseType: !13, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !371, file: !334, line: 386, baseType: !377, size: 32, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !334, line: 351, size: 16, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !378, file: !334, line: 359, baseType: !167, size: 8)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !378, file: !334, line: 364, baseType: !347, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !371, file: !334, line: 388, baseType: !108, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !371, file: !334, line: 396, baseType: !350, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !363, file: !325, line: 65, baseType: !369, size: 32, offset: 32)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "_kernel_thread_info_offsets", scope: !387, file: !392, line: 41, type: !395, isLocal: false, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !284, globals: !389, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!389 = !{!385, !390, !393}
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "_kernel_thread_info_num_offsets", scope: !387, file: !392, line: 140, type: !235, isLocal: false, isDefinition: true)
!392 = !DIFile(filename: "zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "_kernel_thread_info_size_t_size", scope: !387, file: !392, line: 145, type: !167, isLocal: false, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 448, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 14)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "static_regions", scope: !400, file: !407, line: 62, type: !540, isLocal: true, isDefinition: true)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !402, globals: !403, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!402 = !{!235, !109, !110, !108}
!403 = !{!404, !398}
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !406, file: !407, line: 198, type: !526, isLocal: true, isDefinition: true)
!406 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !407, file: !407, line: 175, type: !408, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !400, retainedNodes: !521)
!407 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = !DISubroutineType(types: !409)
!409 = !{null, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !145, line: 245, size: 1408, elements: !412)
!412 = !{!413, !471, !483, !484, !485, !492, !493, !494, !495, !501, !516}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !411, file: !145, line: 247, baseType: !414, size: 384)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !145, line: 57, size: 384, elements: !415)
!415 = !{!416, !440, !447, !448, !449, !458, !459, !460}
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !145, line: 60, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !145, line: 60, size: 64, elements: !418)
!418 = !{!419, !434}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !417, file: !145, line: 61, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !128, line: 49, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !128, line: 37, size: 64, elements: !422)
!422 = !{!423, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, scope: !421, file: !128, line: 38, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !128, line: 38, size: 32, elements: !425)
!425 = !{!426, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !424, file: !128, line: 39, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !128, line: 40, baseType: !427, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, scope: !421, file: !128, line: 42, baseType: !430, size: 32, offset: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !128, line: 42, size: 32, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !430, file: !128, line: 43, baseType: !427, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !430, file: !128, line: 44, baseType: !427, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !417, file: !145, line: 62, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !435, file: !157, line: 50, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 64, elements: !162)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !414, file: !145, line: 68, baseType: !441, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !123, line: 233, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 231, size: 64, elements: !444)
!444 = !{!445}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !443, file: !123, line: 232, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !128, line: 48, baseType: !421)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !414, file: !145, line: 71, baseType: !167, size: 8, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !414, file: !145, line: 74, baseType: !167, size: 8, offset: 104)
!449 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !145, line: 90, baseType: !450, size: 16, offset: 112)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !145, line: 90, size: 16, elements: !451)
!451 = !{!452, !457}
!452 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !145, line: 91, baseType: !453, size: 16)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !450, file: !145, line: 91, size: 16, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !453, file: !145, line: 96, baseType: !177, size: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !453, file: !145, line: 97, baseType: !167, size: 8, offset: 8)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !450, file: !145, line: 100, baseType: !181, size: 16)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !414, file: !145, line: 107, baseType: !110, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !414, file: !145, line: 127, baseType: !108, size: 32, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !414, file: !145, line: 131, baseType: !461, size: 192, offset: 192)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !123, line: 244, size: 192, elements: !462)
!462 = !{!463, !464, !470}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !461, file: !123, line: 245, baseType: !420, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !461, file: !123, line: 246, baseType: !465, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !123, line: 242, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !461, file: !123, line: 249, baseType: !106, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !411, file: !145, line: 250, baseType: !472, size: 288, offset: 384)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !198, line: 25, size: 288, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !472, file: !198, line: 26, baseType: !110, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !472, file: !198, line: 27, baseType: !110, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !472, file: !198, line: 28, baseType: !110, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !472, file: !198, line: 29, baseType: !110, size: 32, offset: 96)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !472, file: !198, line: 30, baseType: !110, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !472, file: !198, line: 31, baseType: !110, size: 32, offset: 160)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !472, file: !198, line: 32, baseType: !110, size: 32, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !472, file: !198, line: 33, baseType: !110, size: 32, offset: 224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !472, file: !198, line: 34, baseType: !110, size: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !411, file: !145, line: 253, baseType: !108, size: 32, offset: 672)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !411, file: !145, line: 256, baseType: !442, size: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !411, file: !145, line: 271, baseType: !486, size: 128, offset: 768)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !145, line: 34, size: 128, elements: !487)
!487 = !{!488, !489, !490, !491}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !486, file: !145, line: 35, baseType: !215, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !486, file: !145, line: 36, baseType: !108, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !486, file: !145, line: 37, baseType: !108, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !486, file: !145, line: 38, baseType: !108, size: 32, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !411, file: !145, line: 274, baseType: !410, size: 32, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !145, line: 279, baseType: !225, size: 256, offset: 928)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !411, file: !145, line: 294, baseType: !109, size: 32, offset: 1184)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !411, file: !145, line: 300, baseType: !496, size: 96, offset: 1216)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !145, line: 149, size: 96, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !496, file: !145, line: 153, baseType: !22, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !496, file: !145, line: 162, baseType: !235, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !496, file: !145, line: 168, baseType: !235, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !411, file: !145, line: 325, baseType: !502, size: 32, offset: 1312)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !119, line: 5073, size: 192, elements: !504)
!504 = !{!505, !511, !512}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !503, file: !119, line: 5074, baseType: !506, size: 96)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !244, line: 56, size: 96, elements: !507)
!507 = !{!508, !509, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !506, file: !244, line: 57, baseType: !247, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !506, file: !244, line: 58, baseType: !108, size: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !506, file: !244, line: 59, baseType: !235, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !503, file: !119, line: 5075, baseType: !442, size: 64, offset: 96)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !503, file: !119, line: 5076, baseType: !513, size: 32, offset: 160)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !254, line: 43, size: 32, elements: !514)
!514 = !{!515}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !513, file: !254, line: 52, baseType: !22, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !411, file: !145, line: 343, baseType: !517, size: 64, offset: 1344)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !198, line: 60, size: 64, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !517, file: !198, line: 63, baseType: !110, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !517, file: !198, line: 66, baseType: !110, size: 32, offset: 32)
!521 = !{!522, !523, !524, !525}
!522 = !DILocalVariable(name: "thread", arg: 1, scope: !406, file: !407, line: 175, type: !410)
!523 = !DILocalVariable(name: "region_num", scope: !406, file: !407, line: 200, type: !167)
!524 = !DILocalVariable(name: "guard_start", scope: !406, file: !407, line: 265, type: !22)
!525 = !DILocalVariable(name: "guard_size", scope: !406, file: !407, line: 266, type: !235)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 96, elements: !538)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !528, line: 52, size: 96, elements: !529)
!528 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!529 = !{!530, !531, !532}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !527, file: !528, line: 53, baseType: !22, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !527, file: !528, line: 54, baseType: !235, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !527, file: !528, line: 55, baseType: !533, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !534, line: 151, baseType: !535)
!534 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !534, line: 149, size: 32, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !535, file: !534, line: 150, baseType: !110, size: 32)
!538 = !{!539}
!539 = !DISubrange(count: 1)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 96, elements: !538)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !544, file: !577, line: 39, type: !167, isLocal: true, isDefinition: true)
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !545, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !546, globals: !576, splitDebugInlining: false, nameTableKind: None)
!545 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!546 = !{!547, !108, !109, !564, !167}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !549, line: 1168, baseType: !550)
!549 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 1155, size: 352, elements: !551)
!551 = !{!552, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !550, file: !549, line: 1157, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !550, file: !549, line: 1158, baseType: !301, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !550, file: !549, line: 1159, baseType: !301, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !550, file: !549, line: 1160, baseType: !301, size: 32, offset: 96)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !550, file: !549, line: 1161, baseType: !301, size: 32, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !550, file: !549, line: 1162, baseType: !301, size: 32, offset: 160)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !550, file: !549, line: 1163, baseType: !301, size: 32, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !550, file: !549, line: 1164, baseType: !301, size: 32, offset: 224)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !550, file: !549, line: 1165, baseType: !301, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !550, file: !549, line: 1166, baseType: !301, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !550, file: !549, line: 1167, baseType: !301, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !567, line: 27, size: 96, elements: !568)
!567 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!568 = !{!569, !570, !571}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !566, file: !567, line: 29, baseType: !110, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !566, file: !567, line: 31, baseType: !337, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !566, file: !567, line: 37, baseType: !572, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !534, line: 146, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !534, line: 141, size: 32, elements: !574)
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !573, file: !534, line: 143, baseType: !110, size: 32)
!576 = !{!542}
!577 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !580, file: !585, line: 13, type: !602, isLocal: true, isDefinition: true)
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !582, splitDebugInlining: false, nameTableKind: None)
!581 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!582 = !{!583, !578}
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "mpu_config", scope: !580, file: !585, line: 37, type: !586, isLocal: false, isDefinition: true)
!585 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !567, line: 41, size: 64, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !587, file: !567, line: 43, baseType: !110, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !587, file: !567, line: 45, baseType: !591, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !567, line: 27, size: 96, elements: !594)
!594 = !{!595, !596, !597}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !593, file: !567, line: 29, baseType: !110, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !593, file: !567, line: 31, baseType: !337, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !593, file: !567, line: 37, baseType: !598, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !534, line: 146, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !534, line: 141, size: 32, elements: !600)
!600 = !{!601}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !599, file: !534, line: 143, baseType: !110, size: 32)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 192, elements: !162)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !605, file: !702, line: 36, type: !703, isLocal: true, isDefinition: true, align: 32)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !607, retainedTypes: !619, globals: !701, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!607 = !{!608, !614}
!608 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !609, line: 506, baseType: !32, size: 32, elements: !610)
!609 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!610 = !{!611, !612, !613}
!611 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!612 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!613 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!614 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !609, line: 512, baseType: !32, size: 32, elements: !615)
!615 = !{!616, !617, !618}
!616 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!617 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!618 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!619 = !{!620, !690, !695, !655, !614, !608, !700, !108}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !609, line: 523, size: 288, elements: !623)
!623 = !{!624, !645, !651, !656, !660, !661, !662, !666, !686}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !622, file: !609, line: 524, baseType: !625, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!626 = !DISubroutineType(types: !627)
!627 = !{!109, !628, !643, !644}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !334, line: 378, size: 192, elements: !631)
!631 = !{!632, !633, !634, !635, !641, !642}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !630, file: !334, line: 380, baseType: !337, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !630, file: !334, line: 382, baseType: !13, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !630, file: !334, line: 384, baseType: !13, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !630, file: !334, line: 386, baseType: !636, size: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !334, line: 351, size: 16, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !637, file: !334, line: 359, baseType: !167, size: 8)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !637, file: !334, line: 364, baseType: !347, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !630, file: !334, line: 388, baseType: !108, size: 32, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !630, file: !334, line: 396, baseType: !350, size: 32, offset: 160)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !609, line: 237, baseType: !167)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !609, line: 257, baseType: !110)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !622, file: !609, line: 530, baseType: !646, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DISubroutineType(types: !648)
!648 = !{!109, !628, !649}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !609, line: 229, baseType: !110)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !622, file: !609, line: 532, baseType: !652, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DISubroutineType(types: !654)
!654 = !{!109, !628, !655, !650}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !609, line: 216, baseType: !110)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !622, file: !609, line: 535, baseType: !657, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DISubroutineType(types: !659)
!659 = !{!109, !628, !655}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !622, file: !609, line: 537, baseType: !657, size: 32, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !622, file: !609, line: 539, baseType: !657, size: 32, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !622, file: !609, line: 541, baseType: !663, size: 32, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DISubroutineType(types: !665)
!665 = !{!109, !628, !643, !608, !614}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !622, file: !609, line: 544, baseType: !667, size: 32, offset: 224)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DISubroutineType(types: !669)
!669 = !{!109, !628, !670, !347}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !609, line: 478, size: 96, elements: !672)
!672 = !{!673, !680, !685}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !671, file: !609, line: 482, baseType: !674, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !675, line: 33, baseType: !676)
!675 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !675, line: 29, size: 32, elements: !677)
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !675, line: 30, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !671, file: !609, line: 485, baseType: !681, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !609, line: 464, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !628, !670, !655}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !671, file: !609, line: 493, baseType: !655, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !622, file: !609, line: 547, baseType: !687, size: 32, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DISubroutineType(types: !689)
!689 = !{!110, !628}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !609, line: 428, size: 32, elements: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !692, file: !609, line: 434, baseType: !655, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !609, line: 441, size: 32, elements: !698)
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !697, file: !609, line: 447, baseType: !655, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!701 = !{!603}
!702 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !325, line: 51, size: 64, elements: !705)
!705 = !{!706, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !704, file: !325, line: 60, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DISubroutineType(types: !709)
!709 = !{!109, !628}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !704, file: !325, line: 65, baseType: !628, size: 32, offset: 32)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !713, file: !785, line: 48, type: !861, isLocal: true, isDefinition: true)
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !715, retainedTypes: !771, globals: !782, splitDebugInlining: false, nameTableKind: None)
!714 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!715 = !{!30, !716}
!716 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 69, baseType: !109, size: 32, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770}
!718 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!719 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!720 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!721 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!722 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!723 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!724 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!725 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!726 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!727 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!728 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!729 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!730 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!731 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!732 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!733 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!734 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!735 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!736 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!737 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!738 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!739 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!740 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!741 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!742 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!743 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!744 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!745 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!746 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!747 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!748 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!749 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!750 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!751 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!752 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!753 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!754 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!755 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!756 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!757 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!758 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!759 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!760 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!761 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!762 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!763 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!764 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!765 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!766 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!767 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!768 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!769 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!770 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!771 = !{!235, !109, !108, !772}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !297, line: 270, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 262, size: 192, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !774, file: !297, line: 264, baseType: !301, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !774, file: !297, line: 265, baseType: !301, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !774, file: !297, line: 266, baseType: !301, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !774, file: !297, line: 267, baseType: !301, size: 32, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !774, file: !297, line: 268, baseType: !301, size: 32, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !774, file: !297, line: 269, baseType: !301, size: 32, offset: 160)
!782 = !{!783, !789, !805, !816, !833, !711, !835, !849, !851, !853, !855, !857, !859}
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !713, file: !785, line: 424, type: !786, isLocal: false, isDefinition: true, align: 16)
!785 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 64, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 4)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !713, file: !785, line: 424, type: !791, isLocal: false, isDefinition: true, align: 32)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !334, line: 378, size: 192, elements: !793)
!793 = !{!794, !795, !796, !797, !803, !804}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !792, file: !334, line: 380, baseType: !337, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !792, file: !334, line: 382, baseType: !13, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !792, file: !334, line: 384, baseType: !13, size: 32, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !792, file: !334, line: 386, baseType: !798, size: 32, offset: 96)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !334, line: 351, size: 16, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !799, file: !334, line: 359, baseType: !167, size: 8)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !799, file: !334, line: 364, baseType: !347, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !792, file: !334, line: 388, baseType: !108, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !792, file: !334, line: 396, baseType: !350, size: 32, offset: 160)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !713, file: !785, line: 424, type: !807, isLocal: true, isDefinition: true, align: 32)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !325, line: 51, size: 64, elements: !809)
!809 = !{!810, !815}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !808, file: !325, line: 60, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DISubroutineType(types: !813)
!813 = !{!109, !814}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !808, file: !325, line: 65, baseType: !814, size: 32, offset: 32)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "exti_data", scope: !713, file: !785, line: 423, type: !818, isLocal: true, isDefinition: true)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !785, line: 107, size: 1024, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !818, file: !785, line: 109, baseType: !821, size: 1024)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 1024, elements: !831)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !785, line: 101, size: 64, elements: !823)
!823 = !{!824, !830}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !822, file: !785, line: 102, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !826, line: 63, baseType: !827)
!826 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !109, !108}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !822, file: !785, line: 103, baseType: !108, size: 32, offset: 32)
!831 = !{!832}
!832 = !DISubrange(count: 16)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !713, file: !785, line: 424, type: !799, isLocal: true, isDefinition: true, align: 8)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !837, file: !785, line: 493, type: !842, isLocal: true, isDefinition: true, align: 32)
!837 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !785, file: !785, line: 460, type: !838, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !713, retainedNodes: !840)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !814}
!840 = !{!841}
!841 = !DILocalVariable(name: "dev", arg: 1, scope: !837, file: !785, line: 460, type: !814)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !843)
!843 = !{!844, !846, !847, !848}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !842, file: !10, line: 55, baseType: !845, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !842, file: !10, line: 57, baseType: !845, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !842, file: !10, line: 59, baseType: !108, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !842, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !837, file: !785, line: 497, type: !842, isLocal: true, isDefinition: true, align: 32)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !837, file: !785, line: 507, type: !842, isLocal: true, isDefinition: true, align: 32)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !837, file: !785, line: 512, type: !842, isLocal: true, isDefinition: true, align: 32)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !837, file: !785, line: 516, type: !842, isLocal: true, isDefinition: true, align: 32)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !837, file: !785, line: 523, type: !842, isLocal: true, isDefinition: true, align: 32)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !837, file: !785, line: 527, type: !842, isLocal: true, isDefinition: true, align: 32)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 512, elements: !831)
!862 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !297, line: 127, baseType: !716)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !866, file: !871, line: 21, type: !891, isLocal: false, isDefinition: true, align: 16)
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !868, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!868 = !{!869, !864, !875, !877, !879, !881, !883, !885, !887, !889}
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !866, file: !871, line: 16, type: !872, isLocal: false, isDefinition: true, align: 16)
!871 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 176, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 11)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !866, file: !871, line: 28, type: !786, isLocal: false, isDefinition: true, align: 16)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !866, file: !871, line: 35, type: !786, isLocal: false, isDefinition: true, align: 16)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !866, file: !871, line: 42, type: !786, isLocal: false, isDefinition: true, align: 16)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !866, file: !871, line: 49, type: !786, isLocal: false, isDefinition: true, align: 16)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !866, file: !871, line: 56, type: !786, isLocal: false, isDefinition: true, align: 16)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !866, file: !871, line: 63, type: !786, isLocal: false, isDefinition: true, align: 16)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !866, file: !871, line: 70, type: !786, isLocal: false, isDefinition: true, align: 16)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !866, file: !871, line: 77, type: !786, isLocal: false, isDefinition: true, align: 16)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 48, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 3)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !896, file: !940, line: 398, type: !971, isLocal: true, isDefinition: true)
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !898, retainedTypes: !911, globals: !937, splitDebugInlining: false, nameTableKind: None)
!897 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!898 = !{!899, !30, !904}
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !900, line: 190, baseType: !32, size: 32, elements: !901)
!900 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!901 = !{!902, !903}
!902 = !DIEnumerator(name: "SUCCESS", value: 0)
!903 = !DIEnumerator(name: "ERROR", value: 1)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !905, line: 44, baseType: !32, size: 32, elements: !906)
!905 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!908 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!909 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!910 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!911 = !{!108, !109, !110, !912, !930, !936}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !297, line: 386, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 370, size: 448, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !914, file: !297, line: 372, baseType: !301, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !914, file: !297, line: 373, baseType: !301, size: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !914, file: !297, line: 374, baseType: !301, size: 32, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !914, file: !297, line: 375, baseType: !301, size: 32, offset: 96)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !914, file: !297, line: 376, baseType: !301, size: 32, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !914, file: !297, line: 377, baseType: !301, size: 32, offset: 160)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !914, file: !297, line: 378, baseType: !301, size: 32, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !914, file: !297, line: 379, baseType: !301, size: 32, offset: 224)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !914, file: !297, line: 380, baseType: !301, size: 32, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !914, file: !297, line: 381, baseType: !301, size: 32, offset: 288)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !914, file: !297, line: 382, baseType: !301, size: 32, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !914, file: !297, line: 383, baseType: !301, size: 32, offset: 352)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !914, file: !297, line: 384, baseType: !301, size: 32, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !914, file: !297, line: 385, baseType: !301, size: 32, offset: 416)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !932, line: 343, size: 64, elements: !933)
!932 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !931, file: !932, line: 344, baseType: !110, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !931, file: !932, line: 345, baseType: !110, size: 32, offset: 32)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!937 = !{!938, !942, !958, !969, !894}
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !896, file: !940, line: 752, type: !941, isLocal: false, isDefinition: true, align: 16)
!940 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 512, elements: !227)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !896, file: !940, line: 752, type: !944, isLocal: false, isDefinition: true, align: 32)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !334, line: 378, size: 192, elements: !946)
!946 = !{!947, !948, !949, !950, !956, !957}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !945, file: !334, line: 380, baseType: !337, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !945, file: !334, line: 382, baseType: !13, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !945, file: !334, line: 384, baseType: !13, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !945, file: !334, line: 386, baseType: !951, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !334, line: 351, size: 16, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !952, file: !334, line: 359, baseType: !167, size: 8)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !952, file: !334, line: 364, baseType: !347, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !945, file: !334, line: 388, baseType: !108, size: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !945, file: !334, line: 396, baseType: !350, size: 32, offset: 160)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !896, file: !940, line: 752, type: !960, isLocal: true, isDefinition: true, align: 32)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !325, line: 51, size: 64, elements: !962)
!962 = !{!963, !968}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !961, file: !325, line: 60, baseType: !964, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(types: !966)
!966 = !{!109, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !961, file: !325, line: 65, baseType: !967, size: 32, offset: 32)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !896, file: !940, line: 752, type: !952, isLocal: true, isDefinition: true, align: 8)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !905, line: 100, size: 224, elements: !972)
!972 = !{!973, !979, !980, !989, !994, !999, !1005}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !971, file: !905, line: 101, baseType: !974, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !905, line: 76, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{!109, !967, !978}
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !905, line: 56, baseType: !108)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !971, file: !905, line: 102, baseType: !974, size: 32, offset: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !971, file: !905, line: 103, baseType: !981, size: 32, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !905, line: 83, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{!109, !967, !978, !985, !108}
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !905, line: 72, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !967, !978, !108}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !971, file: !905, line: 104, baseType: !990, size: 32, offset: 96)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !905, line: 79, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DISubroutineType(types: !993)
!993 = !{!109, !967, !978, !936}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !971, file: !905, line: 105, baseType: !995, size: 32, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !905, line: 88, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = !DISubroutineType(types: !998)
!998 = !{!904, !967, !978}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !971, file: !905, line: 106, baseType: !1000, size: 32, offset: 160)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !905, line: 92, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!109, !967, !978, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !905, line: 64, baseType: !108)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !971, file: !905, line: 107, baseType: !1006, size: 32, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !905, line: 96, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!109, !967, !978, !108}
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !1012, file: !1069, line: 603, type: !1071, isLocal: true, isDefinition: true, align: 32)
!1012 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1013, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !1014, globals: !1066, splitDebugInlining: false, nameTableKind: None)
!1013 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/philosophers")
!1014 = !{!108, !109, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !1018, line: 336, size: 160, elements: !1019)
!1018 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1019 = !{!1020, !1040, !1044, !1048, !1061}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !1017, file: !1018, line: 365, baseType: !1021, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!109, !1024, !1039}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !334, line: 378, size: 192, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1037, !1038}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1026, file: !334, line: 380, baseType: !337, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1026, file: !334, line: 382, baseType: !13, size: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1026, file: !334, line: 384, baseType: !13, size: 32, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1026, file: !334, line: 386, baseType: !1032, size: 32, offset: 96)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !334, line: 351, size: 16, elements: !1034)
!1034 = !{!1035, !1036}
