; ModuleID = 'build/arduino_mkrzero/subsys/task_wdt/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/task_wdt/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/task_wdt")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/task_wdt")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_k_thread_obj_control", scope: !27, file: !299, line: 118, type: !181, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !296, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/task_wdt/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/task_wdt")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !163, !176, !178}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !111, line: 134, size: 128, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !145, !150, !171}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !110, file: !111, line: 135, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !111, line: 113, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DISubroutineType(types: !117)
!117 = !{!107, !118, !134}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !121, line: 378, size: 192, elements: !122)
!121 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123, !127, !128, !129, !138, !139}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !120, file: !121, line: 380, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !120, file: !121, line: 382, baseType: !13, size: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !120, file: !121, line: 384, baseType: !13, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !120, file: !121, line: 386, baseType: !130, size: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !121, line: 351, size: 16, elements: !132)
!132 = !{!133, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !131, file: !121, line: 359, baseType: !134, size: 8)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !135)
!135 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !131, file: !121, line: 364, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!137 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !120, file: !121, line: 388, baseType: !102, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !120, file: !121, line: 396, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !121, line: 43, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !144)
!144 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !110, file: !111, line: 136, baseType: !146, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !111, line: 119, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DISubroutineType(types: !149)
!149 = !{!107, !118}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !110, file: !111, line: 137, baseType: !151, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !111, line: 125, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DISubroutineType(types: !154)
!154 = !{!107, !118, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !111, line: 88, size: 128, elements: !158)
!158 = !{!159, !165, !170}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !157, file: !111, line: 90, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !111, line: 72, size: 64, elements: !161)
!161 = !{!162, !164}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !160, file: !111, line: 74, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !160, file: !111, line: 76, baseType: !163, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !157, file: !111, line: 92, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !111, line: 85, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !118, !107}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !157, file: !111, line: 104, baseType: !134, size: 8, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !110, file: !111, line: 138, baseType: !172, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !111, line: 132, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{!107, !118, !107}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !177)
!177 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !179, line: 347, baseType: !180)
!179 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !179, line: 245, size: 1152, elements: !182)
!182 = !{!183, !250, !263, !264, !265, !269, !270, !291}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !181, file: !179, line: 247, baseType: !184, size: 384)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !179, line: 57, size: 384, elements: !185)
!185 = !{!186, !214, !222, !223, !224, !237, !238, !239}
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !184, file: !179, line: 60, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !184, file: !179, line: 60, size: 64, elements: !188)
!188 = !{!189, !205}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !187, file: !179, line: 61, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !191, line: 49, baseType: !192)
!191 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !191, line: 37, size: 64, elements: !193)
!193 = !{!194, !200}
!194 = !DIDerivedType(tag: DW_TAG_member, scope: !192, file: !191, line: 38, baseType: !195, size: 32)
!195 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !192, file: !191, line: 38, size: 32, elements: !196)
!196 = !{!197, !199}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !195, file: !191, line: 39, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !191, line: 40, baseType: !198, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, scope: !192, file: !191, line: 42, baseType: !201, size: 32, offset: 32)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !192, file: !191, line: 42, size: 32, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !201, file: !191, line: 43, baseType: !198, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !201, file: !191, line: 44, baseType: !198, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !187, file: !179, line: 62, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !207, line: 49, size: 64, elements: !208)
!207 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !206, file: !207, line: 50, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 64, elements: !212)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!212 = !{!213}
!213 = !DISubrange(count: 2)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !184, file: !179, line: 68, baseType: !215, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !217, line: 233, baseType: !218)
!217 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 231, size: 64, elements: !219)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !218, file: !217, line: 232, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !191, line: 48, baseType: !192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !184, file: !179, line: 71, baseType: !134, size: 8, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !184, file: !179, line: 74, baseType: !134, size: 8, offset: 104)
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !184, file: !179, line: 90, baseType: !225, size: 16, offset: 112)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !184, file: !179, line: 90, size: 16, elements: !226)
!226 = !{!227, !234}
!227 = !DIDerivedType(tag: DW_TAG_member, scope: !225, file: !179, line: 91, baseType: !228, size: 16)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !225, file: !179, line: 91, size: 16, elements: !229)
!229 = !{!230, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !228, file: !179, line: 96, baseType: !231, size: 8)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !232)
!232 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !228, file: !179, line: 97, baseType: !134, size: 8, offset: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !225, file: !179, line: 100, baseType: !235, size: 16)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !236)
!236 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !184, file: !179, line: 107, baseType: !163, size: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !184, file: !179, line: 127, baseType: !102, size: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !184, file: !179, line: 131, baseType: !240, size: 192, offset: 192)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !217, line: 244, size: 192, elements: !241)
!241 = !{!242, !243, !249}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !240, file: !217, line: 245, baseType: !190, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !240, file: !217, line: 246, baseType: !244, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !217, line: 242, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !240, file: !217, line: 249, baseType: !105, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !181, file: !179, line: 250, baseType: !251, size: 288, offset: 384)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !252, line: 25, size: 288, elements: !253)
!252 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !251, file: !252, line: 26, baseType: !163, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !251, file: !252, line: 27, baseType: !163, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !251, file: !252, line: 28, baseType: !163, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !251, file: !252, line: 29, baseType: !163, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !251, file: !252, line: 30, baseType: !163, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !251, file: !252, line: 31, baseType: !163, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !251, file: !252, line: 32, baseType: !163, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !251, file: !252, line: 33, baseType: !163, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !251, file: !252, line: 34, baseType: !163, size: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !181, file: !179, line: 253, baseType: !102, size: 32, offset: 672)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !181, file: !179, line: 256, baseType: !216, size: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !179, line: 279, baseType: !266, size: 256, offset: 768)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 256, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !181, file: !179, line: 294, baseType: !107, size: 32, offset: 1024)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !181, file: !179, line: 325, baseType: !271, size: 32, offset: 1056)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !273, line: 5073, size: 160, elements: !274)
!273 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !{!275, !286, !287}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !272, file: !273, line: 5074, baseType: !276, size: 96)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !277, line: 56, size: 96, elements: !278)
!277 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = !{!279, !282, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !276, file: !277, line: 57, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !277, line: 57, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !276, file: !277, line: 58, baseType: !102, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !276, file: !277, line: 59, baseType: !284, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !285, line: 214, baseType: !32)
!285 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !272, file: !273, line: 5075, baseType: !216, size: 64, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !272, file: !273, line: 5076, baseType: !288, offset: 160)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !289, line: 43, elements: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = !{}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !181, file: !179, line: 343, baseType: !292, size: 64, offset: 1088)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !252, line: 60, size: 64, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !292, file: !252, line: 63, baseType: !163, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !292, file: !252, line: 66, baseType: !163, size: 32, offset: 32)
!296 = !{!297, !329, !332, !25}
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "_k_thread_data_control", scope: !27, file: !299, line: 118, type: !300, isLocal: false, isDefinition: true, align: 32)
!299 = !DIFile(filename: "zephyr/samples/subsys/task_wdt/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !273, line: 620, size: 384, elements: !301)
!301 = !{!302, !303, !311, !312, !317, !318, !319, !320, !321, !322, !324, !328}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !300, file: !273, line: 621, baseType: !180, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !300, file: !273, line: 622, baseType: !304, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !306, line: 44, baseType: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !308, line: 47, size: 8, elements: !309)
!308 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !308, line: 48, baseType: !126, size: 8)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !300, file: !273, line: 623, baseType: !32, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !300, file: !273, line: 624, baseType: !313, size: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !306, line: 46, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !102, !102, !102}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !300, file: !273, line: 625, baseType: !102, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !300, file: !273, line: 626, baseType: !102, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !300, file: !273, line: 627, baseType: !102, size: 32, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !300, file: !273, line: 628, baseType: !107, size: 32, offset: 224)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !300, file: !273, line: 629, baseType: !163, size: 32, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !300, file: !273, line: 630, baseType: !323, size: 32, offset: 288)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !300, file: !273, line: 631, baseType: !325, size: 32, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{null}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !300, file: !273, line: 632, baseType: !124, size: 32, offset: 352)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "control", scope: !27, file: !299, line: 118, type: !331, isLocal: false, isDefinition: true)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "_k_thread_stack_control", scope: !27, file: !299, line: 118, type: !334, isLocal: false, isDefinition: true, align: 64)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 8192, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 1024)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !339, file: !405, line: 18, type: !407, isLocal: false, isDefinition: true)
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !341, retainedTypes: !348, globals: !402, splitDebugInlining: false, nameTableKind: None)
!340 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/task_wdt")
!341 = !{!342}
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !343, line: 121, baseType: !32, size: 32, elements: !344)
!343 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!344 = !{!345, !346, !347}
!345 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!346 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!347 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!348 = !{!22, !102, !24, !349, !351, !353, !284, !107, !354, !355, !357, !358, !359, !360, !235, !361, !373, !134, !374, !163, !124}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !363, line: 78, size: 32, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !372}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !362, file: !363, line: 80, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !363, line: 45, size: 32, elements: !367)
!367 = !{!368, !369, !370, !371}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !366, file: !363, line: 47, baseType: !134, size: 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !366, file: !363, line: 50, baseType: !134, size: 8, offset: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !366, file: !363, line: 53, baseType: !134, size: 8, offset: 16)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !366, file: !363, line: 56, baseType: !134, size: 8, offset: 24)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !362, file: !363, line: 82, baseType: !102, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !343, line: 88, size: 128, elements: !376)
!376 = !{!377, !394, !398}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !375, file: !343, line: 89, baseType: !378, size: 96)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !343, line: 66, size: 96, elements: !379)
!379 = !{!380, !391, !392}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !378, file: !343, line: 67, baseType: !381, size: 32)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !343, line: 51, size: 32, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !381, file: !343, line: 52, baseType: !163, size: 1, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !381, file: !343, line: 52, baseType: !163, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !381, file: !343, line: 52, baseType: !163, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !381, file: !343, line: 53, baseType: !163, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !381, file: !343, line: 54, baseType: !163, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !381, file: !343, line: 55, baseType: !163, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !381, file: !343, line: 56, baseType: !163, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !381, file: !343, line: 57, baseType: !163, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !378, file: !343, line: 75, baseType: !13, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !378, file: !343, line: 76, baseType: !393, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !343, line: 35, baseType: !163)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !375, file: !343, line: 93, baseType: !395, size: 32, offset: 96)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 4)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !375, file: !343, line: 94, baseType: !399, offset: 128)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: -1)
!402 = !{!337, !403}
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !339, file: !405, line: 18, type: !406, isLocal: true, isDefinition: true)
!405 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !409, line: 16, size: 64, elements: !410)
!409 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !408, file: !409, line: 17, baseType: !124, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !408, file: !409, line: 18, baseType: !134, size: 8, offset: 32)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "_char_out", scope: !415, file: !419, line: 54, type: !420, isLocal: false, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !417, globals: !418, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/task_wdt")
!417 = !{!102, !107}
!418 = !{!413}
!419 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!421 = !DISubroutineType(types: !422)
!422 = !{!107, !107}
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !425, file: !1157, line: 202, type: !1158, isLocal: true, isDefinition: true, align: 32)
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !427, globals: !1156, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/task_wdt")
!427 = !{!102, !107, !428, !550, !887, !888, !955}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !430, line: 335, baseType: !431)
!430 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 320, size: 288, elements: !432)
!432 = !{!433, !444, !450, !464, !475, !486, !490, !501, !502, !513, !514, !529, !530, !540}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !431, file: !430, line: 321, baseType: !434, size: 16)
!434 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !430, line: 50, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !430, line: 43, size: 16, elements: !437)
!437 = !{!438, !443}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !436, file: !430, line: 48, baseType: !439, size: 16)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !430, line: 44, size: 16, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !439, file: !430, line: 45, baseType: !235, size: 7, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !439, file: !430, line: 47, baseType: !235, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !436, file: !430, line: 49, baseType: !235, size: 16)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !431, file: !430, line: 322, baseType: !445, size: 16, offset: 16)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 16, elements: !212)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !447, line: 52, baseType: !448)
!447 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !134)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !431, file: !430, line: 323, baseType: !451, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !430, line: 107, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !430, line: 94, size: 32, elements: !454)
!454 = !{!455, !463}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !453, file: !430, line: 105, baseType: !456, size: 32)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !430, line: 95, size: 32, elements: !457)
!457 = !{!458, !459, !460, !461, !462}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !456, file: !430, line: 97, baseType: !163, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !456, file: !430, line: 99, baseType: !163, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !456, file: !430, line: 100, baseType: !163, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !456, file: !430, line: 102, baseType: !163, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !456, file: !430, line: 103, baseType: !163, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !453, file: !430, line: 106, baseType: !163, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !431, file: !430, line: 324, baseType: !465, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !430, line: 155, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !430, line: 148, size: 32, elements: !468)
!468 = !{!469, !474}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !467, file: !430, line: 153, baseType: !470, size: 32)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !467, file: !430, line: 149, size: 32, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !470, file: !430, line: 150, baseType: !163, size: 16, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !470, file: !430, line: 151, baseType: !163, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !467, file: !430, line: 154, baseType: !163, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !431, file: !430, line: 325, baseType: !476, size: 8, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !430, line: 194, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !430, line: 187, size: 8, elements: !479)
!479 = !{!480, !485}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !478, file: !430, line: 192, baseType: !481, size: 8)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !478, file: !430, line: 188, size: 8, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !481, file: !430, line: 189, baseType: !134, size: 1, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !481, file: !430, line: 190, baseType: !134, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !478, file: !430, line: 193, baseType: !134, size: 8)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !431, file: !430, line: 326, baseType: !487, size: 24, offset: 104)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 24, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 3)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !431, file: !430, line: 327, baseType: !491, size: 8, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !430, line: 215, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !430, line: 208, size: 8, elements: !494)
!494 = !{!495, !500}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !493, file: !430, line: 213, baseType: !496, size: 8)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !493, file: !430, line: 209, size: 8, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !496, file: !430, line: 210, baseType: !134, size: 1, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !496, file: !430, line: 211, baseType: !134, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !493, file: !430, line: 214, baseType: !134, size: 8)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !431, file: !430, line: 328, baseType: !487, size: 24, offset: 136)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !431, file: !430, line: 329, baseType: !503, size: 8, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !430, line: 236, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !430, line: 229, size: 8, elements: !506)
!506 = !{!507, !512}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !505, file: !430, line: 234, baseType: !508, size: 8)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !505, file: !430, line: 230, size: 8, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !508, file: !430, line: 231, baseType: !448, size: 1, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !508, file: !430, line: 232, baseType: !448, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !505, file: !430, line: 235, baseType: !134, size: 8)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !431, file: !430, line: 330, baseType: !487, size: 24, offset: 168)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !431, file: !430, line: 331, baseType: !515, size: 16, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !430, line: 262, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !430, line: 250, size: 16, elements: !518)
!518 = !{!519, !528}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !517, file: !430, line: 260, baseType: !520, size: 16)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !517, file: !430, line: 251, size: 16, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !520, file: !430, line: 252, baseType: !235, size: 1, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !520, file: !430, line: 253, baseType: !235, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !520, file: !430, line: 254, baseType: !235, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !520, file: !430, line: 255, baseType: !235, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !520, file: !430, line: 256, baseType: !235, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !520, file: !430, line: 258, baseType: !235, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !517, file: !430, line: 261, baseType: !235, size: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !431, file: !430, line: 332, baseType: !445, size: 16, offset: 208)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !431, file: !430, line: 333, baseType: !531, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !430, line: 290, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !430, line: 284, size: 32, elements: !534)
!534 = !{!535, !539}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !533, file: !430, line: 288, baseType: !536, size: 32)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !533, file: !430, line: 285, size: 32, elements: !537)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !536, file: !430, line: 286, baseType: !163, size: 22, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !533, file: !430, line: 289, baseType: !163, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !431, file: !430, line: 334, baseType: !541, size: 16, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !430, line: 308, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !430, line: 303, size: 16, elements: !544)
!544 = !{!545, !549}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !543, file: !430, line: 306, baseType: !546, size: 16)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !543, file: !430, line: 304, size: 16, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !546, file: !430, line: 305, baseType: !235, size: 16, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !543, file: !430, line: 307, baseType: !235, size: 16)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !552, line: 928, baseType: !553)
!552 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 899, size: 672, elements: !554)
!554 = !{!555, !579, !603, !629, !654, !670, !671, !689, !690, !707, !718, !719, !734, !754, !755, !767, !779, !789, !790, !807, !809, !820, !821, !833, !845, !846, !857, !873}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !553, file: !552, line: 900, baseType: !556, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !552, line: 64, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 43, size: 32, elements: !559)
!559 = !{!560, !578}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !558, file: !552, line: 62, baseType: !561, size: 32)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !558, file: !552, line: 44, size: 32, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !561, file: !552, line: 45, baseType: !163, size: 1, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !561, file: !552, line: 46, baseType: !163, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !561, file: !552, line: 47, baseType: !163, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !561, file: !552, line: 48, baseType: !163, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !561, file: !552, line: 49, baseType: !163, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !561, file: !552, line: 50, baseType: !163, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !561, file: !552, line: 51, baseType: !163, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !561, file: !552, line: 52, baseType: !163, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !561, file: !552, line: 53, baseType: !163, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !561, file: !552, line: 54, baseType: !163, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !561, file: !552, line: 55, baseType: !163, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !561, file: !552, line: 56, baseType: !163, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !561, file: !552, line: 58, baseType: !163, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !561, file: !552, line: 59, baseType: !163, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !561, file: !552, line: 60, baseType: !163, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !558, file: !552, line: 63, baseType: !163, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !553, file: !552, line: 901, baseType: !580, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !552, line: 125, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 104, size: 32, elements: !583)
!583 = !{!584, !602}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !582, file: !552, line: 123, baseType: !585, size: 32)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !582, file: !552, line: 105, size: 32, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !585, file: !552, line: 106, baseType: !163, size: 1, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !585, file: !552, line: 107, baseType: !163, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !585, file: !552, line: 108, baseType: !163, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !585, file: !552, line: 109, baseType: !163, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !585, file: !552, line: 110, baseType: !163, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !585, file: !552, line: 111, baseType: !163, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !585, file: !552, line: 112, baseType: !163, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !585, file: !552, line: 113, baseType: !163, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !585, file: !552, line: 114, baseType: !163, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !585, file: !552, line: 115, baseType: !163, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !585, file: !552, line: 116, baseType: !163, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !585, file: !552, line: 117, baseType: !163, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !585, file: !552, line: 119, baseType: !163, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !585, file: !552, line: 120, baseType: !163, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !585, file: !552, line: 121, baseType: !163, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !582, file: !552, line: 124, baseType: !163, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !553, file: !552, line: 902, baseType: !604, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !552, line: 186, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 165, size: 32, elements: !607)
!607 = !{!608, !628}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !606, file: !552, line: 184, baseType: !609, size: 32)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !606, file: !552, line: 166, size: 32, elements: !610)
!610 = !{!611, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !609, file: !552, line: 167, baseType: !612, size: 1, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !163)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !609, file: !552, line: 168, baseType: !612, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !609, file: !552, line: 169, baseType: !612, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !609, file: !552, line: 170, baseType: !612, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !609, file: !552, line: 171, baseType: !612, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !609, file: !552, line: 172, baseType: !612, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !609, file: !552, line: 173, baseType: !612, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !609, file: !552, line: 174, baseType: !612, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !609, file: !552, line: 175, baseType: !612, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !609, file: !552, line: 176, baseType: !612, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !609, file: !552, line: 177, baseType: !612, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !609, file: !552, line: 178, baseType: !612, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !609, file: !552, line: 180, baseType: !612, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !609, file: !552, line: 181, baseType: !612, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !609, file: !552, line: 182, baseType: !612, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !606, file: !552, line: 185, baseType: !163, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !553, file: !552, line: 903, baseType: !630, size: 32, offset: 96)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !552, line: 247, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 226, size: 32, elements: !634)
!634 = !{!635, !653}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !633, file: !552, line: 245, baseType: !636, size: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !633, file: !552, line: 227, size: 32, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !636, file: !552, line: 228, baseType: !163, size: 1, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !636, file: !552, line: 229, baseType: !163, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !636, file: !552, line: 230, baseType: !163, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !636, file: !552, line: 231, baseType: !163, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !636, file: !552, line: 232, baseType: !163, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !636, file: !552, line: 233, baseType: !163, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !636, file: !552, line: 234, baseType: !163, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !636, file: !552, line: 235, baseType: !163, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !636, file: !552, line: 236, baseType: !163, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !636, file: !552, line: 237, baseType: !163, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !636, file: !552, line: 238, baseType: !163, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !636, file: !552, line: 239, baseType: !163, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !636, file: !552, line: 241, baseType: !163, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !636, file: !552, line: 242, baseType: !163, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !636, file: !552, line: 243, baseType: !163, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !633, file: !552, line: 246, baseType: !163, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !553, file: !552, line: 904, baseType: !655, size: 16, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !552, line: 300, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 287, size: 16, elements: !658)
!658 = !{!659, !669}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !657, file: !552, line: 298, baseType: !660, size: 16)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !657, file: !552, line: 288, size: 16, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !660, file: !552, line: 290, baseType: !235, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !660, file: !552, line: 291, baseType: !235, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !660, file: !552, line: 293, baseType: !235, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !660, file: !552, line: 294, baseType: !235, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !660, file: !552, line: 295, baseType: !235, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !660, file: !552, line: 296, baseType: !235, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !660, file: !552, line: 297, baseType: !235, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !657, file: !552, line: 299, baseType: !235, size: 16)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !553, file: !552, line: 905, baseType: !445, size: 16, offset: 144)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !553, file: !552, line: 906, baseType: !672, size: 16, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !552, line: 352, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 336, size: 16, elements: !675)
!675 = !{!676, !688}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !674, file: !552, line: 350, baseType: !677, size: 16)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !674, file: !552, line: 337, size: 16, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !677, file: !552, line: 339, baseType: !235, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !677, file: !552, line: 340, baseType: !235, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !677, file: !552, line: 341, baseType: !235, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !677, file: !552, line: 342, baseType: !235, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !677, file: !552, line: 343, baseType: !235, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !677, file: !552, line: 344, baseType: !235, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !677, file: !552, line: 345, baseType: !235, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !677, file: !552, line: 346, baseType: !235, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !677, file: !552, line: 348, baseType: !235, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !674, file: !552, line: 351, baseType: !235, size: 16)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !553, file: !552, line: 907, baseType: !445, size: 16, offset: 176)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !553, file: !552, line: 908, baseType: !691, size: 32, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !552, line: 398, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 381, size: 32, elements: !694)
!694 = !{!695, !706}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !693, file: !552, line: 396, baseType: !696, size: 32)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !693, file: !552, line: 382, size: 32, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !696, file: !552, line: 384, baseType: !163, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !696, file: !552, line: 385, baseType: !163, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !696, file: !552, line: 386, baseType: !163, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !696, file: !552, line: 388, baseType: !163, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !696, file: !552, line: 389, baseType: !163, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !696, file: !552, line: 390, baseType: !163, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !696, file: !552, line: 392, baseType: !163, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !696, file: !552, line: 394, baseType: !163, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !693, file: !552, line: 397, baseType: !163, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !553, file: !552, line: 909, baseType: !708, size: 8, offset: 224)
!708 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !552, line: 433, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 426, size: 8, elements: !711)
!711 = !{!712, !717}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !710, file: !552, line: 431, baseType: !713, size: 8)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !710, file: !552, line: 427, size: 8, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !713, file: !552, line: 428, baseType: !134, size: 5, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !713, file: !552, line: 430, baseType: !134, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !710, file: !552, line: 432, baseType: !134, size: 8)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !553, file: !552, line: 910, baseType: !487, size: 24, offset: 232)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !553, file: !552, line: 911, baseType: !720, size: 32, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !552, line: 462, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 448, size: 32, elements: !723)
!723 = !{!724, !733}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !722, file: !552, line: 460, baseType: !725, size: 32)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !722, file: !552, line: 449, size: 32, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !725, file: !552, line: 451, baseType: !163, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !725, file: !552, line: 453, baseType: !163, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !725, file: !552, line: 454, baseType: !163, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !725, file: !552, line: 455, baseType: !163, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !725, file: !552, line: 457, baseType: !163, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !725, file: !552, line: 459, baseType: !163, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !722, file: !552, line: 461, baseType: !163, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !553, file: !552, line: 912, baseType: !735, size: 16, offset: 288)
!735 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !552, line: 520, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 503, size: 16, elements: !738)
!738 = !{!739, !753}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !737, file: !552, line: 518, baseType: !740, size: 16)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !737, file: !552, line: 504, size: 16, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !740, file: !552, line: 506, baseType: !235, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !740, file: !552, line: 507, baseType: !235, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !740, file: !552, line: 508, baseType: !235, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !740, file: !552, line: 509, baseType: !235, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !740, file: !552, line: 510, baseType: !235, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !740, file: !552, line: 511, baseType: !235, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !740, file: !552, line: 512, baseType: !235, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !740, file: !552, line: 513, baseType: !235, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !740, file: !552, line: 514, baseType: !235, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !740, file: !552, line: 515, baseType: !235, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !740, file: !552, line: 516, baseType: !235, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !737, file: !552, line: 519, baseType: !235, size: 16)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !553, file: !552, line: 913, baseType: !445, size: 16, offset: 304)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !553, file: !552, line: 914, baseType: !756, size: 32, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !552, line: 559, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 552, size: 32, elements: !759)
!759 = !{!760, !766}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !758, file: !552, line: 557, baseType: !761, size: 32)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !758, file: !552, line: 553, size: 32, elements: !762)
!762 = !{!763, !764, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !761, file: !552, line: 554, baseType: !163, size: 10, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !761, file: !552, line: 555, baseType: !163, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !761, file: !552, line: 556, baseType: !163, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !758, file: !552, line: 558, baseType: !163, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !553, file: !552, line: 915, baseType: !768, size: 32, offset: 352)
!768 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !552, line: 585, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 578, size: 32, elements: !771)
!771 = !{!772, !778}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !770, file: !552, line: 583, baseType: !773, size: 32)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !770, file: !552, line: 579, size: 32, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !773, file: !552, line: 580, baseType: !163, size: 16, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !773, file: !552, line: 581, baseType: !163, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !773, file: !552, line: 582, baseType: !163, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !770, file: !552, line: 584, baseType: !163, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !553, file: !552, line: 916, baseType: !780, size: 8, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !552, line: 610, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 604, size: 8, elements: !783)
!783 = !{!784, !788}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !782, file: !552, line: 608, baseType: !785, size: 8)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !782, file: !552, line: 605, size: 8, elements: !786)
!786 = !{!787}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !785, file: !552, line: 607, baseType: !134, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !782, file: !552, line: 609, baseType: !134, size: 8)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !553, file: !552, line: 917, baseType: !487, size: 24, offset: 392)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !553, file: !552, line: 918, baseType: !791, size: 32, offset: 416)
!791 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !552, line: 639, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 622, size: 32, elements: !794)
!794 = !{!795, !806}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !793, file: !552, line: 637, baseType: !796, size: 32)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !793, file: !552, line: 623, size: 32, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !796, file: !552, line: 625, baseType: !163, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !796, file: !552, line: 626, baseType: !163, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !796, file: !552, line: 627, baseType: !163, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !796, file: !552, line: 629, baseType: !163, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !796, file: !552, line: 631, baseType: !163, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !796, file: !552, line: 632, baseType: !163, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !796, file: !552, line: 634, baseType: !163, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !796, file: !552, line: 635, baseType: !163, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !793, file: !552, line: 638, baseType: !163, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !553, file: !552, line: 919, baseType: !808, size: 32, offset: 448)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 32, elements: !396)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !553, file: !552, line: 920, baseType: !810, size: 16, offset: 480)
!810 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !552, line: 715, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 706, size: 16, elements: !813)
!813 = !{!814, !819}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !812, file: !552, line: 713, baseType: !815, size: 16)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !812, file: !552, line: 707, size: 16, elements: !816)
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !815, file: !552, line: 709, baseType: !235, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !815, file: !552, line: 711, baseType: !235, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !812, file: !552, line: 714, baseType: !235, size: 16)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !553, file: !552, line: 921, baseType: !445, size: 16, offset: 496)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !553, file: !552, line: 922, baseType: !822, size: 32, offset: 512)
!822 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !552, line: 739, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 729, size: 32, elements: !825)
!825 = !{!826, !832}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !824, file: !552, line: 737, baseType: !827, size: 32)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !824, file: !552, line: 730, size: 32, elements: !828)
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !827, file: !552, line: 732, baseType: !163, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !827, file: !552, line: 733, baseType: !163, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !827, file: !552, line: 735, baseType: !163, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !824, file: !552, line: 738, baseType: !163, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !553, file: !552, line: 923, baseType: !834, size: 8, offset: 544)
!834 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !552, line: 765, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 756, size: 8, elements: !837)
!837 = !{!838, !844}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !836, file: !552, line: 763, baseType: !839, size: 8)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !836, file: !552, line: 757, size: 8, elements: !840)
!840 = !{!841, !842, !843}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !839, file: !552, line: 759, baseType: !134, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !839, file: !552, line: 761, baseType: !134, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !839, file: !552, line: 762, baseType: !134, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !836, file: !552, line: 764, baseType: !134, size: 8)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !553, file: !552, line: 924, baseType: !487, size: 24, offset: 552)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !553, file: !552, line: 925, baseType: !847, size: 32, offset: 576)
!847 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !552, line: 789, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 781, size: 32, elements: !850)
!850 = !{!851, !856}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !849, file: !552, line: 787, baseType: !852, size: 32)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !849, file: !552, line: 782, size: 32, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !852, file: !552, line: 783, baseType: !163, size: 12, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !852, file: !552, line: 785, baseType: !163, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !849, file: !552, line: 788, baseType: !163, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !553, file: !552, line: 926, baseType: !858, size: 32, offset: 608)
!858 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !552, line: 820, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 805, size: 32, elements: !861)
!861 = !{!862, !872}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !860, file: !552, line: 818, baseType: !863, size: 32)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !552, line: 806, size: 32, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !870, !871}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !863, file: !552, line: 807, baseType: !163, size: 2, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !863, file: !552, line: 808, baseType: !163, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !863, file: !552, line: 809, baseType: !163, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !863, file: !552, line: 810, baseType: !163, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !863, file: !552, line: 812, baseType: !163, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !863, file: !552, line: 814, baseType: !163, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !863, file: !552, line: 816, baseType: !163, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !860, file: !552, line: 819, baseType: !163, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !553, file: !552, line: 927, baseType: !874, size: 8, offset: 640)
!874 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !552, line: 881, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !552, line: 872, size: 8, elements: !878)
!878 = !{!879, !886}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !877, file: !552, line: 879, baseType: !880, size: 8)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !877, file: !552, line: 873, size: 8, elements: !881)
!881 = !{!882, !883, !884, !885}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !880, file: !552, line: 874, baseType: !134, size: 1, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !880, file: !552, line: 875, baseType: !134, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !880, file: !552, line: 876, baseType: !134, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !880, file: !552, line: 877, baseType: !134, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !877, file: !552, line: 880, baseType: !134, size: 8)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !890, line: 290, baseType: !891)
!890 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !890, line: 284, size: 96, elements: !892)
!892 = !{!893, !903, !914, !927, !944}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !891, file: !890, line: 285, baseType: !894, size: 8)
!894 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !890, line: 49, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !890, line: 43, size: 8, elements: !897)
!897 = !{!898, !902}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !896, file: !890, line: 47, baseType: !899, size: 8)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !896, file: !890, line: 44, size: 8, elements: !900)
!900 = !{!901}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !899, file: !890, line: 45, baseType: !134, size: 1, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !896, file: !890, line: 48, baseType: !134, size: 8)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !891, file: !890, line: 286, baseType: !904, size: 8, offset: 8)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !890, line: 67, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !890, line: 61, size: 8, elements: !908)
!908 = !{!909, !913}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !907, file: !890, line: 65, baseType: !910, size: 8)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !907, file: !890, line: 62, size: 8, elements: !911)
!911 = !{!912}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !910, file: !890, line: 64, baseType: !134, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !907, file: !890, line: 66, baseType: !134, size: 8)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !891, file: !890, line: 287, baseType: !915, size: 16, offset: 16)
!915 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !890, line: 89, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !890, line: 79, size: 16, elements: !918)
!918 = !{!919, !926}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !917, file: !890, line: 87, baseType: !920, size: 16)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !917, file: !890, line: 80, size: 16, elements: !921)
!921 = !{!922, !923, !924, !925}
