; ModuleID = 'build/96b_wistrio/metairq_dispatch/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }
%struct.k_sem = type { %union.anon, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !120, line: 10, type: !346, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !117, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/metairq_dispatch/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !105, !106, !107, !111, !113, !114, !116}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !110)
!110 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 214, baseType: !32)
!112 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !115)
!115 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !105)
!117 = !{!25, !118, !271, !275, !282, !315, !320, !324, !326}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "_k_thread_data_metairq_thread", scope: !27, file: !120, line: 28, type: !121, isLocal: false, isDefinition: true, align: 32)
!120 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !122, line: 620, size: 384, elements: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !{!124, !244, !252, !253, !258, !259, !260, !261, !262, !263, !264, !268}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !121, file: !122, line: 621, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !127, line: 245, size: 1024, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !198, !211, !212, !213, !214, !220, !239}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !126, file: !127, line: 247, baseType: !130, size: 384)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !127, line: 57, size: 384, elements: !131)
!131 = !{!132, !160, !168, !171, !172, !185, !186, !187}
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !127, line: 60, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !127, line: 60, size: 64, elements: !134)
!134 = !{!135, !151}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !133, file: !127, line: 61, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !139)
!139 = !{!140, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !137, line: 38, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !137, line: 38, size: 32, elements: !142)
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !137, line: 39, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !137, line: 40, baseType: !144, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !137, line: 42, baseType: !147, size: 32, offset: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !137, line: 42, size: 32, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !147, file: !137, line: 43, baseType: !144, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !137, line: 44, baseType: !144, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !133, file: !127, line: 62, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !153, line: 49, size: 64, elements: !154)
!153 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !152, file: !153, line: 50, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !158)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!158 = !{!159}
!159 = !DISubrange(count: 2)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !130, file: !127, line: 68, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !164)
!163 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !165)
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !164, file: !163, line: 232, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !138)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !130, file: !127, line: 71, baseType: !169, size: 8, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !170)
!170 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !130, file: !127, line: 74, baseType: !169, size: 8, offset: 104)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !127, line: 90, baseType: !173, size: 16, offset: 112)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !127, line: 90, size: 16, elements: !174)
!174 = !{!175, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, scope: !173, file: !127, line: 91, baseType: !176, size: 16)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !127, line: 91, size: 16, elements: !177)
!177 = !{!178, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !176, file: !127, line: 96, baseType: !179, size: 8)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !180)
!180 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !176, file: !127, line: 97, baseType: !169, size: 8, offset: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !173, file: !127, line: 100, baseType: !183, size: 16)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !184)
!184 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !130, file: !127, line: 107, baseType: !113, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !130, file: !127, line: 127, baseType: !104, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !130, file: !127, line: 131, baseType: !188, size: 192, offset: 192)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !189)
!189 = !{!190, !191, !197}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !188, file: !163, line: 245, baseType: !136, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !188, file: !163, line: 246, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !188, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !126, file: !127, line: 250, baseType: !199, size: 288, offset: 384)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !200, line: 25, size: 288, elements: !201)
!200 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !199, file: !200, line: 26, baseType: !113, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !199, file: !200, line: 27, baseType: !113, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !199, file: !200, line: 28, baseType: !113, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !199, file: !200, line: 29, baseType: !113, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !199, file: !200, line: 30, baseType: !113, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !199, file: !200, line: 31, baseType: !113, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !199, file: !200, line: 32, baseType: !113, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !199, file: !200, line: 33, baseType: !113, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !199, file: !200, line: 34, baseType: !113, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !126, file: !127, line: 253, baseType: !104, size: 32, offset: 672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !126, file: !127, line: 256, baseType: !162, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !126, file: !127, line: 294, baseType: !105, size: 32, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !126, file: !127, line: 300, baseType: !215, size: 96, offset: 800)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !127, line: 149, size: 96, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !215, file: !127, line: 153, baseType: !22, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !127, line: 162, baseType: !111, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !215, file: !127, line: 168, baseType: !111, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !126, file: !127, line: 325, baseType: !221, size: 32, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !122, line: 5073, size: 192, elements: !223)
!223 = !{!224, !233, !234}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !222, file: !122, line: 5074, baseType: !225, size: 96)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !226, line: 56, size: 96, elements: !227)
!226 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!227 = !{!228, !231, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !225, file: !226, line: 57, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !226, line: 57, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !225, file: !226, line: 58, baseType: !104, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !225, file: !226, line: 59, baseType: !111, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !222, file: !122, line: 5075, baseType: !162, size: 64, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !222, file: !122, line: 5076, baseType: !235, size: 32, offset: 160)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !237)
!236 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !235, file: !236, line: 52, baseType: !22, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !126, file: !127, line: 343, baseType: !240, size: 64, offset: 928)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !200, line: 60, size: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !240, file: !200, line: 63, baseType: !113, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !240, file: !200, line: 66, baseType: !113, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !121, file: !122, line: 622, baseType: !245, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !247, line: 44, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !249, line: 47, size: 8, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !248, file: !249, line: 48, baseType: !103, size: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !121, file: !122, line: 623, baseType: !32, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !121, file: !122, line: 624, baseType: !254, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !247, line: 46, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !104, !104, !104}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !121, file: !122, line: 625, baseType: !104, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !121, file: !122, line: 626, baseType: !104, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !121, file: !122, line: 627, baseType: !104, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !121, file: !122, line: 628, baseType: !105, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !121, file: !122, line: 629, baseType: !113, size: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !121, file: !122, line: 630, baseType: !116, size: 32, offset: 288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !121, file: !122, line: 631, baseType: !265, size: 32, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{null}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !121, file: !122, line: 632, baseType: !269, size: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "metairq_thread", scope: !27, file: !120, line: 28, type: !273, isLocal: false, isDefinition: true)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !127, line: 347, baseType: !125)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "report_cookie", scope: !27, file: !120, line: 46, type: !277, isLocal: false, isDefinition: true, align: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !122, line: 2909, size: 128, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !277, file: !122, line: 2910, baseType: !162, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !277, file: !122, line: 2911, baseType: !32, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !277, file: !122, line: 2912, baseType: !32, size: 32, offset: 96)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "threads", scope: !27, file: !120, line: 22, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 15872, elements: !313)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_rec", file: !120, line: 18, size: 3968, elements: !286)
!286 = !{!287, !288, !301}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !285, file: !120, line: 19, baseType: !126, size: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !285, file: !120, line: 20, baseType: !289, size: 352, offset: 1024)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !122, line: 4204, size: 352, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !289, file: !122, line: 4206, baseType: !162, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !289, file: !122, line: 4208, baseType: !235, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !289, file: !122, line: 4210, baseType: !111, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !289, file: !122, line: 4212, baseType: !113, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !289, file: !122, line: 4214, baseType: !102, size: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !289, file: !122, line: 4216, baseType: !102, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !289, file: !122, line: 4218, baseType: !102, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !289, file: !122, line: 4220, baseType: !102, size: 32, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !289, file: !122, line: 4222, baseType: !113, size: 32, offset: 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !289, file: !122, line: 4227, baseType: !169, size: 8, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "msgq_buf", scope: !285, file: !120, line: 21, baseType: !302, size: 2560, offset: 1376)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 2560, elements: !311)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msg", file: !304, line: 44, size: 160, elements: !305)
!304 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/msgdev.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !303, file: !304, line: 46, baseType: !113, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !303, file: !304, line: 49, baseType: !113, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !303, file: !304, line: 52, baseType: !113, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "proc_cyc", scope: !303, file: !304, line: 55, baseType: !113, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "metairq_latency", scope: !303, file: !304, line: 58, baseType: !113, size: 32, offset: 128)
!311 = !{!312}
!312 = !DISubrange(count: 16)
!313 = !{!314}
!314 = !DISubrange(count: 4)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "thread_stacks", scope: !27, file: !120, line: 24, type: !317, isLocal: false, isDefinition: true, align: 512)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 67584, elements: !318)
!318 = !{!314, !319}
!319 = !DISubrange(count: 2112)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "_k_thread_stack_metairq_thread", scope: !27, file: !120, line: 28, type: !322, isLocal: false, isDefinition: true, align: 512)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 16896, elements: !323)
!323 = !{!319}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "_k_thread_obj_metairq_thread", scope: !27, file: !120, line: 28, type: !126, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "stats", scope: !27, file: !120, line: 41, type: !328, isLocal: false, isDefinition: true)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 34, size: 4000, elements: !329)
!329 = !{!330, !333, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_mirq", scope: !328, file: !120, line: 35, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !332, line: 22, baseType: !106)
!332 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mirq_latencies", scope: !328, file: !120, line: 36, baseType: !334, size: 1280, offset: 32)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 1280, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 40)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !328, file: !120, line: 40, baseType: !338, size: 2688, offset: 1312)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 2688, elements: !313)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !120, line: 37, size: 672, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nevt", scope: !339, file: !120, line: 38, baseType: !113, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "latencies", scope: !339, file: !120, line: 39, baseType: !343, size: 640, offset: 32)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 640, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 20)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !349)
!348 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !347, file: !348, line: 17, baseType: !269, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !347, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "hw_msgs", scope: !354, file: !360, line: 27, type: !398, isLocal: false, isDefinition: true, align: 32)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !356, globals: !357, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/metairq_dispatch/src/msgdev.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!356 = !{!107, !104, !105, !113, !114}
!357 = !{!352, !358, !385, !387, !389, !392}
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "timeout", scope: !354, file: !360, line: 17, type: !361, isLocal: true, isDefinition: true)
!360 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/msgdev.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !362)
!362 = !{!363, !378, !384}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !361, file: !163, line: 245, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !366)
!366 = !{!367, !373}
!367 = !DIDerivedType(tag: DW_TAG_member, scope: !365, file: !137, line: 38, baseType: !368, size: 32)
!368 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !137, line: 38, size: 32, elements: !369)
!369 = !{!370, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !368, file: !137, line: 39, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !137, line: 40, baseType: !371, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, scope: !365, file: !137, line: 42, baseType: !374, size: 32, offset: 32)
!374 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !137, line: 42, size: 32, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !374, file: !137, line: 43, baseType: !371, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !374, file: !137, line: 44, baseType: !371, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !361, file: !163, line: 246, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !361, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "max_duty_cyc", scope: !354, file: !360, line: 23, type: !113, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "msg_seq", scope: !354, file: !360, line: 25, type: !113, isLocal: false, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "_k_fifo_buf_hw_msgs", scope: !354, file: !360, line: 27, type: !391, isLocal: true, isDefinition: true, align: 32)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 320, elements: !335)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "state", scope: !394, file: !360, line: 38, type: !114, isLocal: true, isDefinition: true)
!394 = distinct !DISubprogram(name: "rand32", scope: !360, file: !360, line: 36, type: !395, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !354, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!113}
!397 = !{}
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !122, line: 4204, size: 352, elements: !399)
!399 = !{!400, !406, !410, !411, !412, !413, !414, !415, !416, !417}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !398, file: !122, line: 4206, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !402, file: !163, line: 232, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !365)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !398, file: !122, line: 4208, baseType: !407, size: 32, offset: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !407, file: !236, line: 52, baseType: !22, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !398, file: !122, line: 4210, baseType: !111, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !398, file: !122, line: 4212, baseType: !113, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !398, file: !122, line: 4214, baseType: !102, size: 32, offset: 160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !398, file: !122, line: 4216, baseType: !102, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !398, file: !122, line: 4218, baseType: !102, size: 32, offset: 224)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !398, file: !122, line: 4220, baseType: !102, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !398, file: !122, line: 4222, baseType: !113, size: 32, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !398, file: !122, line: 4227, baseType: !169, size: 8, offset: 320)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !420, file: !434, line: 18, type: !435, isLocal: false, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !422, globals: !433, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!422 = !{!22, !104, !24, !423, !425, !427, !111, !105, !428, !429, !430, !431, !102, !432, !183, !269}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!433 = !{!418}
!434 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !436, file: !348, line: 17, baseType: !269, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !436, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "_char_out", scope: !442, file: !446, line: 54, type: !447, isLocal: false, isDefinition: true)
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !444, globals: !445, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!444 = !{!104, !105}
!445 = !{!440}
!446 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DISubroutineType(types: !449)
!449 = !{!105, !105}
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !452, file: !482, line: 60, type: !483, isLocal: true, isDefinition: true, align: 32)
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !454, globals: !481, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!454 = !{!455, !475}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !457, line: 386, baseType: !458)
!457 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 370, size: 448, elements: !459)
!459 = !{!460, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !458, file: !457, line: 372, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !458, file: !457, line: 373, baseType: !461, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !458, file: !457, line: 374, baseType: !461, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !458, file: !457, line: 375, baseType: !461, size: 32, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !458, file: !457, line: 376, baseType: !461, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !458, file: !457, line: 377, baseType: !461, size: 32, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !458, file: !457, line: 378, baseType: !461, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !458, file: !457, line: 379, baseType: !461, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !458, file: !457, line: 380, baseType: !461, size: 32, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !458, file: !457, line: 381, baseType: !461, size: 32, offset: 288)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !458, file: !457, line: 382, baseType: !461, size: 32, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !458, file: !457, line: 383, baseType: !461, size: 32, offset: 352)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !458, file: !457, line: 384, baseType: !461, size: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !458, file: !457, line: 385, baseType: !461, size: 32, offset: 416)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !457, line: 364, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 360, size: 64, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !477, file: !457, line: 362, baseType: !461, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !477, file: !457, line: 363, baseType: !461, size: 32, offset: 32)
!481 = !{!450}
!482 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !485, line: 51, size: 64, elements: !486)
!485 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!486 = !{!487, !513}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !484, file: !485, line: 60, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DISubroutineType(types: !490)
!490 = !{!105, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !494, line: 378, size: 192, elements: !495)
!494 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!495 = !{!496, !497, !498, !499, !506, !507}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !493, file: !494, line: 380, baseType: !269, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !493, file: !494, line: 382, baseType: !13, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !493, file: !494, line: 384, baseType: !13, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !493, file: !494, line: 386, baseType: !500, size: 32, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !494, line: 351, size: 16, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !501, file: !494, line: 359, baseType: !169, size: 8)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !501, file: !494, line: 364, baseType: !505, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!505 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !493, file: !494, line: 388, baseType: !104, size: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !493, file: !494, line: 396, baseType: !508, size: 32, offset: 160)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !494, line: 43, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !512)
!512 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !484, file: !485, line: 65, baseType: !491, size: 32, offset: 32)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !516, file: !519, line: 71, type: !520, isLocal: true, isDefinition: true, align: 32)
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !518, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!518 = !{!514}
!519 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !485, line: 51, size: 64, elements: !522)
!522 = !{!523, !542}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !521, file: !485, line: 60, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DISubroutineType(types: !526)
!526 = !{!105, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !494, line: 378, size: 192, elements: !530)
!530 = !{!531, !532, !533, !534, !540, !541}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !529, file: !494, line: 380, baseType: !269, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !529, file: !494, line: 382, baseType: !13, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !529, file: !494, line: 384, baseType: !13, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !529, file: !494, line: 386, baseType: !535, size: 32, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !494, line: 351, size: 16, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !536, file: !494, line: 359, baseType: !169, size: 8)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !536, file: !494, line: 364, baseType: !505, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !529, file: !494, line: 388, baseType: !104, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !529, file: !494, line: 396, baseType: !508, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !521, file: !485, line: 65, baseType: !527, size: 32, offset: 32)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !545, file: !552, line: 17, type: !680, isLocal: false, isDefinition: true)
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !547, globals: !548, splitDebugInlining: false, nameTableKind: None)
!546 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!547 = !{!111, !105, !113, !104}
!548 = !{!543, !549, !676}
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !551, file: !552, line: 198, type: !662, isLocal: true, isDefinition: true)
!551 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !552, file: !552, line: 175, type: !553, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !545, retainedNodes: !657)
!552 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!553 = !DISubroutineType(types: !554)
!554 = !{null, !555}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !127, line: 245, size: 1024, elements: !557)
!557 = !{!558, !616, !628, !629, !630, !631, !637, !652}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !556, file: !127, line: 247, baseType: !559, size: 384)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !127, line: 57, size: 384, elements: !560)
!560 = !{!561, !585, !592, !593, !594, !603, !604, !605}
!561 = !DIDerivedType(tag: DW_TAG_member, scope: !559, file: !127, line: 60, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !559, file: !127, line: 60, size: 64, elements: !563)
!563 = !{!564, !579}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !562, file: !127, line: 61, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !567)
!567 = !{!568, !574}
!568 = !DIDerivedType(tag: DW_TAG_member, scope: !566, file: !137, line: 38, baseType: !569, size: 32)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !566, file: !137, line: 38, size: 32, elements: !570)
!570 = !{!571, !573}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !569, file: !137, line: 39, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !569, file: !137, line: 40, baseType: !572, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, scope: !566, file: !137, line: 42, baseType: !575, size: 32, offset: 32)
!575 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !566, file: !137, line: 42, size: 32, elements: !576)
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !575, file: !137, line: 43, baseType: !572, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !575, file: !137, line: 44, baseType: !572, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !562, file: !127, line: 62, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !153, line: 49, size: 64, elements: !581)
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !580, file: !153, line: 50, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 64, elements: !158)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !559, file: !127, line: 68, baseType: !586, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !589)
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !588, file: !163, line: 232, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !566)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !559, file: !127, line: 71, baseType: !169, size: 8, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !559, file: !127, line: 74, baseType: !169, size: 8, offset: 104)
!594 = !DIDerivedType(tag: DW_TAG_member, scope: !559, file: !127, line: 90, baseType: !595, size: 16, offset: 112)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !559, file: !127, line: 90, size: 16, elements: !596)
!596 = !{!597, !602}
!597 = !DIDerivedType(tag: DW_TAG_member, scope: !595, file: !127, line: 91, baseType: !598, size: 16)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !595, file: !127, line: 91, size: 16, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !598, file: !127, line: 96, baseType: !179, size: 8)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !598, file: !127, line: 97, baseType: !169, size: 8, offset: 8)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !595, file: !127, line: 100, baseType: !183, size: 16)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !559, file: !127, line: 107, baseType: !113, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !559, file: !127, line: 127, baseType: !104, size: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !559, file: !127, line: 131, baseType: !606, size: 192, offset: 192)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !607)
!607 = !{!608, !609, !615}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !606, file: !163, line: 245, baseType: !565, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !606, file: !163, line: 246, baseType: !610, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !606, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !556, file: !127, line: 250, baseType: !617, size: 288, offset: 384)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !200, line: 25, size: 288, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !617, file: !200, line: 26, baseType: !113, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !617, file: !200, line: 27, baseType: !113, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !617, file: !200, line: 28, baseType: !113, size: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !617, file: !200, line: 29, baseType: !113, size: 32, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !617, file: !200, line: 30, baseType: !113, size: 32, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !617, file: !200, line: 31, baseType: !113, size: 32, offset: 160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !617, file: !200, line: 32, baseType: !113, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !617, file: !200, line: 33, baseType: !113, size: 32, offset: 224)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !617, file: !200, line: 34, baseType: !113, size: 32, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !556, file: !127, line: 253, baseType: !104, size: 32, offset: 672)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !556, file: !127, line: 256, baseType: !587, size: 64, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !556, file: !127, line: 294, baseType: !105, size: 32, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !556, file: !127, line: 300, baseType: !632, size: 96, offset: 800)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !127, line: 149, size: 96, elements: !633)
!633 = !{!634, !635, !636}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !632, file: !127, line: 153, baseType: !22, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !632, file: !127, line: 162, baseType: !111, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !632, file: !127, line: 168, baseType: !111, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !556, file: !127, line: 325, baseType: !638, size: 32, offset: 896)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !122, line: 5073, size: 192, elements: !640)
!640 = !{!641, !647, !648}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !639, file: !122, line: 5074, baseType: !642, size: 96)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !226, line: 56, size: 96, elements: !643)
!643 = !{!644, !645, !646}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !642, file: !226, line: 57, baseType: !229, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !642, file: !226, line: 58, baseType: !104, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !642, file: !226, line: 59, baseType: !111, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !639, file: !122, line: 5075, baseType: !587, size: 64, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !639, file: !122, line: 5076, baseType: !649, size: 32, offset: 160)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !650)
!650 = !{!651}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !649, file: !236, line: 52, baseType: !22, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !556, file: !127, line: 343, baseType: !653, size: 64, offset: 928)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !200, line: 60, size: 64, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !653, file: !200, line: 63, baseType: !113, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !653, file: !200, line: 66, baseType: !113, size: 32, offset: 32)
!657 = !{!658, !659, !660, !661}
!658 = !DILocalVariable(name: "thread", arg: 1, scope: !551, file: !552, line: 175, type: !555)
!659 = !DILocalVariable(name: "region_num", scope: !551, file: !552, line: 200, type: !169)
!660 = !DILocalVariable(name: "guard_start", scope: !551, file: !552, line: 265, type: !22)
!661 = !DILocalVariable(name: "guard_size", scope: !551, file: !552, line: 266, type: !111)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 96, elements: !674)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !664, line: 52, size: 96, elements: !665)
!664 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !663, file: !664, line: 53, baseType: !22, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !663, file: !664, line: 54, baseType: !111, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !663, file: !664, line: 55, baseType: !669, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !670, line: 151, baseType: !671)
!670 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 149, size: 32, elements: !672)
!672 = !{!673}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !671, file: !670, line: 150, baseType: !113, size: 32)
!674 = !{!675}
!675 = !DISubrange(count: 1)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "static_regions", scope: !545, file: !552, line: 62, type: !678, isLocal: true, isDefinition: true)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 96, elements: !674)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !681, file: !348, line: 17, baseType: !269, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !681, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !687, file: !720, line: 39, type: !169, isLocal: true, isDefinition: true)
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !689, globals: !719, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!689 = !{!690, !104, !105, !707, !169}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !692, line: 1168, baseType: !693)
!692 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !692, line: 1155, size: 352, elements: !694)
!694 = !{!695, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !693, file: !692, line: 1157, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !461)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !693, file: !692, line: 1158, baseType: !461, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !693, file: !692, line: 1159, baseType: !461, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !693, file: !692, line: 1160, baseType: !461, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !693, file: !692, line: 1161, baseType: !461, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !693, file: !692, line: 1162, baseType: !461, size: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !693, file: !692, line: 1163, baseType: !461, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !693, file: !692, line: 1164, baseType: !461, size: 32, offset: 224)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !693, file: !692, line: 1165, baseType: !461, size: 32, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !693, file: !692, line: 1166, baseType: !461, size: 32, offset: 288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !693, file: !692, line: 1167, baseType: !461, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !710, line: 27, size: 96, elements: !711)
!710 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!711 = !{!712, !713, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !709, file: !710, line: 29, baseType: !113, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !709, file: !710, line: 31, baseType: !269, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !709, file: !710, line: 37, baseType: !715, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !670, line: 146, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !670, line: 141, size: 32, elements: !717)
!717 = !{!718}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !716, file: !670, line: 143, baseType: !113, size: 32)
!719 = !{!685}
!720 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !723, file: !730, line: 21, type: !447, isLocal: true, isDefinition: true)
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !725, globals: !729, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!725 = !{!726, !105, !104}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !728, line: 22, baseType: !105)
!728 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!729 = !{!721}
!730 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !733, file: !738, line: 13, type: !755, isLocal: true, isDefinition: true)
!733 = distinct !DICompileUnit(language: DW_LANG_C99, file: !734, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !735, splitDebugInlining: false, nameTableKind: None)
!734 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!735 = !{!736, !731}
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "mpu_config", scope: !733, file: !738, line: 37, type: !739, isLocal: false, isDefinition: true)
!738 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !710, line: 41, size: 64, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !740, file: !710, line: 43, baseType: !113, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !740, file: !710, line: 45, baseType: !744, size: 32, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !710, line: 27, size: 96, elements: !747)
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !746, file: !710, line: 29, baseType: !113, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !746, file: !710, line: 31, baseType: !269, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !746, file: !710, line: 37, baseType: !751, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !670, line: 146, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !670, line: 141, size: 32, elements: !753)
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !752, file: !670, line: 143, baseType: !113, size: 32)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 192, elements: !158)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !758, file: !855, line: 36, type: !856, isLocal: true, isDefinition: true, align: 32)
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !759, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !760, retainedTypes: !772, globals: !854, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!760 = !{!761, !767}
!761 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !762, line: 506, baseType: !32, size: 32, elements: !763)
!762 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!763 = !{!764, !765, !766}
!764 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!765 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!766 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!767 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !762, line: 512, baseType: !32, size: 32, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!770 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!771 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!772 = !{!773, !843, !848, !808, !767, !761, !853, !104}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !762, line: 523, size: 288, elements: !776)
!776 = !{!777, !798, !804, !809, !813, !814, !815, !819, !839}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !775, file: !762, line: 524, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DISubroutineType(types: !780)
!780 = !{!105, !781, !796, !797}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !494, line: 378, size: 192, elements: !784)
!784 = !{!785, !786, !787, !788, !794, !795}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !783, file: !494, line: 380, baseType: !269, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !783, file: !494, line: 382, baseType: !13, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !783, file: !494, line: 384, baseType: !13, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !783, file: !494, line: 386, baseType: !789, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !494, line: 351, size: 16, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !790, file: !494, line: 359, baseType: !169, size: 8)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !790, file: !494, line: 364, baseType: !505, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !783, file: !494, line: 388, baseType: !104, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !783, file: !494, line: 396, baseType: !508, size: 32, offset: 160)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !762, line: 237, baseType: !169)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !762, line: 257, baseType: !113)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !775, file: !762, line: 530, baseType: !799, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DISubroutineType(types: !801)
!801 = !{!105, !781, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !762, line: 229, baseType: !113)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !775, file: !762, line: 532, baseType: !805, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{!105, !781, !808, !803}
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !762, line: 216, baseType: !113)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !775, file: !762, line: 535, baseType: !810, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DISubroutineType(types: !812)
!812 = !{!105, !781, !808}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !775, file: !762, line: 537, baseType: !810, size: 32, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !775, file: !762, line: 539, baseType: !810, size: 32, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !775, file: !762, line: 541, baseType: !816, size: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DISubroutineType(types: !818)
!818 = !{!105, !781, !796, !761, !767}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !775, file: !762, line: 544, baseType: !820, size: 32, offset: 224)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DISubroutineType(types: !822)
!822 = !{!105, !781, !823, !505}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !762, line: 478, size: 96, elements: !825)
!825 = !{!826, !833, !838}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !824, file: !762, line: 482, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !828, line: 33, baseType: !829)
!828 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !828, line: 29, size: 32, elements: !830)
!830 = !{!831}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !829, file: !828, line: 30, baseType: !832, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !824, file: !762, line: 485, baseType: !834, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !762, line: 464, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !781, !823, !808}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !824, file: !762, line: 493, baseType: !808, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !775, file: !762, line: 547, baseType: !840, size: 32, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DISubroutineType(types: !842)
!842 = !{!113, !781}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !762, line: 428, size: 32, elements: !846)
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !845, file: !762, line: 434, baseType: !808, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !762, line: 441, size: 32, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !850, file: !762, line: 447, baseType: !808, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!854 = !{!756}
!855 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !485, line: 51, size: 64, elements: !858)
!858 = !{!859, !863}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !857, file: !485, line: 60, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{!105, !781}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !857, file: !485, line: 65, baseType: !781, size: 32, offset: 32)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !866, file: !938, line: 48, type: !1009, isLocal: true, isDefinition: true)
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !868, retainedTypes: !924, globals: !935, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!868 = !{!30, !869}
!869 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !457, line: 69, baseType: !105, size: 32, elements: !870)
!870 = !{!871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923}
!871 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!872 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!873 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!874 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!875 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!876 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!877 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!878 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!879 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!880 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!881 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!882 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!883 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!884 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!885 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!886 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!887 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!888 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!889 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!890 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!891 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!892 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!893 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!894 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!895 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!896 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!897 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!898 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!899 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!900 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!901 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!902 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!903 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!904 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!905 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!906 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!907 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!908 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!909 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!910 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!911 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!912 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!913 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!914 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!915 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!916 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!917 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!918 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!919 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!920 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!921 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!922 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!923 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!924 = !{!111, !105, !104, !925}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !457, line: 270, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 262, size: 192, elements: !928)
!928 = !{!929, !930, !931, !932, !933, !934}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !927, file: !457, line: 264, baseType: !461, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !927, file: !457, line: 265, baseType: !461, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !927, file: !457, line: 266, baseType: !461, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !927, file: !457, line: 267, baseType: !461, size: 32, offset: 96)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !927, file: !457, line: 268, baseType: !461, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !927, file: !457, line: 269, baseType: !461, size: 32, offset: 160)
!935 = !{!936, !940, !956, !967, !982, !864, !984, !997, !999, !1001, !1003, !1005, !1007}
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !866, file: !938, line: 424, type: !939, isLocal: false, isDefinition: true, align: 16)
!938 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 64, elements: !313)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !866, file: !938, line: 424, type: !942, isLocal: false, isDefinition: true, align: 32)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !494, line: 378, size: 192, elements: !944)
!944 = !{!945, !946, !947, !948, !954, !955}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !943, file: !494, line: 380, baseType: !269, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !943, file: !494, line: 382, baseType: !13, size: 32, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !943, file: !494, line: 384, baseType: !13, size: 32, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !943, file: !494, line: 386, baseType: !949, size: 32, offset: 96)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !494, line: 351, size: 16, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !950, file: !494, line: 359, baseType: !169, size: 8)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !950, file: !494, line: 364, baseType: !505, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !943, file: !494, line: 388, baseType: !104, size: 32, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !943, file: !494, line: 396, baseType: !508, size: 32, offset: 160)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !866, file: !938, line: 424, type: !958, isLocal: true, isDefinition: true, align: 32)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !485, line: 51, size: 64, elements: !960)
!960 = !{!961, !966}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !959, file: !485, line: 60, baseType: !962, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DISubroutineType(types: !964)
!964 = !{!105, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !959, file: !485, line: 65, baseType: !965, size: 32, offset: 32)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "exti_data", scope: !866, file: !938, line: 423, type: !969, isLocal: true, isDefinition: true)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !938, line: 107, size: 1024, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !969, file: !938, line: 109, baseType: !972, size: 1024)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 1024, elements: !311)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !938, line: 101, size: 64, elements: !974)
!974 = !{!975, !981}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !973, file: !938, line: 102, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !977, line: 63, baseType: !978)
!977 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !105, !104}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !973, file: !938, line: 103, baseType: !104, size: 32, offset: 32)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !866, file: !938, line: 424, type: !950, isLocal: true, isDefinition: true, align: 8)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !986, file: !938, line: 493, type: !991, isLocal: true, isDefinition: true, align: 32)
!986 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !938, file: !938, line: 460, type: !987, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !866, retainedNodes: !989)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !965}
!989 = !{!990}
!990 = !DILocalVariable(name: "dev", arg: 1, scope: !986, file: !938, line: 460, type: !965)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !992)
!992 = !{!993, !994, !995, !996}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !991, file: !10, line: 55, baseType: !116, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !991, file: !10, line: 57, baseType: !116, size: 32, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !991, file: !10, line: 59, baseType: !104, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !991, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !986, file: !938, line: 497, type: !991, isLocal: true, isDefinition: true, align: 32)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !986, file: !938, line: 507, type: !991, isLocal: true, isDefinition: true, align: 32)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !986, file: !938, line: 512, type: !991, isLocal: true, isDefinition: true, align: 32)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !986, file: !938, line: 516, type: !991, isLocal: true, isDefinition: true, align: 32)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !986, file: !938, line: 523, type: !991, isLocal: true, isDefinition: true, align: 32)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !986, file: !938, line: 527, type: !991, isLocal: true, isDefinition: true, align: 32)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 512, elements: !311)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !457, line: 127, baseType: !869)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !1014, file: !1019, line: 21, type: !1039, isLocal: false, isDefinition: true, align: 16)
!1014 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1015, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1016, splitDebugInlining: false, nameTableKind: None)
!1015 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!1016 = !{!1017, !1012, !1023, !1025, !1027, !1029, !1031, !1033, !1035, !1037}
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !1014, file: !1019, line: 16, type: !1020, isLocal: false, isDefinition: true, align: 16)
!1019 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/metairq_dispatch")
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 176, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 11)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !1014, file: !1019, line: 28, type: !939, isLocal: false, isDefinition: true, align: 16)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
