; ModuleID = 'build/arduino_nano_33_ble/subsys/console/getline/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_fifo = type { %struct.k_queue }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %union.anon }
%struct._sflist = type { %struct.z_heap_bucket*, %struct.z_heap_bucket* }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.console_input = type { i32, i8, [128 x i8] }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "free_queue", scope: !111, file: !221, line: 17, type: !222, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !218, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getline.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!113 = !{!102, !114, !118, !103, !120}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !115, line: 46, baseType: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !117)
!117 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !119, line: 214, baseType: !32)
!119 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !123, line: 336, size: 608, elements: !124)
!123 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = !{!125, !157, !161, !165, !179, !184, !190, !196, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !122, file: !123, line: 365, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DISubroutineType(types: !128)
!128 = !{!103, !129, !156}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !132, line: 378, size: 192, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !138, !139, !140, !149, !150}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !132, line: 380, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !131, file: !132, line: 382, baseType: !13, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !131, file: !132, line: 384, baseType: !13, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !131, file: !132, line: 386, baseType: !141, size: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !132, line: 351, size: 16, elements: !143)
!143 = !{!144, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !142, file: !132, line: 359, baseType: !145, size: 8)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !146)
!146 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !142, file: !132, line: 364, baseType: !148, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!148 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !132, line: 388, baseType: !102, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !131, file: !132, line: 396, baseType: !151, size: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !132, line: 43, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !155)
!155 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !122, file: !123, line: 366, baseType: !158, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !129, !146}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !122, file: !123, line: 374, baseType: !162, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!103, !129}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !122, file: !123, line: 377, baseType: !166, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!103, !129, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !123, line: 122, size: 64, elements: !172)
!172 = !{!173, !175, !176, !177, !178}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !171, file: !123, line: 123, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !171, file: !123, line: 124, baseType: !145, size: 8, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !171, file: !123, line: 125, baseType: !145, size: 8, offset: 40)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !171, file: !123, line: 126, baseType: !145, size: 8, offset: 48)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !171, file: !123, line: 127, baseType: !145, size: 8, offset: 56)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !122, file: !123, line: 379, baseType: !180, size: 32, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{!103, !129, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !122, file: !123, line: 384, baseType: !185, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{!103, !129, !188, !103}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !122, file: !123, line: 393, baseType: !191, size: 32, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DISubroutineType(types: !193)
!193 = !{!103, !129, !194, !195}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !122, file: !123, line: 402, baseType: !197, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !129}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !122, file: !123, line: 405, baseType: !197, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !122, file: !123, line: 408, baseType: !162, size: 32, offset: 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !122, file: !123, line: 411, baseType: !197, size: 32, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !122, file: !123, line: 414, baseType: !197, size: 32, offset: 352)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !122, file: !123, line: 417, baseType: !162, size: 32, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !122, file: !123, line: 420, baseType: !162, size: 32, offset: 416)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !122, file: !123, line: 423, baseType: !197, size: 32, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !122, file: !123, line: 426, baseType: !197, size: 32, offset: 480)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !122, file: !123, line: 429, baseType: !162, size: 32, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !122, file: !123, line: 432, baseType: !162, size: 32, offset: 544)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !122, file: !123, line: 435, baseType: !211, size: 32, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !129, !214, !102}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !123, line: 142, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !129, !102}
!218 = !{!109, !219, !266, !287}
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "used_queue", scope: !111, file: !221, line: 18, type: !222, isLocal: true, isDefinition: true, align: 32)
!221 = !DIFile(filename: "zephyr/subsys/console/getline.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !223, line: 2208, size: 128, elements: !224)
!223 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = !{!225}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !222, file: !223, line: 2209, baseType: !226, size: 128)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !223, line: 1709, size: 128, elements: !227)
!227 = !{!228, !241, !245}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !226, file: !223, line: 1710, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !230, line: 46, baseType: !231)
!230 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !230, line: 41, size: 64, elements: !232)
!232 = !{!233, !240}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !231, file: !230, line: 42, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !230, line: 39, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !230, line: 35, size: 32, elements: !237)
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !236, file: !230, line: 36, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !230, line: 32, baseType: !174)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !230, line: 43, baseType: !234, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !226, file: !223, line: 1711, baseType: !242, offset: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !243, line: 43, elements: !244)
!243 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = !{}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !226, file: !223, line: 1712, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !252, line: 48, baseType: !253)
!252 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !252, line: 37, size: 64, elements: !254)
!254 = !{!255, !261}
!255 = !DIDerivedType(tag: DW_TAG_member, scope: !253, file: !252, line: 38, baseType: !256, size: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !253, file: !252, line: 38, size: 32, elements: !257)
!257 = !{!258, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !256, file: !252, line: 39, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !252, line: 40, baseType: !259, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, scope: !253, file: !252, line: 42, baseType: !262, size: 32, offset: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !253, file: !252, line: 42, size: 32, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !262, file: !252, line: 43, baseType: !259, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !262, file: !252, line: 44, baseType: !259, size: 32)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "cmd", scope: !268, file: !221, line: 22, type: !275, isLocal: true, isDefinition: true)
!268 = distinct !DISubprogram(name: "console_getline", scope: !221, file: !221, line: 20, type: !269, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !272)
!269 = !DISubroutineType(types: !270)
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!272 = !{!273}
!273 = !DILocalVariable(name: "ret", scope: !274, file: !221, line: 29, type: !102)
!274 = distinct !DILexicalBlock(scope: !268, file: !221, line: 29, column: 8)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "console_input", file: !277, line: 21, size: 1088, elements: !278)
!277 = !DIFile(filename: "zephyr/include/zephyr/drivers/console/console.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = !{!279, !282, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !276, file: !277, line: 23, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !281)
!281 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "is_mcumgr", scope: !276, file: !277, line: 25, baseType: !145, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !276, file: !277, line: 27, baseType: !284, size: 1024, offset: 40)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 1024, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 128)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "line_bufs", scope: !111, file: !221, line: 15, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 2176, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 2)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !294, file: !330, line: 27, type: !355, isLocal: true, isDefinition: true)
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !296, retainedTypes: !308, globals: !327, splitDebugInlining: false, nameTableKind: None)
!295 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!296 = !{!297, !30}
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !298, line: 27, baseType: !32, size: 32, elements: !299)
!298 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307}
!300 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!301 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!302 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!303 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!304 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!305 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!306 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!307 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!308 = !{!102, !114, !103, !24, !309, !271, !174, !325}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !311, line: 54, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !320, !324}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !310, file: !311, line: 55, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !315, line: 33, baseType: !316)
!315 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !315, line: 29, size: 32, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !315, line: 30, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !310, file: !311, line: 60, baseType: !321, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !297}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !310, file: !311, line: 65, baseType: !321, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !326)
!326 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!327 = !{!292, !328, !332, !334, !345, !347}
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !294, file: !330, line: 44, type: !331, isLocal: true, isDefinition: true)
!330 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !243, line: 43, elements: !244)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !294, file: !330, line: 49, type: !331, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !294, file: !330, line: 36, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 128, elements: !343)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !298, line: 114, size: 128, elements: !338)
!338 = !{!339, !340, !341, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !337, file: !298, line: 115, baseType: !297, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !337, file: !298, line: 141, baseType: !145, size: 8, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !337, file: !298, line: 149, baseType: !174, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !337, file: !298, line: 156, baseType: !174, size: 32, offset: 96)
!343 = !{!344}
!344 = !DISubrange(count: 1)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !294, file: !330, line: 40, type: !336, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !294, file: !330, line: 28, type: !349, isLocal: true, isDefinition: true)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !315, line: 40, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !315, line: 35, size: 64, elements: !351)
!351 = !{!352, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !350, file: !315, line: 36, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !350, file: !315, line: 37, baseType: !353, size: 32, offset: 32)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 32, elements: !343)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !357, line: 22, baseType: !281)
!357 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!359 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !362, file: !389, line: 50, type: !376, isLocal: true, isDefinition: true)
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !296, retainedTypes: !364, globals: !386, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!364 = !{!154, !114, !118, !103, !102, !174, !325, !365, !271, !376, !377}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !367, line: 45, size: 64, elements: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = !{!369, !375}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !366, file: !367, line: 46, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !315, line: 33, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !315, line: 29, size: 32, elements: !372)
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !315, line: 30, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !366, file: !367, line: 48, baseType: !174, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !367, line: 38, size: 64, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !378, file: !367, line: 39, baseType: !370, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !378, file: !367, line: 41, baseType: !382, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !367, line: 35, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !376}
!386 = !{!387, !391, !399, !360, !401, !411}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "latency_lock", scope: !362, file: !389, line: 44, type: !390, isLocal: true, isDefinition: true)
!389 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !243, line: 43, elements: !244)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !362, file: !389, line: 46, type: !393, isLocal: true, isDefinition: true)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !315, line: 40, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !315, line: 35, size: 64, elements: !395)
!395 = !{!396, !398}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !394, file: !315, line: 36, baseType: !397, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !394, file: !315, line: 37, baseType: !397, size: 32, offset: 32)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "latency_subs", scope: !362, file: !389, line: 52, type: !393, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !362, file: !389, line: 39, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, elements: !409)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 35, size: 96, elements: !405)
!405 = !{!406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !404, file: !389, line: 36, baseType: !297, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !404, file: !389, line: 37, baseType: !145, size: 8, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !404, file: !389, line: 38, baseType: !356, size: 32, offset: 64)
!409 = !{!410}
!410 = !DISubrange(count: 0)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !362, file: !389, line: 48, type: !376, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !415, file: !422, line: 47, type: !435, isLocal: true, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !417, retainedTypes: !418, globals: !419, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!417 = !{!297}
!418 = !{!118, !103}
!419 = !{!420, !413, !432}
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "cpus_states", scope: !415, file: !422, line: 50, type: !423, isLocal: true, isDefinition: true)
!422 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 32, elements: !343)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !298, line: 114, size: 128, elements: !427)
!427 = !{!428, !429, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !426, file: !298, line: 115, baseType: !297, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !426, file: !298, line: 141, baseType: !145, size: 8, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !426, file: !298, line: 149, baseType: !174, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !426, file: !298, line: 156, baseType: !174, size: 32, offset: 96)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !415, file: !422, line: 55, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 8, elements: !343)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, elements: !409)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "static_regions", scope: !438, file: !445, line: 62, type: !575, isLocal: true, isDefinition: true)
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !440, globals: !441, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!440 = !{!118, !103, !174, !102}
!441 = !{!442, !436}
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !444, file: !445, line: 198, type: !563, isLocal: true, isDefinition: true)
!444 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !445, file: !445, line: 175, type: !446, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !438, retainedNodes: !558)
!445 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = !DISubroutineType(types: !447)
!447 = !{null, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !450, line: 245, size: 1024, elements: !451)
!450 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!451 = !{!452, !515, !528, !529, !530, !531, !537, !553}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !449, file: !450, line: 247, baseType: !453, size: 384)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !450, line: 57, size: 384, elements: !454)
!454 = !{!455, !480, !487, !488, !489, !502, !503, !504}
!455 = !DIDerivedType(tag: DW_TAG_member, scope: !453, file: !450, line: 60, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !450, line: 60, size: 64, elements: !457)
!457 = !{!458, !473}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !456, file: !450, line: 61, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !252, line: 49, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !252, line: 37, size: 64, elements: !461)
!461 = !{!462, !468}
!462 = !DIDerivedType(tag: DW_TAG_member, scope: !460, file: !252, line: 38, baseType: !463, size: 32)
!463 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !460, file: !252, line: 38, size: 32, elements: !464)
!464 = !{!465, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !463, file: !252, line: 39, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !252, line: 40, baseType: !466, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !460, file: !252, line: 42, baseType: !469, size: 32, offset: 32)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !460, file: !252, line: 42, size: 32, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !469, file: !252, line: 43, baseType: !466, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !469, file: !252, line: 44, baseType: !466, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !456, file: !450, line: 62, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !475, line: 49, size: 64, elements: !476)
!475 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !474, file: !475, line: 50, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 64, elements: !290)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !453, file: !450, line: 68, baseType: !481, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !484)
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !483, file: !247, line: 232, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !252, line: 48, baseType: !460)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !453, file: !450, line: 71, baseType: !145, size: 8, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !453, file: !450, line: 74, baseType: !145, size: 8, offset: 104)
!489 = !DIDerivedType(tag: DW_TAG_member, scope: !453, file: !450, line: 90, baseType: !490, size: 16, offset: 112)
!490 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !450, line: 90, size: 16, elements: !491)
!491 = !{!492, !499}
!492 = !DIDerivedType(tag: DW_TAG_member, scope: !490, file: !450, line: 91, baseType: !493, size: 16)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !490, file: !450, line: 91, size: 16, elements: !494)
!494 = !{!495, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !493, file: !450, line: 96, baseType: !496, size: 8)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !497)
!497 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !493, file: !450, line: 97, baseType: !145, size: 8, offset: 8)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !490, file: !450, line: 100, baseType: !500, size: 16)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !501)
!501 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !453, file: !450, line: 107, baseType: !174, size: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !453, file: !450, line: 127, baseType: !102, size: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !453, file: !450, line: 131, baseType: !505, size: 192, offset: 192)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !506)
!506 = !{!507, !508, !514}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !505, file: !247, line: 245, baseType: !459, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !505, file: !247, line: 246, baseType: !509, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !505, file: !247, line: 249, baseType: !116, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !449, file: !450, line: 250, baseType: !516, size: 288, offset: 384)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !517, line: 25, size: 288, elements: !518)
!517 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !516, file: !517, line: 26, baseType: !174, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !516, file: !517, line: 27, baseType: !174, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !516, file: !517, line: 28, baseType: !174, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !516, file: !517, line: 29, baseType: !174, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !516, file: !517, line: 30, baseType: !174, size: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !516, file: !517, line: 31, baseType: !174, size: 32, offset: 160)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !516, file: !517, line: 32, baseType: !174, size: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !516, file: !517, line: 33, baseType: !174, size: 32, offset: 224)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !516, file: !517, line: 34, baseType: !174, size: 32, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !449, file: !450, line: 253, baseType: !102, size: 32, offset: 672)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !449, file: !450, line: 256, baseType: !482, size: 64, offset: 704)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !449, file: !450, line: 294, baseType: !103, size: 32, offset: 768)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !449, file: !450, line: 300, baseType: !532, size: 96, offset: 800)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !450, line: 149, size: 96, elements: !533)
!533 = !{!534, !535, !536}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !532, file: !450, line: 153, baseType: !22, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !532, file: !450, line: 162, baseType: !118, size: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !532, file: !450, line: 168, baseType: !118, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !449, file: !450, line: 325, baseType: !538, size: 32, offset: 896)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !223, line: 5073, size: 160, elements: !540)
!540 = !{!541, !550, !551}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !539, file: !223, line: 5074, baseType: !542, size: 96)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !543, line: 56, size: 96, elements: !544)
!543 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!544 = !{!545, !548, !549}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !542, file: !543, line: 57, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !543, line: 57, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !542, file: !543, line: 58, baseType: !102, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !542, file: !543, line: 59, baseType: !118, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !539, file: !223, line: 5075, baseType: !482, size: 64, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !539, file: !223, line: 5076, baseType: !552, offset: 160)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !243, line: 43, elements: !244)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !449, file: !450, line: 343, baseType: !554, size: 64, offset: 928)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !517, line: 60, size: 64, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !554, file: !517, line: 63, baseType: !174, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !554, file: !517, line: 66, baseType: !174, size: 32, offset: 32)
!558 = !{!559, !560, !561, !562}
!559 = !DILocalVariable(name: "thread", arg: 1, scope: !444, file: !445, line: 175, type: !448)
!560 = !DILocalVariable(name: "region_num", scope: !444, file: !445, line: 200, type: !145)
!561 = !DILocalVariable(name: "guard_start", scope: !444, file: !445, line: 265, type: !22)
!562 = !DILocalVariable(name: "guard_size", scope: !444, file: !445, line: 266, type: !118)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 96, elements: !343)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !565, line: 52, size: 96, elements: !566)
!565 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !564, file: !565, line: 53, baseType: !22, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !564, file: !565, line: 54, baseType: !118, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !564, file: !565, line: 55, baseType: !570, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !571, line: 151, baseType: !572)
!571 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 149, size: 32, elements: !573)
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !572, file: !571, line: 150, baseType: !174, size: 32)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 96, elements: !343)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !579, file: !613, line: 39, type: !145, isLocal: true, isDefinition: true)
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !581, globals: !612, splitDebugInlining: false, nameTableKind: None)
!580 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!581 = !{!582, !102, !103, !600, !145}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !584, line: 1226, baseType: !585)
!584 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !584, line: 1213, size: 352, elements: !586)
!586 = !{!587, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !585, file: !584, line: 1215, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !174)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !585, file: !584, line: 1216, baseType: !589, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !585, file: !584, line: 1217, baseType: !589, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !585, file: !584, line: 1218, baseType: !589, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !585, file: !584, line: 1219, baseType: !589, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !585, file: !584, line: 1220, baseType: !589, size: 32, offset: 160)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !585, file: !584, line: 1221, baseType: !589, size: 32, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !585, file: !584, line: 1222, baseType: !589, size: 32, offset: 224)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !585, file: !584, line: 1223, baseType: !589, size: 32, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !585, file: !584, line: 1224, baseType: !589, size: 32, offset: 288)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !585, file: !584, line: 1225, baseType: !589, size: 32, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !603, line: 27, size: 96, elements: !604)
!603 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!604 = !{!605, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !602, file: !603, line: 29, baseType: !174, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !602, file: !603, line: 31, baseType: !135, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !602, file: !603, line: 37, baseType: !608, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !571, line: 146, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !571, line: 141, size: 32, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !609, file: !571, line: 143, baseType: !174, size: 32)
!612 = !{!577}
!613 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !616, file: !623, line: 21, type: !106, isLocal: true, isDefinition: true)
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !618, globals: !622, splitDebugInlining: false, nameTableKind: None)
!617 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!618 = !{!619, !103, !102}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !621, line: 22, baseType: !103)
!621 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!622 = !{!614}
!623 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !626, file: !631, line: 13, type: !648, isLocal: true, isDefinition: true)
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !628, splitDebugInlining: false, nameTableKind: None)
!627 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!628 = !{!629, !624}
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "mpu_config", scope: !626, file: !631, line: 37, type: !632, isLocal: false, isDefinition: true)
!631 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !603, line: 41, size: 64, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !633, file: !603, line: 43, baseType: !174, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !633, file: !603, line: 45, baseType: !637, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !603, line: 27, size: 96, elements: !640)
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !639, file: !603, line: 29, baseType: !174, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !639, file: !603, line: 31, baseType: !135, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !639, file: !603, line: 37, baseType: !644, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !571, line: 146, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !571, line: 141, size: 32, elements: !646)
!646 = !{!647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !645, file: !571, line: 143, baseType: !174, size: 32)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 192, elements: !290)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !651, file: !821, line: 93, type: !822, isLocal: true, isDefinition: true, align: 32)
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !653, globals: !816, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!653 = !{!654, !145, !102, !103, !734, !174, !735, !771, !782}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !656, line: 1071, baseType: !657)
!656 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !656, line: 1035, size: 19584, elements: !658)
!658 = !{!659, !663, !664, !665, !669, !670, !672, !673, !674, !675, !676, !677, !681, !682, !683, !687, !688, !692, !693, !697, !698, !702, !703, !704, !705, !706, !707, !708, !712, !713, !714, !715, !719, !720, !724}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !657, file: !656, line: 1036, baseType: !660, size: 960)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 960, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 30)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !657, file: !656, line: 1037, baseType: !589, size: 32, offset: 960)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !657, file: !656, line: 1038, baseType: !589, size: 32, offset: 992)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !657, file: !656, line: 1039, baseType: !666, size: 1088, offset: 1024)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1088, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 34)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !657, file: !656, line: 1040, baseType: !589, size: 32, offset: 2112)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !657, file: !656, line: 1041, baseType: !671, size: 64, offset: 2144)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 64, elements: !290)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !657, file: !656, line: 1042, baseType: !589, size: 32, offset: 2208)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !657, file: !656, line: 1043, baseType: !589, size: 32, offset: 2240)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !657, file: !656, line: 1044, baseType: !589, size: 32, offset: 2272)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !657, file: !656, line: 1045, baseType: !589, size: 32, offset: 2304)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !657, file: !656, line: 1046, baseType: !589, size: 32, offset: 2336)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !657, file: !656, line: 1047, baseType: !678, size: 3808, offset: 2368)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 3808, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 119)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !657, file: !656, line: 1048, baseType: !589, size: 32, offset: 6176)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !657, file: !656, line: 1049, baseType: !589, size: 32, offset: 6208)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !657, file: !656, line: 1050, baseType: !684, size: 1952, offset: 6240)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1952, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 61)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !657, file: !656, line: 1051, baseType: !589, size: 32, offset: 8192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !657, file: !656, line: 1052, baseType: !689, size: 288, offset: 8224)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 288, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 9)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !657, file: !656, line: 1053, baseType: !588, size: 32, offset: 8512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !657, file: !656, line: 1054, baseType: !694, size: 96, offset: 8544)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 96, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 3)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !657, file: !656, line: 1055, baseType: !588, size: 32, offset: 8640)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !657, file: !656, line: 1056, baseType: !699, size: 1568, offset: 8672)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1568, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 49)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !657, file: !656, line: 1057, baseType: !589, size: 32, offset: 10240)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !657, file: !656, line: 1058, baseType: !694, size: 96, offset: 10272)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !657, file: !656, line: 1059, baseType: !589, size: 32, offset: 10368)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !657, file: !656, line: 1060, baseType: !671, size: 64, offset: 10400)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !657, file: !656, line: 1061, baseType: !589, size: 32, offset: 10464)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !657, file: !656, line: 1062, baseType: !589, size: 32, offset: 10496)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !657, file: !656, line: 1063, baseType: !709, size: 672, offset: 10528)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 672, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 21)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !657, file: !656, line: 1064, baseType: !589, size: 32, offset: 11200)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !657, file: !656, line: 1065, baseType: !588, size: 32, offset: 11232)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !657, file: !656, line: 1066, baseType: !589, size: 32, offset: 11264)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !657, file: !656, line: 1067, baseType: !716, size: 1504, offset: 11296)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1504, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 47)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !657, file: !656, line: 1068, baseType: !588, size: 32, offset: 12800)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !657, file: !656, line: 1069, baseType: !721, size: 5600, offset: 12832)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 5600, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 175)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !657, file: !656, line: 1070, baseType: !725, size: 1152, offset: 18432)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 1152, elements: !690)
!726 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !656, line: 278, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !656, line: 272, size: 128, elements: !729)
!729 = !{!730, !731, !732, !733}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !728, file: !656, line: 273, baseType: !589, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !728, file: !656, line: 274, baseType: !589, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !728, file: !656, line: 275, baseType: !589, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !728, file: !656, line: 277, baseType: !588, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !584, line: 468, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !584, line: 445, size: 1120, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !764, !768, !770}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !737, file: !584, line: 447, baseType: !588, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !737, file: !584, line: 448, baseType: !589, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !737, file: !584, line: 449, baseType: !589, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !737, file: !584, line: 450, baseType: !589, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !737, file: !584, line: 451, baseType: !589, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !737, file: !584, line: 452, baseType: !589, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !737, file: !584, line: 453, baseType: !746, size: 96, offset: 192)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 96, elements: !748)
!747 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !145)
!748 = !{!749}
!749 = !DISubrange(count: 12)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !737, file: !584, line: 454, baseType: !589, size: 32, offset: 288)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !737, file: !584, line: 455, baseType: !589, size: 32, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !737, file: !584, line: 456, baseType: !589, size: 32, offset: 352)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !737, file: !584, line: 457, baseType: !589, size: 32, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !737, file: !584, line: 458, baseType: !589, size: 32, offset: 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !737, file: !584, line: 459, baseType: !589, size: 32, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !737, file: !584, line: 460, baseType: !589, size: 32, offset: 480)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !737, file: !584, line: 461, baseType: !671, size: 64, offset: 512)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !737, file: !584, line: 462, baseType: !588, size: 32, offset: 576)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !737, file: !584, line: 463, baseType: !588, size: 32, offset: 608)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !737, file: !584, line: 464, baseType: !761, size: 128, offset: 640)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 128, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 4)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !737, file: !584, line: 465, baseType: !765, size: 160, offset: 768)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 160, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 5)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !737, file: !584, line: 466, baseType: !769, size: 160, offset: 928)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 160, elements: !766)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !737, file: !584, line: 467, baseType: !589, size: 32, offset: 1088)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !773, file: !772, line: 167, baseType: !781)
!772 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!773 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !772, file: !772, line: 134, type: !774, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !651, retainedNodes: !776)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !174}
!776 = !{!777, !778, !780}
!777 = !DILocalVariable(name: "time_us", arg: 1, scope: !773, file: !772, line: 134, type: !174)
!778 = !DILocalVariable(name: "delay_cycles", scope: !773, file: !772, line: 168, type: !779)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!780 = !DILocalVariable(name: "cycles", scope: !773, file: !772, line: 171, type: !174)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !656, line: 2399, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !656, line: 2373, size: 10880, elements: !785)
!785 = !{!786, !790, !791, !792, !793, !797, !798, !803, !804, !805, !806, !807, !808, !812, !813, !814, !815}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !784, file: !656, line: 2374, baseType: !787, size: 8192)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 8192, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !784, file: !656, line: 2375, baseType: !588, size: 32, offset: 8192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !784, file: !656, line: 2376, baseType: !588, size: 32, offset: 8224)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !784, file: !656, line: 2377, baseType: !588, size: 32, offset: 8256)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !784, file: !656, line: 2378, baseType: !794, size: 1984, offset: 8288)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1984, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 62)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !784, file: !656, line: 2379, baseType: !589, size: 32, offset: 10272)
!798 = !DIDerivedType(tag: DW_TAG_member, scope: !784, file: !656, line: 2381, baseType: !799, size: 32, offset: 10304)
!799 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !784, file: !656, line: 2381, size: 32, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !799, file: !656, line: 2382, baseType: !589, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !799, file: !656, line: 2383, baseType: !589, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !784, file: !656, line: 2386, baseType: !589, size: 32, offset: 10336)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !784, file: !656, line: 2387, baseType: !589, size: 32, offset: 10368)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !784, file: !656, line: 2389, baseType: !589, size: 32, offset: 10400)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !784, file: !656, line: 2391, baseType: !589, size: 32, offset: 10432)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !784, file: !656, line: 2393, baseType: !589, size: 32, offset: 10464)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !784, file: !656, line: 2394, baseType: !809, size: 256, offset: 10496)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 256, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 8)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !784, file: !656, line: 2395, baseType: !589, size: 32, offset: 10752)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !784, file: !656, line: 2396, baseType: !588, size: 32, offset: 10784)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !784, file: !656, line: 2397, baseType: !589, size: 32, offset: 10816)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !784, file: !656, line: 2398, baseType: !589, size: 32, offset: 10848)
!816 = !{!649, !817}
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !773, file: !772, line: 161, type: !819, isLocal: true, isDefinition: true, align: 128)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !820, size: 48, elements: !695)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!821 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !824, line: 51, size: 64, elements: !825)
!824 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!825 = !{!826, !833}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !823, file: !824, line: 60, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = !DISubroutineType(types: !829)
!829 = !{!103, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !824, line: 48, flags: DIFlagFwdDecl)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !823, file: !824, line: 65, baseType: !830, size: 32, offset: 32)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "__init_board_init", scope: !836, file: !935, line: 36, type: !950, isLocal: true, isDefinition: true, align: 32)
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !837, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !838, retainedTypes: !850, globals: !931, splitDebugInlining: false, nameTableKind: None)
!837 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!838 = !{!839, !845}
!839 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !840, line: 506, baseType: !32, size: 32, elements: !841)
!840 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !{!842, !843, !844}
!842 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!843 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!844 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!845 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !840, line: 512, baseType: !32, size: 32, elements: !846)
!846 = !{!847, !848, !849}
!847 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!848 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!849 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!850 = !{!851, !920, !925, !886, !845, !839, !930, !102}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !840, line: 523, size: 288, elements: !854)
!854 = !{!855, !876, !882, !887, !891, !892, !893, !897, !916}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !853, file: !840, line: 524, baseType: !856, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(types: !858)
!858 = !{!103, !859, !874, !875}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !132, line: 378, size: 192, elements: !862)
!862 = !{!863, !864, !865, !866, !872, !873}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !861, file: !132, line: 380, baseType: !135, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !861, file: !132, line: 382, baseType: !13, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !861, file: !132, line: 384, baseType: !13, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !861, file: !132, line: 386, baseType: !867, size: 32, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !132, line: 351, size: 16, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !868, file: !132, line: 359, baseType: !145, size: 8)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !868, file: !132, line: 364, baseType: !148, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !861, file: !132, line: 388, baseType: !102, size: 32, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !861, file: !132, line: 396, baseType: !151, size: 32, offset: 160)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !840, line: 237, baseType: !145)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !840, line: 257, baseType: !174)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !853, file: !840, line: 530, baseType: !877, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DISubroutineType(types: !879)
!879 = !{!103, !859, !880}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !840, line: 229, baseType: !174)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !853, file: !840, line: 532, baseType: !883, size: 32, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 32)
!884 = !DISubroutineType(types: !885)
!885 = !{!103, !859, !886, !881}
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !840, line: 216, baseType: !174)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !853, file: !840, line: 535, baseType: !888, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DISubroutineType(types: !890)
!890 = !{!103, !859, !886}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !853, file: !840, line: 537, baseType: !888, size: 32, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !853, file: !840, line: 539, baseType: !888, size: 32, offset: 160)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !853, file: !840, line: 541, baseType: !894, size: 32, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!895 = !DISubroutineType(types: !896)
!896 = !{!103, !859, !874, !839, !845}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !853, file: !840, line: 544, baseType: !898, size: 32, offset: 224)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DISubroutineType(types: !900)
!900 = !{!103, !859, !901, !148}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !840, line: 478, size: 96, elements: !903)
!903 = !{!904, !910, !915}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !902, file: !840, line: 482, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !315, line: 33, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !315, line: 29, size: 32, elements: !907)
!907 = !{!908}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !906, file: !315, line: 30, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !902, file: !840, line: 485, baseType: !911, size: 32, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !840, line: 464, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !859, !901, !886}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !902, file: !840, line: 493, baseType: !886, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !853, file: !840, line: 547, baseType: !917, size: 32, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DISubroutineType(types: !919)
!919 = !{!174, !859}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !840, line: 428, size: 32, elements: !923)
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !922, file: !840, line: 434, baseType: !886, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !840, line: 441, size: 32, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !927, file: !840, line: 447, baseType: !886, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!931 = !{!834, !932, !948}
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "pull_up", scope: !934, file: !935, line: 15, type: !941, isLocal: true, isDefinition: true)
!934 = distinct !DISubprogram(name: "board_init", scope: !935, file: !935, line: 10, type: !936, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !836, retainedNodes: !938)
!935 = !DIFile(filename: "zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!936 = !DISubroutineType(types: !937)
!937 = !{!103, !859}
!938 = !{!939, !940}
!939 = !DILocalVariable(name: "dev", arg: 1, scope: !934, file: !935, line: 10, type: !859)
!940 = !DILocalVariable(name: "res", scope: !934, file: !935, line: 14, type: !103)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !840, line: 271, size: 64, elements: !943)
!943 = !{!944, !945, !946}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !942, file: !840, line: 273, baseType: !859, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !942, file: !840, line: 275, baseType: !874, size: 8, offset: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !942, file: !840, line: 277, baseType: !947, size: 16, offset: 48)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !840, line: 249, baseType: !500)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "user_led", scope: !934, file: !935, line: 17, type: !941, isLocal: true, isDefinition: true)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !824, line: 51, size: 64, elements: !952)
!952 = !{!953, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !951, file: !824, line: 60, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !951, file: !824, line: 65, baseType: !859, size: 32, offset: 32)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "__device_dts_ord_68", scope: !958, file: !1192, line: 733, type: !1293, isLocal: false, isDefinition: true, align: 32)
!958 = distinct !DICompileUnit(language: DW_LANG_C99, file: !959, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !960, retainedTypes: !1103, globals: !1188, splitDebugInlining: false, nameTableKind: None)
!959 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/console/getline")
!960 = !{!961, !967, !30, !972, !977, !984, !992, !1000, !1009, !1013, !1068, !1075, !1094}
!961 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !962, line: 23, baseType: !32, size: 32, elements: !963)
!962 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!963 = !{!964, !965, !966}
!964 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!965 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!966 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!967 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !962, line: 48, baseType: !32, size: 32, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!970 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!971 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!972 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !973, line: 167, baseType: !32, size: 32, elements: !974)
!973 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!974 = !{!975, !976}
!975 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!976 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!977 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !973, line: 107, baseType: !32, size: 32, elements: !978)
!978 = !{!979, !980, !981, !982, !983}
!979 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!980 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!981 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!982 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!983 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!984 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !973, line: 208, baseType: !32, size: 32, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !991}
!986 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!987 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!988 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!989 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!990 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!991 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!992 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !973, line: 261, baseType: !32, size: 32, elements: !993)
!993 = !{!994, !995, !996, !997, !998, !999}
!994 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!995 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!996 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!997 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!998 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!999 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!1000 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !973, line: 237, baseType: !32, size: 32, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008}
!1002 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!1003 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!1004 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!1005 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!1006 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!1007 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!1008 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!1009 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !973, line: 152, baseType: !32, size: 32, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!1012 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!1013 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !656, line: 71, baseType: !103, size: 32, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067}
!1015 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!1016 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!1017 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!1018 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!1019 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!1020 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!1021 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!1022 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!1023 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!1024 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!1025 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!1026 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!1027 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!1028 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!1029 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!1030 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!1031 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!1032 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!1033 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!1034 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!1035 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!1036 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!1037 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!1038 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!1039 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!1040 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!1041 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!1042 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!1043 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!1044 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!1045 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!1046 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!1047 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!1048 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!1049 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!1050 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!1051 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!1052 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!1053 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!1054 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!1055 = !DIEnumerator(name: "MWU_IRQn", value: 32)
