; ModuleID = 'build/arduino_mkrzero/subsys/usb/console/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.common_descriptor = type <{ %struct.usb_device_descriptor, %struct.usb_cfg_descriptor }>
%struct.usb_device_descriptor = type { i8, i8, i16, i8, i8, i8, i8, i16, i16, i16, i8, i8, i8, i8 }
%struct.usb_cfg_descriptor = type <{ i8, i8, i16, i8, i8, i8, i8, i8 }>
%struct.usb_string_desription = type { %struct.usb_string_descriptor, %struct.usb_mfr_descriptor, %struct.usb_product_descriptor, %struct.usb_sn_descriptor }
%struct.usb_string_descriptor = type { i8, i8, i16 }
%struct.usb_mfr_descriptor = type { i8, i8, [12 x i8] }
%struct.usb_product_descriptor = type { i8, i8, [50 x i8] }
%struct.usb_sn_descriptor = type { i8, i8, [32 x i8] }
%struct.device_state = type { i8, i8 }
%struct.usb_cdc_acm_config = type { %struct.usb_association_descriptor, %struct.usb_if_descriptor, %struct.cdc_header_descriptor, %struct.cdc_cm_descriptor, %struct.cdc_acm_descriptor, %struct.cdc_cm_descriptor, %struct.usb_ep_descriptor, %struct.usb_if_descriptor, %struct.usb_ep_descriptor, %struct.usb_ep_descriptor }
%struct.usb_association_descriptor = type { i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.cdc_header_descriptor = type <{ i8, i8, i8, i16 }>
%struct.cdc_acm_descriptor = type { i8, i8, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/usb/console/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/usb/console")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/usb/console")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/usb/console")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_bossa_init", scope: !111, file: !136, line: 58, type: !137, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !135, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./bossa.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/usb/console")
!113 = !{!102, !114, !116}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !118, line: 370, baseType: !119)
!118 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0plus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 355, size: 320, elements: !120)
!120 = !{!121, !124, !125, !126, !127, !128, !129, !130, !134}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !119, file: !118, line: 357, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !115)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !119, file: !118, line: 358, baseType: !123, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !119, file: !118, line: 360, baseType: !123, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !119, file: !118, line: 364, baseType: !123, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !119, file: !118, line: 365, baseType: !123, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !119, file: !118, line: 366, baseType: !123, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !119, file: !118, line: 367, baseType: !115, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !119, file: !118, line: 368, baseType: !131, size: 64, offset: 224)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 2)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !119, file: !118, line: 369, baseType: !123, size: 32, offset: 288)
!135 = !{!109}
!136 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/bossa.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !139, line: 51, size: 64, elements: !140)
!139 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!140 = !{!141, !172}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !138, file: !139, line: 60, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!103, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !148, line: 378, size: 192, elements: !149)
!148 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!149 = !{!150, !154, !155, !156, !165, !166}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !148, line: 380, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !147, file: !148, line: 382, baseType: !13, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !147, file: !148, line: 384, baseType: !13, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !147, file: !148, line: 386, baseType: !157, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !148, line: 351, size: 16, elements: !159)
!159 = !{!160, !163}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !158, file: !148, line: 359, baseType: !161, size: 8)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !162)
!162 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !158, file: !148, line: 364, baseType: !164, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!164 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !148, line: 388, baseType: !102, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !147, file: !148, line: 396, baseType: !167, size: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !148, line: 43, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !171)
!171 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !138, file: !139, line: 65, baseType: !145, size: 32, offset: 32)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !175, file: !908, line: 202, type: !909, isLocal: true, isDefinition: true, align: 32)
!175 = distinct !DICompileUnit(language: DW_LANG_C99, file: !176, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !177, globals: !907, splitDebugInlining: false, nameTableKind: None)
!176 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/usb/console")
!177 = !{!102, !103, !178, !302, !114, !639, !706}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !180, line: 335, baseType: !181)
!180 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 320, size: 288, elements: !182)
!182 = !{!183, !196, !202, !216, !227, !238, !242, !253, !254, !265, !266, !281, !282, !292}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !181, file: !180, line: 321, baseType: !184, size: 16)
!184 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !180, line: 50, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 43, size: 16, elements: !187)
!187 = !{!188, !195}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !186, file: !180, line: 48, baseType: !189, size: 16)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !180, line: 44, size: 16, elements: !190)
!190 = !{!191, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !189, file: !180, line: 45, baseType: !192, size: 7, flags: DIFlagBitField, extraData: i64 0)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !189, file: !180, line: 47, baseType: !192, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !186, file: !180, line: 49, baseType: !192, size: 16)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !181, file: !180, line: 322, baseType: !197, size: 16, offset: 16)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 16, elements: !132)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !199, line: 52, baseType: !200)
!199 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !161)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !181, file: !180, line: 323, baseType: !203, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !180, line: 107, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 94, size: 32, elements: !206)
!206 = !{!207, !215}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !205, file: !180, line: 105, baseType: !208, size: 32)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !205, file: !180, line: 95, size: 32, elements: !209)
!209 = !{!210, !211, !212, !213, !214}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !208, file: !180, line: 97, baseType: !115, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !208, file: !180, line: 99, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !208, file: !180, line: 100, baseType: !115, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !208, file: !180, line: 102, baseType: !115, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !208, file: !180, line: 103, baseType: !115, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !205, file: !180, line: 106, baseType: !115, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !181, file: !180, line: 324, baseType: !217, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !180, line: 155, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 148, size: 32, elements: !220)
!220 = !{!221, !226}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !219, file: !180, line: 153, baseType: !222, size: 32)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !180, line: 149, size: 32, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !222, file: !180, line: 150, baseType: !115, size: 16, flags: DIFlagBitField, extraData: i64 0)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !222, file: !180, line: 151, baseType: !115, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !219, file: !180, line: 154, baseType: !115, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !181, file: !180, line: 325, baseType: !228, size: 8, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !180, line: 194, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 187, size: 8, elements: !231)
!231 = !{!232, !237}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !230, file: !180, line: 192, baseType: !233, size: 8)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !230, file: !180, line: 188, size: 8, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !233, file: !180, line: 189, baseType: !161, size: 1, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !233, file: !180, line: 190, baseType: !161, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !230, file: !180, line: 193, baseType: !161, size: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !181, file: !180, line: 326, baseType: !239, size: 24, offset: 104)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 24, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 3)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !181, file: !180, line: 327, baseType: !243, size: 8, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !180, line: 215, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 208, size: 8, elements: !246)
!246 = !{!247, !252}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !245, file: !180, line: 213, baseType: !248, size: 8)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !245, file: !180, line: 209, size: 8, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !248, file: !180, line: 210, baseType: !161, size: 1, flags: DIFlagBitField, extraData: i64 0)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !248, file: !180, line: 211, baseType: !161, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !245, file: !180, line: 214, baseType: !161, size: 8)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !181, file: !180, line: 328, baseType: !239, size: 24, offset: 136)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !181, file: !180, line: 329, baseType: !255, size: 8, offset: 160)
!255 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !180, line: 236, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 229, size: 8, elements: !258)
!258 = !{!259, !264}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !257, file: !180, line: 234, baseType: !260, size: 8)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !180, line: 230, size: 8, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !260, file: !180, line: 231, baseType: !200, size: 1, flags: DIFlagBitField, extraData: i64 0)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !260, file: !180, line: 232, baseType: !200, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !257, file: !180, line: 235, baseType: !161, size: 8)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !181, file: !180, line: 330, baseType: !239, size: 24, offset: 168)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !181, file: !180, line: 331, baseType: !267, size: 16, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !180, line: 262, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 250, size: 16, elements: !270)
!270 = !{!271, !280}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !269, file: !180, line: 260, baseType: !272, size: 16)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !180, line: 251, size: 16, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !272, file: !180, line: 252, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !272, file: !180, line: 253, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !272, file: !180, line: 254, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !272, file: !180, line: 255, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !272, file: !180, line: 256, baseType: !192, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !272, file: !180, line: 258, baseType: !192, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !269, file: !180, line: 261, baseType: !192, size: 16)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !181, file: !180, line: 332, baseType: !197, size: 16, offset: 208)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !181, file: !180, line: 333, baseType: !283, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !180, line: 290, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 284, size: 32, elements: !286)
!286 = !{!287, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !285, file: !180, line: 288, baseType: !288, size: 32)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !285, file: !180, line: 285, size: 32, elements: !289)
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !288, file: !180, line: 286, baseType: !115, size: 22, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !285, file: !180, line: 289, baseType: !115, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !181, file: !180, line: 334, baseType: !293, size: 16, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !180, line: 308, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 303, size: 16, elements: !296)
!296 = !{!297, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !295, file: !180, line: 306, baseType: !298, size: 16)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !295, file: !180, line: 304, size: 16, elements: !299)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !298, file: !180, line: 305, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !295, file: !180, line: 307, baseType: !192, size: 16)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !304, line: 928, baseType: !305)
!304 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 899, size: 672, elements: !306)
!306 = !{!307, !331, !355, !379, !404, !420, !421, !439, !440, !457, !468, !469, !484, !504, !505, !517, !529, !539, !540, !557, !561, !572, !573, !585, !597, !598, !609, !625}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !305, file: !304, line: 900, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !304, line: 64, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 43, size: 32, elements: !311)
!311 = !{!312, !330}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !310, file: !304, line: 62, baseType: !313, size: 32)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !310, file: !304, line: 44, size: 32, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !313, file: !304, line: 45, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !313, file: !304, line: 46, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !313, file: !304, line: 47, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !313, file: !304, line: 48, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !313, file: !304, line: 49, baseType: !115, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !313, file: !304, line: 50, baseType: !115, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !313, file: !304, line: 51, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !313, file: !304, line: 52, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !313, file: !304, line: 53, baseType: !115, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !313, file: !304, line: 54, baseType: !115, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !313, file: !304, line: 55, baseType: !115, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !313, file: !304, line: 56, baseType: !115, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !313, file: !304, line: 58, baseType: !115, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !313, file: !304, line: 59, baseType: !115, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !313, file: !304, line: 60, baseType: !115, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !310, file: !304, line: 63, baseType: !115, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !305, file: !304, line: 901, baseType: !332, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !304, line: 125, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 104, size: 32, elements: !335)
!335 = !{!336, !354}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !334, file: !304, line: 123, baseType: !337, size: 32)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !304, line: 105, size: 32, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !337, file: !304, line: 106, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !337, file: !304, line: 107, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !337, file: !304, line: 108, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !337, file: !304, line: 109, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !337, file: !304, line: 110, baseType: !115, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !337, file: !304, line: 111, baseType: !115, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !337, file: !304, line: 112, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !337, file: !304, line: 113, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !337, file: !304, line: 114, baseType: !115, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !337, file: !304, line: 115, baseType: !115, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !337, file: !304, line: 116, baseType: !115, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !337, file: !304, line: 117, baseType: !115, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !337, file: !304, line: 119, baseType: !115, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !337, file: !304, line: 120, baseType: !115, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !337, file: !304, line: 121, baseType: !115, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !334, file: !304, line: 124, baseType: !115, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !305, file: !304, line: 902, baseType: !356, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !304, line: 186, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 165, size: 32, elements: !359)
!359 = !{!360, !378}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !358, file: !304, line: 184, baseType: !361, size: 32)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !304, line: 166, size: 32, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !361, file: !304, line: 167, baseType: !122, size: 1, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !361, file: !304, line: 168, baseType: !122, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !361, file: !304, line: 169, baseType: !122, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !361, file: !304, line: 170, baseType: !122, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !361, file: !304, line: 171, baseType: !122, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !361, file: !304, line: 172, baseType: !122, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !361, file: !304, line: 173, baseType: !122, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !361, file: !304, line: 174, baseType: !122, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !361, file: !304, line: 175, baseType: !122, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !361, file: !304, line: 176, baseType: !122, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !361, file: !304, line: 177, baseType: !122, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !361, file: !304, line: 178, baseType: !122, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !361, file: !304, line: 180, baseType: !122, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !361, file: !304, line: 181, baseType: !122, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !361, file: !304, line: 182, baseType: !122, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !358, file: !304, line: 185, baseType: !115, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !305, file: !304, line: 903, baseType: !380, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !304, line: 247, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 226, size: 32, elements: !384)
!384 = !{!385, !403}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !383, file: !304, line: 245, baseType: !386, size: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !383, file: !304, line: 227, size: 32, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !386, file: !304, line: 228, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !386, file: !304, line: 229, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !386, file: !304, line: 230, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !386, file: !304, line: 231, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !386, file: !304, line: 232, baseType: !115, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !386, file: !304, line: 233, baseType: !115, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !386, file: !304, line: 234, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !386, file: !304, line: 235, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !386, file: !304, line: 236, baseType: !115, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !386, file: !304, line: 237, baseType: !115, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !386, file: !304, line: 238, baseType: !115, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !386, file: !304, line: 239, baseType: !115, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !386, file: !304, line: 241, baseType: !115, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !386, file: !304, line: 242, baseType: !115, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !386, file: !304, line: 243, baseType: !115, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !383, file: !304, line: 246, baseType: !115, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !305, file: !304, line: 904, baseType: !405, size: 16, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !304, line: 300, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 287, size: 16, elements: !408)
!408 = !{!409, !419}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !407, file: !304, line: 298, baseType: !410, size: 16)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !407, file: !304, line: 288, size: 16, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !410, file: !304, line: 290, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !410, file: !304, line: 291, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !410, file: !304, line: 293, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !410, file: !304, line: 294, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !410, file: !304, line: 295, baseType: !192, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !410, file: !304, line: 296, baseType: !192, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !410, file: !304, line: 297, baseType: !192, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !407, file: !304, line: 299, baseType: !192, size: 16)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !305, file: !304, line: 905, baseType: !197, size: 16, offset: 144)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !305, file: !304, line: 906, baseType: !422, size: 16, offset: 160)
!422 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !304, line: 352, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 336, size: 16, elements: !425)
!425 = !{!426, !438}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !424, file: !304, line: 350, baseType: !427, size: 16)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !424, file: !304, line: 337, size: 16, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !427, file: !304, line: 339, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !427, file: !304, line: 340, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !427, file: !304, line: 341, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !427, file: !304, line: 342, baseType: !192, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !427, file: !304, line: 343, baseType: !192, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !427, file: !304, line: 344, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !427, file: !304, line: 345, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !427, file: !304, line: 346, baseType: !192, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !427, file: !304, line: 348, baseType: !192, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !424, file: !304, line: 351, baseType: !192, size: 16)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !305, file: !304, line: 907, baseType: !197, size: 16, offset: 176)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !305, file: !304, line: 908, baseType: !441, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !304, line: 398, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 381, size: 32, elements: !444)
!444 = !{!445, !456}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !443, file: !304, line: 396, baseType: !446, size: 32)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !443, file: !304, line: 382, size: 32, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !446, file: !304, line: 384, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !446, file: !304, line: 385, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !446, file: !304, line: 386, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !446, file: !304, line: 388, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !446, file: !304, line: 389, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !446, file: !304, line: 390, baseType: !115, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !446, file: !304, line: 392, baseType: !115, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !446, file: !304, line: 394, baseType: !115, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !443, file: !304, line: 397, baseType: !115, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !305, file: !304, line: 909, baseType: !458, size: 8, offset: 224)
!458 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !304, line: 433, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 426, size: 8, elements: !461)
!461 = !{!462, !467}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !460, file: !304, line: 431, baseType: !463, size: 8)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !304, line: 427, size: 8, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !463, file: !304, line: 428, baseType: !161, size: 5, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !463, file: !304, line: 430, baseType: !161, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !460, file: !304, line: 432, baseType: !161, size: 8)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !305, file: !304, line: 910, baseType: !239, size: 24, offset: 232)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !305, file: !304, line: 911, baseType: !470, size: 32, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !304, line: 462, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 448, size: 32, elements: !473)
!473 = !{!474, !483}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !472, file: !304, line: 460, baseType: !475, size: 32)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !472, file: !304, line: 449, size: 32, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !475, file: !304, line: 451, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !475, file: !304, line: 453, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !475, file: !304, line: 454, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !475, file: !304, line: 455, baseType: !115, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !475, file: !304, line: 457, baseType: !115, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !475, file: !304, line: 459, baseType: !115, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !472, file: !304, line: 461, baseType: !115, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !305, file: !304, line: 912, baseType: !485, size: 16, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !304, line: 520, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 503, size: 16, elements: !488)
!488 = !{!489, !503}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !487, file: !304, line: 518, baseType: !490, size: 16)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !487, file: !304, line: 504, size: 16, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !490, file: !304, line: 506, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !490, file: !304, line: 507, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !490, file: !304, line: 508, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !490, file: !304, line: 509, baseType: !192, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !490, file: !304, line: 510, baseType: !192, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !490, file: !304, line: 511, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !490, file: !304, line: 512, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !490, file: !304, line: 513, baseType: !192, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !490, file: !304, line: 514, baseType: !192, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !490, file: !304, line: 515, baseType: !192, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !490, file: !304, line: 516, baseType: !192, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !487, file: !304, line: 519, baseType: !192, size: 16)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !305, file: !304, line: 913, baseType: !197, size: 16, offset: 304)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !305, file: !304, line: 914, baseType: !506, size: 32, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !304, line: 559, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 552, size: 32, elements: !509)
!509 = !{!510, !516}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !508, file: !304, line: 557, baseType: !511, size: 32)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !508, file: !304, line: 553, size: 32, elements: !512)
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !511, file: !304, line: 554, baseType: !115, size: 10, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !511, file: !304, line: 555, baseType: !115, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !511, file: !304, line: 556, baseType: !115, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !508, file: !304, line: 558, baseType: !115, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !305, file: !304, line: 915, baseType: !518, size: 32, offset: 352)
!518 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !304, line: 585, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 578, size: 32, elements: !521)
!521 = !{!522, !528}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !520, file: !304, line: 583, baseType: !523, size: 32)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !520, file: !304, line: 579, size: 32, elements: !524)
!524 = !{!525, !526, !527}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !523, file: !304, line: 580, baseType: !115, size: 16, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !523, file: !304, line: 581, baseType: !115, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !523, file: !304, line: 582, baseType: !115, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !520, file: !304, line: 584, baseType: !115, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !305, file: !304, line: 916, baseType: !530, size: 8, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !304, line: 610, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 604, size: 8, elements: !533)
!533 = !{!534, !538}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !532, file: !304, line: 608, baseType: !535, size: 8)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !532, file: !304, line: 605, size: 8, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !535, file: !304, line: 607, baseType: !161, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !532, file: !304, line: 609, baseType: !161, size: 8)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !305, file: !304, line: 917, baseType: !239, size: 24, offset: 392)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !305, file: !304, line: 918, baseType: !541, size: 32, offset: 416)
!541 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !304, line: 639, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 622, size: 32, elements: !544)
!544 = !{!545, !556}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !543, file: !304, line: 637, baseType: !546, size: 32)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !543, file: !304, line: 623, size: 32, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !546, file: !304, line: 625, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !546, file: !304, line: 626, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !546, file: !304, line: 627, baseType: !115, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !546, file: !304, line: 629, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !546, file: !304, line: 631, baseType: !115, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !546, file: !304, line: 632, baseType: !115, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !546, file: !304, line: 634, baseType: !115, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !546, file: !304, line: 635, baseType: !115, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !543, file: !304, line: 638, baseType: !115, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !305, file: !304, line: 919, baseType: !558, size: 32, offset: 448)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 32, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 4)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !305, file: !304, line: 920, baseType: !562, size: 16, offset: 480)
!562 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !304, line: 715, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 706, size: 16, elements: !565)
!565 = !{!566, !571}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !564, file: !304, line: 713, baseType: !567, size: 16)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !564, file: !304, line: 707, size: 16, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !567, file: !304, line: 709, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !567, file: !304, line: 711, baseType: !192, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !564, file: !304, line: 714, baseType: !192, size: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !305, file: !304, line: 921, baseType: !197, size: 16, offset: 496)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !305, file: !304, line: 922, baseType: !574, size: 32, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !304, line: 739, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 729, size: 32, elements: !577)
!577 = !{!578, !584}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !576, file: !304, line: 737, baseType: !579, size: 32)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !576, file: !304, line: 730, size: 32, elements: !580)
!580 = !{!581, !582, !583}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !579, file: !304, line: 732, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !579, file: !304, line: 733, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !579, file: !304, line: 735, baseType: !115, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !576, file: !304, line: 738, baseType: !115, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !305, file: !304, line: 923, baseType: !586, size: 8, offset: 544)
!586 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !304, line: 765, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 756, size: 8, elements: !589)
!589 = !{!590, !596}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !588, file: !304, line: 763, baseType: !591, size: 8)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !304, line: 757, size: 8, elements: !592)
!592 = !{!593, !594, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !591, file: !304, line: 759, baseType: !161, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !591, file: !304, line: 761, baseType: !161, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !591, file: !304, line: 762, baseType: !161, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !588, file: !304, line: 764, baseType: !161, size: 8)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !305, file: !304, line: 924, baseType: !239, size: 24, offset: 552)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !305, file: !304, line: 925, baseType: !599, size: 32, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !304, line: 789, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 781, size: 32, elements: !602)
!602 = !{!603, !608}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !601, file: !304, line: 787, baseType: !604, size: 32)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !601, file: !304, line: 782, size: 32, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !604, file: !304, line: 783, baseType: !115, size: 12, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !604, file: !304, line: 785, baseType: !115, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !601, file: !304, line: 788, baseType: !115, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !305, file: !304, line: 926, baseType: !610, size: 32, offset: 608)
!610 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !304, line: 820, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 805, size: 32, elements: !613)
!613 = !{!614, !624}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !612, file: !304, line: 818, baseType: !615, size: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !612, file: !304, line: 806, size: 32, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !615, file: !304, line: 807, baseType: !115, size: 2, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !615, file: !304, line: 808, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !615, file: !304, line: 809, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !615, file: !304, line: 810, baseType: !115, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !615, file: !304, line: 812, baseType: !115, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !615, file: !304, line: 814, baseType: !115, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !615, file: !304, line: 816, baseType: !115, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !612, file: !304, line: 819, baseType: !115, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !305, file: !304, line: 927, baseType: !626, size: 8, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !304, line: 881, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !304, line: 872, size: 8, elements: !630)
!630 = !{!631, !638}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !629, file: !304, line: 879, baseType: !632, size: 8)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !629, file: !304, line: 873, size: 8, elements: !633)
!633 = !{!634, !635, !636, !637}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !632, file: !304, line: 874, baseType: !161, size: 1, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !632, file: !304, line: 875, baseType: !161, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !632, file: !304, line: 876, baseType: !161, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !632, file: !304, line: 877, baseType: !161, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !629, file: !304, line: 880, baseType: !161, size: 8)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !641, line: 290, baseType: !642)
!641 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !641, line: 284, size: 96, elements: !643)
!643 = !{!644, !654, !665, !678, !695}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !642, file: !641, line: 285, baseType: !645, size: 8)
!645 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !641, line: 49, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !641, line: 43, size: 8, elements: !648)
!648 = !{!649, !653}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !647, file: !641, line: 47, baseType: !650, size: 8)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !647, file: !641, line: 44, size: 8, elements: !651)
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !650, file: !641, line: 45, baseType: !161, size: 1, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !647, file: !641, line: 48, baseType: !161, size: 8)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !642, file: !641, line: 286, baseType: !655, size: 8, offset: 8)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !641, line: 67, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !641, line: 61, size: 8, elements: !659)
!659 = !{!660, !664}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !658, file: !641, line: 65, baseType: !661, size: 8)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !658, file: !641, line: 62, size: 8, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !661, file: !641, line: 64, baseType: !161, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !658, file: !641, line: 66, baseType: !161, size: 8)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !642, file: !641, line: 287, baseType: !666, size: 16, offset: 16)
!666 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !641, line: 89, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !641, line: 79, size: 16, elements: !669)
!669 = !{!670, !677}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !668, file: !641, line: 87, baseType: !671, size: 16)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !668, file: !641, line: 80, size: 16, elements: !672)
!672 = !{!673, !674, !675, !676}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !671, file: !641, line: 81, baseType: !192, size: 6, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !671, file: !641, line: 83, baseType: !192, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !671, file: !641, line: 85, baseType: !192, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !671, file: !641, line: 86, baseType: !192, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !668, file: !641, line: 88, baseType: !192, size: 16)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !642, file: !641, line: 288, baseType: !679, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !641, line: 214, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !641, line: 199, size: 32, elements: !682)
!682 = !{!683, !694}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !681, file: !641, line: 212, baseType: !684, size: 32)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !681, file: !641, line: 200, size: 32, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !684, file: !641, line: 201, baseType: !115, size: 4, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !684, file: !641, line: 203, baseType: !115, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !684, file: !641, line: 205, baseType: !115, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !684, file: !641, line: 206, baseType: !115, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !684, file: !641, line: 207, baseType: !115, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !684, file: !641, line: 208, baseType: !115, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !684, file: !641, line: 209, baseType: !115, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !684, file: !641, line: 210, baseType: !115, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !681, file: !641, line: 213, baseType: !115, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !642, file: !641, line: 289, baseType: !696, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !641, line: 268, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !641, line: 260, size: 32, elements: !699)
!699 = !{!700, !705}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !698, file: !641, line: 266, baseType: !701, size: 32)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !698, file: !641, line: 261, size: 32, elements: !702)
!702 = !{!703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !701, file: !641, line: 262, baseType: !115, size: 4, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !701, file: !641, line: 264, baseType: !115, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !698, file: !641, line: 267, baseType: !115, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !708, line: 513, baseType: !709)
!708 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !708, line: 494, size: 480, elements: !710)
!710 = !{!711, !717, !727, !731, !741, !751, !761, !771, !775, !791, !807, !823, !853, !857, !867, !877, !887, !891}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !709, file: !708, line: 495, baseType: !712, size: 8)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !708, line: 45, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 43, size: 8, elements: !715)
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !708, line: 44, baseType: !161, size: 8)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !709, file: !708, line: 496, baseType: !718, size: 8, offset: 8)
!718 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !708, line: 61, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 55, size: 8, elements: !721)
!721 = !{!722, !726}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !720, file: !708, line: 59, baseType: !723, size: 8)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !720, file: !708, line: 56, size: 8, elements: !724)
!724 = !{!725}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !723, file: !708, line: 57, baseType: !161, size: 2, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !720, file: !708, line: 60, baseType: !161, size: 8)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !709, file: !708, line: 497, baseType: !728, size: 48, offset: 16)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 48, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 6)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !709, file: !708, line: 498, baseType: !732, size: 8, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !708, line: 86, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 80, size: 8, elements: !735)
!735 = !{!736, !740}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !734, file: !708, line: 84, baseType: !737, size: 8)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !734, file: !708, line: 81, size: 8, elements: !738)
!738 = !{!739}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !737, file: !708, line: 82, baseType: !161, size: 3, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !734, file: !708, line: 85, baseType: !161, size: 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !709, file: !708, line: 499, baseType: !742, size: 8, offset: 72)
!742 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !708, line: 121, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 115, size: 8, elements: !745)
!745 = !{!746, !750}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !744, file: !708, line: 119, baseType: !747, size: 8)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !744, file: !708, line: 116, size: 8, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !747, file: !708, line: 117, baseType: !161, size: 3, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !744, file: !708, line: 120, baseType: !161, size: 8)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !709, file: !708, line: 500, baseType: !752, size: 8, offset: 80)
!752 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !708, line: 156, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 150, size: 8, elements: !755)
!755 = !{!756, !760}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !754, file: !708, line: 154, baseType: !757, size: 8)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !754, file: !708, line: 151, size: 8, elements: !758)
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !757, file: !708, line: 152, baseType: !161, size: 3, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !754, file: !708, line: 155, baseType: !161, size: 8)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !709, file: !708, line: 501, baseType: !762, size: 8, offset: 88)
!762 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !708, line: 191, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 185, size: 8, elements: !765)
!765 = !{!766, !770}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !764, file: !708, line: 189, baseType: !767, size: 8)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !764, file: !708, line: 186, size: 8, elements: !768)
!768 = !{!769}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !767, file: !708, line: 187, baseType: !161, size: 3, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !764, file: !708, line: 190, baseType: !161, size: 8)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !709, file: !708, line: 502, baseType: !772, size: 64, offset: 96)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 64, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 8)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !709, file: !708, line: 503, baseType: !776, size: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !708, line: 232, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 220, size: 32, elements: !779)
!779 = !{!780, !790}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !778, file: !708, line: 230, baseType: !781, size: 32)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !778, file: !708, line: 221, size: 32, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !781, file: !708, line: 222, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !781, file: !708, line: 223, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !781, file: !708, line: 224, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !781, file: !708, line: 225, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !781, file: !708, line: 226, baseType: !115, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !781, file: !708, line: 227, baseType: !115, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !781, file: !708, line: 228, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !778, file: !708, line: 231, baseType: !115, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !709, file: !708, line: 504, baseType: !792, size: 32, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !708, line: 268, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 256, size: 32, elements: !795)
!795 = !{!796, !806}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !794, file: !708, line: 266, baseType: !797, size: 32)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !794, file: !708, line: 257, size: 32, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !797, file: !708, line: 258, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !797, file: !708, line: 259, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !797, file: !708, line: 260, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !797, file: !708, line: 261, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !797, file: !708, line: 262, baseType: !115, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !797, file: !708, line: 263, baseType: !115, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !797, file: !708, line: 264, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !794, file: !708, line: 267, baseType: !115, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !709, file: !708, line: 505, baseType: !808, size: 32, offset: 224)
!808 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !708, line: 304, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 292, size: 32, elements: !811)
!811 = !{!812, !822}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !810, file: !708, line: 302, baseType: !813, size: 32)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !810, file: !708, line: 293, size: 32, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !813, file: !708, line: 294, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !813, file: !708, line: 295, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !813, file: !708, line: 296, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !813, file: !708, line: 297, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !813, file: !708, line: 298, baseType: !115, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !813, file: !708, line: 299, baseType: !115, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !813, file: !708, line: 300, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !810, file: !708, line: 303, baseType: !115, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !709, file: !708, line: 506, baseType: !824, size: 32, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !708, line: 354, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 328, size: 32, elements: !827)
!827 = !{!828, !852}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !826, file: !708, line: 352, baseType: !829, size: 32)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !826, file: !708, line: 329, size: 32, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !829, file: !708, line: 330, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !829, file: !708, line: 331, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !829, file: !708, line: 332, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !829, file: !708, line: 333, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !829, file: !708, line: 334, baseType: !115, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !829, file: !708, line: 335, baseType: !115, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !829, file: !708, line: 336, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !829, file: !708, line: 337, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !829, file: !708, line: 338, baseType: !115, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !829, file: !708, line: 339, baseType: !115, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !829, file: !708, line: 340, baseType: !115, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !829, file: !708, line: 341, baseType: !115, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !829, file: !708, line: 342, baseType: !115, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !829, file: !708, line: 343, baseType: !115, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !829, file: !708, line: 344, baseType: !115, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !829, file: !708, line: 345, baseType: !115, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !829, file: !708, line: 346, baseType: !115, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !829, file: !708, line: 347, baseType: !115, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_", scope: !829, file: !708, line: 348, baseType: !115, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "PTC_", scope: !829, file: !708, line: 349, baseType: !115, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_", scope: !829, file: !708, line: 350, baseType: !115, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !826, file: !708, line: 353, baseType: !115, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !709, file: !708, line: 507, baseType: !854, size: 128, offset: 288)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 128, elements: !855)
!855 = !{!856}
!856 = !DISubrange(count: 16)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !709, file: !708, line: 508, baseType: !858, size: 8, offset: 416)
!858 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENCLR_Type", file: !708, line: 412, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 406, size: 8, elements: !861)
!861 = !{!862, !866}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !860, file: !708, line: 410, baseType: !863, size: 8)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !708, line: 407, size: 8, elements: !864)
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !863, file: !708, line: 408, baseType: !161, size: 1, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !860, file: !708, line: 411, baseType: !161, size: 8)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !709, file: !708, line: 509, baseType: !868, size: 8, offset: 424)
!868 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENSET_Type", file: !708, line: 430, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 424, size: 8, elements: !871)
!871 = !{!872, !876}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !870, file: !708, line: 428, baseType: !873, size: 8)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !870, file: !708, line: 425, size: 8, elements: !874)
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !873, file: !708, line: 426, baseType: !161, size: 1, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !870, file: !708, line: 429, baseType: !161, size: 8)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !709, file: !708, line: 510, baseType: !878, size: 8, offset: 432)
!878 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTFLAG_Type", file: !708, line: 448, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !708, line: 442, size: 8, elements: !881)
!881 = !{!882, !886}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !880, file: !708, line: 446, baseType: !883, size: 8)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !880, file: !708, line: 443, size: 8, elements: !884)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !883, file: !708, line: 444, baseType: !200, size: 1, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !880, file: !708, line: 447, baseType: !161, size: 8)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !709, file: !708, line: 511, baseType: !888, size: 8, offset: 440)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 8, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 1)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "RCAUSE", scope: !709, file: !708, line: 512, baseType: !892, size: 8, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !893)
