; ModuleID = 'build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.os_timer_def = type { void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %union.anon.3, i32, i32, i8*, i8*, i8*, i8*, i32, %struct._dnode, i8 }
%struct._wait_q_t = type { %struct._dnode }
%union.anon.3 = type { i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.os_messageQ_def = type { i32, i32, i8*, %struct.k_msgq* }
%struct.os_messageQ_cb = type opaque
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.z_poller*, i8*, i16* }
%struct.z_poller = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.3 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.3 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.k_mem_slab = type { %struct._wait_q_t, %union.anon.3, i32, i32, i8*, i8*, i32 }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 94, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5248, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 82)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2624, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "os_timer_def_myTimer", scope: !27, file: !129, line: 25, type: !198, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !123, globals: !126, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v1/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!29 = !{!30, !49, !53}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 99, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osEventSignal", value: 8)
!36 = !DIEnumerator(name: "osEventMessage", value: 16)
!37 = !DIEnumerator(name: "osEventMail", value: 32)
!38 = !DIEnumerator(name: "osEventTimeout", value: 64)
!39 = !DIEnumerator(name: "osErrorParameter", value: 128)
!40 = !DIEnumerator(name: "osErrorResource", value: 129)
!41 = !DIEnumerator(name: "osErrorTimeoutResource", value: 193)
!42 = !DIEnumerator(name: "osErrorISR", value: 130)
!43 = !DIEnumerator(name: "osErrorISRRecursive", value: 131)
!44 = !DIEnumerator(name: "osErrorPriority", value: 132)
!45 = !DIEnumerator(name: "osErrorNoMemory", value: 133)
!46 = !DIEnumerator(name: "osErrorValue", value: 134)
!47 = !DIEnumerator(name: "osErrorOS", value: 255)
!48 = !DIEnumerator(name: "os_status_reserved", value: 2147483647)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 120, baseType: !32, size: 32, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "osTimerOnce", value: 0)
!52 = !DIEnumerator(name: "osTimerPeriodic", value: 1)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !54, line: 27, baseType: !32, size: 32, elements: !55)
!54 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!56 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!57 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!58 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!59 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!60 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!61 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!62 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!63 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!64 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!65 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!66 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!67 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!68 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!69 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!70 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!71 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!72 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!118 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!119 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!120 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!121 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!122 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !{!25, !127, !184, !186, !188, !193}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "os_messageQ_def_messageq", scope: !27, file: !129, line: 27, type: !130, isLocal: false, isDefinition: true)
!129 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v1/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQDef_t", file: !31, line: 213, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "os_messageQ_def", file: !31, line: 208, size: 128, elements: !133)
!133 = !{!134, !136, !137, !138}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "queue_sz", scope: !132, file: !31, line: 209, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "item_sz", scope: !132, file: !31, line: 210, baseType: !135, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !132, file: !31, line: 211, baseType: !124, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !132, file: !31, line: 212, baseType: !139, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !141, line: 4204, size: 416, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !164, !169, !172, !173, !176, !177, !178, !179, !180, !181}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !140, file: !141, line: 4206, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !145, line: 233, baseType: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 231, size: 64, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !146, file: !145, line: 232, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !150, line: 48, baseType: !151)
!150 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !150, line: 37, size: 64, elements: !152)
!152 = !{!153, !159}
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !150, line: 38, baseType: !154, size: 32)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !150, line: 38, size: 32, elements: !155)
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !154, file: !150, line: 39, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !150, line: 40, baseType: !157, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !150, line: 42, baseType: !160, size: 32, offset: 32)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !150, line: 42, size: 32, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !160, file: !150, line: 43, baseType: !157, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !160, file: !150, line: 44, baseType: !157, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !140, file: !141, line: 4208, baseType: !165, size: 32, offset: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !166, line: 43, size: 32, elements: !167)
!166 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !165, file: !166, line: 52, baseType: !22, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !140, file: !141, line: 4210, baseType: !170, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !171, line: 214, baseType: !32)
!171 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !140, file: !141, line: 4212, baseType: !135, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !140, file: !141, line: 4214, baseType: !174, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !140, file: !141, line: 4216, baseType: !174, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !140, file: !141, line: 4218, baseType: !174, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !140, file: !141, line: 4220, baseType: !174, size: 32, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !140, file: !141, line: 4222, baseType: !135, size: 32, offset: 288)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !140, file: !141, line: 4224, baseType: !149, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !140, file: !141, line: 4227, baseType: !182, size: 8, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !183)
!183 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "data", scope: !27, file: !129, line: 21, type: !135, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "msgq_messageq", scope: !27, file: !129, line: 27, type: !140, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "buf_messageq", scope: !27, file: !129, line: 27, type: !190, isLocal: true, isDefinition: true, align: 32)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 32, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 4)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "message_id", scope: !27, file: !129, line: 28, type: !195, isLocal: false, isDefinition: true)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQId", file: !31, line: 157, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "os_messageQ_cb", file: !31, line: 157, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerDef_t", file: !31, line: 184, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "os_timer_def", file: !31, line: 182, size: 32, elements: !201)
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ptimer", scope: !200, file: !31, line: 183, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "os_ptimer", file: !31, line: 131, baseType: !16)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "_char_out", scope: !206, file: !210, line: 54, type: !211, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !123, globals: !209, splitDebugInlining: false, nameTableKind: None)
!207 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!208 = !{!53}
!209 = !{!204}
!210 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{!125, !125}
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !216, file: !233, line: 56, type: !234, isLocal: true, isDefinition: true, align: 32)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !218, globals: !232, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !221, line: 369, baseType: !222)
!221 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f405xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 360, size: 224, elements: !223)
!223 = !{!224, !226, !227, !228, !229, !230, !231}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !222, file: !221, line: 362, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !222, file: !221, line: 363, baseType: !225, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !222, file: !221, line: 364, baseType: !225, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !222, file: !221, line: 365, baseType: !225, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !222, file: !221, line: 366, baseType: !225, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !222, file: !221, line: 367, baseType: !225, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !222, file: !221, line: 368, baseType: !225, size: 32, offset: 192)
!232 = !{!214}
!233 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !236, line: 51, size: 64, elements: !237)
!236 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !{!238, !266}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !235, file: !236, line: 60, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DISubroutineType(types: !241)
!241 = !{!125, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !245, line: 378, size: 192, elements: !246)
!245 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !{!247, !250, !251, !252, !259, !260}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !244, file: !245, line: 380, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !244, file: !245, line: 382, baseType: !13, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !244, file: !245, line: 384, baseType: !13, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !244, file: !245, line: 386, baseType: !253, size: 32, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !245, line: 351, size: 16, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !254, file: !245, line: 359, baseType: !182, size: 8)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !254, file: !245, line: 364, baseType: !258, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!258 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !244, file: !245, line: 388, baseType: !124, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !244, file: !245, line: 396, baseType: !261, size: 32, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !245, line: 43, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !265)
!265 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !235, file: !236, line: 65, baseType: !242, size: 32, offset: 32)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !269, file: !272, line: 71, type: !273, isLocal: true, isDefinition: true, align: 32)
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !271, splitDebugInlining: false, nameTableKind: None)
!270 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!271 = !{!267}
!272 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !236, line: 51, size: 64, elements: !275)
!275 = !{!276, !295}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !274, file: !236, line: 60, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DISubroutineType(types: !279)
!279 = !{!125, !280}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !245, line: 378, size: 192, elements: !283)
!283 = !{!284, !285, !286, !287, !293, !294}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !282, file: !245, line: 380, baseType: !248, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !282, file: !245, line: 382, baseType: !13, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !282, file: !245, line: 384, baseType: !13, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !282, file: !245, line: 386, baseType: !288, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !245, line: 351, size: 16, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !289, file: !245, line: 359, baseType: !182, size: 8)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !289, file: !245, line: 364, baseType: !258, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !282, file: !245, line: 388, baseType: !124, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !282, file: !245, line: 396, baseType: !261, size: 32, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !274, file: !236, line: 65, baseType: !280, size: 32, offset: 32)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "static_regions", scope: !298, file: !305, line: 62, type: !466, isLocal: true, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !300, globals: !301, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!300 = !{!170, !125, !135, !124}
!301 = !{!302, !296}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !304, file: !305, line: 198, type: !452, isLocal: true, isDefinition: true)
!304 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !305, file: !305, line: 175, type: !306, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !447)
!305 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!306 = !DISubroutineType(types: !307)
!307 = !{null, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !310, line: 245, size: 1472, elements: !311)
!310 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !{!312, !379, !392, !393, !394, !399, !411, !412, !416, !417, !418, !424, !442}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !309, file: !310, line: 247, baseType: !313, size: 384)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !310, line: 57, size: 384, elements: !314)
!314 = !{!315, !342, !349, !350, !351, !364, !365, !366}
!315 = !DIDerivedType(tag: DW_TAG_member, scope: !313, file: !310, line: 60, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !313, file: !310, line: 60, size: 64, elements: !317)
!317 = !{!318, !333}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !316, file: !310, line: 61, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !150, line: 49, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !150, line: 37, size: 64, elements: !321)
!321 = !{!322, !328}
!322 = !DIDerivedType(tag: DW_TAG_member, scope: !320, file: !150, line: 38, baseType: !323, size: 32)
!323 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !320, file: !150, line: 38, size: 32, elements: !324)
!324 = !{!325, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !323, file: !150, line: 39, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !150, line: 40, baseType: !326, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, scope: !320, file: !150, line: 42, baseType: !329, size: 32, offset: 32)
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !320, file: !150, line: 42, size: 32, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !329, file: !150, line: 43, baseType: !326, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !329, file: !150, line: 44, baseType: !326, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !316, file: !310, line: 62, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !335, line: 49, size: 64, elements: !336)
!335 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !334, file: !335, line: 50, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 64, elements: !340)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!340 = !{!341}
!341 = !DISubrange(count: 2)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !313, file: !310, line: 68, baseType: !343, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !145, line: 233, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 231, size: 64, elements: !346)
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !345, file: !145, line: 232, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !150, line: 48, baseType: !320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !313, file: !310, line: 71, baseType: !182, size: 8, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !313, file: !310, line: 74, baseType: !182, size: 8, offset: 104)
!351 = !DIDerivedType(tag: DW_TAG_member, scope: !313, file: !310, line: 90, baseType: !352, size: 16, offset: 112)
!352 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !313, file: !310, line: 90, size: 16, elements: !353)
!353 = !{!354, !361}
!354 = !DIDerivedType(tag: DW_TAG_member, scope: !352, file: !310, line: 91, baseType: !355, size: 16)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !352, file: !310, line: 91, size: 16, elements: !356)
!356 = !{!357, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !355, file: !310, line: 96, baseType: !358, size: 8)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !359)
!359 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !355, file: !310, line: 97, baseType: !182, size: 8, offset: 8)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !352, file: !310, line: 100, baseType: !362, size: 16)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !363)
!363 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !313, file: !310, line: 107, baseType: !135, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !313, file: !310, line: 127, baseType: !124, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !313, file: !310, line: 131, baseType: !367, size: 192, offset: 192)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !145, line: 244, size: 192, elements: !368)
!368 = !{!369, !370, !376}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !367, file: !145, line: 245, baseType: !319, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !367, file: !145, line: 246, baseType: !371, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !145, line: 242, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !375}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !367, file: !145, line: 249, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !378)
!378 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !309, file: !310, line: 250, baseType: !380, size: 288, offset: 384)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !381, line: 25, size: 288, elements: !382)
!381 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !380, file: !381, line: 26, baseType: !135, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !380, file: !381, line: 27, baseType: !135, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !380, file: !381, line: 28, baseType: !135, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !380, file: !381, line: 29, baseType: !135, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !380, file: !381, line: 30, baseType: !135, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !380, file: !381, line: 31, baseType: !135, size: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !380, file: !381, line: 32, baseType: !135, size: 32, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !380, file: !381, line: 33, baseType: !135, size: 32, offset: 224)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !380, file: !381, line: 34, baseType: !135, size: 32, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !309, file: !310, line: 253, baseType: !124, size: 32, offset: 672)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !309, file: !310, line: 256, baseType: !344, size: 64, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !309, file: !310, line: 259, baseType: !395, size: 16, offset: 768)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !310, line: 236, size: 16, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !395, file: !310, line: 237, baseType: !258, size: 8)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !395, file: !310, line: 238, baseType: !182, size: 8, offset: 8)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !309, file: !310, line: 271, baseType: !400, size: 128, offset: 800)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !310, line: 34, size: 128, elements: !401)
!401 = !{!402, !408, !409, !410}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !400, file: !310, line: 35, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !404, line: 46, baseType: !405)
!404 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !124, !124, !124}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !400, file: !310, line: 36, baseType: !124, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !400, file: !310, line: 37, baseType: !124, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !400, file: !310, line: 38, baseType: !124, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !309, file: !310, line: 274, baseType: !308, size: 32, offset: 928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !310, line: 279, baseType: !413, size: 256, offset: 960)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 256, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !309, file: !310, line: 284, baseType: !124, size: 32, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !309, file: !310, line: 294, baseType: !125, size: 32, offset: 1248)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !309, file: !310, line: 300, baseType: !419, size: 96, offset: 1280)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !310, line: 149, size: 96, elements: !420)
!420 = !{!421, !422, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !419, file: !310, line: 153, baseType: !22, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !419, file: !310, line: 162, baseType: !170, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !419, file: !310, line: 168, baseType: !170, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !309, file: !310, line: 325, baseType: !425, size: 32, offset: 1376)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !141, line: 5073, size: 192, elements: !427)
!427 = !{!428, !437, !438}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !426, file: !141, line: 5074, baseType: !429, size: 96)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !430, line: 56, size: 96, elements: !431)
!430 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!431 = !{!432, !435, !436}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !429, file: !430, line: 57, baseType: !433, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !430, line: 57, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !429, file: !430, line: 58, baseType: !124, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !429, file: !430, line: 59, baseType: !170, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !426, file: !141, line: 5075, baseType: !344, size: 64, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !426, file: !141, line: 5076, baseType: !439, size: 32, offset: 160)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !166, line: 43, size: 32, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !439, file: !166, line: 52, baseType: !22, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !309, file: !310, line: 343, baseType: !443, size: 64, offset: 1408)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !381, line: 60, size: 64, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !443, file: !381, line: 63, baseType: !135, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !443, file: !381, line: 66, baseType: !135, size: 32, offset: 32)
!447 = !{!448, !449, !450, !451}
!448 = !DILocalVariable(name: "thread", arg: 1, scope: !304, file: !305, line: 175, type: !308)
!449 = !DILocalVariable(name: "region_num", scope: !304, file: !305, line: 200, type: !182)
!450 = !DILocalVariable(name: "guard_start", scope: !304, file: !305, line: 265, type: !22)
!451 = !DILocalVariable(name: "guard_size", scope: !304, file: !305, line: 266, type: !170)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 96, elements: !464)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !454, line: 52, size: 96, elements: !455)
!454 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !453, file: !454, line: 53, baseType: !22, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !453, file: !454, line: 54, baseType: !170, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !453, file: !454, line: 55, baseType: !459, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !460, line: 151, baseType: !461)
!460 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !460, line: 149, size: 32, elements: !462)
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !461, file: !460, line: 150, baseType: !135, size: 32)
!464 = !{!465}
!465 = !DISubrange(count: 1)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 96, elements: !464)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !470, file: !503, line: 39, type: !182, isLocal: true, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !472, globals: !502, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!472 = !{!473, !124, !125, !490, !182}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !475, line: 1226, baseType: !476)
!475 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !475, line: 1213, size: 352, elements: !477)
!477 = !{!478, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !476, file: !475, line: 1215, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !476, file: !475, line: 1216, baseType: !225, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !476, file: !475, line: 1217, baseType: !225, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !476, file: !475, line: 1218, baseType: !225, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !476, file: !475, line: 1219, baseType: !225, size: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !476, file: !475, line: 1220, baseType: !225, size: 32, offset: 160)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !476, file: !475, line: 1221, baseType: !225, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !476, file: !475, line: 1222, baseType: !225, size: 32, offset: 224)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !476, file: !475, line: 1223, baseType: !225, size: 32, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !476, file: !475, line: 1224, baseType: !225, size: 32, offset: 288)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !476, file: !475, line: 1225, baseType: !225, size: 32, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !493, line: 27, size: 96, elements: !494)
!493 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!494 = !{!495, !496, !497}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !492, file: !493, line: 29, baseType: !135, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !492, file: !493, line: 31, baseType: !248, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !492, file: !493, line: 37, baseType: !498, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !460, line: 146, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !460, line: 141, size: 32, elements: !500)
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !499, file: !460, line: 143, baseType: !135, size: 32)
!502 = !{!468}
!503 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !506, file: !513, line: 21, type: !211, isLocal: true, isDefinition: true)
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !508, globals: !512, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!508 = !{!509, !125, !124}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !511, line: 22, baseType: !125)
!511 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!512 = !{!504}
!513 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !516, file: !521, line: 13, type: !538, isLocal: true, isDefinition: true)
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !518, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!518 = !{!519, !514}
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "mpu_config", scope: !516, file: !521, line: 37, type: !522, isLocal: false, isDefinition: true)
!521 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !493, line: 41, size: 64, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !523, file: !493, line: 43, baseType: !135, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !523, file: !493, line: 45, baseType: !527, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !493, line: 27, size: 96, elements: !530)
!530 = !{!531, !532, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !529, file: !493, line: 29, baseType: !135, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !529, file: !493, line: 31, baseType: !248, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !529, file: !493, line: 37, baseType: !534, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !460, line: 146, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !460, line: 141, size: 32, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !535, file: !460, line: 143, baseType: !135, size: 32)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 192, elements: !340)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "cmsis_timer_slab", scope: !541, file: !553, line: 24, type: !615, isLocal: false, isDefinition: true, align: 32)
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !543, retainedTypes: !544, globals: !609, splitDebugInlining: false, nameTableKind: None)
!542 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v1/cmsis_timer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!543 = !{!49, !30, !53}
!544 = !{!124, !545, !546, !548, !551, !125, !135, !607, !174}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !547, line: 46, baseType: !377)
!547 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerId", file: !31, line: 141, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "os_timer_cb", file: !31, line: 141, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_obj", file: !553, line: 16, size: 576, elements: !554)
!553 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v1/cmsis_timer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!554 = !{!555, !602, !604, !605, !606}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ztimer", scope: !552, file: !553, line: 17, baseType: !556, size: 448)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !141, line: 1318, size: 448, elements: !557)
!557 = !{!558, !583, !589, !594, !595, !600, !601}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !556, file: !141, line: 1324, baseType: !559, size: 192)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !145, line: 244, size: 192, elements: !560)
!560 = !{!561, !576, !582}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !559, file: !145, line: 245, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !150, line: 49, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !150, line: 37, size: 64, elements: !564)
!564 = !{!565, !571}
!565 = !DIDerivedType(tag: DW_TAG_member, scope: !563, file: !150, line: 38, baseType: !566, size: 32)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !563, file: !150, line: 38, size: 32, elements: !567)
!567 = !{!568, !570}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !566, file: !150, line: 39, baseType: !569, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !566, file: !150, line: 40, baseType: !569, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, scope: !563, file: !150, line: 42, baseType: !572, size: 32, offset: 32)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !563, file: !150, line: 42, size: 32, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !572, file: !150, line: 43, baseType: !569, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !572, file: !150, line: 44, baseType: !569, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !559, file: !145, line: 246, baseType: !577, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !145, line: 242, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !559, file: !145, line: 249, baseType: !377, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !556, file: !141, line: 1327, baseType: !584, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !145, line: 233, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 231, size: 64, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !585, file: !145, line: 232, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !150, line: 48, baseType: !563)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !556, file: !141, line: 1330, baseType: !590, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !593}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !556, file: !141, line: 1333, baseType: !590, size: 32, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !556, file: !141, line: 1336, baseType: !596, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !547, line: 67, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !547, line: 65, size: 64, elements: !598)
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !597, file: !547, line: 66, baseType: !546, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !556, file: !141, line: 1339, baseType: !135, size: 32, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !556, file: !141, line: 1342, baseType: !124, size: 32, offset: 416)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !552, file: !553, line: 18, baseType: !603, size: 32, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "os_timer_type", file: !31, line: 123, baseType: !49)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !552, file: !553, line: 19, baseType: !135, size: 32, offset: 480)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "callback_function", scope: !552, file: !553, line: 20, baseType: !16, size: 32, offset: 512)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !552, file: !553, line: 21, baseType: !124, size: 32, offset: 544)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !608)
!608 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!609 = !{!539, !610}
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cmsis_timer_slab", scope: !541, file: !553, line: 24, type: !612, isLocal: false, isDefinition: true, align: 64)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 2880, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 360)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_slab", file: !141, line: 4836, size: 256, elements: !616)
!616 = !{!617, !618, !622, !623, !624, !625, !626}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !615, file: !141, line: 4837, baseType: !584, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !615, file: !141, line: 4838, baseType: !619, size: 32, offset: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !166, line: 43, size: 32, elements: !620)
!620 = !{!621}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !619, file: !166, line: 52, baseType: !22, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !615, file: !141, line: 4839, baseType: !135, size: 32, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !615, file: !141, line: 4840, baseType: !170, size: 32, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !615, file: !141, line: 4841, baseType: !174, size: 32, offset: 160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !615, file: !141, line: 4842, baseType: !174, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "num_used", scope: !615, file: !141, line: 4843, baseType: !135, size: 32, offset: 224)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !629, file: !734, line: 72, type: !816, isLocal: true, isDefinition: true)
!629 = distinct !DICompileUnit(language: DW_LANG_C99, file: !630, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !631, retainedTypes: !720, globals: !731, splitDebugInlining: false, nameTableKind: None)
!630 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!631 = !{!53, !632}
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !221, line: 65, baseType: !125, size: 32, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!634 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!635 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!636 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!637 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!638 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!639 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!640 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!641 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!642 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!643 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!644 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!645 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!646 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!647 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!648 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!649 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!650 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!651 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!652 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!653 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!654 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!655 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!656 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!657 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!658 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!659 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!660 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!661 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!662 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!663 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!664 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!665 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!666 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!667 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!668 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!669 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!670 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!671 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!672 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!673 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!674 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!675 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!676 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!677 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!678 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!679 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!680 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!681 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!682 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!683 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!684 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!685 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!686 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!687 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!688 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!689 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!690 = !DIEnumerator(name: "FSMC_IRQn", value: 48)
!691 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!692 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!693 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!694 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!695 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!696 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!697 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!698 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!699 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!700 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!701 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!702 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!703 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!704 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!705 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!706 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!707 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!708 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!709 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!710 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!711 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!712 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!713 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!714 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!715 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!716 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!717 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!718 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!719 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!720 = !{!170, !125, !124, !721}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !221, line: 354, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 346, size: 192, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !723, file: !221, line: 348, baseType: !225, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !723, file: !221, line: 349, baseType: !225, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !723, file: !221, line: 350, baseType: !225, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !723, file: !221, line: 351, baseType: !225, size: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !723, file: !221, line: 352, baseType: !225, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !723, file: !221, line: 353, baseType: !225, size: 32, offset: 160)
!731 = !{!732, !736, !752, !763, !780, !627, !782, !796, !798, !800, !802, !804, !806, !808, !810, !812, !814}
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !629, file: !734, line: 424, type: !735, isLocal: false, isDefinition: true, align: 16)
!734 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 64, elements: !191)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "__device_dts_ord_37", scope: !629, file: !734, line: 424, type: !738, isLocal: false, isDefinition: true, align: 32)
!738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !245, line: 378, size: 192, elements: !740)
!740 = !{!741, !742, !743, !744, !750, !751}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !739, file: !245, line: 380, baseType: !248, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !739, file: !245, line: 382, baseType: !13, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !739, file: !245, line: 384, baseType: !13, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !739, file: !245, line: 386, baseType: !745, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !245, line: 351, size: 16, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !746, file: !245, line: 359, baseType: !182, size: 8)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !746, file: !245, line: 364, baseType: !258, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !739, file: !245, line: 388, baseType: !124, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !739, file: !245, line: 396, baseType: !261, size: 32, offset: 160)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_37", scope: !629, file: !734, line: 424, type: !754, isLocal: true, isDefinition: true, align: 32)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !236, line: 51, size: 64, elements: !756)
!756 = !{!757, !762}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !755, file: !236, line: 60, baseType: !758, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!759 = !DISubroutineType(types: !760)
!760 = !{!125, !761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !755, file: !236, line: 65, baseType: !761, size: 32, offset: 32)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "exti_data", scope: !629, file: !734, line: 423, type: !765, isLocal: true, isDefinition: true)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !734, line: 107, size: 1472, elements: !766)
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !765, file: !734, line: 109, baseType: !768, size: 1472)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 1472, elements: !778)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !734, line: 101, size: 64, elements: !770)
!770 = !{!771, !777}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !769, file: !734, line: 102, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !773, line: 63, baseType: !774)
!773 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !125, !124}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !769, file: !734, line: 103, baseType: !124, size: 32, offset: 32)
!778 = !{!779}
!779 = !DISubrange(count: 23)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_37", scope: !629, file: !734, line: 424, type: !746, isLocal: true, isDefinition: true, align: 8)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !784, file: !734, line: 493, type: !789, isLocal: true, isDefinition: true, align: 32)
!784 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !734, file: !734, line: 460, type: !785, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !629, retainedNodes: !787)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !761}
!787 = !{!788}
!788 = !DILocalVariable(name: "dev", arg: 1, scope: !784, file: !734, line: 460, type: !761)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !790)
!790 = !{!791, !793, !794, !795}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !789, file: !10, line: 55, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !125)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !789, file: !10, line: 57, baseType: !792, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !789, file: !10, line: 59, baseType: !124, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !789, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !784, file: !734, line: 497, type: !789, isLocal: true, isDefinition: true, align: 32)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !784, file: !734, line: 507, type: !789, isLocal: true, isDefinition: true, align: 32)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !784, file: !734, line: 512, type: !789, isLocal: true, isDefinition: true, align: 32)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !784, file: !734, line: 516, type: !789, isLocal: true, isDefinition: true, align: 32)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !784, file: !734, line: 523, type: !789, isLocal: true, isDefinition: true, align: 32)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !784, file: !734, line: 527, type: !789, isLocal: true, isDefinition: true, align: 32)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !784, file: !734, line: 581, type: !789, isLocal: true, isDefinition: true, align: 32)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !784, file: !734, line: 586, type: !789, isLocal: true, isDefinition: true, align: 32)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !784, file: !734, line: 591, type: !789, isLocal: true, isDefinition: true, align: 32)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !784, file: !734, line: 595, type: !789, isLocal: true, isDefinition: true, align: 32)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 736, elements: !778)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !221, line: 155, baseType: !632)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !821, file: !826, line: 23, type: !850, isLocal: false, isDefinition: true, align: 16)
!821 = distinct !DICompileUnit(language: DW_LANG_C99, file: !822, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !823, splitDebugInlining: false, nameTableKind: None)
!822 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!823 = !{!824, !819, !830, !832, !834, !836, !838, !840, !842, !844, !846, !848}
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !821, file: !826, line: 18, type: !827, isLocal: false, isDefinition: true, align: 16)
!826 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 208, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 13)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !821, file: !826, line: 30, type: !735, isLocal: false, isDefinition: true, align: 16)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !821, file: !826, line: 37, type: !735, isLocal: false, isDefinition: true, align: 16)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !821, file: !826, line: 44, type: !735, isLocal: false, isDefinition: true, align: 16)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !821, file: !826, line: 51, type: !735, isLocal: false, isDefinition: true, align: 16)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !821, file: !826, line: 58, type: !735, isLocal: false, isDefinition: true, align: 16)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !821, file: !826, line: 65, type: !735, isLocal: false, isDefinition: true, align: 16)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !821, file: !826, line: 72, type: !735, isLocal: false, isDefinition: true, align: 16)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !821, file: !826, line: 79, type: !735, isLocal: false, isDefinition: true, align: 16)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !821, file: !826, line: 86, type: !735, isLocal: false, isDefinition: true, align: 16)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !821, file: !826, line: 93, type: !735, isLocal: false, isDefinition: true, align: 16)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 48, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 3)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !855, file: !916, line: 398, type: !949, isLocal: true, isDefinition: true)
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !857, retainedTypes: !870, globals: !913, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!857 = !{!858, !53, !863}
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !859, line: 197, baseType: !32, size: 32, elements: !860)
!859 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!860 = !{!861, !862}
!861 = !DIEnumerator(name: "SUCCESS", value: 0)
!862 = !DIEnumerator(name: "ERROR", value: 1)
!863 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !864, line: 44, baseType: !32, size: 32, elements: !865)
!864 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!865 = !{!866, !867, !868, !869}
!866 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!867 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!868 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!869 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!870 = !{!124, !125, !135, !871, !906, !912}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !221, line: 532, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 500, size: 1088, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !873, file: !221, line: 502, baseType: !225, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !873, file: !221, line: 503, baseType: !225, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !873, file: !221, line: 504, baseType: !225, size: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !873, file: !221, line: 505, baseType: !225, size: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !873, file: !221, line: 506, baseType: !225, size: 32, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !873, file: !221, line: 507, baseType: !225, size: 32, offset: 160)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !873, file: !221, line: 508, baseType: !225, size: 32, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !873, file: !221, line: 509, baseType: !135, size: 32, offset: 224)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !873, file: !221, line: 510, baseType: !225, size: 32, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !873, file: !221, line: 511, baseType: !225, size: 32, offset: 288)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !873, file: !221, line: 512, baseType: !886, size: 64, offset: 320)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !340)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !873, file: !221, line: 513, baseType: !225, size: 32, offset: 384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !873, file: !221, line: 514, baseType: !225, size: 32, offset: 416)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !873, file: !221, line: 515, baseType: !225, size: 32, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !873, file: !221, line: 516, baseType: !135, size: 32, offset: 480)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !873, file: !221, line: 517, baseType: !225, size: 32, offset: 512)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !873, file: !221, line: 518, baseType: !225, size: 32, offset: 544)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !873, file: !221, line: 519, baseType: !886, size: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !873, file: !221, line: 520, baseType: !225, size: 32, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !873, file: !221, line: 521, baseType: !225, size: 32, offset: 672)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !873, file: !221, line: 522, baseType: !225, size: 32, offset: 704)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !873, file: !221, line: 523, baseType: !135, size: 32, offset: 736)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !873, file: !221, line: 524, baseType: !225, size: 32, offset: 768)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !873, file: !221, line: 525, baseType: !225, size: 32, offset: 800)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !873, file: !221, line: 526, baseType: !886, size: 64, offset: 832)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !873, file: !221, line: 527, baseType: !225, size: 32, offset: 896)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !873, file: !221, line: 528, baseType: !225, size: 32, offset: 928)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !873, file: !221, line: 529, baseType: !886, size: 64, offset: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !873, file: !221, line: 530, baseType: !225, size: 32, offset: 1024)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !873, file: !221, line: 531, baseType: !225, size: 32, offset: 1056)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !908, line: 343, size: 64, elements: !909)
!908 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !907, file: !908, line: 344, baseType: !135, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !907, file: !908, line: 345, baseType: !135, size: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!913 = !{!914, !920, !936, !947, !853}
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !855, file: !916, line: 752, type: !917, isLocal: false, isDefinition: true, align: 16)
!916 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 928, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 58)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !855, file: !916, line: 752, type: !922, isLocal: false, isDefinition: true, align: 32)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !245, line: 378, size: 192, elements: !924)
!924 = !{!925, !926, !927, !928, !934, !935}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !923, file: !245, line: 380, baseType: !248, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !923, file: !245, line: 382, baseType: !13, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !923, file: !245, line: 384, baseType: !13, size: 32, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !923, file: !245, line: 386, baseType: !929, size: 32, offset: 96)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !245, line: 351, size: 16, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !930, file: !245, line: 359, baseType: !182, size: 8)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !930, file: !245, line: 364, baseType: !258, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !923, file: !245, line: 388, baseType: !124, size: 32, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !923, file: !245, line: 396, baseType: !261, size: 32, offset: 160)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !855, file: !916, line: 752, type: !938, isLocal: true, isDefinition: true, align: 32)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !236, line: 51, size: 64, elements: !940)
!940 = !{!941, !946}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !939, file: !236, line: 60, baseType: !942, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = !DISubroutineType(types: !944)
!944 = !{!125, !945}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !939, file: !236, line: 65, baseType: !945, size: 32, offset: 32)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !855, file: !916, line: 752, type: !930, isLocal: true, isDefinition: true, align: 8)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !864, line: 100, size: 224, elements: !950)
!950 = !{!951, !957, !958, !967, !972, !977, !983}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !949, file: !864, line: 101, baseType: !952, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !864, line: 76, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DISubroutineType(types: !955)
!955 = !{!125, !945, !956}
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !864, line: 56, baseType: !124)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !949, file: !864, line: 102, baseType: !952, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !949, file: !864, line: 103, baseType: !959, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !864, line: 83, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DISubroutineType(types: !962)
!962 = !{!125, !945, !956, !963, !124}
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !864, line: 72, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !945, !956, !124}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !949, file: !864, line: 104, baseType: !968, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !864, line: 79, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{!125, !945, !956, !912}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !949, file: !864, line: 105, baseType: !973, size: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !864, line: 88, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!975 = !DISubroutineType(types: !976)
!976 = !{!863, !945, !956}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !949, file: !864, line: 106, baseType: !978, size: 32, offset: 160)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !864, line: 92, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DISubroutineType(types: !981)
!981 = !{!125, !945, !956, !982}
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !864, line: 64, baseType: !124)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !949, file: !864, line: 107, baseType: !984, size: 32, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !864, line: 96, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DISubroutineType(types: !987)
!987 = !{!125, !945, !956, !124}
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !990, file: !1047, line: 603, type: !1049, isLocal: true, isDefinition: true, align: 32)
!990 = distinct !DICompileUnit(language: DW_LANG_C99, file: !991, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !992, globals: !1044, splitDebugInlining: false, nameTableKind: None)
!991 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!992 = !{!124, !125, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !996, line: 336, size: 160, elements: !997)
!996 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!997 = !{!998, !1018, !1022, !1026, !1039}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !995, file: !996, line: 365, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!125, !1002, !1017}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !245, line: 378, size: 192, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1015, !1016}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1004, file: !245, line: 380, baseType: !248, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1004, file: !245, line: 382, baseType: !13, size: 32, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1004, file: !245, line: 384, baseType: !13, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1004, file: !245, line: 386, baseType: !1010, size: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !245, line: 351, size: 16, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1011, file: !245, line: 359, baseType: !182, size: 8)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1011, file: !245, line: 364, baseType: !258, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1004, file: !245, line: 388, baseType: !124, size: 32, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1004, file: !245, line: 396, baseType: !261, size: 32, offset: 160)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !995, file: !996, line: 366, baseType: !1019, size: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{null, !1002, !183}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !995, file: !996, line: 374, baseType: !1023, size: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!125, !1002}
