; ModuleID = 'build/96b_argonkey/device_pm/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16*, %struct.pm_device* }
%struct.device_state = type { i8, i8 }
%struct.pm_device = type { %struct.device*, %struct.k_mutex, i32, %struct.k_work_delayable, %struct.k_condvar, %struct.device*, i32, i32, i32 (%struct.device*, i32)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 109, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 6208, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 97)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 3104, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "parent", scope: !27, file: !344, line: 13, type: !126, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !114, globals: !341, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/device_pm/src/dummy_driver.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!29 = !{!30, !38, !44}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_state", file: !31, line: 53, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/pm/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PM_DEVICE_STATE_ACTIVE", value: 0)
!35 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDED", value: 1)
!36 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDING", value: 2)
!37 = !DIEnumerator(name: "PM_DEVICE_STATE_OFF", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_action", file: !31, line: 75, baseType: !32, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PM_DEVICE_ACTION_SUSPEND", value: 0)
!41 = !DIEnumerator(name: "PM_DEVICE_ACTION_RESUME", value: 1)
!42 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_OFF", value: 2)
!43 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_ON", value: 3)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !45, line: 27, baseType: !32, size: 32, elements: !46)
!45 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!47 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!48 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!49 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!50 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!51 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!52 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!53 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!54 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!55 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!56 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!57 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!58 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!59 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!60 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!61 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!62 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!63 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!113 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!116 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_parent_api", file: !119, line: 17, size: 32, elements: !120)
!119 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_parent.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !118, file: !119, line: 18, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_transfer_t", file: !119, line: 14, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DISubroutineType(types: !125)
!125 = !{!116, !126, !223, !340}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !130)
!129 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !{!131, !135, !136, !137, !146, !147, !153}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 380, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !128, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !128, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !128, file: !129, line: 386, baseType: !138, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !140)
!140 = !{!141, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !139, file: !129, line: 359, baseType: !142, size: 8)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !143)
!143 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !139, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !128, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !129, line: 43, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !152)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !128, file: !129, line: 403, baseType: !154, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 832, elements: !156)
!156 = !{!157, !158, !287, !288, !325, !329, !330, !334, !335}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !155, file: !31, line: 124, baseType: !126, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !155, file: !31, line: 126, baseType: !159, size: 160, offset: 32)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !160, line: 2720, size: 160, elements: !161)
!160 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = !{!162, !183, !285, !286}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !159, file: !160, line: 2722, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !165)
!164 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !165, file: !164, line: 232, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !170)
!169 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !171)
!171 = !{!172, !178}
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 38, baseType: !173, size: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 38, size: 32, elements: !174)
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !173, file: !169, line: 39, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !169, line: 40, baseType: !176, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 42, baseType: !179, size: 32, offset: 32)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 42, size: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !179, file: !169, line: 43, baseType: !176, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !169, line: 44, baseType: !176, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !159, file: !160, line: 2724, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 1024, elements: !187)
!186 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !{!188, !238, !251, !252, !253, !254, !262, !280}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !185, file: !186, line: 247, baseType: !189, size: 384)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !190)
!190 = !{!191, !205, !207, !208, !209, !222, !224, !225}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !186, line: 60, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !186, line: 60, size: 64, elements: !193)
!193 = !{!194, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !192, file: !186, line: 61, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !170)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !192, file: !186, line: 62, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !197, file: !198, line: 50, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 64, elements: !203)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!203 = !{!204}
!204 = !DISubrange(count: 2)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !189, file: !186, line: 68, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !189, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !189, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!209 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !186, line: 90, baseType: !210, size: 16, offset: 112)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !186, line: 90, size: 16, elements: !211)
!211 = !{!212, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, scope: !210, file: !186, line: 91, baseType: !213, size: 16)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !186, line: 91, size: 16, elements: !214)
!214 = !{!215, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !213, file: !186, line: 96, baseType: !216, size: 8)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !217)
!217 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !213, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !210, file: !186, line: 100, baseType: !220, size: 16)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !221)
!221 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !189, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !189, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !189, file: !186, line: 131, baseType: !226, size: 192, offset: 192)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !227)
!227 = !{!228, !229, !235}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !226, file: !164, line: 245, baseType: !195, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !226, file: !164, line: 246, baseType: !230, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !226, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !237)
!237 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !185, file: !186, line: 250, baseType: !239, size: 288, offset: 384)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !239, file: !240, line: 26, baseType: !223, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !239, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !239, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !239, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !239, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !239, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !239, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !239, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !239, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !185, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !185, file: !186, line: 256, baseType: !163, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !185, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !185, file: !186, line: 300, baseType: !255, size: 96, offset: 800)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !186, line: 149, size: 96, elements: !256)
!256 = !{!257, !258, !261}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !255, file: !186, line: 153, baseType: !22, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !255, file: !186, line: 162, baseType: !259, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !260, line: 214, baseType: !32)
!260 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !255, file: !186, line: 168, baseType: !259, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !185, file: !186, line: 325, baseType: !263, size: 32, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !160, line: 5073, size: 160, elements: !265)
!265 = !{!266, !275, !276}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !264, file: !160, line: 5074, baseType: !267, size: 96)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !269)
!268 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !{!270, !273, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !267, file: !268, line: 57, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !268, line: 57, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !267, file: !268, line: 58, baseType: !115, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !267, file: !268, line: 59, baseType: !259, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !264, file: !160, line: 5075, baseType: !163, size: 64, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !264, file: !160, line: 5076, baseType: !277, offset: 160)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!278 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !{}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !185, file: !186, line: 343, baseType: !281, size: 64, offset: 928)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !240, line: 60, size: 64, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !281, file: !240, line: 63, baseType: !223, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !281, file: !240, line: 66, baseType: !223, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !159, file: !160, line: 2727, baseType: !223, size: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !159, file: !160, line: 2730, baseType: !116, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !155, file: !31, line: 128, baseType: !223, size: 32, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !155, file: !31, line: 130, baseType: !289, size: 384, offset: 256)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !160, line: 3691, size: 384, elements: !290)
!290 = !{!291, !323, !324}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !289, file: !160, line: 3693, baseType: !292, size: 128)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !160, line: 3663, size: 128, elements: !293)
!293 = !{!294, !301, !307, !322}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !292, file: !160, line: 3669, baseType: !295, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !297)
!296 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !298)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !296, line: 30, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !292, file: !160, line: 3672, baseType: !302, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !160, line: 3071, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !292, file: !160, line: 3675, baseType: !308, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !160, line: 3810, size: 1280, elements: !310)
!310 = !{!311, !312, !319, !320, !321}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !309, file: !160, line: 3812, baseType: !185, size: 1024)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !309, file: !160, line: 3819, baseType: !313, size: 64, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !315)
!315 = !{!316, !318}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !314, file: !296, line: 36, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !314, file: !296, line: 37, baseType: !317, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !309, file: !160, line: 3822, baseType: !163, size: 64, offset: 1088)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !309, file: !160, line: 3825, baseType: !163, size: 64, offset: 1152)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !309, file: !160, line: 3828, baseType: !223, size: 32, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !292, file: !160, line: 3683, baseType: !223, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !289, file: !160, line: 3696, baseType: !226, size: 192, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !289, file: !160, line: 3699, baseType: !308, size: 32, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !155, file: !31, line: 132, baseType: !326, size: 64, offset: 640)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !160, line: 2828, size: 64, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !326, file: !160, line: 2829, baseType: !163, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !155, file: !31, line: 136, baseType: !126, size: 32, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !155, file: !31, line: 139, baseType: !331, size: 32, offset: 736)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !332, line: 22, baseType: !333)
!332 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !155, file: !31, line: 141, baseType: !30, size: 32, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !155, file: !31, line: 143, baseType: !336, size: 32, offset: 800)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DISubroutineType(types: !339)
!339 = !{!116, !126, !38}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!341 = !{!342, !348, !350, !25, !361, !363, !365, !385}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_driver", scope: !27, file: !344, line: 117, type: !345, isLocal: false, isDefinition: true, align: 16)
!344 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_driver.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 48, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 3)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "__device_dummy_driver", scope: !27, file: !344, line: 117, type: !127, isLocal: true, isDefinition: true, align: 32)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "__init___device_dummy_driver", scope: !27, file: !344, line: 117, type: !352, isLocal: true, isDefinition: true, align: 32)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{!356, !360}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !353, file: !354, line: 60, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DISubroutineType(types: !359)
!359 = !{!116, !126}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !353, file: !354, line: 65, baseType: !126, size: 32, offset: 32)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "__pm_slot_dummy_driver", scope: !27, file: !344, line: 115, type: !126, isLocal: true, isDefinition: true, align: 32)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "__devstate_dummy_driver", scope: !27, file: !344, line: 117, type: !139, isLocal: true, isDefinition: true, align: 8)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "funcs", scope: !27, file: !344, line: 98, type: !367, isLocal: true, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_driver_api", file: !369, line: 19, size: 128, elements: !370)
!369 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_driver.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = !{!371, !373, !378, !383}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !368, file: !369, line: 20, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_open_t", file: !369, line: 11, baseType: !357)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !368, file: !369, line: 21, baseType: !374, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_read_t", file: !369, line: 13, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DISubroutineType(types: !377)
!377 = !{!116, !126, !340}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !368, file: !369, line: 22, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_write_t", file: !369, line: 15, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DISubroutineType(types: !382)
!382 = !{!116, !126, !223}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !368, file: !369, line: 23, baseType: !384, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_close_t", file: !369, line: 17, baseType: !357)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "__pm_device_dummy_driver", scope: !27, file: !344, line: 115, type: !155, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_driver", scope: !389, file: !394, line: 95, type: !345, isLocal: false, isDefinition: true, align: 16)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!391 = !{!392, !398, !400, !405, !407, !409, !411, !413, !415, !417, !419, !421, !387}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !389, file: !394, line: 17, type: !395, isLocal: false, isDefinition: true, align: 16)
!394 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 192, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 12)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !389, file: !394, line: 22, type: !345, isLocal: false, isDefinition: true, align: 16)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_79", scope: !389, file: !394, line: 29, type: !402, isLocal: false, isDefinition: true, align: 16)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 4)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_78", scope: !389, file: !394, line: 36, type: !402, isLocal: false, isDefinition: true, align: 16)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_77", scope: !389, file: !394, line: 43, type: !402, isLocal: false, isDefinition: true, align: 16)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !389, file: !394, line: 50, type: !402, isLocal: false, isDefinition: true, align: 16)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !389, file: !394, line: 57, type: !402, isLocal: false, isDefinition: true, align: 16)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_22", scope: !389, file: !394, line: 64, type: !402, isLocal: false, isDefinition: true, align: 16)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !389, file: !394, line: 71, type: !402, isLocal: false, isDefinition: true, align: 16)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !389, file: !394, line: 78, type: !402, isLocal: false, isDefinition: true, align: 16)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_44", scope: !389, file: !394, line: 85, type: !402, isLocal: false, isDefinition: true, align: 16)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_parent", scope: !389, file: !394, line: 90, type: !345, isLocal: false, isDefinition: true, align: 16)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "funcs", scope: !425, file: !431, line: 43, type: !628, isLocal: true, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !427, globals: !428, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/device_pm/src/dummy_parent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!427 = !{!115, !116}
!428 = !{!429, !432, !610, !620, !622, !423, !624, !626}
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_parent", scope: !425, file: !431, line: 54, type: !345, isLocal: false, isDefinition: true, align: 16)
!431 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_parent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "__device_dummy_parent", scope: !425, file: !431, line: 54, type: !434, isLocal: true, isDefinition: true, align: 32)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !436)
!436 = !{!437, !438, !439, !440, !446, !447, !448}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !435, file: !129, line: 380, baseType: !132, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !435, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !435, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !435, file: !129, line: 386, baseType: !441, size: 32, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !442, file: !129, line: 359, baseType: !142, size: 8)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !442, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !435, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !435, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !435, file: !129, line: 403, baseType: !449, size: 32, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 832, elements: !451)
!451 = !{!452, !454, !561, !562, !598, !602, !603, !604, !605}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !450, file: !31, line: 124, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !450, file: !31, line: 126, baseType: !455, size: 160, offset: 32)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !160, line: 2720, size: 160, elements: !456)
!456 = !{!457, !476, !559, !560}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !455, file: !160, line: 2722, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !459, file: !164, line: 232, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !464)
!464 = !{!465, !471}
!465 = !DIDerivedType(tag: DW_TAG_member, scope: !463, file: !169, line: 38, baseType: !466, size: 32)
!466 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !463, file: !169, line: 38, size: 32, elements: !467)
!467 = !{!468, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !466, file: !169, line: 39, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !466, file: !169, line: 40, baseType: !469, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, scope: !463, file: !169, line: 42, baseType: !472, size: 32, offset: 32)
!472 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !463, file: !169, line: 42, size: 32, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !472, file: !169, line: 43, baseType: !469, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !472, file: !169, line: 44, baseType: !469, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !455, file: !160, line: 2724, baseType: !477, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 1024, elements: !479)
!479 = !{!480, !520, !532, !533, !534, !535, !541, !554}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !478, file: !186, line: 247, baseType: !481, size: 384)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !482)
!482 = !{!483, !494, !496, !497, !498, !507, !508, !509}
!483 = !DIDerivedType(tag: DW_TAG_member, scope: !481, file: !186, line: 60, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !481, file: !186, line: 60, size: 64, elements: !485)
!485 = !{!486, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !484, file: !186, line: 61, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !463)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !484, file: !186, line: 62, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !490)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !489, file: !198, line: 50, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 64, elements: !203)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !481, file: !186, line: 68, baseType: !495, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !481, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !481, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!498 = !DIDerivedType(tag: DW_TAG_member, scope: !481, file: !186, line: 90, baseType: !499, size: 16, offset: 112)
!499 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !481, file: !186, line: 90, size: 16, elements: !500)
!500 = !{!501, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, scope: !499, file: !186, line: 91, baseType: !502, size: 16)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !499, file: !186, line: 91, size: 16, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !502, file: !186, line: 96, baseType: !216, size: 8)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !502, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !499, file: !186, line: 100, baseType: !220, size: 16)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !481, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !481, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !481, file: !186, line: 131, baseType: !510, size: 192, offset: 192)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !511)
!511 = !{!512, !513, !519}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !510, file: !164, line: 245, baseType: !487, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !510, file: !164, line: 246, baseType: !514, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !510, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !478, file: !186, line: 250, baseType: !521, size: 288, offset: 384)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !521, file: !240, line: 26, baseType: !223, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !521, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !521, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !521, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !521, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !521, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !521, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !521, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !521, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !478, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !478, file: !186, line: 256, baseType: !458, size: 64, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !478, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !478, file: !186, line: 300, baseType: !536, size: 96, offset: 800)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !186, line: 149, size: 96, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !536, file: !186, line: 153, baseType: !22, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !536, file: !186, line: 162, baseType: !259, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !536, file: !186, line: 168, baseType: !259, size: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !478, file: !186, line: 325, baseType: !542, size: 32, offset: 896)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !160, line: 5073, size: 160, elements: !544)
!544 = !{!545, !551, !552}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !543, file: !160, line: 5074, baseType: !546, size: 96)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !547)
!547 = !{!548, !549, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !546, file: !268, line: 57, baseType: !271, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !546, file: !268, line: 58, baseType: !115, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !546, file: !268, line: 59, baseType: !259, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !543, file: !160, line: 5075, baseType: !458, size: 64, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !543, file: !160, line: 5076, baseType: !553, offset: 160)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !478, file: !186, line: 343, baseType: !555, size: 64, offset: 928)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !240, line: 60, size: 64, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !555, file: !240, line: 63, baseType: !223, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !555, file: !240, line: 66, baseType: !223, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !455, file: !160, line: 2727, baseType: !223, size: 32, offset: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !455, file: !160, line: 2730, baseType: !116, size: 32, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !450, file: !31, line: 128, baseType: !223, size: 32, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !450, file: !31, line: 130, baseType: !563, size: 384, offset: 256)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !160, line: 3691, size: 384, elements: !564)
!564 = !{!565, !596, !597}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !563, file: !160, line: 3693, baseType: !566, size: 128)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !160, line: 3663, size: 128, elements: !567)
!567 = !{!568, !574, !580, !595}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !566, file: !160, line: 3669, baseType: !569, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !571)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !570, file: !296, line: 30, baseType: !573, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !566, file: !160, line: 3672, baseType: !575, size: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !160, line: 3071, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !566, file: !160, line: 3675, baseType: !581, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !160, line: 3810, size: 1280, elements: !583)
!583 = !{!584, !585, !592, !593, !594}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !582, file: !160, line: 3812, baseType: !478, size: 1024)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !582, file: !160, line: 3819, baseType: !586, size: 64, offset: 1024)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !588)
!588 = !{!589, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !587, file: !296, line: 36, baseType: !590, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !587, file: !296, line: 37, baseType: !590, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !582, file: !160, line: 3822, baseType: !458, size: 64, offset: 1088)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !582, file: !160, line: 3825, baseType: !458, size: 64, offset: 1152)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !582, file: !160, line: 3828, baseType: !223, size: 32, offset: 1216)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !566, file: !160, line: 3683, baseType: !223, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !563, file: !160, line: 3696, baseType: !510, size: 192, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !563, file: !160, line: 3699, baseType: !581, size: 32, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !450, file: !31, line: 132, baseType: !599, size: 64, offset: 640)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !160, line: 2828, size: 64, elements: !600)
!600 = !{!601}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !599, file: !160, line: 2829, baseType: !458, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !450, file: !31, line: 136, baseType: !453, size: 32, offset: 704)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !450, file: !31, line: 139, baseType: !331, size: 32, offset: 736)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !450, file: !31, line: 141, baseType: !30, size: 32, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !450, file: !31, line: 143, baseType: !606, size: 32, offset: 800)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DISubroutineType(types: !609)
!609 = !{!116, !453, !38}
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "__init___device_dummy_parent", scope: !425, file: !431, line: 54, type: !612, isLocal: true, isDefinition: true, align: 32)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !614)
!614 = !{!615, !619}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !613, file: !354, line: 60, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DISubroutineType(types: !618)
!618 = !{!116, !453}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !613, file: !354, line: 65, baseType: !453, size: 32, offset: 32)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "__pm_slot_dummy_parent", scope: !425, file: !431, line: 52, type: !453, isLocal: true, isDefinition: true, align: 32)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "__devstate_dummy_parent", scope: !425, file: !431, line: 54, type: !442, isLocal: true, isDefinition: true, align: 8)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "store_value", scope: !425, file: !431, line: 12, type: !223, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "__pm_device_dummy_parent", scope: !425, file: !431, line: 52, type: !450, isLocal: true, isDefinition: true)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_parent_api", file: !119, line: 17, size: 32, elements: !630)
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !629, file: !119, line: 18, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_transfer_t", file: !119, line: 14, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DISubroutineType(types: !635)
!635 = !{!116, !453, !223, !340}
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "_char_out", scope: !638, file: !642, line: 54, type: !643, isLocal: false, isDefinition: true)
!638 = distinct !DICompileUnit(language: DW_LANG_C99, file: !639, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !640, retainedTypes: !427, globals: !641, splitDebugInlining: false, nameTableKind: None)
!639 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!640 = !{!44}
!641 = !{!636}
!642 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DISubroutineType(types: !645)
!645 = !{!116, !116}
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !648, file: !665, line: 56, type: !666, isLocal: true, isDefinition: true, align: 32)
!648 = distinct !DICompileUnit(language: DW_LANG_C99, file: !649, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !650, globals: !664, splitDebugInlining: false, nameTableKind: None)
!649 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!650 = !{!651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !653, line: 379, baseType: !654)
!653 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f412cx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !653, line: 370, size: 224, elements: !655)
!655 = !{!656, !658, !659, !660, !661, !662, !663}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !654, file: !653, line: 372, baseType: !657, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !223)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !654, file: !653, line: 373, baseType: !657, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !654, file: !653, line: 374, baseType: !657, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !654, file: !653, line: 375, baseType: !657, size: 32, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !654, file: !653, line: 376, baseType: !657, size: 32, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !654, file: !653, line: 377, baseType: !657, size: 32, offset: 160)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !654, file: !653, line: 378, baseType: !657, size: 32, offset: 192)
!664 = !{!646}
!665 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !668)
!668 = !{!669, !691}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !667, file: !354, line: 60, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DISubroutineType(types: !672)
!672 = !{!116, !673}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !676)
!676 = !{!677, !678, !679, !680, !686, !687, !688}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !129, line: 380, baseType: !132, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !675, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !675, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !675, file: !129, line: 386, baseType: !681, size: 32, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !682, file: !129, line: 359, baseType: !142, size: 8)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !682, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !675, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !675, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !675, file: !129, line: 403, baseType: !689, size: 32, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !129, line: 367, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !667, file: !354, line: 65, baseType: !673, size: 32, offset: 32)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !694, file: !697, line: 71, type: !698, isLocal: true, isDefinition: true, align: 32)
!694 = distinct !DICompileUnit(language: DW_LANG_C99, file: !695, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !696, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!696 = !{!692}
!697 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !700)
!700 = !{!701, !721}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !699, file: !354, line: 60, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DISubroutineType(types: !704)
!704 = !{!116, !705}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !708)
!708 = !{!709, !710, !711, !712, !718, !719, !720}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !707, file: !129, line: 380, baseType: !132, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !707, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !707, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !707, file: !129, line: 386, baseType: !713, size: 32, offset: 96)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !714, file: !129, line: 359, baseType: !142, size: 8)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !714, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !707, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !707, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !707, file: !129, line: 403, baseType: !689, size: 32, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !699, file: !354, line: 65, baseType: !705, size: 32, offset: 32)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !724, file: !762, line: 27, type: !787, isLocal: true, isDefinition: true)
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !726, retainedTypes: !738, globals: !759, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!726 = !{!727, !30, !38, !44}
!727 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !728, line: 27, baseType: !32, size: 32, elements: !729)
!728 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737}
!730 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!731 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!732 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!733 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!734 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!735 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!736 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!737 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!738 = !{!115, !739, !116, !24, !741, !756, !223, !757}
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !740, line: 46, baseType: !236)
!740 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !743, line: 54, size: 96, elements: !744)
!743 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!744 = !{!745, !751, !755}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !742, file: !743, line: 55, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !747, file: !296, line: 30, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !742, file: !743, line: 60, baseType: !752, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !727}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !742, file: !743, line: 65, baseType: !752, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !758)
!758 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!759 = !{!722, !760, !764, !766, !777, !779}
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !724, file: !762, line: 44, type: !763, isLocal: true, isDefinition: true)
!762 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !724, file: !762, line: 49, type: !763, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !724, file: !762, line: 36, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 128, elements: !775)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !728, line: 114, size: 128, elements: !770)
!770 = !{!771, !772, !773, !774}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !769, file: !728, line: 115, baseType: !727, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !769, file: !728, line: 141, baseType: !142, size: 8, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !769, file: !728, line: 149, baseType: !223, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !769, file: !728, line: 156, baseType: !223, size: 32, offset: 96)
!775 = !{!776}
!776 = !DISubrange(count: 1)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !724, file: !762, line: 40, type: !768, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !724, file: !762, line: 28, type: !781, isLocal: true, isDefinition: true)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !783)
!783 = !{!784, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !782, file: !296, line: 36, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !782, file: !296, line: 37, baseType: !785, size: 32, offset: 32)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 32, elements: !775)
!788 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!789 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !792, file: !820, line: 50, type: !807, isLocal: true, isDefinition: true)
!792 = distinct !DICompileUnit(language: DW_LANG_C99, file: !793, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !794, retainedTypes: !795, globals: !817, splitDebugInlining: false, nameTableKind: None)
!793 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!794 = !{!727, !44}
!795 = !{!151, !739, !259, !116, !115, !223, !757, !796, !756, !807, !808}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !798, line: 45, size: 64, elements: !799)
!798 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!799 = !{!800, !806}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !797, file: !798, line: 46, baseType: !801, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !803)
!803 = !{!804}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !802, file: !296, line: 30, baseType: !805, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !797, file: !798, line: 48, baseType: !223, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !116)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !798, line: 38, size: 64, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !809, file: !798, line: 39, baseType: !801, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !809, file: !798, line: 41, baseType: !813, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !798, line: 35, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !807}
!817 = !{!818, !822, !830, !790, !832, !842}
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "latency_lock", scope: !792, file: !820, line: 44, type: !821, isLocal: true, isDefinition: true)
!820 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !792, file: !820, line: 46, type: !824, isLocal: true, isDefinition: true)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !826)
!826 = !{!827, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !825, file: !296, line: 36, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !825, file: !296, line: 37, baseType: !828, size: 32, offset: 32)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "latency_subs", scope: !792, file: !820, line: 52, type: !824, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !792, file: !820, line: 39, type: !834, isLocal: true, isDefinition: true)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, elements: !840)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !820, line: 35, size: 96, elements: !836)
!836 = !{!837, !838, !839}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !835, file: !820, line: 36, baseType: !727, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !835, file: !820, line: 37, baseType: !142, size: 8, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !835, file: !820, line: 38, baseType: !331, size: 32, offset: 64)
!840 = !{!841}
!841 = !DISubrange(count: 0)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !792, file: !820, line: 48, type: !807, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !846, file: !853, line: 47, type: !867, isLocal: true, isDefinition: true)
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !848, retainedTypes: !849, globals: !850, splitDebugInlining: false, nameTableKind: None)
!847 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!848 = !{!727}
!849 = !{!259, !116}
!850 = !{!851, !844, !863}
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "cpus_states", scope: !846, file: !853, line: 50, type: !854, isLocal: true, isDefinition: true)
!853 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 32, elements: !775)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !728, line: 114, size: 128, elements: !858)
!858 = !{!859, !860, !861, !862}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !857, file: !728, line: 115, baseType: !727, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !857, file: !728, line: 141, baseType: !142, size: 8, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !857, file: !728, line: 149, baseType: !223, size: 32, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !857, file: !728, line: 156, baseType: !223, size: 32, offset: 96)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !846, file: !853, line: 55, type: !865, isLocal: true, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 8, elements: !775)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, elements: !840)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "__init_pm_stats_init", scope: !870, file: !875, line: 53, type: !904, isLocal: true, isDefinition: true, align: 32)
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !794, retainedTypes: !427, globals: !872, splitDebugInlining: false, nameTableKind: None)
!871 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm_stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!872 = !{!868, !873, !894, !897, !899}
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "stats", scope: !870, file: !875, line: 27, type: !876, isLocal: true, isDefinition: true)
!875 = !DIFile(filename: "zephyr/subsys/pm/pm_stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, size: 1568, elements: !892)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats_pm_stats", file: !875, line: 15, size: 224, elements: !878)
!878 = !{!879, !889, !890, !891}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "s_hdr", scope: !877, file: !875, line: 15, baseType: !880, size: 128)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats_hdr", file: !881, line: 66, size: 128, elements: !882)
!881 = !DIFile(filename: "zephyr/include/zephyr/stats/stats.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!882 = !{!883, !884, !885, !886, !887}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "s_name", scope: !880, file: !881, line: 67, baseType: !132, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "s_size", scope: !880, file: !881, line: 68, baseType: !142, size: 8, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "s_cnt", scope: !880, file: !881, line: 69, baseType: !220, size: 16, offset: 48)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "s_pad1", scope: !880, file: !881, line: 70, baseType: !142, size: 8, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !880, file: !881, line: 75, baseType: !888, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "state_count", scope: !877, file: !875, line: 16, baseType: !223, size: 32, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "state_last_cycles", scope: !877, file: !875, line: 17, baseType: !223, size: 32, offset: 160)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "state_total_cycles", scope: !877, file: !875, line: 18, baseType: !223, size: 32, offset: 192)
!892 = !{!776, !893}
!893 = !DISubrange(count: 7)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "time_start", scope: !870, file: !875, line: 31, type: !896, isLocal: true, isDefinition: true)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 32, elements: !775)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "time_stop", scope: !870, file: !875, line: 32, type: !896, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "names", scope: !870, file: !875, line: 30, type: !901, isLocal: true, isDefinition: true)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 1400, elements: !902)
!902 = !{!776, !893, !903}
!903 = !DISubrange(count: 25)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !906)
!906 = !{!907, !914}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !905, file: !354, line: 60, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DISubroutineType(types: !910)
!910 = !{!116, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !354, line: 48, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !905, file: !354, line: 65, baseType: !911, size: 32, offset: 32)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "action_target_state", scope: !917, file: !933, line: 14, type: !934, isLocal: true, isDefinition: true)
!917 = distinct !DICompileUnit(language: DW_LANG_C99, file: !918, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !919, retainedTypes: !929, globals: !930, splitDebugInlining: false, nameTableKind: None)
!918 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!919 = !{!30, !38, !920, !44}
!920 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_flag", file: !31, line: 30, baseType: !32, size: 32, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !928}
!922 = !DIEnumerator(name: "PM_DEVICE_FLAG_BUSY", value: 0)
!923 = !DIEnumerator(name: "PM_DEVICE_FLAG_TURN_ON_FAILED", value: 1)
!924 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_CAPABLE", value: 2)
!925 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_ENABLED", value: 3)
!926 = !DIEnumerator(name: "PM_DEVICE_FLAG_RUNTIME_ENABLED", value: 4)
!927 = !DIEnumerator(name: "PM_DEVICE_FLAG_STATE_LOCKED", value: 5)
!928 = !DIEnumerator(name: "PM_DEVICE_FLAG_PD", value: 6)
!929 = !{!115, !116, !24, !259}
!930 = !{!915, !931}
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "action_expected_state", scope: !917, file: !933, line: 20, type: !934, isLocal: true, isDefinition: true)
!933 = !DIFile(filename: "zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 128, elements: !403)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "stats_list", scope: !938, file: !943, line: 16, type: !944, isLocal: true, isDefinition: true)
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !939, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !940, globals: !942, splitDebugInlining: false, nameTableKind: None)
!939 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/stats/stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!940 = !{!115, !941, !220, !116}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!942 = !{!936}
!943 = !DIFile(filename: "zephyr/subsys/stats/stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats_hdr", file: !881, line: 66, size: 128, elements: !946)
!946 = !{!947, !948, !949, !950, !951}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "s_name", scope: !945, file: !881, line: 67, baseType: !132, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "s_size", scope: !945, file: !881, line: 68, baseType: !142, size: 8, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "s_cnt", scope: !945, file: !881, line: 69, baseType: !220, size: 16, offset: 48)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "s_pad1", scope: !945, file: !881, line: 70, baseType: !142, size: 8, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !945, file: !881, line: 75, baseType: !944, size: 32, offset: 96)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "static_regions", scope: !954, file: !961, line: 62, type: !1081, isLocal: true, isDefinition: true)
!954 = distinct !DICompileUnit(language: DW_LANG_C99, file: !955, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !640, retainedTypes: !956, globals: !957, splitDebugInlining: false, nameTableKind: None)
!955 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/device_pm")
!956 = !{!259, !116, !223, !115}
!957 = !{!958, !952}
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !960, file: !961, line: 198, type: !1069, isLocal: true, isDefinition: true)
!960 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !961, file: !961, line: 175, type: !962, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !954, retainedNodes: !1064)
!961 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!962 = !DISubroutineType(types: !963)
!963 = !{null, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 1024, elements: !966)
!966 = !{!967, !1025, !1037, !1038, !1039, !1040, !1046, !1059}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !965, file: !186, line: 247, baseType: !968, size: 384)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !969)
!969 = !{!970, !994, !1001, !1002, !1003, !1012, !1013, !1014}
!970 = !DIDerivedType(tag: DW_TAG_member, scope: !968, file: !186, line: 60, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !968, file: !186, line: 60, size: 64, elements: !972)
!972 = !{!973, !988}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !971, file: !186, line: 61, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !976)
!976 = !{!977, !983}
!977 = !DIDerivedType(tag: DW_TAG_member, scope: !975, file: !169, line: 38, baseType: !978, size: 32)
!978 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !975, file: !169, line: 38, size: 32, elements: !979)
!979 = !{!980, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !978, file: !169, line: 39, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !978, file: !169, line: 40, baseType: !981, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, scope: !975, file: !169, line: 42, baseType: !984, size: 32, offset: 32)
!984 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !975, file: !169, line: 42, size: 32, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !984, file: !169, line: 43, baseType: !981, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !984, file: !169, line: 44, baseType: !981, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !971, file: !186, line: 62, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !990)
!990 = !{!991}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !989, file: !198, line: 50, baseType: !992, size: 64)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 64, elements: !203)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !968, file: !186, line: 68, baseType: !995, size: 32, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !998)
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !997, file: !164, line: 232, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !975)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !968, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !968, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!1003 = !DIDerivedType(tag: DW_TAG_member, scope: !968, file: !186, line: 90, baseType: !1004, size: 16, offset: 112)
!1004 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !968, file: !186, line: 90, size: 16, elements: !1005)
!1005 = !{!1006, !1011}
!1006 = !DIDerivedType(tag: DW_TAG_member, scope: !1004, file: !186, line: 91, baseType: !1007, size: 16)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1004, file: !186, line: 91, size: 16, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !1007, file: !186, line: 96, baseType: !216, size: 8)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !1007, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !1004, file: !186, line: 100, baseType: !220, size: 16)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !968, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !968, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !968, file: !186, line: 131, baseType: !1015, size: 192, offset: 192)
