; ModuleID = 'build/arduino_due/subsys/zbus/benchmark/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.zbus_observer = type { i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_bm_channel", scope: !27, file: !114, line: 16, type: !136, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !290, !292, !294, !296, !298, !300, !302, !304, !306, !339, !343, !348, !350, !357, !362}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "bm_channel", scope: !27, file: !114, line: 16, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 192, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !123, !125, !126, !134, !259}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !120, size: 16)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !124, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !13, !132}
!131 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 214, baseType: !32)
!133 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !135, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !137, line: 2720, size: 160, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !160, !257, !258}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !136, file: !137, line: 2722, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !141, line: 233, baseType: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 231, size: 64, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !142, file: !141, line: 232, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !146, line: 48, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !146, line: 37, size: 64, elements: !148)
!148 = !{!149, !155}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 38, baseType: !150, size: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 38, size: 32, elements: !151)
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !150, file: !146, line: 39, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !146, line: 40, baseType: !153, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 42, baseType: !156, size: 32, offset: 32)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 42, size: 32, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !156, file: !146, line: 43, baseType: !153, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !146, line: 44, baseType: !153, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !136, file: !137, line: 2724, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !163, line: 245, size: 1024, elements: !164)
!163 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = !{!165, !212, !225, !226, !227, !228, !234, !252}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !162, file: !163, line: 247, baseType: !166, size: 384)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !163, line: 57, size: 384, elements: !167)
!167 = !{!168, !182, !184, !187, !188, !199, !200, !201}
!168 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 60, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 60, size: 64, elements: !170)
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !169, file: !163, line: 61, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !146, line: 49, baseType: !147)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !169, file: !163, line: 62, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !175, line: 49, size: 64, elements: !176)
!175 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !174, file: !175, line: 50, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!180 = !{!181}
!181 = !DISubrange(count: 2)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !166, file: !163, line: 68, baseType: !183, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !166, file: !163, line: 71, baseType: !185, size: 8, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !186)
!186 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !166, file: !163, line: 74, baseType: !185, size: 8, offset: 104)
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 90, baseType: !189, size: 16, offset: 112)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 90, size: 16, elements: !190)
!190 = !{!191, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !163, line: 91, baseType: !192, size: 16)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !163, line: 91, size: 16, elements: !193)
!193 = !{!194, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !192, file: !163, line: 96, baseType: !195, size: 8)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !196)
!196 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !192, file: !163, line: 97, baseType: !185, size: 8, offset: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !189, file: !163, line: 100, baseType: !121, size: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !166, file: !163, line: 107, baseType: !108, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !166, file: !163, line: 127, baseType: !102, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !166, file: !163, line: 131, baseType: !202, size: 192, offset: 192)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !141, line: 244, size: 192, elements: !203)
!203 = !{!204, !205, !211}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !202, file: !141, line: 245, baseType: !172, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !202, file: !141, line: 246, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !141, line: 242, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !202, file: !141, line: 249, baseType: !106, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !162, file: !163, line: 250, baseType: !213, size: 288, offset: 384)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !214, line: 25, size: 288, elements: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !213, file: !214, line: 26, baseType: !108, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !213, file: !214, line: 27, baseType: !108, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !213, file: !214, line: 28, baseType: !108, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !213, file: !214, line: 29, baseType: !108, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !213, file: !214, line: 30, baseType: !108, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !213, file: !214, line: 31, baseType: !108, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !213, file: !214, line: 32, baseType: !108, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !213, file: !214, line: 33, baseType: !108, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !213, file: !214, line: 34, baseType: !108, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !162, file: !163, line: 253, baseType: !102, size: 32, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !162, file: !163, line: 256, baseType: !140, size: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !162, file: !163, line: 294, baseType: !103, size: 32, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !162, file: !163, line: 300, baseType: !229, size: 96, offset: 800)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !163, line: 149, size: 96, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !229, file: !163, line: 153, baseType: !22, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !163, line: 162, baseType: !132, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !229, file: !163, line: 168, baseType: !132, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !162, file: !163, line: 325, baseType: !235, size: 32, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !137, line: 5073, size: 160, elements: !237)
!237 = !{!238, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !236, file: !137, line: 5074, baseType: !239, size: 96)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !240, line: 57, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !240, line: 57, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !239, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !239, file: !240, line: 59, baseType: !132, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !236, file: !137, line: 5075, baseType: !140, size: 64, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !236, file: !137, line: 5076, baseType: !249, offset: 160)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !162, file: !163, line: 343, baseType: !253, size: 64, offset: 928)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !214, line: 60, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !253, file: !214, line: 63, baseType: !108, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !253, file: !214, line: 66, baseType: !108, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !136, file: !137, line: 2727, baseType: !108, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !136, file: !137, line: 2730, baseType: !103, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !260, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 96, elements: !265)
!265 = !{!266, !267, !284}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !264, file: !117, line: 91, baseType: !131, size: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !264, file: !117, line: 93, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !137, line: 4204, size: 320, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !279, !280, !281, !282, !283}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !270, file: !137, line: 4206, baseType: !140, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !270, file: !137, line: 4208, baseType: !249, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !270, file: !137, line: 4210, baseType: !132, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !270, file: !137, line: 4212, baseType: !108, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !270, file: !137, line: 4214, baseType: !277, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !270, file: !137, line: 4216, baseType: !277, size: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !270, file: !137, line: 4218, baseType: !277, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !270, file: !137, line: 4220, baseType: !277, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !270, file: !137, line: 4222, baseType: !108, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !270, file: !137, line: 4227, baseType: !185, size: 8, offset: 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !264, file: !117, line: 96, baseType: !285, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "s1", scope: !27, file: !114, line: 126, type: !264, isLocal: false, isDefinition: true, align: 32)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "s2", scope: !27, file: !114, line: 129, type: !264, isLocal: false, isDefinition: true, align: 32)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "s3", scope: !27, file: !114, line: 131, type: !264, isLocal: false, isDefinition: true, align: 32)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "s4", scope: !27, file: !114, line: 132, type: !264, isLocal: false, isDefinition: true, align: 32)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "s5", scope: !27, file: !114, line: 134, type: !264, isLocal: false, isDefinition: true, align: 32)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "s6", scope: !27, file: !114, line: 135, type: !264, isLocal: false, isDefinition: true, align: 32)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "s7", scope: !27, file: !114, line: 136, type: !264, isLocal: false, isDefinition: true, align: 32)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "s8", scope: !27, file: !114, line: 137, type: !264, isLocal: false, isDefinition: true, align: 32)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "_k_thread_data_producer_thread_id", scope: !27, file: !114, line: 216, type: !308, isLocal: false, isDefinition: true, align: 32)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !137, line: 620, size: 384, elements: !309)
!309 = !{!310, !311, !319, !320, !325, !326, !327, !328, !329, !330, !332, !336}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !308, file: !137, line: 621, baseType: !161, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !308, file: !137, line: 622, baseType: !312, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !314, line: 44, baseType: !315)
!314 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !316, line: 47, size: 8, elements: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !316, line: 48, baseType: !278, size: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !308, file: !137, line: 623, baseType: !32, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !308, file: !137, line: 624, baseType: !321, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !314, line: 46, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !102, !102, !102}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !308, file: !137, line: 625, baseType: !102, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !308, file: !137, line: 626, baseType: !102, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !308, file: !137, line: 627, baseType: !102, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !308, file: !137, line: 628, baseType: !103, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !308, file: !137, line: 629, baseType: !108, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !308, file: !137, line: 630, baseType: !331, size: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !308, file: !137, line: 631, baseType: !333, size: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{null}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !308, file: !137, line: 632, baseType: !337, size: 32, offset: 352)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "producer_thread_id", scope: !27, file: !114, line: 216, type: !341, isLocal: false, isDefinition: true)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !163, line: 347, baseType: !161)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "_k_thread_stack_producer_thread_id", scope: !27, file: !114, line: 216, type: !345, isLocal: false, isDefinition: true, align: 512)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 8704, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 1088)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_k_thread_obj_producer_thread_id", scope: !27, file: !114, line: 216, type: !162, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "_zbus_message_bm_channel", scope: !27, file: !114, line: 16, type: !352, isLocal: true, isDefinition: true)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_data_msg", file: !353, line: 10, size: 64, elements: !354)
!353 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !352, file: !353, line: 11, baseType: !102, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !352, file: !353, line: 12, baseType: !132, size: 32, offset: 32)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "_zbus_observers_bm_channel", scope: !27, file: !114, line: 16, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 288, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 9)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 44, type: !109, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !366, file: !381, line: 18, type: !382, isLocal: false, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !368, globals: !380, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!368 = !{!22, !102, !24, !369, !371, !373, !132, !103, !374, !375, !377, !378, !277, !379, !121, !337}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!380 = !{!364}
!381 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !385)
!384 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !384, line: 17, baseType: !337, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !383, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "_char_out", scope: !390, file: !394, line: 54, type: !395, isLocal: false, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !392, globals: !393, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!392 = !{!102, !103}
!393 = !{!388}
!394 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!103, !103}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !400, file: !465, line: 235, type: !466, isLocal: true, isDefinition: true, align: 32)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !402, globals: !464, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!402 = !{!102, !103, !403, !414}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !405, line: 46, baseType: !406)
!405 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 41, size: 128, elements: !407)
!407 = !{!408, !410, !411, !413}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !406, file: !405, line: 42, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !406, file: !405, line: 43, baseType: !409, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !406, file: !405, line: 44, baseType: !412, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !406, file: !405, line: 45, baseType: !412, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !416, line: 75, baseType: !417)
!416 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 41, size: 2176, elements: !418)
!418 = !{!419, !420, !421, !422, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !442, !446, !447, !448, !449, !450, !451, !452, !453, !457, !458, !459, !460, !461, !462, !463}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !417, file: !416, line: 42, baseType: !409, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !417, file: !416, line: 43, baseType: !409, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !417, file: !416, line: 44, baseType: !412, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !417, file: !416, line: 45, baseType: !423, size: 32, offset: 96)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 32, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 1)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !417, file: !416, line: 46, baseType: !409, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !417, file: !416, line: 47, baseType: !409, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !417, file: !416, line: 48, baseType: !412, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !417, file: !416, line: 49, baseType: !409, size: 32, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !417, file: !416, line: 50, baseType: !409, size: 32, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !417, file: !416, line: 51, baseType: !412, size: 32, offset: 288)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !417, file: !416, line: 52, baseType: !409, size: 32, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !417, file: !416, line: 53, baseType: !423, size: 32, offset: 352)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !417, file: !416, line: 54, baseType: !409, size: 32, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !417, file: !416, line: 55, baseType: !423, size: 32, offset: 416)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !417, file: !416, line: 56, baseType: !409, size: 32, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !417, file: !416, line: 57, baseType: !423, size: 32, offset: 480)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !417, file: !416, line: 58, baseType: !439, size: 96, offset: 512)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 96, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 3)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !417, file: !416, line: 59, baseType: !443, size: 160, offset: 608)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 160, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 5)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !417, file: !416, line: 60, baseType: !409, size: 32, offset: 768)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !417, file: !416, line: 61, baseType: !409, size: 32, offset: 800)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !417, file: !416, line: 62, baseType: !412, size: 32, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !417, file: !416, line: 63, baseType: !412, size: 32, offset: 864)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !417, file: !416, line: 64, baseType: !409, size: 32, offset: 896)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !417, file: !416, line: 65, baseType: !409, size: 32, offset: 928)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !417, file: !416, line: 66, baseType: !409, size: 32, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !417, file: !416, line: 67, baseType: !454, size: 832, offset: 992)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 832, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 26)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !417, file: !416, line: 68, baseType: !409, size: 32, offset: 1824)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !417, file: !416, line: 69, baseType: !412, size: 32, offset: 1856)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !417, file: !416, line: 70, baseType: !443, size: 160, offset: 1888)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !417, file: !416, line: 71, baseType: !409, size: 32, offset: 2048)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !417, file: !416, line: 72, baseType: !409, size: 32, offset: 2080)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !417, file: !416, line: 73, baseType: !412, size: 32, offset: 2112)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !417, file: !416, line: 74, baseType: !409, size: 32, offset: 2144)
!464 = !{!398}
!465 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !468, line: 51, size: 64, elements: !469)
!468 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = !{!470, !495}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !467, file: !468, line: 60, baseType: !471, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DISubroutineType(types: !473)
!473 = !{!103, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !477, line: 378, size: 192, elements: !478)
!477 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!478 = !{!479, !480, !481, !482, !488, !489}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !476, file: !477, line: 380, baseType: !337, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !476, file: !477, line: 382, baseType: !13, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !476, file: !477, line: 384, baseType: !13, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !476, file: !477, line: 386, baseType: !483, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !477, line: 351, size: 16, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !484, file: !477, line: 359, baseType: !185, size: 8)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !484, file: !477, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !476, file: !477, line: 388, baseType: !102, size: 32, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !476, file: !477, line: 396, baseType: !490, size: 32, offset: 160)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !477, line: 43, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !494)
!494 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !467, file: !468, line: 65, baseType: !474, size: 32, offset: 32)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !498, file: !505, line: 17, type: !629, isLocal: false, isDefinition: true)
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !500, globals: !501, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!500 = !{!132, !103, !108, !102}
!501 = !{!496, !502, !625}
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !504, file: !505, line: 198, type: !613, isLocal: true, isDefinition: true)
!504 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !505, file: !505, line: 175, type: !506, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !498, retainedNodes: !608)
!505 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!506 = !DISubroutineType(types: !507)
!507 = !{null, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !163, line: 245, size: 1024, elements: !510)
!510 = !{!511, !569, !581, !582, !583, !584, !590, !603}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !509, file: !163, line: 247, baseType: !512, size: 384)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !163, line: 57, size: 384, elements: !513)
!513 = !{!514, !538, !545, !546, !547, !556, !557, !558}
!514 = !DIDerivedType(tag: DW_TAG_member, scope: !512, file: !163, line: 60, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !512, file: !163, line: 60, size: 64, elements: !516)
!516 = !{!517, !532}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !515, file: !163, line: 61, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !146, line: 49, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !146, line: 37, size: 64, elements: !520)
!520 = !{!521, !527}
!521 = !DIDerivedType(tag: DW_TAG_member, scope: !519, file: !146, line: 38, baseType: !522, size: 32)
!522 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !519, file: !146, line: 38, size: 32, elements: !523)
!523 = !{!524, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !522, file: !146, line: 39, baseType: !525, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !522, file: !146, line: 40, baseType: !525, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, scope: !519, file: !146, line: 42, baseType: !528, size: 32, offset: 32)
!528 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !519, file: !146, line: 42, size: 32, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !528, file: !146, line: 43, baseType: !525, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !528, file: !146, line: 44, baseType: !525, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !515, file: !163, line: 62, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !175, line: 49, size: 64, elements: !534)
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !533, file: !175, line: 50, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 64, elements: !180)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !512, file: !163, line: 68, baseType: !539, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !141, line: 233, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 231, size: 64, elements: !542)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !541, file: !141, line: 232, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !146, line: 48, baseType: !519)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !512, file: !163, line: 71, baseType: !185, size: 8, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !512, file: !163, line: 74, baseType: !185, size: 8, offset: 104)
!547 = !DIDerivedType(tag: DW_TAG_member, scope: !512, file: !163, line: 90, baseType: !548, size: 16, offset: 112)
!548 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !512, file: !163, line: 90, size: 16, elements: !549)
!549 = !{!550, !555}
!550 = !DIDerivedType(tag: DW_TAG_member, scope: !548, file: !163, line: 91, baseType: !551, size: 16)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !548, file: !163, line: 91, size: 16, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !551, file: !163, line: 96, baseType: !195, size: 8)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !551, file: !163, line: 97, baseType: !185, size: 8, offset: 8)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !548, file: !163, line: 100, baseType: !121, size: 16)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !512, file: !163, line: 107, baseType: !108, size: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !512, file: !163, line: 127, baseType: !102, size: 32, offset: 160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !512, file: !163, line: 131, baseType: !559, size: 192, offset: 192)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !141, line: 244, size: 192, elements: !560)
!560 = !{!561, !562, !568}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !559, file: !141, line: 245, baseType: !518, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !559, file: !141, line: 246, baseType: !563, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !141, line: 242, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !559, file: !141, line: 249, baseType: !106, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !509, file: !163, line: 250, baseType: !570, size: 288, offset: 384)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !214, line: 25, size: 288, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !570, file: !214, line: 26, baseType: !108, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !570, file: !214, line: 27, baseType: !108, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !570, file: !214, line: 28, baseType: !108, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !570, file: !214, line: 29, baseType: !108, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !570, file: !214, line: 30, baseType: !108, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !570, file: !214, line: 31, baseType: !108, size: 32, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !570, file: !214, line: 32, baseType: !108, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !570, file: !214, line: 33, baseType: !108, size: 32, offset: 224)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !570, file: !214, line: 34, baseType: !108, size: 32, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !509, file: !163, line: 253, baseType: !102, size: 32, offset: 672)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !509, file: !163, line: 256, baseType: !540, size: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !509, file: !163, line: 294, baseType: !103, size: 32, offset: 768)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !509, file: !163, line: 300, baseType: !585, size: 96, offset: 800)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !163, line: 149, size: 96, elements: !586)
!586 = !{!587, !588, !589}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !585, file: !163, line: 153, baseType: !22, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !585, file: !163, line: 162, baseType: !132, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !585, file: !163, line: 168, baseType: !132, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !509, file: !163, line: 325, baseType: !591, size: 32, offset: 896)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !137, line: 5073, size: 160, elements: !593)
!593 = !{!594, !600, !601}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !592, file: !137, line: 5074, baseType: !595, size: 96)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !596)
!596 = !{!597, !598, !599}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !595, file: !240, line: 57, baseType: !243, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !595, file: !240, line: 58, baseType: !102, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !595, file: !240, line: 59, baseType: !132, size: 32, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !592, file: !137, line: 5075, baseType: !540, size: 64, offset: 96)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !592, file: !137, line: 5076, baseType: !602, offset: 160)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !509, file: !163, line: 343, baseType: !604, size: 64, offset: 928)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !214, line: 60, size: 64, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !604, file: !214, line: 63, baseType: !108, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !604, file: !214, line: 66, baseType: !108, size: 32, offset: 32)
!608 = !{!609, !610, !611, !612}
!609 = !DILocalVariable(name: "thread", arg: 1, scope: !504, file: !505, line: 175, type: !508)
!610 = !DILocalVariable(name: "region_num", scope: !504, file: !505, line: 200, type: !185)
!611 = !DILocalVariable(name: "guard_start", scope: !504, file: !505, line: 265, type: !22)
!612 = !DILocalVariable(name: "guard_size", scope: !504, file: !505, line: 266, type: !132)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 96, elements: !424)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !615, line: 52, size: 96, elements: !616)
!615 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !614, file: !615, line: 53, baseType: !22, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !614, file: !615, line: 54, baseType: !132, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !614, file: !615, line: 55, baseType: !620, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !621, line: 151, baseType: !622)
!621 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !621, line: 149, size: 32, elements: !623)
!623 = !{!624}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !622, file: !621, line: 150, baseType: !108, size: 32)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "static_regions", scope: !498, file: !505, line: 62, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 96, elements: !424)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !630, file: !384, line: 17, baseType: !337, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !630, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !636, file: !668, line: 39, type: !185, isLocal: true, isDefinition: true)
!636 = distinct !DICompileUnit(language: DW_LANG_C99, file: !637, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !638, globals: !667, splitDebugInlining: false, nameTableKind: None)
!637 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!638 = !{!639, !102, !103, !655, !185}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !641, line: 1168, baseType: !642)
!641 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !641, line: 1155, size: 352, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !642, file: !641, line: 1157, baseType: !412, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !642, file: !641, line: 1158, baseType: !409, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !642, file: !641, line: 1159, baseType: !409, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !642, file: !641, line: 1160, baseType: !409, size: 32, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !642, file: !641, line: 1161, baseType: !409, size: 32, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !642, file: !641, line: 1162, baseType: !409, size: 32, offset: 160)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !642, file: !641, line: 1163, baseType: !409, size: 32, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !642, file: !641, line: 1164, baseType: !409, size: 32, offset: 224)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !642, file: !641, line: 1165, baseType: !409, size: 32, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !642, file: !641, line: 1166, baseType: !409, size: 32, offset: 288)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !642, file: !641, line: 1167, baseType: !409, size: 32, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !658, line: 27, size: 96, elements: !659)
!658 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !657, file: !658, line: 29, baseType: !108, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !657, file: !658, line: 31, baseType: !337, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !657, file: !658, line: 37, baseType: !663, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !621, line: 146, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !621, line: 141, size: 32, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !664, file: !621, line: 143, baseType: !108, size: 32)
!667 = !{!634}
!668 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !671, file: !678, line: 21, type: !395, isLocal: true, isDefinition: true)
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !673, globals: !677, splitDebugInlining: false, nameTableKind: None)
!672 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!673 = !{!674, !103, !102}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !676, line: 22, baseType: !103)
!676 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!677 = !{!669}
!678 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !681, file: !686, line: 13, type: !703, isLocal: true, isDefinition: true)
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !683, splitDebugInlining: false, nameTableKind: None)
!682 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!683 = !{!684, !679}
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "mpu_config", scope: !681, file: !686, line: 37, type: !687, isLocal: false, isDefinition: true)
!686 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !658, line: 41, size: 64, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !688, file: !658, line: 43, baseType: !108, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !688, file: !658, line: 45, baseType: !692, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !658, line: 27, size: 96, elements: !695)
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !694, file: !658, line: 29, baseType: !108, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !694, file: !658, line: 31, baseType: !337, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !694, file: !658, line: 37, baseType: !699, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !621, line: 146, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !621, line: 141, size: 32, elements: !701)
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !700, file: !621, line: 143, baseType: !108, size: 32)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 192, elements: !180)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !706, file: !710, line: 10, type: !711, isLocal: false, isDefinition: true)
!706 = distinct !DICompileUnit(language: DW_LANG_C99, file: !707, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !708, globals: !709, splitDebugInlining: false, nameTableKind: None)
!707 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!708 = !{!104, !102, !103}
!709 = !{!704}
!710 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !712, file: !384, line: 17, baseType: !337, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !712, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !718, file: !775, line: 603, type: !777, isLocal: true, isDefinition: true, align: 32)
!718 = distinct !DICompileUnit(language: DW_LANG_C99, file: !719, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !720, globals: !772, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!720 = !{!102, !103, !721}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !724, line: 336, size: 160, elements: !725)
!724 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!725 = !{!726, !746, !750, !754, !767}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !723, file: !724, line: 365, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DISubroutineType(types: !729)
!729 = !{!103, !730, !745}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !477, line: 378, size: 192, elements: !733)
!733 = !{!734, !735, !736, !737, !743, !744}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !732, file: !477, line: 380, baseType: !337, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !732, file: !477, line: 382, baseType: !13, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !732, file: !477, line: 384, baseType: !13, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !732, file: !477, line: 386, baseType: !738, size: 32, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !477, line: 351, size: 16, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !739, file: !477, line: 359, baseType: !185, size: 8)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !739, file: !477, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !732, file: !477, line: 388, baseType: !102, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !732, file: !477, line: 396, baseType: !490, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !723, file: !724, line: 366, baseType: !747, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !730, !186}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !723, file: !724, line: 374, baseType: !751, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = !DISubroutineType(types: !753)
!753 = !{!103, !730}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !723, file: !724, line: 377, baseType: !755, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DISubroutineType(types: !757)
!757 = !{!103, !730, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !724, line: 122, size: 64, elements: !761)
!761 = !{!762, !763, !764, !765, !766}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !760, file: !724, line: 123, baseType: !108, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !760, file: !724, line: 124, baseType: !185, size: 8, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !760, file: !724, line: 125, baseType: !185, size: 8, offset: 40)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !760, file: !724, line: 126, baseType: !185, size: 8, offset: 48)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !760, file: !724, line: 127, baseType: !185, size: 8, offset: 56)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !723, file: !724, line: 379, baseType: !768, size: 32, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DISubroutineType(types: !770)
!770 = !{!103, !730, !771}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!772 = !{!716, !773}
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !718, file: !775, line: 38, type: !776, isLocal: true, isDefinition: true)
!775 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !468, line: 51, size: 64, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !778, file: !468, line: 60, baseType: !751, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !778, file: !468, line: 65, baseType: !730, size: 32, offset: 32)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "log_const_wdt_sam", scope: !784, file: !845, line: 28, type: !891, isLocal: false, isDefinition: true)
!784 = distinct !DICompileUnit(language: DW_LANG_C99, file: !785, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !786, globals: !842, splitDebugInlining: false, nameTableKind: None)
!785 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!786 = !{!787, !108}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !790, line: 134, size: 128, elements: !791)
!790 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!791 = !{!792, !812, !817, !837}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !789, file: !790, line: 135, baseType: !793, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !790, line: 113, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DISubroutineType(types: !796)
!796 = !{!103, !797, !185}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !477, line: 378, size: 192, elements: !800)
!800 = !{!801, !802, !803, !804, !810, !811}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !799, file: !477, line: 380, baseType: !337, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !799, file: !477, line: 382, baseType: !13, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !799, file: !477, line: 384, baseType: !13, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !799, file: !477, line: 386, baseType: !805, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !477, line: 351, size: 16, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !806, file: !477, line: 359, baseType: !185, size: 8)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !806, file: !477, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !799, file: !477, line: 388, baseType: !102, size: 32, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !799, file: !477, line: 396, baseType: !490, size: 32, offset: 160)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !789, file: !790, line: 136, baseType: !813, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !790, line: 119, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{!103, !797}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !789, file: !790, line: 137, baseType: !818, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !790, line: 125, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DISubroutineType(types: !821)
!821 = !{!103, !797, !822}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !790, line: 88, size: 128, elements: !825)
!825 = !{!826, !831, !836}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !824, file: !790, line: 90, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !790, line: 72, size: 64, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !827, file: !790, line: 74, baseType: !108, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !827, file: !790, line: 76, baseType: !108, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !824, file: !790, line: 92, baseType: !832, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !790, line: 85, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !797, !103}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !824, file: !790, line: 104, baseType: !185, size: 8, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !789, file: !790, line: 138, baseType: !838, size: 32, offset: 96)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !790, line: 132, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{!103, !797, !103}
!842 = !{!782, !843, !847, !849, !856, !858, !872, !874, !882}
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !784, file: !845, line: 256, type: !846, isLocal: false, isDefinition: true, align: 16)
!845 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 80, elements: !444)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !784, file: !845, line: 256, type: !798, isLocal: false, isDefinition: true, align: 32)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !784, file: !845, line: 256, type: !851, isLocal: true, isDefinition: true, align: 32)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !468, line: 51, size: 64, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !852, file: !468, line: 60, baseType: !814, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !852, file: !468, line: 65, baseType: !797, size: 32, offset: 32)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !784, file: !845, line: 256, type: !806, isLocal: true, isDefinition: true, align: 8)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !784, file: !845, line: 234, type: !860, isLocal: true, isDefinition: true)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !845, line: 34, size: 32, elements: !862)
!862 = !{!863}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !861, file: !845, line: 35, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !866, line: 45, baseType: !867)
!866 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !866, line: 41, size: 96, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !867, file: !866, line: 42, baseType: !409, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !867, file: !866, line: 43, baseType: !409, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !867, file: !866, line: 44, baseType: !412, size: 32, offset: 64)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !784, file: !845, line: 227, type: !788, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !784, file: !845, line: 45, type: !876, isLocal: true, isDefinition: true)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !845, line: 38, size: 96, elements: !877)
!877 = !{!878, !879, !880, !881}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !876, file: !845, line: 39, baseType: !832, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !876, file: !845, line: 40, baseType: !108, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !876, file: !845, line: 41, baseType: !131, size: 8, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !876, file: !845, line: 42, baseType: !131, size: 8, offset: 72)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !884, file: !845, line: 240, type: !885, isLocal: true, isDefinition: true, align: 32)
!884 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !845, file: !845, line: 238, type: !334, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !784, retainedNodes: !251)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !886)
!886 = !{!887, !888, !889, !890}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !885, file: !10, line: 55, baseType: !331, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !885, file: !10, line: 57, baseType: !331, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !885, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !885, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !384, line: 16, size: 64, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !892, file: !384, line: 17, baseType: !337, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !892, file: !384, line: 18, baseType: !185, size: 8, offset: 32)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !898, file: !903, line: 7, type: !904, isLocal: false, isDefinition: true, align: 16)
!898 = distinct !DICompileUnit(language: DW_LANG_C99, file: !899, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !900, splitDebugInlining: false, nameTableKind: None)
!899 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!900 = !{!896, !901}
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !898, file: !903, line: 12, type: !904, isLocal: false, isDefinition: true, align: 16)
!903 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 48, elements: !440)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !907, file: !995, line: 494, type: !1042, isLocal: true, isDefinition: true)
!907 = distinct !DICompileUnit(language: DW_LANG_C99, file: !908, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !909, retainedTypes: !942, globals: !992, splitDebugInlining: false, nameTableKind: None)
!908 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/zbus/benchmark")
!909 = !{!910, !917, !923, !930, !935}
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !724, line: 47, baseType: !32, size: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916}
!912 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!913 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!914 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!915 = !DIEnumerator(name: "UART_BREAK", value: 8)
!916 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!917 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !724, line: 84, baseType: !32, size: 32, elements: !918)
!918 = !{!919, !920, !921, !922}
!919 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!920 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!921 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!922 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !724, line: 92, baseType: !32, size: 32, elements: !924)
!924 = !{!925, !926, !927, !928, !929}
!925 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!926 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!927 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!928 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!929 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !724, line: 107, baseType: !32, size: 32, elements: !931)
!931 = !{!932, !933, !934}
!932 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!933 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!934 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !724, line: 75, baseType: !32, size: 32, elements: !936)
!936 = !{!937, !938, !939, !940, !941}
!937 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!938 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!939 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!940 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!941 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!942 = !{!943, !102, !186, !108}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !724, line: 336, size: 160, elements: !946)
!946 = !{!947, !966, !970, !974, !987}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !945, file: !724, line: 365, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DISubroutineType(types: !950)
!950 = !{!103, !951, !745}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !477, line: 378, size: 192, elements: !954)
!954 = !{!955, !956, !957, !958, !964, !965}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !953, file: !477, line: 380, baseType: !337, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !953, file: !477, line: 382, baseType: !13, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !953, file: !477, line: 384, baseType: !13, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !953, file: !477, line: 386, baseType: !959, size: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !477, line: 351, size: 16, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !960, file: !477, line: 359, baseType: !185, size: 8)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !960, file: !477, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !953, file: !477, line: 388, baseType: !102, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !953, file: !477, line: 396, baseType: !490, size: 32, offset: 160)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !945, file: !724, line: 366, baseType: !967, size: 32, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !951, !186}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !945, file: !724, line: 374, baseType: !971, size: 32, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!972 = !DISubroutineType(types: !973)
!973 = !{!103, !951}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !945, file: !724, line: 377, baseType: !975, size: 32, offset: 96)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{!103, !951, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !724, line: 122, size: 64, elements: !981)
!981 = !{!982, !983, !984, !985, !986}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !980, file: !724, line: 123, baseType: !108, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !980, file: !724, line: 124, baseType: !185, size: 8, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !980, file: !724, line: 125, baseType: !185, size: 8, offset: 40)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !980, file: !724, line: 126, baseType: !185, size: 8, offset: 48)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !980, file: !724, line: 127, baseType: !185, size: 8, offset: 56)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !945, file: !724, line: 379, baseType: !988, size: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!989 = !DISubroutineType(types: !990)
!990 = !{!103, !951, !991}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!992 = !{!993, !999, !1001, !1008, !1010, !1012, !905, !1017, !1036, !1039}
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !907, file: !995, line: 494, type: !996, isLocal: false, isDefinition: true, align: 16)
!995 = !DIFile(filename: "zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 96, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 6)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !907, file: !995, line: 494, type: !952, isLocal: false, isDefinition: true, align: 32)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !907, file: !995, line: 494, type: !1003, isLocal: true, isDefinition: true, align: 32)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !468, line: 51, size: 64, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1004, file: !468, line: 60, baseType: !971, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1004, file: !468, line: 65, baseType: !951, size: 32, offset: 32)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
