; ModuleID = 'build/arduino_mkrzero/drivers/ipm/ipm_mcux/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.anon.10] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.10 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.gpio_sam0_config = type { %union.anon.1, %struct.PortGroup*, i8 }
%union.anon.1 = type { i32 }
%struct.PortGroup = type { %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, %union.PORT_DIR_Type, [4 x i8], [16 x %union.PORT_PMUX_Type], [32 x %union.PORT_PMUX_Type], [32 x i8] }
%union.PORT_DIR_Type = type { %union.anon.1 }
%union.PORT_PMUX_Type = type { %struct.anon.10 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/ipm/ipm_mcux/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/ipm/ipm_mcux")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/ipm/ipm_mcux")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "gcounter", scope: !27, file: !170, line: 12, type: !103, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !169, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/ipm/ipm_mcux")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipm_driver_api", file: !108, line: 98, size: 160, elements: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/drivers/ipm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !{!110, !143, !154, !159, !164}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !107, file: !108, line: 99, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_send_t", file: !108, line: 54, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DISubroutineType(types: !114)
!114 = !{!103, !115, !103, !142, !13, !103}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !124, !125, !126, !135, !136}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 380, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !117, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !117, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !118, line: 386, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !129)
!129 = !{!130, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !128, file: !118, line: 359, baseType: !131, size: 8)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !132)
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !128, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !117, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !118, line: 43, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !141)
!141 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "register_callback", scope: !107, file: !108, line: 100, baseType: !144, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_register_callback_t", file: !108, line: 78, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !115, !148, !104}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_callback_t", file: !108, line: 45, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !115, !104, !142, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_data_size_get", scope: !107, file: !108, line: 101, baseType: !155, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_data_size_get_t", file: !108, line: 62, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{!103, !115}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max_id_val_get", scope: !107, file: !108, line: 102, baseType: !160, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_id_val_get_t", file: !108, line: 70, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!142, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "set_enabled", scope: !107, file: !108, line: 103, baseType: !165, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_set_enabled_t", file: !108, line: 88, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!103, !115, !103}
!169 = !{!25}
!170 = !DIFile(filename: "zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "_char_out", scope: !173, file: !177, line: 54, type: !178, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !175, globals: !176, splitDebugInlining: false, nameTableKind: None)
!174 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/ipm/ipm_mcux")
!175 = !{!104, !103}
!176 = !{!171}
!177 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DISubroutineType(types: !180)
!180 = !{!103, !103}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !183, file: !921, line: 202, type: !922, isLocal: true, isDefinition: true, align: 32)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !185, globals: !920, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/drivers/ipm/ipm_mcux")
!185 = !{!104, !103, !186, !312, !651, !652, !719}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !188, line: 335, baseType: !189)
!188 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 320, size: 288, elements: !190)
!190 = !{!191, !204, !212, !226, !237, !248, !252, !263, !264, !275, !276, !291, !292, !302}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !189, file: !188, line: 321, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !188, line: 50, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !188, line: 43, size: 16, elements: !195)
!195 = !{!196, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !194, file: !188, line: 48, baseType: !197, size: 16)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !194, file: !188, line: 44, size: 16, elements: !198)
!198 = !{!199, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !197, file: !188, line: 45, baseType: !200, size: 7, flags: DIFlagBitField, extraData: i64 0)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !201)
!201 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !197, file: !188, line: 47, baseType: !200, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !194, file: !188, line: 49, baseType: !200, size: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !189, file: !188, line: 322, baseType: !205, size: 16, offset: 16)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 16, elements: !210)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !207, line: 52, baseType: !208)
!207 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!210 = !{!211}
!211 = !DISubrange(count: 2)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !189, file: !188, line: 323, baseType: !213, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !188, line: 107, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !188, line: 94, size: 32, elements: !216)
!216 = !{!217, !225}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !215, file: !188, line: 105, baseType: !218, size: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !215, file: !188, line: 95, size: 32, elements: !219)
!219 = !{!220, !221, !222, !223, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !218, file: !188, line: 97, baseType: !142, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !218, file: !188, line: 99, baseType: !142, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !218, file: !188, line: 100, baseType: !142, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !218, file: !188, line: 102, baseType: !142, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !218, file: !188, line: 103, baseType: !142, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !215, file: !188, line: 106, baseType: !142, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !189, file: !188, line: 324, baseType: !227, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !188, line: 155, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !188, line: 148, size: 32, elements: !230)
!230 = !{!231, !236}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !229, file: !188, line: 153, baseType: !232, size: 32)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !229, file: !188, line: 149, size: 32, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !232, file: !188, line: 150, baseType: !142, size: 16, flags: DIFlagBitField, extraData: i64 0)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !232, file: !188, line: 151, baseType: !142, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !229, file: !188, line: 154, baseType: !142, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !189, file: !188, line: 325, baseType: !238, size: 8, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !188, line: 194, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !188, line: 187, size: 8, elements: !241)
!241 = !{!242, !247}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !240, file: !188, line: 192, baseType: !243, size: 8)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !240, file: !188, line: 188, size: 8, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !243, file: !188, line: 189, baseType: !131, size: 1, flags: DIFlagBitField, extraData: i64 0)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !243, file: !188, line: 190, baseType: !131, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !240, file: !188, line: 193, baseType: !131, size: 8)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !189, file: !188, line: 326, baseType: !249, size: 24, offset: 104)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 24, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 3)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !189, file: !188, line: 327, baseType: !253, size: 8, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !188, line: 215, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !188, line: 208, size: 8, elements: !256)
!256 = !{!257, !262}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !255, file: !188, line: 213, baseType: !258, size: 8)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !188, line: 209, size: 8, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !258, file: !188, line: 210, baseType: !131, size: 1, flags: DIFlagBitField, extraData: i64 0)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !258, file: !188, line: 211, baseType: !131, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !255, file: !188, line: 214, baseType: !131, size: 8)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !189, file: !188, line: 328, baseType: !249, size: 24, offset: 136)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !189, file: !188, line: 329, baseType: !265, size: 8, offset: 160)
!265 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !188, line: 236, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !188, line: 229, size: 8, elements: !268)
!268 = !{!269, !274}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !267, file: !188, line: 234, baseType: !270, size: 8)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !267, file: !188, line: 230, size: 8, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !270, file: !188, line: 231, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !270, file: !188, line: 232, baseType: !208, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !267, file: !188, line: 235, baseType: !131, size: 8)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !189, file: !188, line: 330, baseType: !249, size: 24, offset: 168)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !189, file: !188, line: 331, baseType: !277, size: 16, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !188, line: 262, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !188, line: 250, size: 16, elements: !280)
!280 = !{!281, !290}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !279, file: !188, line: 260, baseType: !282, size: 16)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !279, file: !188, line: 251, size: 16, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !282, file: !188, line: 252, baseType: !200, size: 1, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !282, file: !188, line: 253, baseType: !200, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !282, file: !188, line: 254, baseType: !200, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !282, file: !188, line: 255, baseType: !200, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !282, file: !188, line: 256, baseType: !200, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !282, file: !188, line: 258, baseType: !200, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !279, file: !188, line: 261, baseType: !200, size: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !189, file: !188, line: 332, baseType: !205, size: 16, offset: 208)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !189, file: !188, line: 333, baseType: !293, size: 32, offset: 224)
!293 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !188, line: 290, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !188, line: 284, size: 32, elements: !296)
!296 = !{!297, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !295, file: !188, line: 288, baseType: !298, size: 32)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !295, file: !188, line: 285, size: 32, elements: !299)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !298, file: !188, line: 286, baseType: !142, size: 22, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !295, file: !188, line: 289, baseType: !142, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !189, file: !188, line: 334, baseType: !303, size: 16, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !188, line: 308, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !188, line: 303, size: 16, elements: !306)
!306 = !{!307, !311}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !305, file: !188, line: 306, baseType: !308, size: 16)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !305, file: !188, line: 304, size: 16, elements: !309)
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !308, file: !188, line: 305, baseType: !200, size: 16, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !305, file: !188, line: 307, baseType: !200, size: 16)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !314, line: 928, baseType: !315)
!314 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !314, line: 899, size: 672, elements: !316)
!316 = !{!317, !341, !365, !391, !416, !432, !433, !451, !452, !469, !480, !481, !496, !516, !517, !529, !541, !551, !552, !569, !573, !584, !585, !597, !609, !610, !621, !637}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !315, file: !314, line: 900, baseType: !318, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !314, line: 64, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 43, size: 32, elements: !321)
!321 = !{!322, !340}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !320, file: !314, line: 62, baseType: !323, size: 32)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !314, line: 44, size: 32, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !323, file: !314, line: 45, baseType: !142, size: 1, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !323, file: !314, line: 46, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !323, file: !314, line: 47, baseType: !142, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !323, file: !314, line: 48, baseType: !142, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !323, file: !314, line: 49, baseType: !142, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !323, file: !314, line: 50, baseType: !142, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !323, file: !314, line: 51, baseType: !142, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !323, file: !314, line: 52, baseType: !142, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !323, file: !314, line: 53, baseType: !142, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !323, file: !314, line: 54, baseType: !142, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !323, file: !314, line: 55, baseType: !142, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !323, file: !314, line: 56, baseType: !142, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !323, file: !314, line: 58, baseType: !142, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !323, file: !314, line: 59, baseType: !142, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !323, file: !314, line: 60, baseType: !142, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !320, file: !314, line: 63, baseType: !142, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !315, file: !314, line: 901, baseType: !342, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !314, line: 125, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 104, size: 32, elements: !345)
!345 = !{!346, !364}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !344, file: !314, line: 123, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !314, line: 105, size: 32, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !347, file: !314, line: 106, baseType: !142, size: 1, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !347, file: !314, line: 107, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !347, file: !314, line: 108, baseType: !142, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !347, file: !314, line: 109, baseType: !142, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !347, file: !314, line: 110, baseType: !142, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !347, file: !314, line: 111, baseType: !142, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !347, file: !314, line: 112, baseType: !142, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !347, file: !314, line: 113, baseType: !142, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !347, file: !314, line: 114, baseType: !142, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !347, file: !314, line: 115, baseType: !142, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !347, file: !314, line: 116, baseType: !142, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !347, file: !314, line: 117, baseType: !142, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !347, file: !314, line: 119, baseType: !142, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !347, file: !314, line: 120, baseType: !142, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !347, file: !314, line: 121, baseType: !142, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !344, file: !314, line: 124, baseType: !142, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !315, file: !314, line: 902, baseType: !366, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !314, line: 186, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 165, size: 32, elements: !369)
!369 = !{!370, !390}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !368, file: !314, line: 184, baseType: !371, size: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !368, file: !314, line: 166, size: 32, elements: !372)
!372 = !{!373, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !371, file: !314, line: 167, baseType: !374, size: 1, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !142)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !371, file: !314, line: 168, baseType: !374, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !371, file: !314, line: 169, baseType: !374, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !371, file: !314, line: 170, baseType: !374, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !371, file: !314, line: 171, baseType: !374, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !371, file: !314, line: 172, baseType: !374, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !371, file: !314, line: 173, baseType: !374, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !371, file: !314, line: 174, baseType: !374, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !371, file: !314, line: 175, baseType: !374, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !371, file: !314, line: 176, baseType: !374, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !371, file: !314, line: 177, baseType: !374, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !371, file: !314, line: 178, baseType: !374, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !371, file: !314, line: 180, baseType: !374, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !371, file: !314, line: 181, baseType: !374, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !371, file: !314, line: 182, baseType: !374, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !368, file: !314, line: 185, baseType: !142, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !315, file: !314, line: 903, baseType: !392, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !314, line: 247, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 226, size: 32, elements: !396)
!396 = !{!397, !415}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !395, file: !314, line: 245, baseType: !398, size: 32)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !395, file: !314, line: 227, size: 32, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !398, file: !314, line: 228, baseType: !142, size: 1, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !398, file: !314, line: 229, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !398, file: !314, line: 230, baseType: !142, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !398, file: !314, line: 231, baseType: !142, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !398, file: !314, line: 232, baseType: !142, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !398, file: !314, line: 233, baseType: !142, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !398, file: !314, line: 234, baseType: !142, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !398, file: !314, line: 235, baseType: !142, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !398, file: !314, line: 236, baseType: !142, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !398, file: !314, line: 237, baseType: !142, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !398, file: !314, line: 238, baseType: !142, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !398, file: !314, line: 239, baseType: !142, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !398, file: !314, line: 241, baseType: !142, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !398, file: !314, line: 242, baseType: !142, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !398, file: !314, line: 243, baseType: !142, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !395, file: !314, line: 246, baseType: !142, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !315, file: !314, line: 904, baseType: !417, size: 16, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !314, line: 300, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 287, size: 16, elements: !420)
!420 = !{!421, !431}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !419, file: !314, line: 298, baseType: !422, size: 16)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !419, file: !314, line: 288, size: 16, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !429, !430}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !422, file: !314, line: 290, baseType: !200, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !422, file: !314, line: 291, baseType: !200, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !422, file: !314, line: 293, baseType: !200, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !422, file: !314, line: 294, baseType: !200, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !422, file: !314, line: 295, baseType: !200, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !422, file: !314, line: 296, baseType: !200, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !422, file: !314, line: 297, baseType: !200, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !419, file: !314, line: 299, baseType: !200, size: 16)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !315, file: !314, line: 905, baseType: !205, size: 16, offset: 144)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !315, file: !314, line: 906, baseType: !434, size: 16, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !314, line: 352, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 336, size: 16, elements: !437)
!437 = !{!438, !450}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !436, file: !314, line: 350, baseType: !439, size: 16)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !314, line: 337, size: 16, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !439, file: !314, line: 339, baseType: !200, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !439, file: !314, line: 340, baseType: !200, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !439, file: !314, line: 341, baseType: !200, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !439, file: !314, line: 342, baseType: !200, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !439, file: !314, line: 343, baseType: !200, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !439, file: !314, line: 344, baseType: !200, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !439, file: !314, line: 345, baseType: !200, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !439, file: !314, line: 346, baseType: !200, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !439, file: !314, line: 348, baseType: !200, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !436, file: !314, line: 351, baseType: !200, size: 16)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !315, file: !314, line: 907, baseType: !205, size: 16, offset: 176)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !315, file: !314, line: 908, baseType: !453, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !314, line: 398, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 381, size: 32, elements: !456)
!456 = !{!457, !468}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !455, file: !314, line: 396, baseType: !458, size: 32)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !455, file: !314, line: 382, size: 32, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !458, file: !314, line: 384, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !458, file: !314, line: 385, baseType: !142, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !458, file: !314, line: 386, baseType: !142, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !458, file: !314, line: 388, baseType: !142, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !458, file: !314, line: 389, baseType: !142, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !458, file: !314, line: 390, baseType: !142, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !458, file: !314, line: 392, baseType: !142, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !458, file: !314, line: 394, baseType: !142, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !455, file: !314, line: 397, baseType: !142, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !315, file: !314, line: 909, baseType: !470, size: 8, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !314, line: 433, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 426, size: 8, elements: !473)
!473 = !{!474, !479}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !472, file: !314, line: 431, baseType: !475, size: 8)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !472, file: !314, line: 427, size: 8, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !475, file: !314, line: 428, baseType: !131, size: 5, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !475, file: !314, line: 430, baseType: !131, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !472, file: !314, line: 432, baseType: !131, size: 8)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !315, file: !314, line: 910, baseType: !249, size: 24, offset: 232)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !315, file: !314, line: 911, baseType: !482, size: 32, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !314, line: 462, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 448, size: 32, elements: !485)
!485 = !{!486, !495}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !484, file: !314, line: 460, baseType: !487, size: 32)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !484, file: !314, line: 449, size: 32, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !487, file: !314, line: 451, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !487, file: !314, line: 453, baseType: !142, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !487, file: !314, line: 454, baseType: !142, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !487, file: !314, line: 455, baseType: !142, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !487, file: !314, line: 457, baseType: !142, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !487, file: !314, line: 459, baseType: !142, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !484, file: !314, line: 461, baseType: !142, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !315, file: !314, line: 912, baseType: !497, size: 16, offset: 288)
!497 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !314, line: 520, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 503, size: 16, elements: !500)
!500 = !{!501, !515}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !499, file: !314, line: 518, baseType: !502, size: 16)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !499, file: !314, line: 504, size: 16, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !502, file: !314, line: 506, baseType: !200, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !502, file: !314, line: 507, baseType: !200, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !502, file: !314, line: 508, baseType: !200, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !502, file: !314, line: 509, baseType: !200, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !502, file: !314, line: 510, baseType: !200, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !502, file: !314, line: 511, baseType: !200, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !502, file: !314, line: 512, baseType: !200, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !502, file: !314, line: 513, baseType: !200, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !502, file: !314, line: 514, baseType: !200, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !502, file: !314, line: 515, baseType: !200, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !502, file: !314, line: 516, baseType: !200, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !499, file: !314, line: 519, baseType: !200, size: 16)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !315, file: !314, line: 913, baseType: !205, size: 16, offset: 304)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !315, file: !314, line: 914, baseType: !518, size: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !314, line: 559, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 552, size: 32, elements: !521)
!521 = !{!522, !528}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !520, file: !314, line: 557, baseType: !523, size: 32)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !520, file: !314, line: 553, size: 32, elements: !524)
!524 = !{!525, !526, !527}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !523, file: !314, line: 554, baseType: !142, size: 10, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !523, file: !314, line: 555, baseType: !142, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !523, file: !314, line: 556, baseType: !142, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !520, file: !314, line: 558, baseType: !142, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !315, file: !314, line: 915, baseType: !530, size: 32, offset: 352)
!530 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !314, line: 585, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 578, size: 32, elements: !533)
!533 = !{!534, !540}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !532, file: !314, line: 583, baseType: !535, size: 32)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !532, file: !314, line: 579, size: 32, elements: !536)
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !535, file: !314, line: 580, baseType: !142, size: 16, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !535, file: !314, line: 581, baseType: !142, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !535, file: !314, line: 582, baseType: !142, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !532, file: !314, line: 584, baseType: !142, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !315, file: !314, line: 916, baseType: !542, size: 8, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !314, line: 610, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 604, size: 8, elements: !545)
!545 = !{!546, !550}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !544, file: !314, line: 608, baseType: !547, size: 8)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !544, file: !314, line: 605, size: 8, elements: !548)
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !547, file: !314, line: 607, baseType: !131, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !544, file: !314, line: 609, baseType: !131, size: 8)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !315, file: !314, line: 917, baseType: !249, size: 24, offset: 392)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !315, file: !314, line: 918, baseType: !553, size: 32, offset: 416)
!553 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !314, line: 639, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 622, size: 32, elements: !556)
!556 = !{!557, !568}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !555, file: !314, line: 637, baseType: !558, size: 32)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !555, file: !314, line: 623, size: 32, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !558, file: !314, line: 625, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !558, file: !314, line: 626, baseType: !142, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !558, file: !314, line: 627, baseType: !142, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !558, file: !314, line: 629, baseType: !142, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !558, file: !314, line: 631, baseType: !142, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !558, file: !314, line: 632, baseType: !142, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !558, file: !314, line: 634, baseType: !142, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !558, file: !314, line: 635, baseType: !142, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !555, file: !314, line: 638, baseType: !142, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !315, file: !314, line: 919, baseType: !570, size: 32, offset: 448)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 32, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 4)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !315, file: !314, line: 920, baseType: !574, size: 16, offset: 480)
!574 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !314, line: 715, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 706, size: 16, elements: !577)
!577 = !{!578, !583}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !576, file: !314, line: 713, baseType: !579, size: 16)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !576, file: !314, line: 707, size: 16, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !579, file: !314, line: 709, baseType: !200, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !579, file: !314, line: 711, baseType: !200, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !576, file: !314, line: 714, baseType: !200, size: 16)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !315, file: !314, line: 921, baseType: !205, size: 16, offset: 496)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !315, file: !314, line: 922, baseType: !586, size: 32, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !314, line: 739, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 729, size: 32, elements: !589)
!589 = !{!590, !596}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !588, file: !314, line: 737, baseType: !591, size: 32)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !314, line: 730, size: 32, elements: !592)
!592 = !{!593, !594, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !591, file: !314, line: 732, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !591, file: !314, line: 733, baseType: !142, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !591, file: !314, line: 735, baseType: !142, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !588, file: !314, line: 738, baseType: !142, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !315, file: !314, line: 923, baseType: !598, size: 8, offset: 544)
!598 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !314, line: 765, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 756, size: 8, elements: !601)
!601 = !{!602, !608}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !600, file: !314, line: 763, baseType: !603, size: 8)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !600, file: !314, line: 757, size: 8, elements: !604)
!604 = !{!605, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !603, file: !314, line: 759, baseType: !131, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !603, file: !314, line: 761, baseType: !131, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !603, file: !314, line: 762, baseType: !131, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !600, file: !314, line: 764, baseType: !131, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !315, file: !314, line: 924, baseType: !249, size: 24, offset: 552)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !315, file: !314, line: 925, baseType: !611, size: 32, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !314, line: 789, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 781, size: 32, elements: !614)
!614 = !{!615, !620}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !613, file: !314, line: 787, baseType: !616, size: 32)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !613, file: !314, line: 782, size: 32, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !616, file: !314, line: 783, baseType: !142, size: 12, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !616, file: !314, line: 785, baseType: !142, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !613, file: !314, line: 788, baseType: !142, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !315, file: !314, line: 926, baseType: !622, size: 32, offset: 608)
!622 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !314, line: 820, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 805, size: 32, elements: !625)
!625 = !{!626, !636}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !624, file: !314, line: 818, baseType: !627, size: 32)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !624, file: !314, line: 806, size: 32, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !627, file: !314, line: 807, baseType: !142, size: 2, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !627, file: !314, line: 808, baseType: !142, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !627, file: !314, line: 809, baseType: !142, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !627, file: !314, line: 810, baseType: !142, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !627, file: !314, line: 812, baseType: !142, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !627, file: !314, line: 814, baseType: !142, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !627, file: !314, line: 816, baseType: !142, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !624, file: !314, line: 819, baseType: !142, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !315, file: !314, line: 927, baseType: !638, size: 8, offset: 640)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !314, line: 881, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !314, line: 872, size: 8, elements: !642)
!642 = !{!643, !650}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !641, file: !314, line: 879, baseType: !644, size: 8)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !641, file: !314, line: 873, size: 8, elements: !645)
!645 = !{!646, !647, !648, !649}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !644, file: !314, line: 874, baseType: !131, size: 1, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !644, file: !314, line: 875, baseType: !131, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !644, file: !314, line: 876, baseType: !131, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !644, file: !314, line: 877, baseType: !131, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !641, file: !314, line: 880, baseType: !131, size: 8)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !654, line: 290, baseType: !655)
!654 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !654, line: 284, size: 96, elements: !656)
!656 = !{!657, !667, !678, !691, !708}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !655, file: !654, line: 285, baseType: !658, size: 8)
!658 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !654, line: 49, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !654, line: 43, size: 8, elements: !661)
!661 = !{!662, !666}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !660, file: !654, line: 47, baseType: !663, size: 8)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !660, file: !654, line: 44, size: 8, elements: !664)
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !663, file: !654, line: 45, baseType: !131, size: 1, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !660, file: !654, line: 48, baseType: !131, size: 8)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !655, file: !654, line: 286, baseType: !668, size: 8, offset: 8)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !654, line: 67, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !654, line: 61, size: 8, elements: !672)
!672 = !{!673, !677}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !671, file: !654, line: 65, baseType: !674, size: 8)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !654, line: 62, size: 8, elements: !675)
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !674, file: !654, line: 64, baseType: !131, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !671, file: !654, line: 66, baseType: !131, size: 8)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !655, file: !654, line: 287, baseType: !679, size: 16, offset: 16)
!679 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !654, line: 89, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !654, line: 79, size: 16, elements: !682)
!682 = !{!683, !690}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !681, file: !654, line: 87, baseType: !684, size: 16)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !681, file: !654, line: 80, size: 16, elements: !685)
!685 = !{!686, !687, !688, !689}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !684, file: !654, line: 81, baseType: !200, size: 6, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !684, file: !654, line: 83, baseType: !200, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !684, file: !654, line: 85, baseType: !200, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !684, file: !654, line: 86, baseType: !200, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !681, file: !654, line: 88, baseType: !200, size: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !655, file: !654, line: 288, baseType: !692, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !654, line: 214, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !654, line: 199, size: 32, elements: !695)
!695 = !{!696, !707}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !694, file: !654, line: 212, baseType: !697, size: 32)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !694, file: !654, line: 200, size: 32, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !697, file: !654, line: 201, baseType: !142, size: 4, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !697, file: !654, line: 203, baseType: !142, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !697, file: !654, line: 205, baseType: !142, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !697, file: !654, line: 206, baseType: !142, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !697, file: !654, line: 207, baseType: !142, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !697, file: !654, line: 208, baseType: !142, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !697, file: !654, line: 209, baseType: !142, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !697, file: !654, line: 210, baseType: !142, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !694, file: !654, line: 213, baseType: !142, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !655, file: !654, line: 289, baseType: !709, size: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !654, line: 268, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !654, line: 260, size: 32, elements: !712)
!712 = !{!713, !718}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !711, file: !654, line: 266, baseType: !714, size: 32)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !711, file: !654, line: 261, size: 32, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !714, file: !654, line: 262, baseType: !142, size: 4, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !714, file: !654, line: 264, baseType: !142, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !711, file: !654, line: 267, baseType: !142, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !721, line: 513, baseType: !722)
!721 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !721, line: 494, size: 480, elements: !723)
!723 = !{!724, !730, !740, !744, !754, !764, !774, !784, !788, !804, !820, !836, !866, !870, !880, !890, !900, !904}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !722, file: !721, line: 495, baseType: !725, size: 8)
!725 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !721, line: 45, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 43, size: 8, elements: !728)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !727, file: !721, line: 44, baseType: !131, size: 8)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !722, file: !721, line: 496, baseType: !731, size: 8, offset: 8)
!731 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !721, line: 61, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 55, size: 8, elements: !734)
!734 = !{!735, !739}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !733, file: !721, line: 59, baseType: !736, size: 8)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !733, file: !721, line: 56, size: 8, elements: !737)
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !736, file: !721, line: 57, baseType: !131, size: 2, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !733, file: !721, line: 60, baseType: !131, size: 8)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !722, file: !721, line: 497, baseType: !741, size: 48, offset: 16)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 48, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 6)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !722, file: !721, line: 498, baseType: !745, size: 8, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !721, line: 86, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 80, size: 8, elements: !748)
!748 = !{!749, !753}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !747, file: !721, line: 84, baseType: !750, size: 8)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !747, file: !721, line: 81, size: 8, elements: !751)
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !750, file: !721, line: 82, baseType: !131, size: 3, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !747, file: !721, line: 85, baseType: !131, size: 8)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !722, file: !721, line: 499, baseType: !755, size: 8, offset: 72)
!755 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !721, line: 121, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 115, size: 8, elements: !758)
!758 = !{!759, !763}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !757, file: !721, line: 119, baseType: !760, size: 8)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !757, file: !721, line: 116, size: 8, elements: !761)
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !760, file: !721, line: 117, baseType: !131, size: 3, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !757, file: !721, line: 120, baseType: !131, size: 8)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !722, file: !721, line: 500, baseType: !765, size: 8, offset: 80)
!765 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !721, line: 156, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 150, size: 8, elements: !768)
!768 = !{!769, !773}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !767, file: !721, line: 154, baseType: !770, size: 8)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !767, file: !721, line: 151, size: 8, elements: !771)
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !770, file: !721, line: 152, baseType: !131, size: 3, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !767, file: !721, line: 155, baseType: !131, size: 8)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !722, file: !721, line: 501, baseType: !775, size: 8, offset: 88)
!775 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !721, line: 191, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 185, size: 8, elements: !778)
!778 = !{!779, !783}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !777, file: !721, line: 189, baseType: !780, size: 8)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !777, file: !721, line: 186, size: 8, elements: !781)
!781 = !{!782}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !780, file: !721, line: 187, baseType: !131, size: 3, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !777, file: !721, line: 190, baseType: !131, size: 8)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !722, file: !721, line: 502, baseType: !785, size: 64, offset: 96)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 64, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 8)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !722, file: !721, line: 503, baseType: !789, size: 32, offset: 160)
!789 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !721, line: 232, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 220, size: 32, elements: !792)
!792 = !{!793, !803}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !791, file: !721, line: 230, baseType: !794, size: 32)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !791, file: !721, line: 221, size: 32, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !794, file: !721, line: 222, baseType: !142, size: 1, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !794, file: !721, line: 223, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !794, file: !721, line: 224, baseType: !142, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !794, file: !721, line: 225, baseType: !142, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !794, file: !721, line: 226, baseType: !142, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !794, file: !721, line: 227, baseType: !142, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !794, file: !721, line: 228, baseType: !142, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !791, file: !721, line: 231, baseType: !142, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !722, file: !721, line: 504, baseType: !805, size: 32, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !721, line: 268, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 256, size: 32, elements: !808)
!808 = !{!809, !819}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !807, file: !721, line: 266, baseType: !810, size: 32)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !807, file: !721, line: 257, size: 32, elements: !811)
!811 = !{!812, !813, !814, !815, !816, !817, !818}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !810, file: !721, line: 258, baseType: !142, size: 1, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !810, file: !721, line: 259, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !810, file: !721, line: 260, baseType: !142, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !810, file: !721, line: 261, baseType: !142, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !810, file: !721, line: 262, baseType: !142, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !810, file: !721, line: 263, baseType: !142, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !810, file: !721, line: 264, baseType: !142, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !807, file: !721, line: 267, baseType: !142, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !722, file: !721, line: 505, baseType: !821, size: 32, offset: 224)
!821 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !721, line: 304, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 292, size: 32, elements: !824)
!824 = !{!825, !835}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !823, file: !721, line: 302, baseType: !826, size: 32)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !721, line: 293, size: 32, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !826, file: !721, line: 294, baseType: !142, size: 1, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !826, file: !721, line: 295, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !826, file: !721, line: 296, baseType: !142, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !826, file: !721, line: 297, baseType: !142, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !826, file: !721, line: 298, baseType: !142, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !826, file: !721, line: 299, baseType: !142, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !826, file: !721, line: 300, baseType: !142, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !823, file: !721, line: 303, baseType: !142, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !722, file: !721, line: 506, baseType: !837, size: 32, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !721, line: 354, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 328, size: 32, elements: !840)
!840 = !{!841, !865}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !839, file: !721, line: 352, baseType: !842, size: 32)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !839, file: !721, line: 329, size: 32, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !842, file: !721, line: 330, baseType: !142, size: 1, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !842, file: !721, line: 331, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !842, file: !721, line: 332, baseType: !142, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !842, file: !721, line: 333, baseType: !142, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !842, file: !721, line: 334, baseType: !142, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !842, file: !721, line: 335, baseType: !142, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !842, file: !721, line: 336, baseType: !142, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !842, file: !721, line: 337, baseType: !142, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !842, file: !721, line: 338, baseType: !142, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !842, file: !721, line: 339, baseType: !142, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !842, file: !721, line: 340, baseType: !142, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !842, file: !721, line: 341, baseType: !142, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !842, file: !721, line: 342, baseType: !142, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !842, file: !721, line: 343, baseType: !142, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !842, file: !721, line: 344, baseType: !142, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !842, file: !721, line: 345, baseType: !142, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !842, file: !721, line: 346, baseType: !142, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !842, file: !721, line: 347, baseType: !142, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_", scope: !842, file: !721, line: 348, baseType: !142, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "PTC_", scope: !842, file: !721, line: 349, baseType: !142, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_", scope: !842, file: !721, line: 350, baseType: !142, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !839, file: !721, line: 353, baseType: !142, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !722, file: !721, line: 507, baseType: !867, size: 128, offset: 288)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 128, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 16)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !722, file: !721, line: 508, baseType: !871, size: 8, offset: 416)
!871 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENCLR_Type", file: !721, line: 412, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 406, size: 8, elements: !874)
!874 = !{!875, !879}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !873, file: !721, line: 410, baseType: !876, size: 8)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !873, file: !721, line: 407, size: 8, elements: !877)
!877 = !{!878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !876, file: !721, line: 408, baseType: !131, size: 1, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !873, file: !721, line: 411, baseType: !131, size: 8)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !722, file: !721, line: 509, baseType: !881, size: 8, offset: 424)
!881 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENSET_Type", file: !721, line: 430, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 424, size: 8, elements: !884)
!884 = !{!885, !889}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !883, file: !721, line: 428, baseType: !886, size: 8)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !721, line: 425, size: 8, elements: !887)
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !886, file: !721, line: 426, baseType: !131, size: 1, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !883, file: !721, line: 429, baseType: !131, size: 8)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !722, file: !721, line: 510, baseType: !891, size: 8, offset: 432)
!891 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTFLAG_Type", file: !721, line: 448, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !721, line: 442, size: 8, elements: !894)
!894 = !{!895, !899}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !893, file: !721, line: 446, baseType: !896, size: 8)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !893, file: !721, line: 443, size: 8, elements: !897)
!897 = !{!898}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !896, file: !721, line: 444, baseType: !208, size: 1, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !893, file: !721, line: 447, baseType: !131, size: 8)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !722, file: !721, line: 511, baseType: !901, size: 8, offset: 440)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 8, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 1)
