; ModuleID = 'build/adafruit_feather_m0_basic_proto/subsys/zbus/work_queue/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.zbus_observer = type { i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type { i32 }
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/work_queue/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/work_queue")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/work_queue")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !27, file: !106, line: 16, type: !282, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !323, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/work_queue/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/work_queue")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !307, !319, !190, !321}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_wq_info", file: !106, line: 68, size: 192, elements: !107)
!106 = !DIFile(filename: "zephyr/samples/subsys/zbus/work_queue/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!107 = !{!108, !263, !318}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !105, file: !106, line: 69, baseType: !109, size: 128)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !110, line: 3663, size: 128, elements: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112, !119, !125, !262}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !109, file: !110, line: 3669, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !114, line: 33, baseType: !115)
!114 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !114, line: 29, size: 32, elements: !116)
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !114, line: 30, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !109, file: !110, line: 3672, baseType: !120, size: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !110, line: 3071, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !109, file: !110, line: 3675, baseType: !126, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !110, line: 3810, size: 1408, elements: !128)
!128 = !{!129, !252, !259, !260, !261}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !127, file: !110, line: 3812, baseType: !130, size: 1152)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !131, line: 245, size: 1152, elements: !132)
!131 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!132 = !{!133, !205, !218, !219, !220, !225, !226, !247}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !130, file: !131, line: 247, baseType: !134, size: 384)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !131, line: 57, size: 384, elements: !135)
!135 = !{!136, !164, !172, !175, !176, !189, !191, !192}
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !131, line: 60, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !131, line: 60, size: 64, elements: !138)
!138 = !{!139, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !137, file: !131, line: 61, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !141, line: 49, baseType: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !141, line: 37, size: 64, elements: !143)
!143 = !{!144, !150}
!144 = !DIDerivedType(tag: DW_TAG_member, scope: !142, file: !141, line: 38, baseType: !145, size: 32)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !141, line: 38, size: 32, elements: !146)
!146 = !{!147, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !145, file: !141, line: 39, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !141, line: 40, baseType: !148, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, scope: !142, file: !141, line: 42, baseType: !151, size: 32, offset: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !141, line: 42, size: 32, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !151, file: !141, line: 43, baseType: !148, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !151, file: !141, line: 44, baseType: !148, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !137, file: !131, line: 62, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !156, file: !157, line: 50, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!162 = !{!163}
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !134, file: !131, line: 68, baseType: !165, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !167, line: 233, baseType: !168)
!167 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 231, size: 64, elements: !169)
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !168, file: !167, line: 232, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !141, line: 48, baseType: !142)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !134, file: !131, line: 71, baseType: !173, size: 8, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !174)
!174 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !134, file: !131, line: 74, baseType: !173, size: 8, offset: 104)
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !131, line: 90, baseType: !177, size: 16, offset: 112)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !131, line: 90, size: 16, elements: !178)
!178 = !{!179, !186}
!179 = !DIDerivedType(tag: DW_TAG_member, scope: !177, file: !131, line: 91, baseType: !180, size: 16)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !131, line: 91, size: 16, elements: !181)
!181 = !{!182, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !180, file: !131, line: 96, baseType: !183, size: 8)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !184)
!184 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !180, file: !131, line: 97, baseType: !173, size: 8, offset: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !177, file: !131, line: 100, baseType: !187, size: 16)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !188)
!188 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !134, file: !131, line: 107, baseType: !190, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !134, file: !131, line: 127, baseType: !102, size: 32, offset: 160)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !134, file: !131, line: 131, baseType: !193, size: 192, offset: 192)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !167, line: 244, size: 192, elements: !194)
!194 = !{!195, !196, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !193, file: !167, line: 245, baseType: !140, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !193, file: !167, line: 246, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !167, line: 242, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !193, file: !167, line: 249, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !204)
!204 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !130, file: !131, line: 250, baseType: !206, size: 288, offset: 384)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !207, line: 25, size: 288, elements: !208)
!207 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !206, file: !207, line: 26, baseType: !190, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !206, file: !207, line: 27, baseType: !190, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !206, file: !207, line: 28, baseType: !190, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !206, file: !207, line: 29, baseType: !190, size: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !206, file: !207, line: 30, baseType: !190, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !206, file: !207, line: 31, baseType: !190, size: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !206, file: !207, line: 32, baseType: !190, size: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !206, file: !207, line: 33, baseType: !190, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !206, file: !207, line: 34, baseType: !190, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !130, file: !131, line: 253, baseType: !102, size: 32, offset: 672)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !130, file: !131, line: 256, baseType: !166, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !131, line: 279, baseType: !221, size: 256, offset: 768)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 256, elements: !223)
!222 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!223 = !{!224}
!224 = !DISubrange(count: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !130, file: !131, line: 294, baseType: !103, size: 32, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !130, file: !131, line: 325, baseType: !227, size: 32, offset: 1056)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !110, line: 5073, size: 192, elements: !229)
!229 = !{!230, !241, !242}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !228, file: !110, line: 5074, baseType: !231, size: 96)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !232, line: 56, size: 96, elements: !233)
!232 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = !{!234, !237, !238}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !231, file: !232, line: 57, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !232, line: 57, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !231, file: !232, line: 58, baseType: !102, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !231, file: !232, line: 59, baseType: !239, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !240, line: 214, baseType: !32)
!240 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !228, file: !110, line: 5075, baseType: !166, size: 64, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !228, file: !110, line: 5076, baseType: !243, size: 32, offset: 160)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, size: 32, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !243, file: !244, line: 52, baseType: !22, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !130, file: !131, line: 343, baseType: !248, size: 64, offset: 1088)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !207, line: 60, size: 64, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !248, file: !207, line: 63, baseType: !190, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !248, file: !207, line: 66, baseType: !190, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !127, file: !110, line: 3819, baseType: !253, size: 64, offset: 1152)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !114, line: 40, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !114, line: 35, size: 64, elements: !255)
!255 = !{!256, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !254, file: !114, line: 36, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !254, file: !114, line: 37, baseType: !257, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !127, file: !110, line: 3822, baseType: !166, size: 64, offset: 1216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !127, file: !110, line: 3825, baseType: !166, size: 64, offset: 1280)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !127, file: !110, line: 3828, baseType: !190, size: 32, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !109, file: !110, line: 3683, baseType: !190, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !105, file: !106, line: 70, baseType: !264, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !267, line: 29, size: 192, elements: !268)
!267 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!268 = !{!269, !271, !273, !274, !280, !289}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !266, file: !267, line: 35, baseType: !270, size: 16)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !266, file: !267, line: 40, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !266, file: !267, line: 45, baseType: !272, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !266, file: !267, line: 51, baseType: !275, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{!279, !13, !239}
!279 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !266, file: !267, line: 56, baseType: !281, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !110, line: 2720, size: 160, elements: !283)
!283 = !{!284, !285, !287, !288}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !282, file: !110, line: 2722, baseType: !166, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !282, file: !110, line: 2724, baseType: !286, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !282, file: !110, line: 2727, baseType: !190, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !282, file: !110, line: 2730, baseType: !103, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !266, file: !267, line: 67, baseType: !290, size: 32, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !267, line: 85, size: 96, elements: !295)
!295 = !{!296, !297, !313}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !294, file: !267, line: 91, baseType: !279, size: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !294, file: !267, line: 93, baseType: !298, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !110, line: 4204, size: 352, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !308, !309, !310, !311, !312}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !300, file: !110, line: 4206, baseType: !166, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !300, file: !110, line: 4208, baseType: !243, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !300, file: !110, line: 4210, baseType: !239, size: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !300, file: !110, line: 4212, baseType: !190, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !300, file: !110, line: 4214, baseType: !307, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !300, file: !110, line: 4216, baseType: !307, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !300, file: !110, line: 4218, baseType: !307, size: 32, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !300, file: !110, line: 4220, baseType: !307, size: 32, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !300, file: !110, line: 4222, baseType: !190, size: 32, offset: 288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !110, line: 4227, baseType: !173, size: 8, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !294, file: !267, line: 96, baseType: !314, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !264}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !105, file: !106, line: 71, baseType: !173, size: 8, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !320, line: 46, baseType: !203)
!320 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !322)
!322 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!323 = !{!25, !324, !326, !328, !330, !332, !334, !336, !338, !340, !342, !344, !346, !379, !383, !385, !387, !389, !391, !393, !395, !397, !399, !404, !409, !411, !413, !415, !417, !419, !421, !423, !431, !436, !443, !448, !450, !452}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "version_chan", scope: !27, file: !106, line: 16, type: !265, isLocal: false, isDefinition: true, align: 32)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "_zbus_mutex_sensor_data_chan", scope: !27, file: !106, line: 26, type: !282, isLocal: true, isDefinition: true, align: 32)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "sensor_data_chan", scope: !27, file: !106, line: 26, type: !265, isLocal: false, isDefinition: true, align: 32)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "fast_handler1_lis", scope: !27, file: !106, line: 46, type: !294, isLocal: false, isDefinition: true, align: 32)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "fast_handler2_lis", scope: !27, file: !106, line: 56, type: !294, isLocal: false, isDefinition: true, align: 32)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "fast_handler3_lis", scope: !27, file: !106, line: 66, type: !294, isLocal: false, isDefinition: true, align: 32)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "delay_handler1_lis", scope: !27, file: !106, line: 97, type: !294, isLocal: false, isDefinition: true, align: 32)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "delay_handler2_lis", scope: !27, file: !106, line: 106, type: !294, isLocal: false, isDefinition: true, align: 32)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "delay_handler3_lis", scope: !27, file: !106, line: 115, type: !294, isLocal: false, isDefinition: true, align: 32)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_thread_handler1_sub", scope: !27, file: !106, line: 128, type: !300, isLocal: false, isDefinition: true, align: 32)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "thread_handler1_sub", scope: !27, file: !106, line: 128, type: !294, isLocal: false, isDefinition: true, align: 32)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_handler1_id", scope: !27, file: !106, line: 145, type: !348, isLocal: false, isDefinition: true, align: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !110, line: 620, size: 384, elements: !349)
!349 = !{!350, !351, !359, !360, !365, !366, !367, !368, !369, !370, !372, !376}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !348, file: !110, line: 621, baseType: !286, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !348, file: !110, line: 622, baseType: !352, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !354, line: 44, baseType: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !356, line: 47, size: 8, elements: !357)
!356 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = !{!358}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !355, file: !356, line: 48, baseType: !222, size: 8)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !348, file: !110, line: 623, baseType: !32, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !348, file: !110, line: 624, baseType: !361, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !354, line: 46, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !102, !102, !102}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !348, file: !110, line: 625, baseType: !102, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !348, file: !110, line: 626, baseType: !102, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !348, file: !110, line: 627, baseType: !102, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !348, file: !110, line: 628, baseType: !103, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !348, file: !110, line: 629, baseType: !190, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !348, file: !110, line: 630, baseType: !371, size: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !348, file: !110, line: 631, baseType: !373, size: 32, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DISubroutineType(types: !375)
!375 = !{null}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !348, file: !110, line: 632, baseType: !377, size: 32, offset: 352)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "thread_handler1_id", scope: !27, file: !106, line: 145, type: !381, isLocal: false, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !131, line: 347, baseType: !286)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_thread_handler2_sub", scope: !27, file: !106, line: 147, type: !300, isLocal: false, isDefinition: true, align: 32)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "thread_handler2_sub", scope: !27, file: !106, line: 147, type: !294, isLocal: false, isDefinition: true, align: 32)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_handler2_id", scope: !27, file: !106, line: 164, type: !348, isLocal: false, isDefinition: true, align: 32)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "thread_handler2_id", scope: !27, file: !106, line: 164, type: !381, isLocal: false, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_thread_handler3_sub", scope: !27, file: !106, line: 166, type: !300, isLocal: false, isDefinition: true, align: 32)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "thread_handler3_sub", scope: !27, file: !106, line: 166, type: !294, isLocal: false, isDefinition: true, align: 32)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_handler3_id", scope: !27, file: !106, line: 183, type: !348, isLocal: false, isDefinition: true, align: 32)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "thread_handler3_id", scope: !27, file: !106, line: 183, type: !381, isLocal: false, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_thread_handler1_sub", scope: !27, file: !106, line: 128, type: !401, isLocal: true, isDefinition: true, align: 32)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 128, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 16)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_handler1_id", scope: !27, file: !106, line: 145, type: !406, isLocal: false, isDefinition: true, align: 64)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 8192, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 1024)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_handler1_id", scope: !27, file: !106, line: 145, type: !130, isLocal: false, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_thread_handler2_sub", scope: !27, file: !106, line: 147, type: !401, isLocal: true, isDefinition: true, align: 32)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_handler2_id", scope: !27, file: !106, line: 164, type: !406, isLocal: false, isDefinition: true, align: 64)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_handler2_id", scope: !27, file: !106, line: 164, type: !130, isLocal: false, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_thread_handler3_sub", scope: !27, file: !106, line: 166, type: !401, isLocal: true, isDefinition: true, align: 32)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_handler3_id", scope: !27, file: !106, line: 183, type: !406, isLocal: false, isDefinition: true, align: 64)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_handler3_id", scope: !27, file: !106, line: 183, type: !130, isLocal: false, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !27, file: !106, line: 16, type: !425, isLocal: true, isDefinition: true)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !426, line: 9, size: 32, elements: !427)
!426 = !DIFile(filename: "zephyr/samples/subsys/zbus/work_queue/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !425, file: !426, line: 10, baseType: !173, size: 8)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !425, file: !426, line: 11, baseType: !173, size: 8, offset: 8)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !425, file: !426, line: 12, baseType: !187, size: 16, offset: 16)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !27, file: !106, line: 16, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 32, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 1)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "_zbus_message_sensor_data_chan", scope: !27, file: !106, line: 26, type: !438, isLocal: true, isDefinition: true)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_msg", file: !426, line: 15, size: 96, elements: !439)
!439 = !{!440, !441, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !438, file: !426, line: 16, baseType: !190, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "press", scope: !438, file: !426, line: 17, baseType: !190, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "humidity", scope: !438, file: !426, line: 18, baseType: !190, size: 32, offset: 64)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "_zbus_observers_sensor_data_chan", scope: !27, file: !106, line: 26, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 320, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 10)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "wq_handler1", scope: !27, file: !106, line: 74, type: !105, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "wq_handler2", scope: !27, file: !106, line: 75, type: !105, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "wq_handler3", scope: !27, file: !106, line: 76, type: !105, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "_k_thread_obj_peripheral_thread_id", scope: !456, file: !462, line: 30, type: !467, isLocal: false, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !458, globals: !459, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/work_queue/src/sensors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/work_queue")
!458 = !{!319, !102, !103, !190, !321}
!459 = !{!460, !579, !583, !454}
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "_k_thread_data_peripheral_thread_id", scope: !456, file: !462, line: 30, type: !463, isLocal: false, isDefinition: true, align: 32)
!462 = !DIFile(filename: "zephyr/samples/subsys/zbus/work_queue/src/sensors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !110, line: 620, size: 384, elements: !464)
!464 = !{!465, !563, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !463, file: !110, line: 621, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !131, line: 245, size: 1152, elements: !468)
!468 = !{!469, !527, !539, !540, !541, !542, !543, !558}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !467, file: !131, line: 247, baseType: !470, size: 384)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !131, line: 57, size: 384, elements: !471)
!471 = !{!472, !496, !503, !504, !505, !514, !515, !516}
!472 = !DIDerivedType(tag: DW_TAG_member, scope: !470, file: !131, line: 60, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !470, file: !131, line: 60, size: 64, elements: !474)
!474 = !{!475, !490}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !473, file: !131, line: 61, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !141, line: 49, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !141, line: 37, size: 64, elements: !478)
!478 = !{!479, !485}
!479 = !DIDerivedType(tag: DW_TAG_member, scope: !477, file: !141, line: 38, baseType: !480, size: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !477, file: !141, line: 38, size: 32, elements: !481)
!481 = !{!482, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !480, file: !141, line: 39, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !480, file: !141, line: 40, baseType: !483, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, scope: !477, file: !141, line: 42, baseType: !486, size: 32, offset: 32)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !477, file: !141, line: 42, size: 32, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !486, file: !141, line: 43, baseType: !483, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !486, file: !141, line: 44, baseType: !483, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !473, file: !131, line: 62, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !491, file: !157, line: 50, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 64, elements: !162)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !470, file: !131, line: 68, baseType: !497, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !167, line: 233, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 231, size: 64, elements: !500)
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !499, file: !167, line: 232, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !141, line: 48, baseType: !477)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !470, file: !131, line: 71, baseType: !173, size: 8, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !470, file: !131, line: 74, baseType: !173, size: 8, offset: 104)
!505 = !DIDerivedType(tag: DW_TAG_member, scope: !470, file: !131, line: 90, baseType: !506, size: 16, offset: 112)
!506 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !470, file: !131, line: 90, size: 16, elements: !507)
!507 = !{!508, !513}
!508 = !DIDerivedType(tag: DW_TAG_member, scope: !506, file: !131, line: 91, baseType: !509, size: 16)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !506, file: !131, line: 91, size: 16, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !509, file: !131, line: 96, baseType: !183, size: 8)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !509, file: !131, line: 97, baseType: !173, size: 8, offset: 8)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !506, file: !131, line: 100, baseType: !187, size: 16)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !470, file: !131, line: 107, baseType: !190, size: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !470, file: !131, line: 127, baseType: !102, size: 32, offset: 160)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !470, file: !131, line: 131, baseType: !517, size: 192, offset: 192)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !167, line: 244, size: 192, elements: !518)
!518 = !{!519, !520, !526}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !517, file: !167, line: 245, baseType: !476, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !517, file: !167, line: 246, baseType: !521, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !167, line: 242, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !517, file: !167, line: 249, baseType: !203, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !467, file: !131, line: 250, baseType: !528, size: 288, offset: 384)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !207, line: 25, size: 288, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !528, file: !207, line: 26, baseType: !190, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !528, file: !207, line: 27, baseType: !190, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !528, file: !207, line: 28, baseType: !190, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !528, file: !207, line: 29, baseType: !190, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !528, file: !207, line: 30, baseType: !190, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !528, file: !207, line: 31, baseType: !190, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !528, file: !207, line: 32, baseType: !190, size: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !528, file: !207, line: 33, baseType: !190, size: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !528, file: !207, line: 34, baseType: !190, size: 32, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !467, file: !131, line: 253, baseType: !102, size: 32, offset: 672)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !467, file: !131, line: 256, baseType: !498, size: 64, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !467, file: !131, line: 279, baseType: !221, size: 256, offset: 768)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !467, file: !131, line: 294, baseType: !103, size: 32, offset: 1024)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !467, file: !131, line: 325, baseType: !544, size: 32, offset: 1056)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !110, line: 5073, size: 192, elements: !546)
!546 = !{!547, !553, !554}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !545, file: !110, line: 5074, baseType: !548, size: 96)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !232, line: 56, size: 96, elements: !549)
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !548, file: !232, line: 57, baseType: !235, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !548, file: !232, line: 58, baseType: !102, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !548, file: !232, line: 59, baseType: !239, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !545, file: !110, line: 5075, baseType: !498, size: 64, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !545, file: !110, line: 5076, baseType: !555, size: 32, offset: 160)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, size: 32, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !555, file: !244, line: 52, baseType: !22, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !467, file: !131, line: 343, baseType: !559, size: 64, offset: 1088)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !207, line: 60, size: 64, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !559, file: !207, line: 63, baseType: !190, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !559, file: !207, line: 66, baseType: !190, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !463, file: !110, line: 622, baseType: !564, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !354, line: 44, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !356, line: 47, size: 8, elements: !567)
!567 = !{!568}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !566, file: !356, line: 48, baseType: !222, size: 8)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !463, file: !110, line: 623, baseType: !32, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !463, file: !110, line: 624, baseType: !361, size: 32, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !463, file: !110, line: 625, baseType: !102, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !463, file: !110, line: 626, baseType: !102, size: 32, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !463, file: !110, line: 627, baseType: !102, size: 32, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !463, file: !110, line: 628, baseType: !103, size: 32, offset: 224)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !463, file: !110, line: 629, baseType: !190, size: 32, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !463, file: !110, line: 630, baseType: !371, size: 32, offset: 288)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !463, file: !110, line: 631, baseType: !373, size: 32, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !463, file: !110, line: 632, baseType: !377, size: 32, offset: 352)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "peripheral_thread_id", scope: !456, file: !462, line: 30, type: !581, isLocal: false, isDefinition: true)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !131, line: 347, baseType: !466)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "_k_thread_stack_peripheral_thread_id", scope: !456, file: !462, line: 30, type: !585, isLocal: false, isDefinition: true, align: 64)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 8192, elements: !407)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !588, file: !603, line: 18, type: !604, isLocal: false, isDefinition: true)
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !590, globals: !602, splitDebugInlining: false, nameTableKind: None)
!589 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/work_queue")
!590 = !{!22, !102, !24, !591, !593, !595, !239, !103, !596, !597, !599, !600, !307, !601, !187, !377}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!602 = !{!586}
!603 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !606, line: 16, size: 64, elements: !607)
!606 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !606, line: 17, baseType: !377, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !605, file: !606, line: 18, baseType: !173, size: 8, offset: 32)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "_char_out", scope: !612, file: !616, line: 54, type: !617, isLocal: false, isDefinition: true)
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !614, globals: !615, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/work_queue")
!614 = !{!102, !103}
!615 = !{!610}
!616 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DISubroutineType(types: !619)
!619 = !{!103, !103}
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !622, file: !1352, line: 202, type: !1353, isLocal: true, isDefinition: true, align: 32)
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !624, globals: !1351, splitDebugInlining: false, nameTableKind: None)
!623 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/work_queue")
!624 = !{!102, !103, !625, !747, !1086, !1087, !1154}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !627, line: 335, baseType: !628)
!627 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 320, size: 288, elements: !629)
!629 = !{!630, !641, !647, !661, !672, !683, !687, !698, !699, !710, !711, !726, !727, !737}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !628, file: !627, line: 321, baseType: !631, size: 16)
!631 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !627, line: 50, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !627, line: 43, size: 16, elements: !634)
!634 = !{!635, !640}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !633, file: !627, line: 48, baseType: !636, size: 16)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !633, file: !627, line: 44, size: 16, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !636, file: !627, line: 45, baseType: !187, size: 7, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !636, file: !627, line: 47, baseType: !187, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !633, file: !627, line: 49, baseType: !187, size: 16)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !628, file: !627, line: 322, baseType: !642, size: 16, offset: 16)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 16, elements: !162)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !644, line: 52, baseType: !645)
!644 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !173)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !628, file: !627, line: 323, baseType: !648, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !627, line: 107, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !627, line: 94, size: 32, elements: !651)
!651 = !{!652, !660}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !650, file: !627, line: 105, baseType: !653, size: 32)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !650, file: !627, line: 95, size: 32, elements: !654)
!654 = !{!655, !656, !657, !658, !659}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !653, file: !627, line: 97, baseType: !190, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !653, file: !627, line: 99, baseType: !190, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !653, file: !627, line: 100, baseType: !190, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !653, file: !627, line: 102, baseType: !190, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !653, file: !627, line: 103, baseType: !190, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !650, file: !627, line: 106, baseType: !190, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !628, file: !627, line: 324, baseType: !662, size: 32, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !627, line: 155, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !627, line: 148, size: 32, elements: !665)
!665 = !{!666, !671}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !664, file: !627, line: 153, baseType: !667, size: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !627, line: 149, size: 32, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !667, file: !627, line: 150, baseType: !190, size: 16, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !667, file: !627, line: 151, baseType: !190, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !664, file: !627, line: 154, baseType: !190, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !628, file: !627, line: 325, baseType: !673, size: 8, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !627, line: 194, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !627, line: 187, size: 8, elements: !676)
!676 = !{!677, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !675, file: !627, line: 192, baseType: !678, size: 8)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !675, file: !627, line: 188, size: 8, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !678, file: !627, line: 189, baseType: !173, size: 1, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !678, file: !627, line: 190, baseType: !173, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !675, file: !627, line: 193, baseType: !173, size: 8)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !628, file: !627, line: 326, baseType: !684, size: 24, offset: 104)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 24, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 3)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !628, file: !627, line: 327, baseType: !688, size: 8, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !627, line: 215, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !627, line: 208, size: 8, elements: !691)
!691 = !{!692, !697}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !690, file: !627, line: 213, baseType: !693, size: 8)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !690, file: !627, line: 209, size: 8, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !693, file: !627, line: 210, baseType: !173, size: 1, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !693, file: !627, line: 211, baseType: !173, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !690, file: !627, line: 214, baseType: !173, size: 8)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !628, file: !627, line: 328, baseType: !684, size: 24, offset: 136)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !628, file: !627, line: 329, baseType: !700, size: 8, offset: 160)
!700 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !627, line: 236, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !627, line: 229, size: 8, elements: !703)
!703 = !{!704, !709}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !702, file: !627, line: 234, baseType: !705, size: 8)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !702, file: !627, line: 230, size: 8, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !705, file: !627, line: 231, baseType: !645, size: 1, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !705, file: !627, line: 232, baseType: !645, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !702, file: !627, line: 235, baseType: !173, size: 8)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !628, file: !627, line: 330, baseType: !684, size: 24, offset: 168)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !628, file: !627, line: 331, baseType: !712, size: 16, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !627, line: 262, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !627, line: 250, size: 16, elements: !715)
!715 = !{!716, !725}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !627, line: 260, baseType: !717, size: 16)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !627, line: 251, size: 16, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !717, file: !627, line: 252, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !717, file: !627, line: 253, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !717, file: !627, line: 254, baseType: !187, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !717, file: !627, line: 255, baseType: !187, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !717, file: !627, line: 256, baseType: !187, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !717, file: !627, line: 258, baseType: !187, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !627, line: 261, baseType: !187, size: 16)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !628, file: !627, line: 332, baseType: !642, size: 16, offset: 208)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !628, file: !627, line: 333, baseType: !728, size: 32, offset: 224)
!728 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !627, line: 290, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !627, line: 284, size: 32, elements: !731)
!731 = !{!732, !736}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !730, file: !627, line: 288, baseType: !733, size: 32)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !730, file: !627, line: 285, size: 32, elements: !734)
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !733, file: !627, line: 286, baseType: !190, size: 22, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !730, file: !627, line: 289, baseType: !190, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !628, file: !627, line: 334, baseType: !738, size: 16, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !627, line: 308, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !627, line: 303, size: 16, elements: !741)
!741 = !{!742, !746}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !740, file: !627, line: 306, baseType: !743, size: 16)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !740, file: !627, line: 304, size: 16, elements: !744)
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !743, file: !627, line: 305, baseType: !187, size: 16, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !740, file: !627, line: 307, baseType: !187, size: 16)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !749, line: 928, baseType: !750)
!749 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !749, line: 899, size: 672, elements: !751)
!751 = !{!752, !776, !800, !826, !851, !867, !868, !886, !887, !904, !915, !916, !931, !951, !952, !964, !976, !986, !987, !1004, !1008, !1019, !1020, !1032, !1044, !1045, !1056, !1072}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !750, file: !749, line: 900, baseType: !753, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !749, line: 64, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 43, size: 32, elements: !756)
!756 = !{!757, !775}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !755, file: !749, line: 62, baseType: !758, size: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !755, file: !749, line: 44, size: 32, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !758, file: !749, line: 45, baseType: !190, size: 1, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !758, file: !749, line: 46, baseType: !190, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !758, file: !749, line: 47, baseType: !190, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !758, file: !749, line: 48, baseType: !190, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !758, file: !749, line: 49, baseType: !190, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !758, file: !749, line: 50, baseType: !190, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !758, file: !749, line: 51, baseType: !190, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !758, file: !749, line: 52, baseType: !190, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !758, file: !749, line: 53, baseType: !190, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !758, file: !749, line: 54, baseType: !190, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !758, file: !749, line: 55, baseType: !190, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !758, file: !749, line: 56, baseType: !190, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !758, file: !749, line: 58, baseType: !190, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !758, file: !749, line: 59, baseType: !190, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !758, file: !749, line: 60, baseType: !190, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !755, file: !749, line: 63, baseType: !190, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !750, file: !749, line: 901, baseType: !777, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !749, line: 125, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 104, size: 32, elements: !780)
!780 = !{!781, !799}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !779, file: !749, line: 123, baseType: !782, size: 32)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !749, line: 105, size: 32, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !782, file: !749, line: 106, baseType: !190, size: 1, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !782, file: !749, line: 107, baseType: !190, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !782, file: !749, line: 108, baseType: !190, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !782, file: !749, line: 109, baseType: !190, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !782, file: !749, line: 110, baseType: !190, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !782, file: !749, line: 111, baseType: !190, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !782, file: !749, line: 112, baseType: !190, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !782, file: !749, line: 113, baseType: !190, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !782, file: !749, line: 114, baseType: !190, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !782, file: !749, line: 115, baseType: !190, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !782, file: !749, line: 116, baseType: !190, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !782, file: !749, line: 117, baseType: !190, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !782, file: !749, line: 119, baseType: !190, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !782, file: !749, line: 120, baseType: !190, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !782, file: !749, line: 121, baseType: !190, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !779, file: !749, line: 124, baseType: !190, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !750, file: !749, line: 902, baseType: !801, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !749, line: 186, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 165, size: 32, elements: !804)
!804 = !{!805, !825}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !803, file: !749, line: 184, baseType: !806, size: 32)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !803, file: !749, line: 166, size: 32, elements: !807)
!807 = !{!808, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !806, file: !749, line: 167, baseType: !809, size: 1, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !190)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !806, file: !749, line: 168, baseType: !809, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !806, file: !749, line: 169, baseType: !809, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !806, file: !749, line: 170, baseType: !809, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !806, file: !749, line: 171, baseType: !809, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !806, file: !749, line: 172, baseType: !809, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !806, file: !749, line: 173, baseType: !809, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !806, file: !749, line: 174, baseType: !809, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !806, file: !749, line: 175, baseType: !809, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !806, file: !749, line: 176, baseType: !809, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !806, file: !749, line: 177, baseType: !809, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !806, file: !749, line: 178, baseType: !809, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !806, file: !749, line: 180, baseType: !809, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !806, file: !749, line: 181, baseType: !809, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !806, file: !749, line: 182, baseType: !809, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !803, file: !749, line: 185, baseType: !190, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !750, file: !749, line: 903, baseType: !827, size: 32, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !749, line: 247, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 226, size: 32, elements: !831)
!831 = !{!832, !850}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !830, file: !749, line: 245, baseType: !833, size: 32)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !830, file: !749, line: 227, size: 32, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !833, file: !749, line: 228, baseType: !190, size: 1, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !833, file: !749, line: 229, baseType: !190, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !833, file: !749, line: 230, baseType: !190, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !833, file: !749, line: 231, baseType: !190, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !833, file: !749, line: 232, baseType: !190, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !833, file: !749, line: 233, baseType: !190, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !833, file: !749, line: 234, baseType: !190, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !833, file: !749, line: 235, baseType: !190, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !833, file: !749, line: 236, baseType: !190, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !833, file: !749, line: 237, baseType: !190, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !833, file: !749, line: 238, baseType: !190, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !833, file: !749, line: 239, baseType: !190, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !833, file: !749, line: 241, baseType: !190, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !833, file: !749, line: 242, baseType: !190, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !833, file: !749, line: 243, baseType: !190, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !830, file: !749, line: 246, baseType: !190, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !750, file: !749, line: 904, baseType: !852, size: 16, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !749, line: 300, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 287, size: 16, elements: !855)
!855 = !{!856, !866}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !854, file: !749, line: 298, baseType: !857, size: 16)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !854, file: !749, line: 288, size: 16, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !857, file: !749, line: 290, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !857, file: !749, line: 291, baseType: !187, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !857, file: !749, line: 293, baseType: !187, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !857, file: !749, line: 294, baseType: !187, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !857, file: !749, line: 295, baseType: !187, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !857, file: !749, line: 296, baseType: !187, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !857, file: !749, line: 297, baseType: !187, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !854, file: !749, line: 299, baseType: !187, size: 16)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !750, file: !749, line: 905, baseType: !642, size: 16, offset: 144)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !750, file: !749, line: 906, baseType: !869, size: 16, offset: 160)
!869 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !749, line: 352, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 336, size: 16, elements: !872)
!872 = !{!873, !885}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !871, file: !749, line: 350, baseType: !874, size: 16)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !749, line: 337, size: 16, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883, !884}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !874, file: !749, line: 339, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !874, file: !749, line: 340, baseType: !187, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !874, file: !749, line: 341, baseType: !187, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !874, file: !749, line: 342, baseType: !187, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !874, file: !749, line: 343, baseType: !187, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !874, file: !749, line: 344, baseType: !187, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !874, file: !749, line: 345, baseType: !187, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !874, file: !749, line: 346, baseType: !187, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !874, file: !749, line: 348, baseType: !187, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !871, file: !749, line: 351, baseType: !187, size: 16)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !750, file: !749, line: 907, baseType: !642, size: 16, offset: 176)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !750, file: !749, line: 908, baseType: !888, size: 32, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !749, line: 398, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 381, size: 32, elements: !891)
!891 = !{!892, !903}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !890, file: !749, line: 396, baseType: !893, size: 32)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !749, line: 382, size: 32, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !893, file: !749, line: 384, baseType: !190, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !893, file: !749, line: 385, baseType: !190, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !893, file: !749, line: 386, baseType: !190, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !893, file: !749, line: 388, baseType: !190, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !893, file: !749, line: 389, baseType: !190, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !893, file: !749, line: 390, baseType: !190, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !893, file: !749, line: 392, baseType: !190, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !893, file: !749, line: 394, baseType: !190, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !890, file: !749, line: 397, baseType: !190, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !750, file: !749, line: 909, baseType: !905, size: 8, offset: 224)
!905 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !749, line: 433, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 426, size: 8, elements: !908)
!908 = !{!909, !914}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !907, file: !749, line: 431, baseType: !910, size: 8)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !907, file: !749, line: 427, size: 8, elements: !911)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !910, file: !749, line: 428, baseType: !173, size: 5, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !910, file: !749, line: 430, baseType: !173, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !907, file: !749, line: 432, baseType: !173, size: 8)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !750, file: !749, line: 910, baseType: !684, size: 24, offset: 232)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !750, file: !749, line: 911, baseType: !917, size: 32, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !749, line: 462, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !749, line: 448, size: 32, elements: !920)
!920 = !{!921, !930}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !919, file: !749, line: 460, baseType: !922, size: 32)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !919, file: !749, line: 449, size: 32, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !922, file: !749, line: 451, baseType: !190, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
