; ModuleID = 'build/96b_carbon/sys_heap/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, i32, i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %struct.z_heap_bucket, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 97, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5440, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 85)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2720, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "heap", scope: !27, file: !107, line: 13, type: !112, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "heap_mem", scope: !27, file: !107, line: 12, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !110)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !{!115, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !112, file: !113, line: 57, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !113, line: 57, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !112, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !112, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 214, baseType: !32)
!121 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !127, line: 54, type: !128, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!126 = !{!122}
!127 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!103, !103}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "state", scope: !133, file: !134, line: 227, type: !163, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "rand32", scope: !134, file: !134, line: 225, type: !135, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !138, retainedNodes: !162)
!134 = !DIFile(filename: "zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !148, globals: !161, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!140 = !{!30, !141}
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !142, line: 54, baseType: !32, size: 32, elements: !143)
!142 = !DIFile(filename: "zephyr/lib/os/heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!145 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!146 = !DIEnumerator(name: "FREE_PREV", value: 2)
!147 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!148 = !{!102, !103, !149, !150, !137, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !142, line: 58, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 58, size: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !155, file: !142, line: 58, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !{!131}
!162 = !{}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !164)
!164 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !167, file: !184, line: 56, type: !185, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !169, globals: !183, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !172, line: 258, baseType: !173)
!172 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f401xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 249, size: 224, elements: !174)
!174 = !{!175, !177, !178, !179, !180, !181, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !173, file: !172, line: 251, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !173, file: !172, line: 252, baseType: !176, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !173, file: !172, line: 253, baseType: !176, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !173, file: !172, line: 254, baseType: !176, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !173, file: !172, line: 255, baseType: !176, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !173, file: !172, line: 256, baseType: !176, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !173, file: !172, line: 257, baseType: !176, size: 32, offset: 192)
!183 = !{!165}
!184 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !188)
!187 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = !{!189, !219}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !186, file: !187, line: 60, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{!103, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !197)
!196 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!197 = !{!198, !201, !202, !203, !212, !213}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !196, line: 380, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !195, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !195, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !195, file: !196, line: 386, baseType: !204, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !206)
!206 = !{!207, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !205, file: !196, line: 359, baseType: !208, size: 8)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !209)
!209 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !205, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!211 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !195, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !195, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !196, line: 43, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !218)
!218 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !186, file: !187, line: 65, baseType: !193, size: 32, offset: 32)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !222, file: !225, line: 71, type: !226, isLocal: true, isDefinition: true, align: 32)
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !224, splitDebugInlining: false, nameTableKind: None)
!223 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!224 = !{!220}
!225 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !228)
!228 = !{!229, !248}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !227, file: !187, line: 60, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DISubroutineType(types: !232)
!232 = !{!103, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !236)
!236 = !{!237, !238, !239, !240, !246, !247}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !235, file: !196, line: 380, baseType: !199, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !235, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !235, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !235, file: !196, line: 386, baseType: !241, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !242, file: !196, line: 359, baseType: !208, size: 8)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !242, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !235, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !235, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !227, file: !187, line: 65, baseType: !233, size: 32, offset: 32)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "static_regions", scope: !251, file: !258, line: 62, type: !393, isLocal: true, isDefinition: true)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !253, globals: !254, splitDebugInlining: false, nameTableKind: None)
!252 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!253 = !{!120, !103, !137, !102}
!254 = !{!255, !249}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !257, file: !258, line: 198, type: !379, isLocal: true, isDefinition: true)
!257 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !258, file: !258, line: 175, type: !259, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !251, retainedNodes: !374)
!258 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !DISubroutineType(types: !260)
!260 = !{null, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !263, line: 245, size: 1024, elements: !264)
!263 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!264 = !{!265, !332, !345, !346, !347, !348, !354, !369}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !262, file: !263, line: 247, baseType: !266, size: 384)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !263, line: 57, size: 384, elements: !267)
!267 = !{!268, !296, !304, !305, !306, !317, !318, !319}
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !263, line: 60, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !263, line: 60, size: 64, elements: !270)
!270 = !{!271, !287}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !269, file: !263, line: 61, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !273, line: 49, baseType: !274)
!273 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !273, line: 37, size: 64, elements: !275)
!275 = !{!276, !282}
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !273, line: 38, baseType: !277, size: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !273, line: 38, size: 32, elements: !278)
!278 = !{!279, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !277, file: !273, line: 39, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !273, line: 40, baseType: !280, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !273, line: 42, baseType: !283, size: 32, offset: 32)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !273, line: 42, size: 32, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !283, file: !273, line: 43, baseType: !280, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !283, file: !273, line: 44, baseType: !280, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !269, file: !263, line: 62, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !289, line: 49, size: 64, elements: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !288, file: !289, line: 50, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 64, elements: !294)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!294 = !{!295}
!295 = !DISubrange(count: 2)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !266, file: !263, line: 68, baseType: !297, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !299, line: 233, baseType: !300)
!299 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !299, line: 231, size: 64, elements: !301)
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !300, file: !299, line: 232, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !273, line: 48, baseType: !274)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !266, file: !263, line: 71, baseType: !208, size: 8, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !266, file: !263, line: 74, baseType: !208, size: 8, offset: 104)
!306 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !263, line: 90, baseType: !307, size: 16, offset: 112)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !263, line: 90, size: 16, elements: !308)
!308 = !{!309, !316}
!309 = !DIDerivedType(tag: DW_TAG_member, scope: !307, file: !263, line: 91, baseType: !310, size: 16)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !307, file: !263, line: 91, size: 16, elements: !311)
!311 = !{!312, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !310, file: !263, line: 96, baseType: !313, size: 8)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !314)
!314 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !310, file: !263, line: 97, baseType: !208, size: 8, offset: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !307, file: !263, line: 100, baseType: !151, size: 16)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !266, file: !263, line: 107, baseType: !137, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !266, file: !263, line: 127, baseType: !102, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !266, file: !263, line: 131, baseType: !320, size: 192, offset: 192)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !299, line: 244, size: 192, elements: !321)
!321 = !{!322, !323, !329}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !320, file: !299, line: 245, baseType: !272, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !320, file: !299, line: 246, baseType: !324, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !299, line: 242, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !320, file: !299, line: 249, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !331)
!331 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !262, file: !263, line: 250, baseType: !333, size: 288, offset: 384)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !334, line: 25, size: 288, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !333, file: !334, line: 26, baseType: !137, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !333, file: !334, line: 27, baseType: !137, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !333, file: !334, line: 28, baseType: !137, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !333, file: !334, line: 29, baseType: !137, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !333, file: !334, line: 30, baseType: !137, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !333, file: !334, line: 31, baseType: !137, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !333, file: !334, line: 32, baseType: !137, size: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !333, file: !334, line: 33, baseType: !137, size: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !333, file: !334, line: 34, baseType: !137, size: 32, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !262, file: !263, line: 253, baseType: !102, size: 32, offset: 672)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !262, file: !263, line: 256, baseType: !298, size: 64, offset: 704)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !262, file: !263, line: 294, baseType: !103, size: 32, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !262, file: !263, line: 300, baseType: !349, size: 96, offset: 800)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !263, line: 149, size: 96, elements: !350)
!350 = !{!351, !352, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !349, file: !263, line: 153, baseType: !22, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !263, line: 162, baseType: !120, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !349, file: !263, line: 168, baseType: !120, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !262, file: !263, line: 325, baseType: !355, size: 32, offset: 896)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !357, line: 5073, size: 160, elements: !358)
!357 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = !{!359, !365, !366}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !356, file: !357, line: 5074, baseType: !360, size: 96)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !360, file: !113, line: 57, baseType: !116, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !360, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !360, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !356, file: !357, line: 5075, baseType: !298, size: 64, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !356, file: !357, line: 5076, baseType: !367, offset: 160)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !368, line: 43, elements: !162)
!368 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !262, file: !263, line: 343, baseType: !370, size: 64, offset: 928)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !334, line: 60, size: 64, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !370, file: !334, line: 63, baseType: !137, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !370, file: !334, line: 66, baseType: !137, size: 32, offset: 32)
!374 = !{!375, !376, !377, !378}
!375 = !DILocalVariable(name: "thread", arg: 1, scope: !257, file: !258, line: 175, type: !261)
!376 = !DILocalVariable(name: "region_num", scope: !257, file: !258, line: 200, type: !208)
!377 = !DILocalVariable(name: "guard_start", scope: !257, file: !258, line: 265, type: !22)
!378 = !DILocalVariable(name: "guard_size", scope: !257, file: !258, line: 266, type: !120)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 96, elements: !391)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !381, line: 52, size: 96, elements: !382)
!381 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !{!383, !384, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !380, file: !381, line: 53, baseType: !22, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !380, file: !381, line: 54, baseType: !120, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !380, file: !381, line: 55, baseType: !386, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !387, line: 151, baseType: !388)
!387 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 149, size: 32, elements: !389)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !388, file: !387, line: 150, baseType: !137, size: 32)
!391 = !{!392}
!392 = !DISubrange(count: 1)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 96, elements: !391)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !397, file: !430, line: 39, type: !208, isLocal: true, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !399, globals: !429, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!399 = !{!400, !102, !103, !417, !208}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !402, line: 1226, baseType: !403)
!402 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 1213, size: 352, elements: !404)
!404 = !{!405, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !403, file: !402, line: 1215, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !403, file: !402, line: 1216, baseType: !176, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !403, file: !402, line: 1217, baseType: !176, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !403, file: !402, line: 1218, baseType: !176, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !403, file: !402, line: 1219, baseType: !176, size: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !403, file: !402, line: 1220, baseType: !176, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !403, file: !402, line: 1221, baseType: !176, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !403, file: !402, line: 1222, baseType: !176, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !403, file: !402, line: 1223, baseType: !176, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !403, file: !402, line: 1224, baseType: !176, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !403, file: !402, line: 1225, baseType: !176, size: 32, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !420, line: 27, size: 96, elements: !421)
!420 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = !{!422, !423, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !419, file: !420, line: 29, baseType: !137, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !419, file: !420, line: 31, baseType: !199, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !419, file: !420, line: 37, baseType: !425, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !387, line: 146, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !387, line: 141, size: 32, elements: !427)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !426, file: !387, line: 143, baseType: !137, size: 32)
!429 = !{!395}
!430 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !433, file: !440, line: 21, type: !128, isLocal: true, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !435, globals: !439, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!435 = !{!436, !103, !102}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !438, line: 22, baseType: !103)
!438 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = !{!431}
!440 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !443, file: !448, line: 13, type: !465, isLocal: true, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !445, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!445 = !{!446, !441}
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "mpu_config", scope: !443, file: !448, line: 37, type: !449, isLocal: false, isDefinition: true)
!448 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !420, line: 41, size: 64, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !450, file: !420, line: 43, baseType: !137, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !450, file: !420, line: 45, baseType: !454, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !420, line: 27, size: 96, elements: !457)
!457 = !{!458, !459, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !456, file: !420, line: 29, baseType: !137, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !456, file: !420, line: 31, baseType: !199, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !456, file: !420, line: 37, baseType: !461, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !387, line: 146, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !387, line: 141, size: 32, elements: !463)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !462, file: !387, line: 143, baseType: !137, size: 32)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 192, elements: !294)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !468, file: !551, line: 72, type: !635, isLocal: true, isDefinition: true)
!468 = distinct !DICompileUnit(language: DW_LANG_C99, file: !469, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !470, retainedTypes: !537, globals: !548, splitDebugInlining: false, nameTableKind: None)
!469 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!470 = !{!30, !471}
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 65, baseType: !103, size: 32, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!473 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!474 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!475 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!476 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!477 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!478 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!479 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!480 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!481 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!482 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!483 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!484 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!485 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!486 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!487 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!488 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!489 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!490 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!491 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!492 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!493 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!494 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!495 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!496 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!497 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!498 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!499 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!500 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!501 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!502 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!503 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!504 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!505 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!506 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!507 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!508 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!509 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!510 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!511 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!512 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!513 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!514 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!515 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!516 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!517 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!518 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!519 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!520 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!521 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!522 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!523 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!524 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!525 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!526 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!527 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!528 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!529 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!530 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!531 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!532 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!533 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!534 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!535 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!536 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!537 = !{!120, !103, !102, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !172, line: 243, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 235, size: 192, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !540, file: !172, line: 237, baseType: !176, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !540, file: !172, line: 238, baseType: !176, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !540, file: !172, line: 239, baseType: !176, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !540, file: !172, line: 240, baseType: !176, size: 32, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !540, file: !172, line: 241, baseType: !176, size: 32, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !540, file: !172, line: 242, baseType: !176, size: 32, offset: 160)
!548 = !{!549, !555, !571, !582, !599, !466, !601, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633}
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !468, file: !551, line: 424, type: !552, isLocal: false, isDefinition: true, align: 16)
!551 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 64, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 4)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !468, file: !551, line: 424, type: !557, isLocal: false, isDefinition: true, align: 32)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !559)
!559 = !{!560, !561, !562, !563, !569, !570}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !558, file: !196, line: 380, baseType: !199, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !558, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !558, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !558, file: !196, line: 386, baseType: !564, size: 32, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !565, file: !196, line: 359, baseType: !208, size: 8)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !565, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !558, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !558, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !468, file: !551, line: 424, type: !573, isLocal: true, isDefinition: true, align: 32)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !575)
!575 = !{!576, !581}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !574, file: !187, line: 60, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DISubroutineType(types: !579)
!579 = !{!103, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !574, file: !187, line: 65, baseType: !580, size: 32, offset: 32)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "exti_data", scope: !468, file: !551, line: 423, type: !584, isLocal: true, isDefinition: true)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !551, line: 107, size: 1472, elements: !585)
!585 = !{!586}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !584, file: !551, line: 109, baseType: !587, size: 1472)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1472, elements: !597)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !551, line: 101, size: 64, elements: !589)
!589 = !{!590, !596}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !588, file: !551, line: 102, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !592, line: 63, baseType: !593)
!592 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !103, !102}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !588, file: !551, line: 103, baseType: !102, size: 32, offset: 32)
!597 = !{!598}
!598 = !DISubrange(count: 23)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_39", scope: !468, file: !551, line: 424, type: !565, isLocal: true, isDefinition: true, align: 8)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !603, file: !551, line: 493, type: !608, isLocal: true, isDefinition: true, align: 32)
!603 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !551, file: !551, line: 460, type: !604, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !468, retainedNodes: !606)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !580}
!606 = !{!607}
!607 = !DILocalVariable(name: "dev", arg: 1, scope: !603, file: !551, line: 460, type: !580)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !609)
!609 = !{!610, !612, !613, !614}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !608, file: !10, line: 55, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !608, file: !10, line: 57, baseType: !611, size: 32, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !608, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !608, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !603, file: !551, line: 497, type: !608, isLocal: true, isDefinition: true, align: 32)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !603, file: !551, line: 507, type: !608, isLocal: true, isDefinition: true, align: 32)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !603, file: !551, line: 512, type: !608, isLocal: true, isDefinition: true, align: 32)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !603, file: !551, line: 516, type: !608, isLocal: true, isDefinition: true, align: 32)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !603, file: !551, line: 523, type: !608, isLocal: true, isDefinition: true, align: 32)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !603, file: !551, line: 527, type: !608, isLocal: true, isDefinition: true, align: 32)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !603, file: !551, line: 581, type: !608, isLocal: true, isDefinition: true, align: 32)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !603, file: !551, line: 586, type: !608, isLocal: true, isDefinition: true, align: 32)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !603, file: !551, line: 591, type: !608, isLocal: true, isDefinition: true, align: 32)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !603, file: !551, line: 595, type: !608, isLocal: true, isDefinition: true, align: 32)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 736, elements: !597)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !172, line: 133, baseType: !471)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !640, file: !645, line: 24, type: !671, isLocal: false, isDefinition: true, align: 16)
!640 = distinct !DICompileUnit(language: DW_LANG_C99, file: !641, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !642, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!642 = !{!643, !638, !649, !651, !653, !655, !657, !659, !661, !663, !665, !667, !669}
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !640, file: !645, line: 19, type: !646, isLocal: false, isDefinition: true, align: 16)
!645 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 224, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 14)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !640, file: !645, line: 31, type: !552, isLocal: false, isDefinition: true, align: 16)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !640, file: !645, line: 38, type: !552, isLocal: false, isDefinition: true, align: 16)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !640, file: !645, line: 45, type: !552, isLocal: false, isDefinition: true, align: 16)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !640, file: !645, line: 52, type: !552, isLocal: false, isDefinition: true, align: 16)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !640, file: !645, line: 59, type: !552, isLocal: false, isDefinition: true, align: 16)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !640, file: !645, line: 66, type: !552, isLocal: false, isDefinition: true, align: 16)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_20", scope: !640, file: !645, line: 73, type: !552, isLocal: false, isDefinition: true, align: 16)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !640, file: !645, line: 80, type: !552, isLocal: false, isDefinition: true, align: 16)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_50", scope: !640, file: !645, line: 87, type: !552, isLocal: false, isDefinition: true, align: 16)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_44", scope: !640, file: !645, line: 94, type: !552, isLocal: false, isDefinition: true, align: 16)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_47", scope: !640, file: !645, line: 101, type: !552, isLocal: false, isDefinition: true, align: 16)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 48, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 3)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !676, file: !739, line: 398, type: !772, isLocal: true, isDefinition: true)
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !678, retainedTypes: !691, globals: !736, splitDebugInlining: false, nameTableKind: None)
!677 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!678 = !{!679, !30, !684}
!679 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !680, line: 197, baseType: !32, size: 32, elements: !681)
!680 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!681 = !{!682, !683}
!682 = !DIEnumerator(name: "SUCCESS", value: 0)
!683 = !DIEnumerator(name: "ERROR", value: 1)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !685, line: 44, baseType: !32, size: 32, elements: !686)
!685 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!686 = !{!687, !688, !689, !690}
!687 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!688 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!689 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!690 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!691 = !{!102, !103, !137, !692, !730, !149}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !172, line: 369, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 335, size: 1152, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !729}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !694, file: !172, line: 337, baseType: !176, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !694, file: !172, line: 338, baseType: !176, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !694, file: !172, line: 339, baseType: !176, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !694, file: !172, line: 340, baseType: !176, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !694, file: !172, line: 341, baseType: !176, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !694, file: !172, line: 342, baseType: !176, size: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !694, file: !172, line: 343, baseType: !176, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !694, file: !172, line: 344, baseType: !137, size: 32, offset: 224)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !694, file: !172, line: 345, baseType: !176, size: 32, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !694, file: !172, line: 346, baseType: !176, size: 32, offset: 288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !694, file: !172, line: 347, baseType: !707, size: 64, offset: 320)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !294)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !694, file: !172, line: 348, baseType: !176, size: 32, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !694, file: !172, line: 349, baseType: !176, size: 32, offset: 416)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !694, file: !172, line: 350, baseType: !176, size: 32, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !694, file: !172, line: 351, baseType: !137, size: 32, offset: 480)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !694, file: !172, line: 352, baseType: !176, size: 32, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !694, file: !172, line: 353, baseType: !176, size: 32, offset: 544)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !694, file: !172, line: 354, baseType: !707, size: 64, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !694, file: !172, line: 355, baseType: !176, size: 32, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !694, file: !172, line: 356, baseType: !176, size: 32, offset: 672)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !694, file: !172, line: 357, baseType: !176, size: 32, offset: 704)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !694, file: !172, line: 358, baseType: !137, size: 32, offset: 736)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !694, file: !172, line: 359, baseType: !176, size: 32, offset: 768)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !694, file: !172, line: 360, baseType: !176, size: 32, offset: 800)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !694, file: !172, line: 361, baseType: !707, size: 64, offset: 832)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !694, file: !172, line: 362, baseType: !176, size: 32, offset: 896)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !694, file: !172, line: 363, baseType: !176, size: 32, offset: 928)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !694, file: !172, line: 364, baseType: !707, size: 64, offset: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !694, file: !172, line: 365, baseType: !176, size: 32, offset: 1024)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !694, file: !172, line: 366, baseType: !176, size: 32, offset: 1056)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !694, file: !172, line: 367, baseType: !728, size: 32, offset: 1088)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 32, elements: !391)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !694, file: !172, line: 368, baseType: !176, size: 32, offset: 1120)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !732, line: 343, size: 64, elements: !733)
!732 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !731, file: !732, line: 344, baseType: !137, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !731, file: !732, line: 345, baseType: !137, size: 32, offset: 32)
!736 = !{!737, !743, !759, !770, !674}
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !676, file: !739, line: 752, type: !740, isLocal: false, isDefinition: true, align: 16)
!739 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 640, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 40)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !676, file: !739, line: 752, type: !745, isLocal: false, isDefinition: true, align: 32)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !747)
!747 = !{!748, !749, !750, !751, !757, !758}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !746, file: !196, line: 380, baseType: !199, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !746, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !746, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !746, file: !196, line: 386, baseType: !752, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !753, file: !196, line: 359, baseType: !208, size: 8)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !753, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !746, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !746, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !676, file: !739, line: 752, type: !761, isLocal: true, isDefinition: true, align: 32)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !763)
!763 = !{!764, !769}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !762, file: !187, line: 60, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DISubroutineType(types: !767)
!767 = !{!103, !768}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !762, file: !187, line: 65, baseType: !768, size: 32, offset: 32)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !676, file: !739, line: 752, type: !753, isLocal: true, isDefinition: true, align: 8)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !685, line: 100, size: 224, elements: !773)
!773 = !{!774, !780, !781, !790, !795, !800, !806}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !772, file: !685, line: 101, baseType: !775, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !685, line: 76, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DISubroutineType(types: !778)
!778 = !{!103, !768, !779}
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !685, line: 56, baseType: !102)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !772, file: !685, line: 102, baseType: !775, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !772, file: !685, line: 103, baseType: !782, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !685, line: 83, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DISubroutineType(types: !785)
!785 = !{!103, !768, !779, !786, !102}
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !685, line: 72, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !768, !779, !102}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !772, file: !685, line: 104, baseType: !791, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !685, line: 79, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = !DISubroutineType(types: !794)
!794 = !{!103, !768, !779, !149}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !772, file: !685, line: 105, baseType: !796, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !685, line: 88, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DISubroutineType(types: !799)
!799 = !{!684, !768, !779}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !772, file: !685, line: 106, baseType: !801, size: 32, offset: 160)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !685, line: 92, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DISubroutineType(types: !804)
!804 = !{!103, !768, !779, !805}
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !685, line: 64, baseType: !102)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !772, file: !685, line: 107, baseType: !807, size: 32, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !685, line: 96, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{!103, !768, !779, !102}
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !813, file: !870, line: 603, type: !872, isLocal: true, isDefinition: true, align: 32)
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !815, globals: !867, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!815 = !{!102, !103, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !819, line: 336, size: 160, elements: !820)
!819 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!820 = !{!821, !841, !845, !849, !862}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !818, file: !819, line: 365, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!823 = !DISubroutineType(types: !824)
!824 = !{!103, !825, !840}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !828)
!828 = !{!829, !830, !831, !832, !838, !839}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !827, file: !196, line: 380, baseType: !199, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !827, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !827, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !827, file: !196, line: 386, baseType: !833, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !834, file: !196, line: 359, baseType: !208, size: 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !834, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !827, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !827, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !818, file: !819, line: 366, baseType: !842, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !825, !209}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !818, file: !819, line: 374, baseType: !846, size: 32, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DISubroutineType(types: !848)
!848 = !{!103, !825}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !818, file: !819, line: 377, baseType: !850, size: 32, offset: 96)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DISubroutineType(types: !852)
!852 = !{!103, !825, !853}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !819, line: 122, size: 64, elements: !856)
!856 = !{!857, !858, !859, !860, !861}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !855, file: !819, line: 123, baseType: !137, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !855, file: !819, line: 124, baseType: !208, size: 8, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !855, file: !819, line: 125, baseType: !208, size: 8, offset: 40)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !855, file: !819, line: 126, baseType: !208, size: 8, offset: 48)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !855, file: !819, line: 127, baseType: !208, size: 8, offset: 56)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !818, file: !819, line: 379, baseType: !863, size: 32, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!864 = !DISubroutineType(types: !865)
!865 = !{!103, !825, !866}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!867 = !{!811, !868}
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !813, file: !870, line: 38, type: !871, isLocal: true, isDefinition: true)
!870 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !825)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !873, file: !187, line: 60, baseType: !846, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !873, file: !187, line: 65, baseType: !825, size: 32, offset: 32)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !879, file: !1049, line: 762, type: !1161, isLocal: true, isDefinition: true)
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !881, retainedTypes: !899, globals: !1046, splitDebugInlining: false, nameTableKind: None)
!880 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/sys_heap")
!881 = !{!30, !882, !888, !893, !684}
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !883, line: 506, baseType: !32, size: 32, elements: !884)
!883 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!884 = !{!885, !886, !887}
!885 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!886 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!887 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !883, line: 512, baseType: !32, size: 32, elements: !889)
!889 = !{!890, !891, !892}
!890 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!891 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!892 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !592, line: 43, baseType: !32, size: 32, elements: !894)
!894 = !{!895, !896, !897, !898}
!895 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!896 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!897 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!898 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!899 = !{!102, !103, !900, !970, !975, !935, !888, !882, !980, !981, !137, !995, !950, !1005, !1006, !1007}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !883, line: 523, size: 288, elements: !903)
!903 = !{!904, !925, !931, !936, !940, !941, !942, !946, !966}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !902, file: !883, line: 524, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DISubroutineType(types: !907)
!907 = !{!103, !908, !923, !924}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !911)
!911 = !{!912, !913, !914, !915, !921, !922}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !910, file: !196, line: 380, baseType: !199, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !910, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !910, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !910, file: !196, line: 386, baseType: !916, size: 32, offset: 96)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !917, file: !196, line: 359, baseType: !208, size: 8)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !917, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !910, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !910, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !883, line: 237, baseType: !208)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !883, line: 257, baseType: !137)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !902, file: !883, line: 530, baseType: !926, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DISubroutineType(types: !928)
!928 = !{!103, !908, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !883, line: 229, baseType: !137)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !902, file: !883, line: 532, baseType: !932, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DISubroutineType(types: !934)
!934 = !{!103, !908, !935, !930}
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !883, line: 216, baseType: !137)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !902, file: !883, line: 535, baseType: !937, size: 32, offset: 96)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{!103, !908, !935}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !902, file: !883, line: 537, baseType: !937, size: 32, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !902, file: !883, line: 539, baseType: !937, size: 32, offset: 160)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !902, file: !883, line: 541, baseType: !943, size: 32, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DISubroutineType(types: !945)
!945 = !{!103, !908, !923, !882, !888}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !902, file: !883, line: 544, baseType: !947, size: 32, offset: 224)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = !DISubroutineType(types: !949)
!949 = !{!103, !908, !950, !211}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !883, line: 478, size: 96, elements: !952)
!952 = !{!953, !960, !965}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !951, file: !883, line: 482, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !955, line: 33, baseType: !956)
!955 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !955, line: 29, size: 32, elements: !957)
!957 = !{!958}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !956, file: !955, line: 30, baseType: !959, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !951, file: !883, line: 485, baseType: !961, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !883, line: 464, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !908, !950, !935}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !951, file: !883, line: 493, baseType: !935, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !902, file: !883, line: 547, baseType: !967, size: 32, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{!137, !908}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !883, line: 428, size: 32, elements: !973)
!973 = !{!974}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !972, file: !883, line: 434, baseType: !935, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !883, line: 441, size: 32, elements: !978)
!978 = !{!979}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !977, file: !883, line: 447, baseType: !935, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !172, line: 275, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 264, size: 320, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !983, file: !172, line: 266, baseType: !176, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !983, file: !172, line: 267, baseType: !176, size: 32, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !983, file: !172, line: 268, baseType: !176, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !983, file: !172, line: 269, baseType: !176, size: 32, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !983, file: !172, line: 270, baseType: !176, size: 32, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !983, file: !172, line: 271, baseType: !176, size: 32, offset: 160)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !983, file: !172, line: 272, baseType: !176, size: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !983, file: !172, line: 273, baseType: !176, size: 32, offset: 224)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !983, file: !172, line: 274, baseType: !994, size: 64, offset: 256)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 64, elements: !294)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !172, line: 288, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 281, size: 288, elements: !998)
!998 = !{!999, !1000, !1001, !1003, !1004}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !997, file: !172, line: 283, baseType: !176, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !997, file: !172, line: 284, baseType: !176, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !997, file: !172, line: 285, baseType: !1002, size: 128, offset: 64)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !553)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !997, file: !172, line: 286, baseType: !707, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !997, file: !172, line: 287, baseType: !176, size: 32, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !685, line: 100, size: 224, elements: !1010)
!1010 = !{!1011, !1016, !1017, !1026, !1031, !1036, !1041}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1009, file: !685, line: 101, baseType: !1012, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !685, line: 76, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!103, !908, !779}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1009, file: !685, line: 102, baseType: !1012, size: 32, offset: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1009, file: !685, line: 103, baseType: !1018, size: 32, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !685, line: 83, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!103, !908, !779, !1022, !102}
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !685, line: 72, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{null, !908, !779, !102}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1009, file: !685, line: 104, baseType: !1027, size: 32, offset: 96)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !685, line: 79, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!103, !908, !779, !149}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1009, file: !685, line: 105, baseType: !1032, size: 32, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !685, line: 88, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!684, !908, !779}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !1009, file: !685, line: 106, baseType: !1037, size: 32, offset: 160)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !685, line: 92, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!103, !908, !779, !805}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1009, file: !685, line: 107, baseType: !1042, size: 32, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !685, line: 96, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!103, !908, !779, !102}
!1046 = !{!1047, !1053, !1055, !1065, !1067, !1069, !1071, !1076, !1078, !1080, !1085, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1111, !1113, !1127, !1129, !1131, !1133, !1135, !1137, !1139, !1141, !1143, !1145, !1147, !1149, !1151, !1153, !1155, !877, !1157, !1159, !1172, !1174, !1176, !1178, !1180, !1182}
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
