; ModuleID = './build/freertos_create_thread.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.tskTaskControlBlock = type { i32*, %struct.xLIST_ITEM, %struct.xLIST_ITEM, i32, i32*, [6 x i8], i32, i32, i32, i32, i32, i32 }
%struct.xLIST_ITEM = type { i32, %struct.xLIST_ITEM*, %struct.xLIST_ITEM*, i8*, i8* }
%struct.xLIST = type { i32, %struct.xLIST_ITEM*, %struct.xMINI_LIST_ITEM }
%struct.xMINI_LIST_ITEM = type { i32, %struct.xLIST_ITEM*, %struct.xLIST_ITEM* }
%struct.QUEUE_REGISTRY_ITEM = type { i8*, i8* }
%struct.A_BLOCK_LINK = type { %struct.A_BLOCK_LINK*, i32 }
%struct.exception_config_t = type { i32, [6 x %struct.exception_config_type] }
%struct.exception_config_type = type { void ()*, void ()* }
%struct.TaskContextType = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.syslog_buffer_t = type { i32, [292 x i8] }
%struct.syslog_config_s = type { {}*, %struct.log_control_block_t** }
%struct.log_control_block_t = type { i8*, i32, i32, void (i8*, i8*, i32, i32, i8*, ...)*, void (i8*, i8*, i32, i32, i8*, i32, i8*, ...)* }
%struct.flash_info_t = type { i8*, i8, i32, i32, i32, i8, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "pxCurrentTCB", scope: !2, file: !3, line: 208, type: !167, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !26, globals: !106, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../kernel/rtos/FreeRTOS/Source/tasks.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!4 = !{!5, !11, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 122, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "eNotWaitingNotification", value: 0)
!9 = !DIEnumerator(name: "eWaitingNotification", value: 1)
!10 = !DIEnumerator(name: "eNotified", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 112, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "../../../../../kernel/rtos/FreeRTOS/Source/include/task.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "eRunning", value: 0)
!15 = !DIEnumerator(name: "eReady", value: 1)
!16 = !DIEnumerator(name: "eBlocked", value: 2)
!17 = !DIEnumerator(name: "eSuspended", value: 3)
!18 = !DIEnumerator(name: "eDeleted", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 122, baseType: !6, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25}
!21 = !DIEnumerator(name: "eNoAction", value: 0)
!22 = !DIEnumerator(name: "eSetBits", value: 1)
!23 = !DIEnumerator(name: "eIncrement", value: 2)
!24 = !DIEnumerator(name: "eSetValueWithOverwrite", value: 3)
!25 = !DIEnumerator(name: "eSetValueWithoutOverwrite", value: 4)
!26 = !{!27, !30, !31, !36, !38, !40, !41, !43, !45, !59, !35, !81, !95, !6, !99, !103, !104, !96}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "UBaseType_t", file: !28, line: 99, baseType: !29)
!28 = !DIFile(filename: "../../../../../kernel/rtos/FreeRTOS/Source/portable/GCC/ARM_CM4F/portmacro.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!29 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !32, line: 36, baseType: !33)
!32 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !34, line: 57, baseType: !35)
!34 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!35 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "StackType_t", file: !28, line: 97, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !32, line: 48, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !34, line: 79, baseType: !6)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskHandle_t", file: !12, line: 103, baseType: !30)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "BaseType_t", file: !28, line: 98, baseType: !42)
!42 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCB_t", file: !3, line: 195, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "tskTCB", file: !3, line: 191, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tskTaskControlBlock", file: !3, line: 134, size: 672, elements: !49)
!49 = !{!50, !53, !65, !66, !67, !68, !73, !74, !75, !76, !77, !78}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pxTopOfStack", scope: !48, file: !3, line: 136, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "xGenericListItem", scope: !48, file: !3, line: 143, baseType: !54, size: 160, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !55, line: 191, baseType: !56)
!55 = !DIFile(filename: "../../../../../kernel/rtos/FreeRTOS/Source/include/list.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !55, line: 181, size: 160, elements: !57)
!57 = !{!58, !60, !62, !63, !64}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !56, file: !55, line: 184, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "TickType_t", file: !28, line: 105, baseType: !38)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !56, file: !55, line: 185, baseType: !61, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !56, file: !55, line: 186, baseType: !61, size: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !56, file: !55, line: 187, baseType: !30, size: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !56, file: !55, line: 188, baseType: !30, size: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "xEventListItem", scope: !48, file: !3, line: 144, baseType: !54, size: 160, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "uxPriority", scope: !48, file: !3, line: 145, baseType: !27, size: 32, offset: 352)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pxStack", scope: !48, file: !3, line: 146, baseType: !36, size: 32, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pcTaskName", scope: !48, file: !3, line: 147, baseType: !69, size: 48, offset: 416)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 48, elements: !71)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !{!72}
!72 = !DISubrange(count: 6)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uxTCBNumber", scope: !48, file: !3, line: 158, baseType: !27, size: 32, offset: 480)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "uxTaskNumber", scope: !48, file: !3, line: 159, baseType: !27, size: 32, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "uxBasePriority", scope: !48, file: !3, line: 163, baseType: !27, size: 32, offset: 544)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "uxMutexesHeld", scope: !48, file: !3, line: 164, baseType: !27, size: 32, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ulNotifiedValue", scope: !48, file: !3, line: 187, baseType: !44, size: 32, offset: 608)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "eNotifyState", scope: !48, file: !3, line: 188, baseType: !79, size: 32, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "eNotifyValue", file: !3, line: 127, baseType: !5)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "List_t", file: !55, line: 212, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !55, line: 205, size: 160, elements: !84)
!84 = !{!85, !86, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !83, file: !55, line: 208, baseType: !27, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !83, file: !55, line: 209, baseType: !87, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !83, file: !55, line: 210, baseType: !89, size: 96, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !55, line: 200, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !55, line: 193, size: 96, elements: !91)
!91 = !{!92, !93, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !90, file: !55, line: 196, baseType: !59, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !90, file: !55, line: 197, baseType: !61, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !90, file: !55, line: 198, baseType: !61, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !32, line: 24, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !34, line: 43, baseType: !98)
!98 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 40, baseType: !101)
!100 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/strings.h", directory: "/home/mjshen/RTOSExploration")
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !102, line: 131, baseType: !6)
!102 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!106 = !{!0, !107, !124, !127, !130, !132, !134, !136, !138, !141, !144, !146, !148, !150, !152, !155, !157, !159, !161, !163, !165}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "ucExpectedStackBytes", scope: !109, file: !3, line: 2240, type: !120, isLocal: true, isDefinition: true)
!109 = distinct !DISubprogram(name: "vTaskSwitchContext", scope: !3, file: !3, line: 2198, type: !110, scopeLine: 2199, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !112)
!110 = !DISubroutineType(types: !111)
!111 = !{null}
!112 = !{!113, !117}
!113 = !DILocalVariable(name: "uxTopPriority", scope: !114, file: !3, line: 2244, type: !27)
!114 = distinct !DILexicalBlock(scope: !115, file: !3, line: 2244, column: 3)
!115 = distinct !DILexicalBlock(scope: !116, file: !3, line: 2207, column: 2)
!116 = distinct !DILexicalBlock(scope: !109, file: !3, line: 2200, column: 6)
!117 = !DILocalVariable(name: "pxConstList", scope: !118, file: !3, line: 2244, type: !119)
!118 = distinct !DILexicalBlock(scope: !114, file: !3, line: 2244, column: 3)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 160, elements: !122)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!122 = !{!123}
!123 = !DISubrange(count: 20)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "pxReadyTasksLists", scope: !2, file: !3, line: 211, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 3200, elements: !122)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "pxDelayedTaskList", scope: !2, file: !3, line: 214, type: !129, isLocal: true, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !81)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "pxOverflowDelayedTaskList", scope: !2, file: !3, line: 215, type: !129, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "xPendingReadyList", scope: !2, file: !3, line: 216, type: !82, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "xTasksWaitingTermination", scope: !2, file: !3, line: 220, type: !82, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "xSuspendedTaskList", scope: !2, file: !3, line: 227, type: !82, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "uxCurrentNumberOfTasks", scope: !2, file: !3, line: 238, type: !140, isLocal: true, isDefinition: true)
!140 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !27)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "xSchedulerRunning", scope: !2, file: !3, line: 241, type: !143, isLocal: true, isDefinition: true)
!143 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !41)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "uxTaskNumber", scope: !2, file: !3, line: 245, type: !27, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "uxTopReadyPriority", scope: !2, file: !3, line: 240, type: !140, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "uxTasksDeleted", scope: !2, file: !3, line: 221, type: !140, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "uxSchedulerSuspended", scope: !2, file: !3, line: 256, type: !140, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "xTickCount", scope: !2, file: !3, line: 239, type: !154, isLocal: true, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !59)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "xYieldPending", scope: !2, file: !3, line: 243, type: !143, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "uxPendedTicks", scope: !2, file: !3, line: 242, type: !140, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "xNumOfOverflows", scope: !2, file: !3, line: 244, type: !143, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "xNextTaskUnblockTime", scope: !2, file: !3, line: 246, type: !154, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "xDelayedTaskList1", scope: !2, file: !3, line: 212, type: !82, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "xDelayedTaskList2", scope: !2, file: !3, line: 213, type: !82, isLocal: true, isDefinition: true)
!167 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "xQueueRegistry", scope: !170, file: !171, line: 192, type: !222, isLocal: false, isDefinition: true)
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !172, globals: !221, splitDebugInlining: false, nameTableKind: None)
!171 = !DIFile(filename: "../../../../../kernel/rtos/FreeRTOS/Source/queue.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!172 = !{!173, !27, !41, !43, !30, !99, !179, !59, !96}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "Queue_t", file: !171, line: 165, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "xQUEUE", file: !171, line: 161, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QueueDefinition", file: !171, line: 130, size: 672, elements: !177)
!177 = !{!178, !183, !184, !185, !190, !213, !214, !215, !216, !217, !218, !219, !220}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pcHead", scope: !176, file: !171, line: 132, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !32, line: 20, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !34, line: 41, baseType: !182)
!182 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pcTail", scope: !176, file: !171, line: 133, baseType: !179, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pcWriteTo", scope: !176, file: !171, line: 134, baseType: !179, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !176, file: !171, line: 140, baseType: !186, size: 32, offset: 96)
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !176, file: !171, line: 136, size: 32, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pcReadFrom", scope: !186, file: !171, line: 138, baseType: !179, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "uxRecursiveCallCount", scope: !186, file: !171, line: 139, baseType: !27, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "xTasksWaitingToSend", scope: !176, file: !171, line: 142, baseType: !191, size: 160, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "List_t", file: !55, line: 212, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !55, line: 205, size: 160, elements: !193)
!193 = !{!194, !195, !206}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !192, file: !55, line: 208, baseType: !27, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !192, file: !55, line: 209, baseType: !196, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !55, line: 191, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !55, line: 181, size: 160, elements: !199)
!199 = !{!200, !201, !203, !204, !205}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !198, file: !55, line: 184, baseType: !59, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !198, file: !55, line: 185, baseType: !202, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !198, file: !55, line: 186, baseType: !202, size: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !198, file: !55, line: 187, baseType: !30, size: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !198, file: !55, line: 188, baseType: !30, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !192, file: !55, line: 210, baseType: !207, size: 96, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !55, line: 200, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !55, line: 193, size: 96, elements: !209)
!209 = !{!210, !211, !212}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !208, file: !55, line: 196, baseType: !59, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !208, file: !55, line: 197, baseType: !202, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !208, file: !55, line: 198, baseType: !202, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "xTasksWaitingToReceive", scope: !176, file: !171, line: 143, baseType: !191, size: 160, offset: 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "uxMessagesWaiting", scope: !176, file: !171, line: 145, baseType: !140, size: 32, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "uxLength", scope: !176, file: !171, line: 146, baseType: !27, size: 32, offset: 480)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "uxItemSize", scope: !176, file: !171, line: 147, baseType: !27, size: 32, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "xRxLock", scope: !176, file: !171, line: 149, baseType: !143, size: 32, offset: 544)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "xTxLock", scope: !176, file: !171, line: 150, baseType: !143, size: 32, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "uxQueueNumber", scope: !176, file: !171, line: 153, baseType: !27, size: 32, offset: 608)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ucQueueType", scope: !176, file: !171, line: 154, baseType: !96, size: 8, offset: 640)
!221 = !{!168}
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 512, elements: !231)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueueRegistryItem_t", file: !171, line: 187, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "xQueueRegistryItem", file: !171, line: 182, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QUEUE_REGISTRY_ITEM", file: !171, line: 178, size: 64, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pcQueueName", scope: !225, file: !171, line: 180, baseType: !104, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "xHandle", scope: !225, file: !171, line: 181, baseType: !229, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueueHandle_t", file: !230, line: 88, baseType: !30)
!230 = !DIFile(filename: "../../../../../kernel/rtos/FreeRTOS/Source/include/queue.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!231 = !{!232}
!232 = !DISubrange(count: 8)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "xTimerQueue", scope: !235, file: !236, line: 169, type: !229, isLocal: true, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !237, globals: !265, splitDebugInlining: false, nameTableKind: None)
!236 = !DIFile(filename: "../../../../../kernel/rtos/FreeRTOS/Source/timers.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!237 = !{!41, !30, !31, !35, !27, !59, !238, !263, !43, !96}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer_t", file: !236, line: 119, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "xTIMER", file: !236, line: 115, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tmrTimerControl", file: !236, line: 104, size: 352, elements: !242)
!242 = !{!243, !244, !254, !255, !256, !257, !264}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pcTimerName", scope: !241, file: !236, line: 106, baseType: !104, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "xTimerListItem", scope: !241, file: !236, line: 107, baseType: !245, size: 160, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !55, line: 191, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !55, line: 181, size: 160, elements: !247)
!247 = !{!248, !249, !251, !252, !253}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !246, file: !55, line: 184, baseType: !59, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !246, file: !55, line: 185, baseType: !250, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !246, file: !55, line: 186, baseType: !250, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !246, file: !55, line: 187, baseType: !30, size: 32, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !246, file: !55, line: 188, baseType: !30, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "xTimerPeriodInTicks", scope: !241, file: !236, line: 108, baseType: !59, size: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "uxAutoReload", scope: !241, file: !236, line: 109, baseType: !27, size: 32, offset: 224)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pvTimerID", scope: !241, file: !236, line: 110, baseType: !30, size: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pxCallbackFunction", scope: !241, file: !236, line: 111, baseType: !258, size: 32, offset: 288)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerCallbackFunction_t", file: !259, line: 123, baseType: !260)
!259 = !DIFile(filename: "../../../../../kernel/rtos/FreeRTOS/Source/include/timers.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !263}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerHandle_t", file: !259, line: 118, baseType: !30)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "uxTimerNumber", scope: !241, file: !236, line: 113, baseType: !27, size: 32, offset: 320)
!265 = !{!233, !266, !282, !292, !294, !296}
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "pxCurrentTimerList", scope: !235, file: !236, line: 165, type: !268, isLocal: true, isDefinition: true)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "List_t", file: !55, line: 212, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !55, line: 205, size: 160, elements: !271)
!271 = !{!272, !273, !275}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !270, file: !55, line: 208, baseType: !27, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !270, file: !55, line: 209, baseType: !274, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !270, file: !55, line: 210, baseType: !276, size: 96, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !55, line: 200, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !55, line: 193, size: 96, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !277, file: !55, line: 196, baseType: !59, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !277, file: !55, line: 197, baseType: !250, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !277, file: !55, line: 198, baseType: !250, size: 32, offset: 64)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "xLastTime", scope: !284, file: !236, line: 524, type: !59, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "prvSampleTimeNow", scope: !236, file: !236, line: 521, type: !285, scopeLine: 522, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !235, retainedNodes: !289)
!285 = !DISubroutineType(types: !286)
!286 = !{!59, !287}
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!289 = !{!290, !291}
!290 = !DILocalVariable(name: "pxTimerListsWereSwitched", arg: 1, scope: !284, file: !236, line: 521, type: !287)
!291 = !DILocalVariable(name: "xTimeNow", scope: !284, file: !236, line: 523, type: !59)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "pxOverflowTimerList", scope: !235, file: !236, line: 166, type: !268, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "xActiveTimerList1", scope: !235, file: !236, line: 163, type: !269, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "xActiveTimerList2", scope: !235, file: !236, line: 164, type: !269, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "ucMaxSysCallPriority", scope: !300, file: !301, line: 212, type: !96, isLocal: true, isDefinition: true)
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !301, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !302, retainedTypes: !318, globals: !321, splitDebugInlining: false, nameTableKind: None)
!301 = !DIFile(filename: "../../../../../kernel/rtos/FreeRTOS/Source/portable/GCC/ARM_CM4F/port.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!302 = !{!303, !311}
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !304, line: 50, baseType: !6, size: 32, elements: !305)
!304 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_dwt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIEnumerator(name: "HAL_DWT_0", value: 0)
!307 = !DIEnumerator(name: "HAL_DWT_1", value: 1)
!308 = !DIEnumerator(name: "HAL_DWT_2", value: 2)
!309 = !DIEnumerator(name: "HAL_DWT_3", value: 3)
!310 = !DIEnumerator(name: "HAL_DWT_MAX", value: 4)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !304, line: 42, baseType: !6, size: 32, elements: !312)
!312 = !{!313, !314, !315, !316, !317}
!313 = !DIEnumerator(name: "COMP_DISABLE", value: 0)
!314 = !DIEnumerator(name: "WDE_INST", value: 4)
!315 = !DIEnumerator(name: "WDE_DATA_RO", value: 5)
!316 = !DIEnumerator(name: "WDE_DATA_WO", value: 6)
!317 = !DIEnumerator(name: "WDE_DATA_RW", value: 7)
!318 = !{!37, !30, !319, !96, !38, !43, !41, !59}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !96)
!321 = !{!322, !298, !327, !329}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "pcInterruptPriorityRegisters", scope: !300, file: !301, line: 214, type: !324, isLocal: true, isDefinition: true)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "ulMaxPRIGROUPValue", scope: !300, file: !301, line: 213, type: !38, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "uxCriticalNesting", scope: !300, file: !301, line: 150, type: !27, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "pxEnd", scope: !333, file: !334, line: 142, type: !336, isLocal: true, isDefinition: true)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !335, globals: !343, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "../../../../../kernel/rtos/FreeRTOS/Source/portable/MemMang/heap_4.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!335 = !{!30, !95, !99, !38, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockLink_t", file: !334, line: 117, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "A_BLOCK_LINK", file: !334, line: 110, size: 64, elements: !339)
!339 = !{!340, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pxNextFreeBlock", scope: !338, file: !334, line: 112, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "xBlockSize", scope: !338, file: !334, line: 113, baseType: !99, size: 32, offset: 32)
!343 = !{!344, !347, !331, !349, !351, !353, !355}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!345 = distinct !DIGlobalVariable(name: "xHeapStructSize", scope: !333, file: !334, line: 139, type: !346, isLocal: true, isDefinition: true)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "xStart", scope: !333, file: !334, line: 142, type: !337, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "xBlockAllocatedBit", scope: !333, file: !334, line: 153, type: !99, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "xFreeBytesRemaining", scope: !333, file: !334, line: 146, type: !99, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "xMinimumEverFreeBytesRemaining", scope: !333, file: !334, line: 147, type: !99, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "ucHeap", scope: !333, file: !334, line: 105, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 524288, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 65536)
!360 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 2147483648, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "xExceptionStack", scope: !363, file: !364, line: 78, type: !560, isLocal: true, isDefinition: true)
!363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !364, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !365, retainedTypes: !393, globals: !466, splitDebugInlining: false, nameTableKind: None)
!364 = !DIFile(filename: "../../../../../kernel/service/src/exception_handler.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!365 = !{!366, !303}
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !364, line: 276, baseType: !6, size: 32, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!368 = !DIEnumerator(name: "r0", value: 0)
!369 = !DIEnumerator(name: "r1", value: 1)
!370 = !DIEnumerator(name: "r2", value: 2)
!371 = !DIEnumerator(name: "r3", value: 3)
!372 = !DIEnumerator(name: "r12", value: 4)
!373 = !DIEnumerator(name: "lr", value: 5)
!374 = !DIEnumerator(name: "pc", value: 6)
!375 = !DIEnumerator(name: "psr", value: 7)
!376 = !DIEnumerator(name: "s0", value: 8)
!377 = !DIEnumerator(name: "s1", value: 9)
!378 = !DIEnumerator(name: "s2", value: 10)
!379 = !DIEnumerator(name: "s3", value: 11)
!380 = !DIEnumerator(name: "s4", value: 12)
!381 = !DIEnumerator(name: "s5", value: 13)
!382 = !DIEnumerator(name: "s6", value: 14)
!383 = !DIEnumerator(name: "s7", value: 15)
!384 = !DIEnumerator(name: "s8", value: 16)
!385 = !DIEnumerator(name: "s9", value: 17)
!386 = !DIEnumerator(name: "s10", value: 18)
!387 = !DIEnumerator(name: "s11", value: 19)
!388 = !DIEnumerator(name: "s12", value: 20)
!389 = !DIEnumerator(name: "s13", value: 21)
!390 = !DIEnumerator(name: "s14", value: 22)
!391 = !DIEnumerator(name: "s15", value: 23)
!392 = !DIEnumerator(name: "fpscr", value: 24)
!393 = !{!394, !434, !6, !38, !436}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !396, line: 418, baseType: !397)
!396 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 395, size: 1120, elements: !398)
!398 = !{!399, !401, !402, !403, !404, !405, !406, !410, !411, !412, !413, !414, !415, !416, !417, !421, !422, !423, !427, !431, !433}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !397, file: !396, line: 397, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !397, file: !396, line: 398, baseType: !44, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !397, file: !396, line: 399, baseType: !44, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !397, file: !396, line: 400, baseType: !44, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !397, file: !396, line: 401, baseType: !44, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !397, file: !396, line: 402, baseType: !44, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !397, file: !396, line: 403, baseType: !407, size: 96, offset: 192)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 96, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 12)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !397, file: !396, line: 404, baseType: !44, size: 32, offset: 288)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !397, file: !396, line: 405, baseType: !44, size: 32, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !397, file: !396, line: 406, baseType: !44, size: 32, offset: 352)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !397, file: !396, line: 407, baseType: !44, size: 32, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !397, file: !396, line: 408, baseType: !44, size: 32, offset: 416)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !397, file: !396, line: 409, baseType: !44, size: 32, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !397, file: !396, line: 410, baseType: !44, size: 32, offset: 480)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !397, file: !396, line: 411, baseType: !418, size: 64, offset: 512)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 64, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 2)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !397, file: !396, line: 412, baseType: !400, size: 32, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !397, file: !396, line: 413, baseType: !400, size: 32, offset: 608)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !397, file: !396, line: 414, baseType: !424, size: 128, offset: 640)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 128, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 4)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !397, file: !396, line: 415, baseType: !428, size: 160, offset: 768)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 160, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 5)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !397, file: !396, line: 416, baseType: !432, size: 160, offset: 928)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, elements: !429)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !397, file: !396, line: 417, baseType: !44, size: 32, offset: 1088)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "DWT_Type", file: !396, line: 826, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 801, size: 736, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !438, file: !396, line: 803, baseType: !44, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "CYCCNT", scope: !438, file: !396, line: 804, baseType: !44, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "CPICNT", scope: !438, file: !396, line: 805, baseType: !44, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "EXCCNT", scope: !438, file: !396, line: 806, baseType: !44, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPCNT", scope: !438, file: !396, line: 807, baseType: !44, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "LSUCNT", scope: !438, file: !396, line: 808, baseType: !44, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "FOLDCNT", scope: !438, file: !396, line: 809, baseType: !44, size: 32, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "PCSR", scope: !438, file: !396, line: 810, baseType: !400, size: 32, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "COMP0", scope: !438, file: !396, line: 811, baseType: !44, size: 32, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "MASK0", scope: !438, file: !396, line: 812, baseType: !44, size: 32, offset: 288)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION0", scope: !438, file: !396, line: 813, baseType: !44, size: 32, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !438, file: !396, line: 814, baseType: !452, size: 32, offset: 352)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 32, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 1)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "COMP1", scope: !438, file: !396, line: 815, baseType: !44, size: 32, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "MASK1", scope: !438, file: !396, line: 816, baseType: !44, size: 32, offset: 416)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION1", scope: !438, file: !396, line: 817, baseType: !44, size: 32, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !438, file: !396, line: 818, baseType: !452, size: 32, offset: 480)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "COMP2", scope: !438, file: !396, line: 819, baseType: !44, size: 32, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "MASK2", scope: !438, file: !396, line: 820, baseType: !44, size: 32, offset: 544)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION2", scope: !438, file: !396, line: 821, baseType: !44, size: 32, offset: 576)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !438, file: !396, line: 822, baseType: !452, size: 32, offset: 608)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "COMP3", scope: !438, file: !396, line: 823, baseType: !44, size: 32, offset: 640)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "MASK3", scope: !438, file: !396, line: 824, baseType: !44, size: 32, offset: 672)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION3", scope: !438, file: !396, line: 825, baseType: !44, size: 32, offset: 704)
!466 = !{!467, !470, !361, !530, !540, !542, !558}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "pxExceptionStack", scope: !363, file: !364, line: 79, type: !469, isLocal: false, isDefinition: true)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "pTaskContext", scope: !363, file: !364, line: 340, type: !472, isLocal: false, isDefinition: true)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskContext", file: !364, line: 337, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TaskContextType", file: !364, line: 282, size: 1728, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "r0", scope: !474, file: !364, line: 283, baseType: !6, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !474, file: !364, line: 284, baseType: !6, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "r2", scope: !474, file: !364, line: 285, baseType: !6, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "r3", scope: !474, file: !364, line: 286, baseType: !6, size: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "r4", scope: !474, file: !364, line: 287, baseType: !6, size: 32, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "r5", scope: !474, file: !364, line: 288, baseType: !6, size: 32, offset: 160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "r6", scope: !474, file: !364, line: 289, baseType: !6, size: 32, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "r7", scope: !474, file: !364, line: 290, baseType: !6, size: 32, offset: 224)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "r8", scope: !474, file: !364, line: 291, baseType: !6, size: 32, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "r9", scope: !474, file: !364, line: 292, baseType: !6, size: 32, offset: 288)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "r10", scope: !474, file: !364, line: 293, baseType: !6, size: 32, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "r11", scope: !474, file: !364, line: 294, baseType: !6, size: 32, offset: 352)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "r12", scope: !474, file: !364, line: 295, baseType: !6, size: 32, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !474, file: !364, line: 296, baseType: !6, size: 32, offset: 416)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "lr", scope: !474, file: !364, line: 297, baseType: !6, size: 32, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !474, file: !364, line: 298, baseType: !6, size: 32, offset: 480)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "psr", scope: !474, file: !364, line: 299, baseType: !6, size: 32, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !474, file: !364, line: 300, baseType: !6, size: 32, offset: 544)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "exc_return", scope: !474, file: !364, line: 301, baseType: !6, size: 32, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "msp", scope: !474, file: !364, line: 302, baseType: !6, size: 32, offset: 608)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !474, file: !364, line: 303, baseType: !6, size: 32, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fpscr", scope: !474, file: !364, line: 304, baseType: !6, size: 32, offset: 672)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "s0", scope: !474, file: !364, line: 305, baseType: !6, size: 32, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "s1", scope: !474, file: !364, line: 306, baseType: !6, size: 32, offset: 736)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "s2", scope: !474, file: !364, line: 307, baseType: !6, size: 32, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "s3", scope: !474, file: !364, line: 308, baseType: !6, size: 32, offset: 800)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !474, file: !364, line: 309, baseType: !6, size: 32, offset: 832)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "s5", scope: !474, file: !364, line: 310, baseType: !6, size: 32, offset: 864)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !474, file: !364, line: 311, baseType: !6, size: 32, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "s7", scope: !474, file: !364, line: 312, baseType: !6, size: 32, offset: 928)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "s8", scope: !474, file: !364, line: 313, baseType: !6, size: 32, offset: 960)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "s9", scope: !474, file: !364, line: 314, baseType: !6, size: 32, offset: 992)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "s10", scope: !474, file: !364, line: 315, baseType: !6, size: 32, offset: 1024)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "s11", scope: !474, file: !364, line: 316, baseType: !6, size: 32, offset: 1056)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "s12", scope: !474, file: !364, line: 317, baseType: !6, size: 32, offset: 1088)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "s13", scope: !474, file: !364, line: 318, baseType: !6, size: 32, offset: 1120)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "s14", scope: !474, file: !364, line: 319, baseType: !6, size: 32, offset: 1152)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "s15", scope: !474, file: !364, line: 320, baseType: !6, size: 32, offset: 1184)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "s16", scope: !474, file: !364, line: 321, baseType: !6, size: 32, offset: 1216)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "s17", scope: !474, file: !364, line: 322, baseType: !6, size: 32, offset: 1248)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "s18", scope: !474, file: !364, line: 323, baseType: !6, size: 32, offset: 1280)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "s19", scope: !474, file: !364, line: 324, baseType: !6, size: 32, offset: 1312)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "s20", scope: !474, file: !364, line: 325, baseType: !6, size: 32, offset: 1344)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "s21", scope: !474, file: !364, line: 326, baseType: !6, size: 32, offset: 1376)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "s22", scope: !474, file: !364, line: 327, baseType: !6, size: 32, offset: 1408)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "s23", scope: !474, file: !364, line: 328, baseType: !6, size: 32, offset: 1440)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "s24", scope: !474, file: !364, line: 329, baseType: !6, size: 32, offset: 1472)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "s25", scope: !474, file: !364, line: 330, baseType: !6, size: 32, offset: 1504)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "s26", scope: !474, file: !364, line: 331, baseType: !6, size: 32, offset: 1536)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "s27", scope: !474, file: !364, line: 332, baseType: !6, size: 32, offset: 1568)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "s28", scope: !474, file: !364, line: 333, baseType: !6, size: 32, offset: 1600)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "s29", scope: !474, file: !364, line: 334, baseType: !6, size: 32, offset: 1632)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "s30", scope: !474, file: !364, line: 335, baseType: !6, size: 32, offset: 1664)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "s31", scope: !474, file: !364, line: 336, baseType: !6, size: 32, offset: 1696)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "assert_expr", scope: !363, file: !364, line: 99, type: !532, isLocal: true, isDefinition: true)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "assert_expr_t", file: !364, line: 95, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 89, size: 128, elements: !534)
!534 = !{!535, !537, !538, !539}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !533, file: !364, line: 91, baseType: !536, size: 8)
!536 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !533, file: !364, line: 92, baseType: !104, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !533, file: !364, line: 93, baseType: !104, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !533, file: !364, line: 94, baseType: !103, size: 32, offset: 96)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "reboot_flag", scope: !363, file: !364, line: 101, type: !103, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "exception_config", scope: !363, file: !364, line: 97, type: !544, isLocal: true, isDefinition: true)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "exception_config_t", file: !364, line: 87, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 83, size: 416, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !545, file: !364, line: 85, baseType: !103, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "configs", scope: !545, file: !364, line: 86, baseType: !549, size: 384, offset: 32)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 384, elements: !71)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "exception_config_type", file: !551, line: 99, baseType: !552)
!551 = !DIFile(filename: "../../../../../kernel/service/inc/exception_handler.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !551, line: 95, size: 64, elements: !553)
!553 = !{!554, !557}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "init_cb", scope: !552, file: !551, line: 97, baseType: !555, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "f_exception_callback_t", file: !551, line: 93, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "dump_cb", scope: !552, file: !551, line: 98, baseType: !555, size: 32, offset: 32)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "taskContext", scope: !363, file: !364, line: 339, type: !473, isLocal: true, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 6144, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 192)
!563 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value, DW_OP_LLVM_fragment, 0, 8))
!564 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!565 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 32))
!566 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression(DW_OP_LLVM_fragment, 96, 32))
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "g_log_uart_port", scope: !569, file: !570, line: 166, type: !774, isLocal: true, isDefinition: true)
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !571, retainedTypes: !658, globals: !734, splitDebugInlining: false, nameTableKind: None)
!570 = !DIFile(filename: "../../../../../kernel/service/src/syslog.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!571 = !{!572, !577, !583, !591, !597, !613, !619, !623, !628, !632, !645, !653}
!572 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !573, line: 65, baseType: !6, size: 32, elements: !574)
!573 = !DIFile(filename: "../../../../../kernel/service/inc/syslog.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!574 = !{!575, !576}
!575 = !DIEnumerator(name: "DEBUG_LOG_ON", value: 0)
!576 = !DIEnumerator(name: "DEBUG_LOG_OFF", value: 1)
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !573, line: 74, baseType: !6, size: 32, elements: !578)
!578 = !{!579, !580, !581, !582}
!579 = !DIEnumerator(name: "PRINT_LEVEL_DEBUG", value: 0)
!580 = !DIEnumerator(name: "PRINT_LEVEL_INFO", value: 1)
!581 = !DIEnumerator(name: "PRINT_LEVEL_WARNING", value: 2)
!582 = !DIEnumerator(name: "PRINT_LEVEL_ERROR", value: 3)
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !584, line: 345, baseType: !103, size: 32, elements: !585)
!584 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!585 = !{!586, !587, !588, !589, !590}
!586 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!587 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!588 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!589 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!590 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!591 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !592, line: 109, baseType: !6, size: 32, elements: !593)
!592 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!593 = !{!594, !595, !596}
!594 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!595 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!596 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!597 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !584, line: 302, baseType: !6, size: 32, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!599 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!600 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!601 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!602 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!603 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!604 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!605 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!606 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!607 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!608 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!609 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!610 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!611 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!612 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!613 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !584, line: 321, baseType: !6, size: 32, elements: !614)
!614 = !{!615, !616, !617, !618}
!615 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!616 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!617 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!618 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !584, line: 330, baseType: !6, size: 32, elements: !620)
!620 = !{!621, !622}
!621 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!622 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!623 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !584, line: 337, baseType: !6, size: 32, elements: !624)
!624 = !{!625, !626, !627}
!625 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!626 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!627 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!628 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !570, line: 96, baseType: !6, size: 32, elements: !629)
!629 = !{!630, !631}
!630 = !DIEnumerator(name: "MESSAGE_TYPE_NORMAL_LOG", value: 0)
!631 = !DIEnumerator(name: "MESSAGE_TYPE_HEX_DUMP", value: 1)
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !633, line: 40, baseType: !6, size: 32, elements: !634)
!633 = !DIFile(filename: "../inc/task_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!635 = !DIEnumerator(name: "TASK_PRIORITY_IDLE", value: 0)
!636 = !DIEnumerator(name: "TASK_PRIORITY_SYSLOG", value: 1)
!637 = !DIEnumerator(name: "TASK_PRIORITY_LOW", value: 2)
!638 = !DIEnumerator(name: "TASK_PRIORITY_BELOW_NORMAL", value: 3)
!639 = !DIEnumerator(name: "TASK_PRIORITY_NORMAL", value: 4)
!640 = !DIEnumerator(name: "TASK_PRIORITY_ABOVE_NORMAL", value: 5)
!641 = !DIEnumerator(name: "TASK_PRIORITY_HIGH", value: 6)
!642 = !DIEnumerator(name: "TASK_PRIORITY_SOFT_REALTIME", value: 7)
!643 = !DIEnumerator(name: "TASK_PRIORITY_HARD_REALTIME", value: 8)
!644 = !DIEnumerator(name: "TASK_PRIORITY_TIMER", value: 19)
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !646, line: 50, baseType: !6, size: 32, elements: !647)
!646 = !DIFile(filename: "../../../../../kernel/service/inc/toi.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!647 = !{!648, !649, !650, !651, !652}
!648 = !DIEnumerator(name: "TOI_BIN", value: 0)
!649 = !DIEnumerator(name: "TOI_OCT", value: 1)
!650 = !DIEnumerator(name: "TOI_DEC", value: 2)
!651 = !DIEnumerator(name: "TOI_HEX", value: 3)
!652 = !DIEnumerator(name: "TOI_ERR", value: 4)
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !592, line: 666, baseType: !6, size: 32, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!656 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!657 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_BUS", value: 2)
!658 = !{!659, !96, !30, !43, !41, !59, !6, !701, !103, !702, !708, !674, !38, !722, !731}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_message_t", file: !570, line: 130, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 124, size: 2336, elements: !662)
!662 = !{!663, !665}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !661, file: !570, line: 125, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "message_type_t", file: !570, line: 99, baseType: !628)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !661, file: !570, line: 129, baseType: !666, size: 2304, offset: 32)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !570, line: 126, size: 2304, elements: !667)
!667 = !{!668, !682}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "normal_log_message", scope: !666, file: !570, line: 127, baseType: !669, size: 2240)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "normal_log_message_t", file: !570, line: 108, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 101, size: 2240, elements: !671)
!671 = !{!672, !673, !675, !676, !677, !678}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "module_name", scope: !670, file: !570, line: 102, baseType: !104, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "print_level", scope: !670, file: !570, line: 103, baseType: !674, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "print_level_t", file: !573, line: 79, baseType: !577)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "func_name", scope: !670, file: !570, line: 104, baseType: !104, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !670, file: !570, line: 105, baseType: !103, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !670, file: !570, line: 106, baseType: !38, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !670, file: !570, line: 107, baseType: !679, size: 2056, offset: 160)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 2056, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 257)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "hex_dump_message", scope: !666, file: !570, line: 128, baseType: !683, size: 2304)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "hex_dump_message_t", file: !570, line: 120, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 110, size: 2304, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !695, !696, !700}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "module_name", scope: !684, file: !570, line: 111, baseType: !104, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "print_level", scope: !684, file: !570, line: 112, baseType: !674, size: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "func_name", scope: !684, file: !570, line: 113, baseType: !104, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !684, file: !570, line: 114, baseType: !103, size: 32, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !684, file: !570, line: 115, baseType: !38, size: 32, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !684, file: !570, line: 116, baseType: !692, size: 1032, offset: 160)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1032, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 129)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "data_length", scope: !684, file: !570, line: 117, baseType: !38, size: 32, offset: 1216)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !684, file: !570, line: 118, baseType: !697, size: 1024, offset: 1248)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1024, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "additional_data", scope: !684, file: !570, line: 119, baseType: !701, size: 32, offset: 2272)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_control_block_t", file: !573, line: 95, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 89, size: 160, elements: !705)
!705 = !{!706, !707, !709, !710, !715}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "module_name", scope: !704, file: !573, line: 90, baseType: !104, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "log_switch", scope: !704, file: !573, line: 91, baseType: !708, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_switch_t", file: !573, line: 68, baseType: !572)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "print_level", scope: !704, file: !573, line: 92, baseType: !674, size: 32, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "print_handle", scope: !704, file: !573, line: 93, baseType: !711, size: 32, offset: 96)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "f_print_t", file: !573, line: 82, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !30, !104, !103, !674, !104, null}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "dump_handle", scope: !704, file: !573, line: 94, baseType: !716, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "f_dump_buffer_t", file: !573, line: 83, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !30, !104, !103, !674, !720, !103, !104, null}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "syslog_buffer_t", file: !570, line: 135, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 132, size: 2368, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "occupied", scope: !724, file: !570, line: 133, baseType: !38, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !724, file: !570, line: 134, baseType: !728, size: 2336, offset: 32)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2336, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 292)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !32, line: 60, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !34, line: 105, baseType: !733)
!733 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!734 = !{!735, !737, !739, !744, !567, !758, !760, !762, !764, !767, !769, !771}
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "log_control_block_common", scope: !569, file: !570, line: 158, type: !703, isLocal: false, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "syslog_task_handle", scope: !569, file: !570, line: 138, type: !40, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "syslog_buffer_pool", scope: !569, file: !570, line: 141, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, size: 37888, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 16)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "syslog_config", scope: !569, file: !570, line: 160, type: !746, isLocal: true, isDefinition: true)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "syslog_config_t", file: !573, line: 97, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syslog_config_s", file: !573, line: 122, size: 64, elements: !748)
!748 = !{!749, !756}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "save_fn", scope: !747, file: !573, line: 123, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "syslog_save_fn", file: !573, line: 107, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !747, file: !573, line: 124, baseType: !757, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "syslog_init_done", scope: !569, file: !570, line: 153, type: !38, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "syslog_drop_count", scope: !569, file: !570, line: 155, type: !38, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "g_log_queue", scope: !569, file: !570, line: 144, type: !229, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "print_level_table", scope: !569, file: !570, line: 164, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 128, elements: !425)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "syslog_task_ready", scope: !569, file: !570, line: 154, type: !38, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "syslog_init_time", scope: !569, file: !570, line: 152, type: !38, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "log_switch_table", scope: !569, file: !570, line: 162, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 64, elements: !419)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !592, line: 113, baseType: !591)
!775 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "NOR_FLASH_BUSY", scope: !778, file: !779, line: 74, type: !536, isLocal: false, isDefinition: true)
!778 = distinct !DICompileUnit(language: DW_LANG_C99, file: !779, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !780, retainedTypes: !818, globals: !819, splitDebugInlining: false, nameTableKind: None)
!779 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/flash_sfc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!780 = !{!781, !795, !653, !803, !812}
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !782, line: 52, baseType: !103, size: 32, elements: !783)
!782 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/spi_flash.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794}
!784 = !DIEnumerator(name: "SF_DRV_NOT_READY", value: -1)
!785 = !DIEnumerator(name: "SF_DRV_READY", value: 0)
!786 = !DIEnumerator(name: "SF_DRV_READING", value: 1)
!787 = !DIEnumerator(name: "SF_DRV_DIRECT_READING", value: 2)
!788 = !DIEnumerator(name: "SF_DRV_PROGRAMMING", value: 3)
!789 = !DIEnumerator(name: "SF_DRV_ERASE_WRITE", value: 4)
!790 = !DIEnumerator(name: "SF_DRV_ERASE_WRITE_CRC", value: 5)
!791 = !DIEnumerator(name: "SF_DRV_SECTOR_4K_ERASING", value: 6)
!792 = !DIEnumerator(name: "SF_DRV_SECTOR_32K_ERASING", value: 7)
!793 = !DIEnumerator(name: "SF_DRV_SECTOR_64K_ERASING", value: 8)
!794 = !DIEnumerator(name: "SF_DRV_CHIP_ERASING", value: 9)
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !796, line: 387, baseType: !103, size: 32, elements: !797)
!796 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!797 = !{!798, !799, !800, !801, !802}
!798 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!799 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!800 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!801 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!802 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !782, line: 73, baseType: !6, size: 32, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811}
!805 = !DIEnumerator(name: "SF_TYPE_NONE", value: 0)
!806 = !DIEnumerator(name: "SF_TYPE_MXIC", value: 194)
!807 = !DIEnumerator(name: "SF_TYPE_WINBOND", value: 239)
!808 = !DIEnumerator(name: "SF_TYPE_GD", value: 200)
!809 = !DIEnumerator(name: "SF_TYPE_MICRON", value: 32)
!810 = !DIEnumerator(name: "SF_TYPE_CUSTOMER", value: 255)
!811 = !DIEnumerator(name: "SF_TYPE_COUNT", value: 65535)
!812 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !813, line: 123, baseType: !6, size: 32, elements: !814)
!813 = !DIFile(filename: "../../../../../driver/chip/inc/hal_flash.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!814 = !{!815, !816, !817}
!815 = !DIEnumerator(name: "HAL_FLASH_BLOCK_4K", value: 0)
!816 = !DIEnumerator(name: "HAL_FLASH_BLOCK_32K", value: 1)
!817 = !DIEnumerator(name: "HAL_FLASH_BLOCK_64K", value: 2)
!818 = !{!30, !319, !43}
!819 = !{!820, !776, !823, !825, !827, !829, !831, !833}
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "sf_drvier_status", scope: !778, file: !779, line: 72, type: !822, isLocal: false, isDefinition: true)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_DRV_STATE", file: !782, line: 64, baseType: !781)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "NOR_FLASH_SUSPENDED", scope: !778, file: !779, line: 75, type: !536, isLocal: false, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "gucFlashSFCMode", scope: !778, file: !779, line: 77, type: !38, isLocal: false, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "suspend_time", scope: !778, file: !779, line: 82, type: !38, isLocal: false, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "resume_suspend_on_ready", scope: !778, file: !779, line: 83, type: !38, isLocal: false, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "resume_suspend_on_checkready", scope: !778, file: !779, line: 84, type: !38, isLocal: false, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "sf_Mutex", scope: !778, file: !779, line: 78, type: !103, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !838, file: !839, line: 71, type: !910, isLocal: false, isDefinition: true)
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !840, retainedTypes: !891, globals: !896, splitDebugInlining: false, nameTableKind: None)
!839 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!840 = !{!841, !846}
!841 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !842, line: 121, baseType: !6, size: 32, elements: !843)
!842 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!843 = !{!844, !845}
!844 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!845 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!846 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !847, line: 47, baseType: !103, size: 32, elements: !848)
!847 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!848 = !{!849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890}
!849 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!850 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!851 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!852 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!853 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!854 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!855 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!856 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!857 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!858 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!859 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!860 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!861 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!862 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!863 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!864 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!865 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!866 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!867 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!868 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!869 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!870 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!871 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!872 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!873 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!874 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!875 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!876 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!877 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!878 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!879 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!880 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!881 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!882 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!883 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!884 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!885 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!886 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!887 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!888 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!889 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!890 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!891 = !{!892, !895}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !842, line: 116, baseType: !6)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !847, line: 95, baseType: !846)
!896 = !{!836, !897}
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !838, file: !839, line: 67, type: !899, isLocal: true, isDefinition: true)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !900, line: 111, baseType: !901)
!900 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !900, line: 109, size: 96, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !901, file: !900, line: 110, baseType: !904, size: 96)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !900, line: 106, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !900, line: 102, size: 96, elements: !906)
!906 = !{!907, !908, !909}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !905, file: !900, line: 103, baseType: !556, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !905, file: !900, line: 104, baseType: !556, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !905, file: !900, line: 105, baseType: !556, size: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !842, line: 62, baseType: !6)
!912 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!913 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "g_sfc_security_enable", scope: !916, file: !917, line: 58, type: !6, isLocal: false, isDefinition: true)
!916 = distinct !DICompileUnit(language: DW_LANG_C99, file: !917, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !918, retainedTypes: !925, globals: !929, splitDebugInlining: false, nameTableKind: None)
!917 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/sfc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!918 = !{!919}
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !782, line: 45, baseType: !6, size: 32, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIEnumerator(name: "SF_UNDEF", value: 0)
!922 = !DIEnumerator(name: "SPI", value: 1)
!923 = !DIEnumerator(name: "SPIQ", value: 2)
!924 = !DIEnumerator(name: "QPI", value: 3)
!925 = !{!892, !42, !6, !434, !926, !927}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !98)
!929 = !{!914}
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "gSFC_max_data_size", scope: !932, file: !933, line: 67, type: !6, isLocal: false, isDefinition: true)
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !934, retainedTypes: !941, globals: !956, splitDebugInlining: false, nameTableKind: None)
!933 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/spi_flash.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/linkit7697_hdk/templates/freertos_create_thread/GCC")
!934 = !{!803, !781, !919, !935}
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !782, line: 66, baseType: !103, size: 32, elements: !936)
!936 = !{!937, !938, !939, !940}
!937 = !DIEnumerator(name: "FLASH_NOT_READY", value: -1)
!938 = !DIEnumerator(name: "FLASH_READY", value: 0)
!939 = !DIEnumerator(name: "FLASH_PROGRAMMING", value: 1)
!940 = !DIEnumerator(name: "FLASH_ERASING", value: 2)
!941 = !{!942, !29, !944, !6, !30, !95, !38, !894}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chip_info", file: !782, line: 137, size: 192, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !953, !954, !955}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !946, file: !782, line: 138, baseType: !701, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !946, file: !782, line: 139, baseType: !98, size: 8, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !946, file: !782, line: 140, baseType: !29, size: 32, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !946, file: !782, line: 141, baseType: !29, size: 32, offset: 96)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !946, file: !782, line: 142, baseType: !6, size: 32, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !946, file: !782, line: 144, baseType: !98, size: 8, offset: 160)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !946, file: !782, line: 145, baseType: !98, size: 8, offset: 168)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !946, file: !782, line: 146, baseType: !98, size: 8, offset: 176)
!956 = !{!930, !957, !960, !963, !968, !971, !973, !976, !978, !980, !982, !984, !986, !988, !990, !992, !994, !996, !998, !1003, !1005, !1007, !1009, !1012}
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_winbond", scope: !932, file: !933, line: 70, type: !959, isLocal: false, isDefinition: true)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 96, elements: !408)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_winbond", scope: !932, file: !933, line: 73, type: !962, isLocal: false, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 32, elements: !425)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_winbond", scope: !932, file: !933, line: 76, type: !965, isLocal: false, isDefinition: true)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 72, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 9)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "cmdlist_suspend_winbond", scope: !932, file: !933, line: 79, type: !970, isLocal: false, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 32, elements: !425)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "cmdlist_resume_winbond", scope: !932, file: !933, line: 82, type: !970, isLocal: false, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_mxic", scope: !932, file: !933, line: 87, type: !975, isLocal: false, isDefinition: true)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 64, elements: !231)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_mxic", scope: !932, file: !933, line: 91, type: !975, isLocal: false, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_mxic", scope: !932, file: !933, line: 95, type: !975, isLocal: false, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd", scope: !932, file: !933, line: 100, type: !965, isLocal: false, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd", scope: !932, file: !933, line: 104, type: !965, isLocal: false, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd", scope: !932, file: !933, line: 108, type: !965, isLocal: false, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd25q32c", scope: !932, file: !933, line: 112, type: !975, isLocal: false, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd25q32c", scope: !932, file: !933, line: 115, type: !975, isLocal: false, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd25q32c", scope: !932, file: !933, line: 119, type: !975, isLocal: false, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_micron", scope: !932, file: !933, line: 123, type: !975, isLocal: false, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_micron", scope: !932, file: !933, line: 126, type: !975, isLocal: false, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_micron", scope: !932, file: !933, line: 130, type: !975, isLocal: false, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_spimode", scope: !932, file: !933, line: 135, type: !1000, isLocal: false, isDefinition: true)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 56, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 7)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_qpimode", scope: !932, file: !933, line: 138, type: !1000, isLocal: false, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "spi_chip_info", scope: !932, file: !933, line: 142, type: !944, isLocal: false, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "gd_write_sr2_1", scope: !932, file: !933, line: 161, type: !103, isLocal: false, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(name: "support_flash_id", scope: !932, file: !933, line: 162, type: !1011, isLocal: false, isDefinition: true)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_TYPT", file: !782, line: 81, baseType: !803)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "chips_data", scope: !932, file: !933, line: 144, type: !1014, isLocal: true, isDefinition: true)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 2496, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 13)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !1019, file: !1020, line: 43, type: !38, isLocal: true, isDefinition: true)
!1019 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1020, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1021, globals: !1026, splitDebugInlining: false, nameTableKind: None)
