; ModuleID = 'build/96b_argonkey/out_of_tree_driver/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.15 }
%union.anon.15 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.15 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.15, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 109, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 6208, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 97)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 3104, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "dev", scope: !27, file: !106, line: 11, type: !107, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !105, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_HELLO_WORLD", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_LAST", value: 67)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !{!25}
!106 = !DIFile(filename: "zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112, !116, !117, !118, !127, !128}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !110, line: 380, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !109, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !109, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !110, line: 386, baseType: !119, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !121)
!121 = !{!122, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !120, file: !110, line: 359, baseType: !123, size: 8)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !124)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !120, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !109, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !110, line: 43, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !133)
!133 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "_char_out", scope: !136, file: !139, line: 54, type: !140, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !138, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!138 = !{!134}
!139 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DISubroutineType(types: !142)
!142 = !{!104, !104}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !145, file: !163, line: 56, type: !164, isLocal: true, isDefinition: true, align: 32)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !147, globals: !162, splitDebugInlining: false, nameTableKind: None)
!146 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !150, line: 379, baseType: !151)
!150 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f412cx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 370, size: 224, elements: !152)
!152 = !{!153, !156, !157, !158, !159, !160, !161}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !151, file: !150, line: 372, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !151, file: !150, line: 373, baseType: !154, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !151, file: !150, line: 374, baseType: !154, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !151, file: !150, line: 375, baseType: !154, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !151, file: !150, line: 376, baseType: !154, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !151, file: !150, line: 377, baseType: !154, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !151, file: !150, line: 378, baseType: !154, size: 32, offset: 192)
!162 = !{!143}
!163 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !166, line: 51, size: 64, elements: !167)
!166 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!167 = !{!168, !187}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !165, file: !166, line: 60, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DISubroutineType(types: !171)
!171 = !{!104, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !175)
!175 = !{!176, !177, !178, !179, !185, !186}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !110, line: 380, baseType: !113, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !174, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !174, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !174, file: !110, line: 386, baseType: !180, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !181, file: !110, line: 359, baseType: !123, size: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !181, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !174, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !165, file: !166, line: 65, baseType: !172, size: 32, offset: 32)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !190, file: !193, line: 71, type: !194, isLocal: true, isDefinition: true, align: 32)
!190 = distinct !DICompileUnit(language: DW_LANG_C99, file: !191, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !192, splitDebugInlining: false, nameTableKind: None)
!191 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!192 = !{!188}
!193 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !166, line: 51, size: 64, elements: !196)
!196 = !{!197, !216}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !195, file: !166, line: 60, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!104, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !204)
!204 = !{!205, !206, !207, !208, !214, !215}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !110, line: 380, baseType: !113, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !203, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !203, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !203, file: !110, line: 386, baseType: !209, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !210, file: !110, line: 359, baseType: !123, size: 8)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !210, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !203, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !203, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !195, file: !166, line: 65, baseType: !201, size: 32, offset: 32)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "static_regions", scope: !219, file: !228, line: 62, type: !369, isLocal: true, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !221, globals: !224, splitDebugInlining: false, nameTableKind: None)
!220 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!221 = !{!222, !104, !155, !103}
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !223, line: 214, baseType: !32)
!223 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = !{!225, !217}
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !227, file: !228, line: 198, type: !355, isLocal: true, isDefinition: true)
!227 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !228, file: !228, line: 175, type: !229, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !219, retainedNodes: !350)
!228 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !233, line: 245, size: 1024, elements: !234)
!233 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = !{!235, !304, !317, !318, !319, !320, !326, !345}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !232, file: !233, line: 247, baseType: !236, size: 384)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !233, line: 57, size: 384, elements: !237)
!237 = !{!238, !266, !274, !275, !276, !289, !290, !291}
!238 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !233, line: 60, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !233, line: 60, size: 64, elements: !240)
!240 = !{!241, !257}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !239, file: !233, line: 61, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !243, line: 49, baseType: !244)
!243 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !243, line: 37, size: 64, elements: !245)
!245 = !{!246, !252}
!246 = !DIDerivedType(tag: DW_TAG_member, scope: !244, file: !243, line: 38, baseType: !247, size: 32)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !243, line: 38, size: 32, elements: !248)
!248 = !{!249, !251}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !247, file: !243, line: 39, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !243, line: 40, baseType: !250, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, scope: !244, file: !243, line: 42, baseType: !253, size: 32, offset: 32)
!253 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !243, line: 42, size: 32, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !253, file: !243, line: 43, baseType: !250, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !253, file: !243, line: 44, baseType: !250, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !239, file: !233, line: 62, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !259, line: 49, size: 64, elements: !260)
!259 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !258, file: !259, line: 50, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 64, elements: !264)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!264 = !{!265}
!265 = !DISubrange(count: 2)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !236, file: !233, line: 68, baseType: !267, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !269, line: 233, baseType: !270)
!269 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 231, size: 64, elements: !271)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !270, file: !269, line: 232, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !243, line: 48, baseType: !244)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !236, file: !233, line: 71, baseType: !123, size: 8, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !236, file: !233, line: 74, baseType: !123, size: 8, offset: 104)
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !233, line: 90, baseType: !277, size: 16, offset: 112)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !233, line: 90, size: 16, elements: !278)
!278 = !{!279, !286}
!279 = !DIDerivedType(tag: DW_TAG_member, scope: !277, file: !233, line: 91, baseType: !280, size: 16)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !277, file: !233, line: 91, size: 16, elements: !281)
!281 = !{!282, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !280, file: !233, line: 96, baseType: !283, size: 8)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !284)
!284 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !280, file: !233, line: 97, baseType: !123, size: 8, offset: 8)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !277, file: !233, line: 100, baseType: !287, size: 16)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !288)
!288 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !236, file: !233, line: 107, baseType: !155, size: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !236, file: !233, line: 127, baseType: !103, size: 32, offset: 160)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !236, file: !233, line: 131, baseType: !292, size: 192, offset: 192)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !269, line: 244, size: 192, elements: !293)
!293 = !{!294, !295, !301}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !292, file: !269, line: 245, baseType: !242, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !292, file: !269, line: 246, baseType: !296, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !269, line: 242, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !292, file: !269, line: 249, baseType: !302, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !303)
!303 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !232, file: !233, line: 250, baseType: !305, size: 288, offset: 384)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !306, line: 25, size: 288, elements: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !305, file: !306, line: 26, baseType: !155, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !305, file: !306, line: 27, baseType: !155, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !305, file: !306, line: 28, baseType: !155, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !305, file: !306, line: 29, baseType: !155, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !305, file: !306, line: 30, baseType: !155, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !305, file: !306, line: 31, baseType: !155, size: 32, offset: 160)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !305, file: !306, line: 32, baseType: !155, size: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !305, file: !306, line: 33, baseType: !155, size: 32, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !305, file: !306, line: 34, baseType: !155, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !232, file: !233, line: 253, baseType: !103, size: 32, offset: 672)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !232, file: !233, line: 256, baseType: !268, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !232, file: !233, line: 294, baseType: !104, size: 32, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !232, file: !233, line: 300, baseType: !321, size: 96, offset: 800)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !233, line: 149, size: 96, elements: !322)
!322 = !{!323, !324, !325}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !321, file: !233, line: 153, baseType: !22, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !321, file: !233, line: 162, baseType: !222, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !321, file: !233, line: 168, baseType: !222, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !232, file: !233, line: 325, baseType: !327, size: 32, offset: 896)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !329, line: 5073, size: 160, elements: !330)
!329 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!330 = !{!331, !340, !341}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !328, file: !329, line: 5074, baseType: !332, size: 96)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !333, line: 56, size: 96, elements: !334)
!333 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!334 = !{!335, !338, !339}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !332, file: !333, line: 57, baseType: !336, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !333, line: 57, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !332, file: !333, line: 58, baseType: !103, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !332, file: !333, line: 59, baseType: !222, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !328, file: !329, line: 5075, baseType: !268, size: 64, offset: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !328, file: !329, line: 5076, baseType: !342, offset: 160)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !343, line: 43, elements: !344)
!343 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!344 = !{}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !232, file: !233, line: 343, baseType: !346, size: 64, offset: 928)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !306, line: 60, size: 64, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !346, file: !306, line: 63, baseType: !155, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !346, file: !306, line: 66, baseType: !155, size: 32, offset: 32)
!350 = !{!351, !352, !353, !354}
!351 = !DILocalVariable(name: "thread", arg: 1, scope: !227, file: !228, line: 175, type: !231)
!352 = !DILocalVariable(name: "region_num", scope: !227, file: !228, line: 200, type: !123)
!353 = !DILocalVariable(name: "guard_start", scope: !227, file: !228, line: 265, type: !22)
!354 = !DILocalVariable(name: "guard_size", scope: !227, file: !228, line: 266, type: !222)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 96, elements: !367)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !357, line: 52, size: 96, elements: !358)
!357 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = !{!359, !360, !361}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !356, file: !357, line: 53, baseType: !22, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !356, file: !357, line: 54, baseType: !222, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !356, file: !357, line: 55, baseType: !362, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !363, line: 151, baseType: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 149, size: 32, elements: !365)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !364, file: !363, line: 150, baseType: !155, size: 32)
!367 = !{!368}
!368 = !DISubrange(count: 1)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 96, elements: !367)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !373, file: !406, line: 39, type: !123, isLocal: true, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !375, globals: !405, splitDebugInlining: false, nameTableKind: None)
!374 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!375 = !{!376, !103, !104, !393, !123}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !378, line: 1226, baseType: !379)
!378 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 1213, size: 352, elements: !380)
!380 = !{!381, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !379, file: !378, line: 1215, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !379, file: !378, line: 1216, baseType: !154, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !379, file: !378, line: 1217, baseType: !154, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !379, file: !378, line: 1218, baseType: !154, size: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !379, file: !378, line: 1219, baseType: !154, size: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !379, file: !378, line: 1220, baseType: !154, size: 32, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !379, file: !378, line: 1221, baseType: !154, size: 32, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !379, file: !378, line: 1222, baseType: !154, size: 32, offset: 224)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !379, file: !378, line: 1223, baseType: !154, size: 32, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !379, file: !378, line: 1224, baseType: !154, size: 32, offset: 288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !379, file: !378, line: 1225, baseType: !154, size: 32, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !396, line: 27, size: 96, elements: !397)
!396 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!397 = !{!398, !399, !400}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !395, file: !396, line: 29, baseType: !155, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !395, file: !396, line: 31, baseType: !113, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !395, file: !396, line: 37, baseType: !401, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !363, line: 146, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !363, line: 141, size: 32, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !402, file: !363, line: 143, baseType: !155, size: 32)
!405 = !{!371}
!406 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !409, file: !416, line: 21, type: !140, isLocal: true, isDefinition: true)
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !411, globals: !415, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!411 = !{!412, !104, !103}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !414, line: 22, baseType: !104)
!414 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!415 = !{!407}
!416 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !419, file: !424, line: 13, type: !441, isLocal: true, isDefinition: true)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !421, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!421 = !{!422, !417}
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "mpu_config", scope: !419, file: !424, line: 37, type: !425, isLocal: false, isDefinition: true)
!424 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !396, line: 41, size: 64, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !426, file: !396, line: 43, baseType: !155, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !426, file: !396, line: 45, baseType: !430, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !396, line: 27, size: 96, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !432, file: !396, line: 29, baseType: !155, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !396, line: 31, baseType: !113, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !432, file: !396, line: 37, baseType: !437, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !363, line: 146, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !363, line: 141, size: 32, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !438, file: !363, line: 143, baseType: !155, size: 32)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 192, elements: !264)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !444, file: !548, line: 72, type: !632, isLocal: true, isDefinition: true)
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !446, retainedTypes: !534, globals: !545, splitDebugInlining: false, nameTableKind: None)
!445 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!446 = !{!30, !447}
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !150, line: 65, baseType: !104, size: 32, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!449 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!450 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!451 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!452 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!453 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!454 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!455 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!456 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!457 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!458 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!459 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!460 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!461 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!462 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!463 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!464 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!465 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!466 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!467 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!468 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!469 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!470 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!471 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!472 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!473 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!474 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!475 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!476 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!477 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!478 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!479 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!480 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!481 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!482 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!483 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!484 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!485 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!486 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!487 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!488 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!489 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!490 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!491 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!492 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!493 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!494 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!495 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!496 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!497 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!498 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!499 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!500 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!501 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!502 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!503 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!504 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!505 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!506 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!507 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!508 = !DIEnumerator(name: "TIM6_IRQn", value: 54)
!509 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!510 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!511 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!512 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!513 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!514 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!515 = !DIEnumerator(name: "DFSDM1_FLT0_IRQn", value: 61)
!516 = !DIEnumerator(name: "DFSDM1_FLT1_IRQn", value: 62)
!517 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!518 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!519 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!520 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!521 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!522 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!523 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!524 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!525 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!526 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!527 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!528 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!529 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!530 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!531 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!532 = !DIEnumerator(name: "FMPI2C1_EV_IRQn", value: 95)
!533 = !DIEnumerator(name: "FMPI2C1_ER_IRQn", value: 96)
!534 = !{!222, !104, !103, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !150, line: 364, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 356, size: 192, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !537, file: !150, line: 358, baseType: !154, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !537, file: !150, line: 359, baseType: !154, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !537, file: !150, line: 360, baseType: !154, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !537, file: !150, line: 361, baseType: !154, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !537, file: !150, line: 362, baseType: !154, size: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !537, file: !150, line: 363, baseType: !154, size: 32, offset: 160)
!545 = !{!546, !552, !568, !579, !596, !442, !598, !612, !614, !616, !618, !620, !622, !624, !626, !628, !630}
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !444, file: !548, line: 424, type: !549, isLocal: false, isDefinition: true, align: 16)
!548 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 64, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 4)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "__device_dts_ord_35", scope: !444, file: !548, line: 424, type: !554, isLocal: false, isDefinition: true, align: 32)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !556)
!556 = !{!557, !558, !559, !560, !566, !567}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !555, file: !110, line: 380, baseType: !113, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !555, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !555, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !555, file: !110, line: 386, baseType: !561, size: 32, offset: 96)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !562, file: !110, line: 359, baseType: !123, size: 8)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !562, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !555, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !555, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_35", scope: !444, file: !548, line: 424, type: !570, isLocal: true, isDefinition: true, align: 32)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !166, line: 51, size: 64, elements: !572)
!572 = !{!573, !578}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !571, file: !166, line: 60, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = !DISubroutineType(types: !576)
!576 = !{!104, !577}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !571, file: !166, line: 65, baseType: !577, size: 32, offset: 32)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "exti_data", scope: !444, file: !548, line: 423, type: !581, isLocal: true, isDefinition: true)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !548, line: 107, size: 1472, elements: !582)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !581, file: !548, line: 109, baseType: !584, size: 1472)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 1472, elements: !594)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !548, line: 101, size: 64, elements: !586)
!586 = !{!587, !593}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !585, file: !548, line: 102, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !589, line: 63, baseType: !590)
!589 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !104, !103}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !585, file: !548, line: 103, baseType: !103, size: 32, offset: 32)
!594 = !{!595}
!595 = !DISubrange(count: 23)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_35", scope: !444, file: !548, line: 424, type: !562, isLocal: true, isDefinition: true, align: 8)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !600, file: !548, line: 493, type: !605, isLocal: true, isDefinition: true, align: 32)
!600 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !548, file: !548, line: 460, type: !601, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !444, retainedNodes: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !577}
!603 = !{!604}
!604 = !DILocalVariable(name: "dev", arg: 1, scope: !600, file: !548, line: 460, type: !577)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !606)
!606 = !{!607, !609, !610, !611}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !605, file: !10, line: 55, baseType: !608, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !104)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !605, file: !10, line: 57, baseType: !608, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !605, file: !10, line: 59, baseType: !103, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !605, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !600, file: !548, line: 497, type: !605, isLocal: true, isDefinition: true, align: 32)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !600, file: !548, line: 507, type: !605, isLocal: true, isDefinition: true, align: 32)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !600, file: !548, line: 512, type: !605, isLocal: true, isDefinition: true, align: 32)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !600, file: !548, line: 516, type: !605, isLocal: true, isDefinition: true, align: 32)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !600, file: !548, line: 523, type: !605, isLocal: true, isDefinition: true, align: 32)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !600, file: !548, line: 527, type: !605, isLocal: true, isDefinition: true, align: 32)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !600, file: !548, line: 581, type: !605, isLocal: true, isDefinition: true, align: 32)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !600, file: !548, line: 586, type: !605, isLocal: true, isDefinition: true, align: 32)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !600, file: !548, line: 591, type: !605, isLocal: true, isDefinition: true, align: 32)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !600, file: !548, line: 595, type: !605, isLocal: true, isDefinition: true, align: 32)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 736, elements: !594)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !150, line: 154, baseType: !447)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !637, file: !642, line: 22, type: !664, isLocal: false, isDefinition: true, align: 16)
!637 = distinct !DICompileUnit(language: DW_LANG_C99, file: !638, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !639, splitDebugInlining: false, nameTableKind: None)
!638 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!639 = !{!640, !635, !646, !648, !650, !652, !654, !656, !658, !660, !662, !667}
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !637, file: !642, line: 17, type: !643, isLocal: false, isDefinition: true, align: 16)
!642 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 192, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 12)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_79", scope: !637, file: !642, line: 29, type: !549, isLocal: false, isDefinition: true, align: 16)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_78", scope: !637, file: !642, line: 36, type: !549, isLocal: false, isDefinition: true, align: 16)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_77", scope: !637, file: !642, line: 43, type: !549, isLocal: false, isDefinition: true, align: 16)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !637, file: !642, line: 50, type: !549, isLocal: false, isDefinition: true, align: 16)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !637, file: !642, line: 57, type: !549, isLocal: false, isDefinition: true, align: 16)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_22", scope: !637, file: !642, line: 64, type: !549, isLocal: false, isDefinition: true, align: 16)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !637, file: !642, line: 71, type: !549, isLocal: false, isDefinition: true, align: 16)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !637, file: !642, line: 78, type: !549, isLocal: false, isDefinition: true, align: 16)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "__devicehdl_hello_world", scope: !637, file: !642, line: 83, type: !664, isLocal: false, isDefinition: true, align: 16)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 48, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 3)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_44", scope: !637, file: !642, line: 90, type: !549, isLocal: false, isDefinition: true, align: 16)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !671, file: !733, line: 398, type: !766, isLocal: true, isDefinition: true)
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !673, retainedTypes: !686, globals: !730, splitDebugInlining: false, nameTableKind: None)
!672 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!673 = !{!674, !30, !679}
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !675, line: 197, baseType: !32, size: 32, elements: !676)
!675 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!676 = !{!677, !678}
!677 = !DIEnumerator(name: "SUCCESS", value: 0)
!678 = !DIEnumerator(name: "ERROR", value: 1)
!679 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !680, line: 44, baseType: !32, size: 32, elements: !681)
!680 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!681 = !{!682, !683, !684, !685}
!682 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!683 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!684 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!685 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!686 = !{!103, !104, !155, !687, !723, !729}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !150, line: 510, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 477, size: 1216, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696, !697, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !689, file: !150, line: 479, baseType: !154, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !689, file: !150, line: 480, baseType: !154, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !689, file: !150, line: 481, baseType: !154, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !689, file: !150, line: 482, baseType: !154, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !689, file: !150, line: 483, baseType: !154, size: 32, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !689, file: !150, line: 484, baseType: !154, size: 32, offset: 160)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !689, file: !150, line: 485, baseType: !698, size: 64, offset: 192)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 64, elements: !264)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !689, file: !150, line: 486, baseType: !154, size: 32, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !689, file: !150, line: 487, baseType: !154, size: 32, offset: 288)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !689, file: !150, line: 488, baseType: !698, size: 64, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !689, file: !150, line: 489, baseType: !154, size: 32, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !689, file: !150, line: 490, baseType: !154, size: 32, offset: 416)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !689, file: !150, line: 491, baseType: !698, size: 64, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !689, file: !150, line: 492, baseType: !154, size: 32, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !689, file: !150, line: 493, baseType: !154, size: 32, offset: 544)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !689, file: !150, line: 494, baseType: !698, size: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !689, file: !150, line: 495, baseType: !154, size: 32, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !689, file: !150, line: 496, baseType: !154, size: 32, offset: 672)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !689, file: !150, line: 497, baseType: !698, size: 64, offset: 704)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !689, file: !150, line: 498, baseType: !154, size: 32, offset: 768)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !689, file: !150, line: 499, baseType: !154, size: 32, offset: 800)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !689, file: !150, line: 500, baseType: !698, size: 64, offset: 832)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !689, file: !150, line: 501, baseType: !154, size: 32, offset: 896)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !689, file: !150, line: 502, baseType: !154, size: 32, offset: 928)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !689, file: !150, line: 503, baseType: !698, size: 64, offset: 960)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !689, file: !150, line: 504, baseType: !154, size: 32, offset: 1024)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !689, file: !150, line: 505, baseType: !154, size: 32, offset: 1056)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !689, file: !150, line: 506, baseType: !155, size: 32, offset: 1088)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !689, file: !150, line: 507, baseType: !154, size: 32, offset: 1120)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "CKGATENR", scope: !689, file: !150, line: 508, baseType: !154, size: 32, offset: 1152)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR2", scope: !689, file: !150, line: 509, baseType: !154, size: 32, offset: 1184)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !725, line: 343, size: 64, elements: !726)
!725 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !724, file: !725, line: 344, baseType: !155, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !724, file: !725, line: 345, baseType: !155, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!730 = !{!731, !737, !753, !764, !669}
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !671, file: !733, line: 752, type: !734, isLocal: false, isDefinition: true, align: 16)
!733 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 848, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 53)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !671, file: !733, line: 752, type: !739, isLocal: false, isDefinition: true, align: 32)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !741)
!741 = !{!742, !743, !744, !745, !751, !752}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !740, file: !110, line: 380, baseType: !113, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !740, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !740, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !740, file: !110, line: 386, baseType: !746, size: 32, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !747, file: !110, line: 359, baseType: !123, size: 8)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !747, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !740, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !740, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !671, file: !733, line: 752, type: !755, isLocal: true, isDefinition: true, align: 32)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !166, line: 51, size: 64, elements: !757)
!757 = !{!758, !763}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !756, file: !166, line: 60, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DISubroutineType(types: !761)
!761 = !{!104, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !756, file: !166, line: 65, baseType: !762, size: 32, offset: 32)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !671, file: !733, line: 752, type: !747, isLocal: true, isDefinition: true, align: 8)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !680, line: 100, size: 224, elements: !767)
!767 = !{!768, !774, !775, !784, !789, !794, !800}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !766, file: !680, line: 101, baseType: !769, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !680, line: 76, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!771 = !DISubroutineType(types: !772)
!772 = !{!104, !762, !773}
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !680, line: 56, baseType: !103)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !766, file: !680, line: 102, baseType: !769, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !766, file: !680, line: 103, baseType: !776, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !680, line: 83, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DISubroutineType(types: !779)
!779 = !{!104, !762, !773, !780, !103}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !680, line: 72, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !762, !773, !103}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !766, file: !680, line: 104, baseType: !785, size: 32, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !680, line: 79, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DISubroutineType(types: !788)
!788 = !{!104, !762, !773, !729}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !766, file: !680, line: 105, baseType: !790, size: 32, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !680, line: 88, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DISubroutineType(types: !793)
!793 = !{!679, !762, !773}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !766, file: !680, line: 106, baseType: !795, size: 32, offset: 160)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !680, line: 92, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DISubroutineType(types: !798)
!798 = !{!104, !762, !773, !799}
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !680, line: 64, baseType: !103)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !766, file: !680, line: 107, baseType: !801, size: 32, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !680, line: 96, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DISubroutineType(types: !804)
!804 = !{!104, !762, !773, !103}
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !807, file: !864, line: 603, type: !866, isLocal: true, isDefinition: true, align: 32)
!807 = distinct !DICompileUnit(language: DW_LANG_C99, file: !808, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !809, globals: !861, splitDebugInlining: false, nameTableKind: None)
!808 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!809 = !{!103, !104, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !813, line: 336, size: 160, elements: !814)
!813 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!814 = !{!815, !835, !839, !843, !856}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !812, file: !813, line: 365, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DISubroutineType(types: !818)
!818 = !{!104, !819, !834}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !822)
!822 = !{!823, !824, !825, !826, !832, !833}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !821, file: !110, line: 380, baseType: !113, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !821, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !821, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !821, file: !110, line: 386, baseType: !827, size: 32, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !828, file: !110, line: 359, baseType: !123, size: 8)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !828, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !821, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !821, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !812, file: !813, line: 366, baseType: !836, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !819, !124}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !812, file: !813, line: 374, baseType: !840, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DISubroutineType(types: !842)
!842 = !{!104, !819}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !812, file: !813, line: 377, baseType: !844, size: 32, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DISubroutineType(types: !846)
!846 = !{!104, !819, !847}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !813, line: 122, size: 64, elements: !850)
!850 = !{!851, !852, !853, !854, !855}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !849, file: !813, line: 123, baseType: !155, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !849, file: !813, line: 124, baseType: !123, size: 8, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !849, file: !813, line: 125, baseType: !123, size: 8, offset: 40)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !849, file: !813, line: 126, baseType: !123, size: 8, offset: 48)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !849, file: !813, line: 127, baseType: !123, size: 8, offset: 56)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !812, file: !813, line: 379, baseType: !857, size: 32, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DISubroutineType(types: !859)
!859 = !{!104, !819, !860}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!861 = !{!805, !862}
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !807, file: !864, line: 38, type: !865, isLocal: true, isDefinition: true)
!864 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !166, line: 51, size: 64, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !867, file: !166, line: 60, baseType: !840, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !867, file: !166, line: 65, baseType: !819, size: 32, offset: 32)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !873, file: !1045, line: 762, type: !1157, isLocal: true, isDefinition: true)
!873 = distinct !DICompileUnit(language: DW_LANG_C99, file: !874, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !875, retainedTypes: !893, globals: !1042, splitDebugInlining: false, nameTableKind: None)
!874 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/out_of_tree_driver")
!875 = !{!30, !876, !882, !887, !679}
!876 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !877, line: 506, baseType: !32, size: 32, elements: !878)
!877 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!878 = !{!879, !880, !881}
!879 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!880 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!881 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !877, line: 512, baseType: !32, size: 32, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!885 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!886 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !589, line: 43, baseType: !32, size: 32, elements: !888)
!888 = !{!889, !890, !891, !892}
!889 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!890 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!891 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!892 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!893 = !{!103, !104, !894, !964, !969, !929, !882, !876, !974, !975, !155, !989, !944, !1001, !1002, !1003}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !877, line: 523, size: 288, elements: !897)
!897 = !{!898, !919, !925, !930, !934, !935, !936, !940, !960}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !896, file: !877, line: 524, baseType: !899, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32)
!900 = !DISubroutineType(types: !901)
!901 = !{!104, !902, !917, !918}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !905)
!905 = !{!906, !907, !908, !909, !915, !916}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !904, file: !110, line: 380, baseType: !113, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !904, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !904, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !904, file: !110, line: 386, baseType: !910, size: 32, offset: 96)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !911, file: !110, line: 359, baseType: !123, size: 8)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !911, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !904, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !904, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !877, line: 237, baseType: !123)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !877, line: 257, baseType: !155)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !896, file: !877, line: 530, baseType: !920, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = !DISubroutineType(types: !922)
!922 = !{!104, !902, !923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !877, line: 229, baseType: !155)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !896, file: !877, line: 532, baseType: !926, size: 32, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DISubroutineType(types: !928)
!928 = !{!104, !902, !929, !924}
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !877, line: 216, baseType: !155)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !896, file: !877, line: 535, baseType: !931, size: 32, offset: 96)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DISubroutineType(types: !933)
!933 = !{!104, !902, !929}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !896, file: !877, line: 537, baseType: !931, size: 32, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !896, file: !877, line: 539, baseType: !931, size: 32, offset: 160)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !896, file: !877, line: 541, baseType: !937, size: 32, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{!104, !902, !917, !876, !882}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !896, file: !877, line: 544, baseType: !941, size: 32, offset: 224)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DISubroutineType(types: !943)
!943 = !{!104, !902, !944, !126}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !877, line: 478, size: 96, elements: !946)
!946 = !{!947, !954, !959}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !945, file: !877, line: 482, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !949, line: 33, baseType: !950)
!949 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !949, line: 29, size: 32, elements: !951)
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !950, file: !949, line: 30, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !945, file: !877, line: 485, baseType: !955, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !877, line: 464, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !902, !944, !929}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !945, file: !877, line: 493, baseType: !929, size: 32, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !896, file: !877, line: 547, baseType: !961, size: 32, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DISubroutineType(types: !963)
!963 = !{!155, !902}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !877, line: 428, size: 32, elements: !967)
!967 = !{!968}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !966, file: !877, line: 434, baseType: !929, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !877, line: 441, size: 32, elements: !972)
!972 = !{!973}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !971, file: !877, line: 447, baseType: !929, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !150, line: 396, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 385, size: 320, elements: !978)
!978 = !{!979, !980, !981, !982, !983, !984, !985, !986, !987}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !977, file: !150, line: 387, baseType: !154, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !977, file: !150, line: 388, baseType: !154, size: 32, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !977, file: !150, line: 389, baseType: !154, size: 32, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !977, file: !150, line: 390, baseType: !154, size: 32, offset: 96)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !977, file: !150, line: 391, baseType: !154, size: 32, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !977, file: !150, line: 392, baseType: !154, size: 32, offset: 160)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !977, file: !150, line: 393, baseType: !154, size: 32, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !977, file: !150, line: 394, baseType: !154, size: 32, offset: 224)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !977, file: !150, line: 395, baseType: !988, size: 64, offset: 256)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 64, elements: !264)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !150, line: 411, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 402, size: 320, elements: !992)
!992 = !{!993, !994, !995, !997, !998, !999, !1000}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !991, file: !150, line: 404, baseType: !154, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !991, file: !150, line: 405, baseType: !154, size: 32, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !991, file: !150, line: 406, baseType: !996, size: 128, offset: 64)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 128, elements: !550)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !991, file: !150, line: 407, baseType: !155, size: 32, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !991, file: !150, line: 408, baseType: !154, size: 32, offset: 224)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !991, file: !150, line: 409, baseType: !154, size: 32, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !991, file: !150, line: 410, baseType: !154, size: 32, offset: 288)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !680, line: 100, size: 224, elements: !1006)
!1006 = !{!1007, !1012, !1013, !1022, !1027, !1032, !1037}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1005, file: !680, line: 101, baseType: !1008, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !680, line: 76, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!104, !902, !773}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1005, file: !680, line: 102, baseType: !1008, size: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1005, file: !680, line: 103, baseType: !1014, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !680, line: 83, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!104, !902, !773, !1018, !103}
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !680, line: 72, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{null, !902, !773, !103}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1005, file: !680, line: 104, baseType: !1023, size: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !680, line: 79, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!104, !902, !773, !729}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1005, file: !680, line: 105, baseType: !1028, size: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !680, line: 88, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!679, !902, !773}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !1005, file: !680, line: 106, baseType: !1033, size: 32, offset: 160)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !680, line: 92, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!104, !902, !773, !799}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1005, file: !680, line: 107, baseType: !1038, size: 32, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !680, line: 96, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!104, !902, !773, !103}
!1042 = !{!1043, !1049, !1051, !1061, !1063, !1065, !1067, !1072, !1074, !1076, !1081, !1083, !1085, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1123, !1125, !1127, !1129, !1131, !1133, !1135, !1137, !1139, !1141, !1143, !1145, !1147, !1149, !1151, !871, !1153, !1155, !1168, !1170, !1172, !1174, !1176, !1178}
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !873, file: !1045, line: 762, type: !1046, isLocal: false, isDefinition: true, align: 16)
!1045 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 112, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 7)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
