; ModuleID = 'build/96b_nitrogen/runtime_obs_registration/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type { i32 }
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct._slist*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 51, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2496, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 39)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1248, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_consumer_sub", scope: !27, file: !114, line: 11, type: !123, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/runtime_obs_registration/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !305, !338, !342, !347, !352}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "consumer_sub", scope: !27, file: !114, line: 11, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !116, line: 85, size: 96, elements: !117)
!116 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !{!118, !120, !166}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !115, file: !116, line: 91, baseType: !119, size: 8)
!119 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !115, file: !116, line: 93, baseType: !121, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !124, line: 4204, size: 352, elements: !125)
!124 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!125 = !{!126, !147, !152, !155, !156, !159, !160, !161, !162, !163}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !123, file: !124, line: 4206, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !128, line: 233, baseType: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 231, size: 64, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !129, file: !128, line: 232, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !133, line: 48, baseType: !134)
!133 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !133, line: 37, size: 64, elements: !135)
!135 = !{!136, !142}
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !133, line: 38, baseType: !137, size: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !133, line: 38, size: 32, elements: !138)
!138 = !{!139, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !137, file: !133, line: 39, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !133, line: 40, baseType: !140, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !133, line: 42, baseType: !143, size: 32, offset: 32)
!143 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !133, line: 42, size: 32, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !143, file: !133, line: 43, baseType: !140, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !133, line: 44, baseType: !140, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !123, file: !124, line: 4208, baseType: !148, size: 32, offset: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !149, line: 43, size: 32, elements: !150)
!149 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !148, file: !149, line: 52, baseType: !22, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !123, file: !124, line: 4210, baseType: !153, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !154, line: 214, baseType: !32)
!154 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !123, file: !124, line: 4212, baseType: !108, size: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !123, file: !124, line: 4214, baseType: !157, size: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !123, file: !124, line: 4216, baseType: !157, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !123, file: !124, line: 4218, baseType: !157, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !123, file: !124, line: 4220, baseType: !157, size: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !123, file: !124, line: 4222, baseType: !108, size: 32, offset: 288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !124, line: 4227, baseType: !164, size: 8, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !165)
!165 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !115, file: !116, line: 96, baseType: !167, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !116, line: 29, size: 224, elements: !174)
!174 = !{!175, !179, !181, !182, !187, !286, !300}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !173, file: !116, line: 35, baseType: !176, size: 16)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !178)
!178 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !173, file: !116, line: 40, baseType: !180, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !173, file: !116, line: 45, baseType: !180, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !173, file: !116, line: 51, baseType: !183, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DISubroutineType(types: !186)
!186 = !{!119, !13, !153}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !173, file: !116, line: 56, baseType: !188, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !124, line: 2720, size: 160, elements: !190)
!190 = !{!191, !192, !284, !285}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !189, file: !124, line: 2722, baseType: !127, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !189, file: !124, line: 2724, baseType: !193, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !195, line: 245, size: 1024, elements: !196)
!195 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!196 = !{!197, !242, !255, !256, !257, !258, !264, !279}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !194, file: !195, line: 247, baseType: !198, size: 384)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !195, line: 57, size: 384, elements: !199)
!199 = !{!200, !214, !216, !217, !218, !229, !230, !231}
!200 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !195, line: 60, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !195, line: 60, size: 64, elements: !202)
!202 = !{!203, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !201, file: !195, line: 61, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !133, line: 49, baseType: !134)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !201, file: !195, line: 62, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !207, line: 49, size: 64, elements: !208)
!207 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !206, file: !207, line: 50, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 64, elements: !212)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!212 = !{!213}
!213 = !DISubrange(count: 2)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !198, file: !195, line: 68, baseType: !215, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !198, file: !195, line: 71, baseType: !164, size: 8, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !198, file: !195, line: 74, baseType: !164, size: 8, offset: 104)
!218 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !195, line: 90, baseType: !219, size: 16, offset: 112)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !195, line: 90, size: 16, elements: !220)
!220 = !{!221, !228}
!221 = !DIDerivedType(tag: DW_TAG_member, scope: !219, file: !195, line: 91, baseType: !222, size: 16)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !195, line: 91, size: 16, elements: !223)
!223 = !{!224, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !222, file: !195, line: 96, baseType: !225, size: 8)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !226)
!226 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !222, file: !195, line: 97, baseType: !164, size: 8, offset: 8)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !219, file: !195, line: 100, baseType: !177, size: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !198, file: !195, line: 107, baseType: !108, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !198, file: !195, line: 127, baseType: !102, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !198, file: !195, line: 131, baseType: !232, size: 192, offset: 192)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !128, line: 244, size: 192, elements: !233)
!233 = !{!234, !235, !241}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !232, file: !128, line: 245, baseType: !204, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !232, file: !128, line: 246, baseType: !236, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !128, line: 242, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !232, file: !128, line: 249, baseType: !106, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !194, file: !195, line: 250, baseType: !243, size: 288, offset: 384)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !244, line: 25, size: 288, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !243, file: !244, line: 26, baseType: !108, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !243, file: !244, line: 27, baseType: !108, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !243, file: !244, line: 28, baseType: !108, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !243, file: !244, line: 29, baseType: !108, size: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !243, file: !244, line: 30, baseType: !108, size: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !243, file: !244, line: 31, baseType: !108, size: 32, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !243, file: !244, line: 32, baseType: !108, size: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !243, file: !244, line: 33, baseType: !108, size: 32, offset: 224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !243, file: !244, line: 34, baseType: !108, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !194, file: !195, line: 253, baseType: !102, size: 32, offset: 672)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !194, file: !195, line: 256, baseType: !127, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !194, file: !195, line: 294, baseType: !103, size: 32, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !194, file: !195, line: 300, baseType: !259, size: 96, offset: 800)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !195, line: 149, size: 96, elements: !260)
!260 = !{!261, !262, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !259, file: !195, line: 153, baseType: !22, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !259, file: !195, line: 162, baseType: !153, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !259, file: !195, line: 168, baseType: !153, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !194, file: !195, line: 325, baseType: !265, size: 32, offset: 896)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !124, line: 5073, size: 192, elements: !267)
!267 = !{!268, !277, !278}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !266, file: !124, line: 5074, baseType: !269, size: 96)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !270, line: 56, size: 96, elements: !271)
!270 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!271 = !{!272, !275, !276}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !269, file: !270, line: 57, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !270, line: 57, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !269, file: !270, line: 58, baseType: !102, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !269, file: !270, line: 59, baseType: !153, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !266, file: !124, line: 5075, baseType: !127, size: 64, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !266, file: !124, line: 5076, baseType: !148, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !194, file: !195, line: 343, baseType: !280, size: 64, offset: 928)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !244, line: 60, size: 64, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !280, file: !244, line: 63, baseType: !108, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !280, file: !244, line: 66, baseType: !108, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !189, file: !124, line: 2727, baseType: !108, size: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !189, file: !124, line: 2730, baseType: !103, size: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_observers", scope: !173, file: !116, line: 61, baseType: !287, size: 32, offset: 160)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !289, line: 40, baseType: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !289, line: 35, size: 64, elements: !291)
!291 = !{!292, !299}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !290, file: !289, line: 36, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !289, line: 33, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !289, line: 29, size: 32, elements: !296)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !289, line: 30, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !290, file: !289, line: 37, baseType: !293, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !173, file: !116, line: 67, baseType: !301, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "_k_thread_data_consumer_thread_id", scope: !27, file: !114, line: 25, type: !307, isLocal: false, isDefinition: true, align: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !124, line: 620, size: 384, elements: !308)
!308 = !{!309, !310, !318, !319, !324, !325, !326, !327, !328, !329, !331, !335}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !307, file: !124, line: 621, baseType: !193, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !307, file: !124, line: 622, baseType: !311, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !313, line: 44, baseType: !314)
!313 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !315, line: 47, size: 8, elements: !316)
!315 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !314, file: !315, line: 48, baseType: !158, size: 8)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !307, file: !124, line: 623, baseType: !32, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !307, file: !124, line: 624, baseType: !320, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !313, line: 46, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !102, !102, !102}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !307, file: !124, line: 625, baseType: !102, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !307, file: !124, line: 626, baseType: !102, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !307, file: !124, line: 627, baseType: !102, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !307, file: !124, line: 628, baseType: !103, size: 32, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !307, file: !124, line: 629, baseType: !108, size: 32, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !307, file: !124, line: 630, baseType: !330, size: 32, offset: 288)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !307, file: !124, line: 631, baseType: !332, size: 32, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DISubroutineType(types: !334)
!334 = !{null}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !307, file: !124, line: 632, baseType: !336, size: 32, offset: 352)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "consumer_thread_id", scope: !27, file: !114, line: 25, type: !340, isLocal: false, isDefinition: true)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !195, line: 347, baseType: !193)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_consumer_sub", scope: !27, file: !114, line: 11, type: !344, isLocal: true, isDefinition: true, align: 32)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 16)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "_k_thread_stack_consumer_thread_id", scope: !27, file: !114, line: 25, type: !349, isLocal: false, isDefinition: true, align: 64)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 4096, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 512)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "_k_thread_obj_consumer_thread_id", scope: !27, file: !114, line: 25, type: !194, isLocal: false, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "_zbus_mutex_processed_data_chan", scope: !356, file: !362, line: 15, type: !372, isLocal: true, isDefinition: true, align: 32)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !358, globals: !359, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/runtime_obs_registration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration")
!358 = !{!104, !102, !103, !108, !109}
!359 = !{!354, !360, !522, !524, !526, !528, !530, !535, !543}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "processed_data_chan", scope: !356, file: !362, line: 15, type: !363, isLocal: false, isDefinition: true, align: 32)
!362 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !116, line: 29, size: 224, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !480, !493}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !364, file: !116, line: 35, baseType: !176, size: 16)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !364, file: !116, line: 40, baseType: !180, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !364, file: !116, line: 45, baseType: !180, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !364, file: !116, line: 51, baseType: !183, size: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !364, file: !116, line: 56, baseType: !371, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !124, line: 2720, size: 160, elements: !373)
!373 = !{!374, !393, !478, !479}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !372, file: !124, line: 2722, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !128, line: 233, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 231, size: 64, elements: !377)
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !376, file: !128, line: 232, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !133, line: 48, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !133, line: 37, size: 64, elements: !381)
!381 = !{!382, !388}
!382 = !DIDerivedType(tag: DW_TAG_member, scope: !380, file: !133, line: 38, baseType: !383, size: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !380, file: !133, line: 38, size: 32, elements: !384)
!384 = !{!385, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !383, file: !133, line: 39, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !133, line: 40, baseType: !386, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, scope: !380, file: !133, line: 42, baseType: !389, size: 32, offset: 32)
!389 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !380, file: !133, line: 42, size: 32, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !389, file: !133, line: 43, baseType: !386, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !389, file: !133, line: 44, baseType: !386, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !372, file: !124, line: 2724, baseType: !394, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !195, line: 245, size: 1024, elements: !396)
!396 = !{!397, !437, !449, !450, !451, !452, !458, !473}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !395, file: !195, line: 247, baseType: !398, size: 384)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !195, line: 57, size: 384, elements: !399)
!399 = !{!400, !411, !413, !414, !415, !424, !425, !426}
!400 = !DIDerivedType(tag: DW_TAG_member, scope: !398, file: !195, line: 60, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !398, file: !195, line: 60, size: 64, elements: !402)
!402 = !{!403, !405}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !401, file: !195, line: 61, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !133, line: 49, baseType: !380)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !401, file: !195, line: 62, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !207, line: 49, size: 64, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !406, file: !207, line: 50, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 64, elements: !212)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !398, file: !195, line: 68, baseType: !412, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !398, file: !195, line: 71, baseType: !164, size: 8, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !398, file: !195, line: 74, baseType: !164, size: 8, offset: 104)
!415 = !DIDerivedType(tag: DW_TAG_member, scope: !398, file: !195, line: 90, baseType: !416, size: 16, offset: 112)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !398, file: !195, line: 90, size: 16, elements: !417)
!417 = !{!418, !423}
!418 = !DIDerivedType(tag: DW_TAG_member, scope: !416, file: !195, line: 91, baseType: !419, size: 16)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !416, file: !195, line: 91, size: 16, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !419, file: !195, line: 96, baseType: !225, size: 8)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !419, file: !195, line: 97, baseType: !164, size: 8, offset: 8)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !416, file: !195, line: 100, baseType: !177, size: 16)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !398, file: !195, line: 107, baseType: !108, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !398, file: !195, line: 127, baseType: !102, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !398, file: !195, line: 131, baseType: !427, size: 192, offset: 192)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !128, line: 244, size: 192, elements: !428)
!428 = !{!429, !430, !436}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !427, file: !128, line: 245, baseType: !404, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !427, file: !128, line: 246, baseType: !431, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !128, line: 242, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !427, file: !128, line: 249, baseType: !106, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !395, file: !195, line: 250, baseType: !438, size: 288, offset: 384)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !244, line: 25, size: 288, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !438, file: !244, line: 26, baseType: !108, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !438, file: !244, line: 27, baseType: !108, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !438, file: !244, line: 28, baseType: !108, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !438, file: !244, line: 29, baseType: !108, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !438, file: !244, line: 30, baseType: !108, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !438, file: !244, line: 31, baseType: !108, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !438, file: !244, line: 32, baseType: !108, size: 32, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !438, file: !244, line: 33, baseType: !108, size: 32, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !438, file: !244, line: 34, baseType: !108, size: 32, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !395, file: !195, line: 253, baseType: !102, size: 32, offset: 672)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !395, file: !195, line: 256, baseType: !375, size: 64, offset: 704)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !395, file: !195, line: 294, baseType: !103, size: 32, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !395, file: !195, line: 300, baseType: !453, size: 96, offset: 800)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !195, line: 149, size: 96, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !453, file: !195, line: 153, baseType: !22, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !453, file: !195, line: 162, baseType: !153, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !453, file: !195, line: 168, baseType: !153, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !395, file: !195, line: 325, baseType: !459, size: 32, offset: 896)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !124, line: 5073, size: 192, elements: !461)
!461 = !{!462, !468, !469}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !460, file: !124, line: 5074, baseType: !463, size: 96)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !270, line: 56, size: 96, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !463, file: !270, line: 57, baseType: !273, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !463, file: !270, line: 58, baseType: !102, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !463, file: !270, line: 59, baseType: !153, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !460, file: !124, line: 5075, baseType: !375, size: 64, offset: 96)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !460, file: !124, line: 5076, baseType: !470, size: 32, offset: 160)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !149, line: 43, size: 32, elements: !471)
!471 = !{!472}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !470, file: !149, line: 52, baseType: !22, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !395, file: !195, line: 343, baseType: !474, size: 64, offset: 928)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !244, line: 60, size: 64, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !474, file: !244, line: 63, baseType: !108, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !474, file: !244, line: 66, baseType: !108, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !372, file: !124, line: 2727, baseType: !108, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !372, file: !124, line: 2730, baseType: !103, size: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_observers", scope: !364, file: !116, line: 61, baseType: !481, size: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !289, line: 40, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !289, line: 35, size: 64, elements: !484)
!484 = !{!485, !492}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !483, file: !289, line: 36, baseType: !486, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !289, line: 33, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !289, line: 29, size: 32, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !488, file: !289, line: 30, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !483, file: !289, line: 37, baseType: !486, size: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !364, file: !116, line: 67, baseType: !494, size: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !116, line: 85, size: 96, elements: !499)
!499 = !{!500, !501, !516}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !498, file: !116, line: 91, baseType: !119, size: 8)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !498, file: !116, line: 93, baseType: !502, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !124, line: 4204, size: 352, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !504, file: !124, line: 4206, baseType: !375, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !504, file: !124, line: 4208, baseType: !470, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !504, file: !124, line: 4210, baseType: !153, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !504, file: !124, line: 4212, baseType: !108, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !504, file: !124, line: 4214, baseType: !157, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !504, file: !124, line: 4216, baseType: !157, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !504, file: !124, line: 4218, baseType: !157, size: 32, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !504, file: !124, line: 4220, baseType: !157, size: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !504, file: !124, line: 4222, baseType: !108, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !504, file: !124, line: 4227, baseType: !164, size: 8, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !498, file: !116, line: 96, baseType: !517, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "filter_lis", scope: !356, file: !362, line: 38, type: !498, isLocal: false, isDefinition: true, align: 32)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_state_change_sub", scope: !356, file: !362, line: 40, type: !504, isLocal: false, isDefinition: true, align: 32)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "state_change_sub", scope: !356, file: !362, line: 40, type: !498, isLocal: false, isDefinition: true, align: 32)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "_runtime_observers_processed_data_chan", scope: !356, file: !362, line: 15, type: !482, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_state_change_sub", scope: !356, file: !362, line: 40, type: !532, isLocal: true, isDefinition: true, align: 32)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 160, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 20)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "_zbus_message_processed_data_chan", scope: !356, file: !362, line: 15, type: !537, isLocal: true, isDefinition: true)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_msg", file: !538, line: 11, size: 96, elements: !539)
!538 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!539 = !{!540, !541, !542}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !537, file: !538, line: 12, baseType: !103, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !537, file: !538, line: 13, baseType: !103, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !537, file: !538, line: 14, baseType: !103, size: 32, offset: 64)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "_zbus_observers_processed_data_chan", scope: !356, file: !362, line: 15, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 64, elements: !212)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "_zbus_mutex_raw_data_chan", scope: !548, file: !553, line: 11, type: !563, isLocal: true, isDefinition: true, align: 32)
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !550, splitDebugInlining: false, nameTableKind: None)
!549 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/runtime_obs_registration/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration")
!550 = !{!546, !551, !713, !715, !717, !738, !742, !744, !746, !749, !751, !758, !763, !765}
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "raw_data_chan", scope: !548, file: !553, line: 11, type: !554, isLocal: false, isDefinition: true, align: 32)
!553 = !DIFile(filename: "zephyr/samples/subsys/zbus/runtime_obs_registration/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !116, line: 29, size: 224, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !671, !684}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !555, file: !116, line: 35, baseType: !176, size: 16)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !555, file: !116, line: 40, baseType: !180, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !555, file: !116, line: 45, baseType: !180, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !555, file: !116, line: 51, baseType: !183, size: 32, offset: 96)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !555, file: !116, line: 56, baseType: !562, size: 32, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !124, line: 2720, size: 160, elements: !564)
!564 = !{!565, !584, !669, !670}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !563, file: !124, line: 2722, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !128, line: 233, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 231, size: 64, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !567, file: !128, line: 232, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !133, line: 48, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !133, line: 37, size: 64, elements: !572)
!572 = !{!573, !579}
!573 = !DIDerivedType(tag: DW_TAG_member, scope: !571, file: !133, line: 38, baseType: !574, size: 32)
!574 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !571, file: !133, line: 38, size: 32, elements: !575)
!575 = !{!576, !578}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !574, file: !133, line: 39, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !574, file: !133, line: 40, baseType: !577, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, scope: !571, file: !133, line: 42, baseType: !580, size: 32, offset: 32)
!580 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !571, file: !133, line: 42, size: 32, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !580, file: !133, line: 43, baseType: !577, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !580, file: !133, line: 44, baseType: !577, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !563, file: !124, line: 2724, baseType: !585, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !195, line: 245, size: 1024, elements: !587)
!587 = !{!588, !628, !640, !641, !642, !643, !649, !664}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !586, file: !195, line: 247, baseType: !589, size: 384)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !195, line: 57, size: 384, elements: !590)
!590 = !{!591, !602, !604, !605, !606, !615, !616, !617}
!591 = !DIDerivedType(tag: DW_TAG_member, scope: !589, file: !195, line: 60, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !589, file: !195, line: 60, size: 64, elements: !593)
!593 = !{!594, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !592, file: !195, line: 61, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !133, line: 49, baseType: !571)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !592, file: !195, line: 62, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !207, line: 49, size: 64, elements: !598)
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !597, file: !207, line: 50, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 64, elements: !212)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !589, file: !195, line: 68, baseType: !603, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !589, file: !195, line: 71, baseType: !164, size: 8, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !589, file: !195, line: 74, baseType: !164, size: 8, offset: 104)
!606 = !DIDerivedType(tag: DW_TAG_member, scope: !589, file: !195, line: 90, baseType: !607, size: 16, offset: 112)
!607 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !589, file: !195, line: 90, size: 16, elements: !608)
!608 = !{!609, !614}
!609 = !DIDerivedType(tag: DW_TAG_member, scope: !607, file: !195, line: 91, baseType: !610, size: 16)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !607, file: !195, line: 91, size: 16, elements: !611)
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !610, file: !195, line: 96, baseType: !225, size: 8)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !610, file: !195, line: 97, baseType: !164, size: 8, offset: 8)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !607, file: !195, line: 100, baseType: !177, size: 16)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !589, file: !195, line: 107, baseType: !108, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !589, file: !195, line: 127, baseType: !102, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !589, file: !195, line: 131, baseType: !618, size: 192, offset: 192)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !128, line: 244, size: 192, elements: !619)
!619 = !{!620, !621, !627}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !618, file: !128, line: 245, baseType: !595, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !618, file: !128, line: 246, baseType: !622, size: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !128, line: 242, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !618, file: !128, line: 249, baseType: !106, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !586, file: !195, line: 250, baseType: !629, size: 288, offset: 384)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !244, line: 25, size: 288, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !629, file: !244, line: 26, baseType: !108, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !629, file: !244, line: 27, baseType: !108, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !629, file: !244, line: 28, baseType: !108, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !629, file: !244, line: 29, baseType: !108, size: 32, offset: 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !629, file: !244, line: 30, baseType: !108, size: 32, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !629, file: !244, line: 31, baseType: !108, size: 32, offset: 160)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !629, file: !244, line: 32, baseType: !108, size: 32, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !629, file: !244, line: 33, baseType: !108, size: 32, offset: 224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !629, file: !244, line: 34, baseType: !108, size: 32, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !586, file: !195, line: 253, baseType: !102, size: 32, offset: 672)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !586, file: !195, line: 256, baseType: !566, size: 64, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !586, file: !195, line: 294, baseType: !103, size: 32, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !586, file: !195, line: 300, baseType: !644, size: 96, offset: 800)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !195, line: 149, size: 96, elements: !645)
!645 = !{!646, !647, !648}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !644, file: !195, line: 153, baseType: !22, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !644, file: !195, line: 162, baseType: !153, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !644, file: !195, line: 168, baseType: !153, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !586, file: !195, line: 325, baseType: !650, size: 32, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !124, line: 5073, size: 192, elements: !652)
!652 = !{!653, !659, !660}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !651, file: !124, line: 5074, baseType: !654, size: 96)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !270, line: 56, size: 96, elements: !655)
!655 = !{!656, !657, !658}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !654, file: !270, line: 57, baseType: !273, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !654, file: !270, line: 58, baseType: !102, size: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !654, file: !270, line: 59, baseType: !153, size: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !651, file: !124, line: 5075, baseType: !566, size: 64, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !651, file: !124, line: 5076, baseType: !661, size: 32, offset: 160)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !149, line: 43, size: 32, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !661, file: !149, line: 52, baseType: !22, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !586, file: !195, line: 343, baseType: !665, size: 64, offset: 928)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !244, line: 60, size: 64, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !665, file: !244, line: 63, baseType: !108, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !665, file: !244, line: 66, baseType: !108, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !563, file: !124, line: 2727, baseType: !108, size: 32, offset: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !563, file: !124, line: 2730, baseType: !103, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_observers", scope: !555, file: !116, line: 61, baseType: !672, size: 32, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !289, line: 40, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !289, line: 35, size: 64, elements: !675)
!675 = !{!676, !683}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !674, file: !289, line: 36, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !289, line: 33, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !289, line: 29, size: 32, elements: !680)
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !679, file: !289, line: 30, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !674, file: !289, line: 37, baseType: !677, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !555, file: !116, line: 67, baseType: !685, size: 32, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !116, line: 85, size: 96, elements: !690)
!690 = !{!691, !692, !707}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !689, file: !116, line: 91, baseType: !119, size: 8)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !689, file: !116, line: 93, baseType: !693, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !124, line: 4204, size: 352, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !695, file: !124, line: 4206, baseType: !566, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !695, file: !124, line: 4208, baseType: !661, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !695, file: !124, line: 4210, baseType: !153, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !695, file: !124, line: 4212, baseType: !108, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !695, file: !124, line: 4214, baseType: !157, size: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !695, file: !124, line: 4216, baseType: !157, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !695, file: !124, line: 4218, baseType: !157, size: 32, offset: 224)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !695, file: !124, line: 4220, baseType: !157, size: 32, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !695, file: !124, line: 4222, baseType: !108, size: 32, offset: 288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !695, file: !124, line: 4227, baseType: !164, size: 8, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !689, file: !116, line: 96, baseType: !708, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "_zbus_mutex_state_chan", scope: !548, file: !553, line: 14, type: !563, isLocal: true, isDefinition: true, align: 32)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "state_chan", scope: !548, file: !553, line: 14, type: !554, isLocal: false, isDefinition: true, align: 32)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "_k_thread_data_produce_thread_id", scope: !548, file: !553, line: 43, type: !719, isLocal: false, isDefinition: true, align: 32)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !124, line: 620, size: 384, elements: !720)
!720 = !{!721, !722, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !719, file: !124, line: 621, baseType: !585, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !719, file: !124, line: 622, baseType: !723, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !313, line: 44, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !315, line: 47, size: 8, elements: !726)
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !725, file: !315, line: 48, baseType: !158, size: 8)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !719, file: !124, line: 623, baseType: !32, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !719, file: !124, line: 624, baseType: !320, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !719, file: !124, line: 625, baseType: !102, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !719, file: !124, line: 626, baseType: !102, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !719, file: !124, line: 627, baseType: !102, size: 32, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !719, file: !124, line: 628, baseType: !103, size: 32, offset: 224)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !719, file: !124, line: 629, baseType: !108, size: 32, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !719, file: !124, line: 630, baseType: !330, size: 32, offset: 288)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !719, file: !124, line: 631, baseType: !332, size: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !719, file: !124, line: 632, baseType: !336, size: 32, offset: 352)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "produce_thread_id", scope: !548, file: !553, line: 43, type: !740, isLocal: false, isDefinition: true)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !195, line: 347, baseType: !585)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "_runtime_observers_raw_data_chan", scope: !548, file: !553, line: 11, type: !673, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "_runtime_observers_state_chan", scope: !548, file: !553, line: 14, type: !673, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "_k_thread_stack_produce_thread_id", scope: !548, file: !553, line: 43, type: !748, isLocal: false, isDefinition: true, align: 64)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 4096, elements: !350)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "_k_thread_obj_produce_thread_id", scope: !548, file: !553, line: 43, type: !586, isLocal: false, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "_zbus_message_raw_data_chan", scope: !548, file: !553, line: 11, type: !753, isLocal: true, isDefinition: true)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_msg", file: !538, line: 11, size: 96, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !753, file: !538, line: 12, baseType: !103, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !753, file: !538, line: 13, baseType: !103, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !753, file: !538, line: 14, baseType: !103, size: 32, offset: 64)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "_zbus_observers_raw_data_chan", scope: !548, file: !553, line: 11, type: !760, isLocal: true, isDefinition: true)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 32, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 1)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "_zbus_message_state_chan", scope: !548, file: !553, line: 14, type: !119, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "_zbus_observers_state_chan", scope: !548, file: !553, line: 14, type: !767, isLocal: true, isDefinition: true)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 64, elements: !212)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !770, file: !785, line: 18, type: !786, isLocal: false, isDefinition: true)
!770 = distinct !DICompileUnit(language: DW_LANG_C99, file: !771, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !772, globals: !784, splitDebugInlining: false, nameTableKind: None)
!771 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration")
!772 = !{!22, !102, !24, !773, !775, !777, !153, !103, !778, !779, !781, !782, !157, !783, !177, !336}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!784 = !{!768}
!785 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !788, line: 16, size: 64, elements: !789)
!788 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !787, file: !788, line: 17, baseType: !336, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !787, file: !788, line: 18, baseType: !164, size: 8, offset: 32)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "_char_out", scope: !794, file: !798, line: 54, type: !799, isLocal: false, isDefinition: true)
!794 = distinct !DICompileUnit(language: DW_LANG_C99, file: !795, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !796, globals: !797, splitDebugInlining: false, nameTableKind: None)
!795 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration")
!796 = !{!102, !103}
!797 = !{!792}
!798 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DISubroutineType(types: !801)
!801 = !{!103, !103}
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !804, file: !837, line: 22, type: !867, isLocal: false, isDefinition: true)
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !806, retainedTypes: !818, globals: !834, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration")
!806 = !{!807, !30}
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !808, line: 27, baseType: !32, size: 32, elements: !809)
!808 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817}
!810 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!811 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!812 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!813 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!814 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!815 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!816 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!817 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!818 = !{!102, !104, !103, !24, !819, !157, !108, !109}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !821, line: 54, size: 96, elements: !822)
!821 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!822 = !{!823, !829, !833}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !820, file: !821, line: 55, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !289, line: 33, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !289, line: 29, size: 32, elements: !826)
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !825, file: !289, line: 30, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !820, file: !821, line: 60, baseType: !830, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !807}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !820, file: !821, line: 65, baseType: !830, size: 32, offset: 64)
!834 = !{!802, !835, !841, !846, !848, !857, !859}
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !804, file: !837, line: 27, type: !838, isLocal: true, isDefinition: true)
!837 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 32, elements: !761)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !840, line: 22, baseType: !780)
!840 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !804, file: !837, line: 44, type: !843, isLocal: true, isDefinition: true)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !149, line: 43, size: 32, elements: !844)
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !843, file: !149, line: 52, baseType: !22, size: 32)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !804, file: !837, line: 49, type: !843, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !804, file: !837, line: 36, type: !850, isLocal: true, isDefinition: true)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 128, elements: !761)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !808, line: 114, size: 128, elements: !852)
!852 = !{!853, !854, !855, !856}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !851, file: !808, line: 115, baseType: !807, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !851, file: !808, line: 141, baseType: !164, size: 8, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !851, file: !808, line: 149, baseType: !108, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !851, file: !808, line: 156, baseType: !108, size: 32, offset: 96)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !804, file: !837, line: 40, type: !850, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !804, file: !837, line: 28, type: !861, isLocal: true, isDefinition: true)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !289, line: 40, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !289, line: 35, size: 64, elements: !863)
!863 = !{!864, !866}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !862, file: !289, line: 36, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !862, file: !289, line: 37, baseType: !865, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !788, line: 16, size: 64, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !868, file: !788, line: 17, baseType: !336, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !868, file: !788, line: 18, baseType: !164, size: 8, offset: 32)
!872 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!873 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !876, file: !904, line: 50, type: !330, isLocal: true, isDefinition: true)
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !806, retainedTypes: !878, globals: !901, splitDebugInlining: false, nameTableKind: None)
!877 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration")
!878 = !{!879, !104, !153, !103, !102, !108, !109, !881, !157, !330, !892}
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !880)
!880 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !883, line: 45, size: 64, elements: !884)
!883 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!884 = !{!885, !891}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !882, file: !883, line: 46, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !289, line: 33, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !289, line: 29, size: 32, elements: !888)
!888 = !{!889}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !887, file: !289, line: 30, baseType: !890, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !882, file: !883, line: 48, baseType: !108, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !883, line: 38, size: 64, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !893, file: !883, line: 39, baseType: !886, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !893, file: !883, line: 41, baseType: !897, size: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !883, line: 35, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !330}
!901 = !{!902, !908, !916, !874, !918, !928}
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "latency_lock", scope: !876, file: !904, line: 44, type: !905, isLocal: true, isDefinition: true)
!904 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !149, line: 43, size: 32, elements: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !905, file: !149, line: 52, baseType: !22, size: 32)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !876, file: !904, line: 46, type: !910, isLocal: true, isDefinition: true)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !289, line: 40, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !289, line: 35, size: 64, elements: !912)
!912 = !{!913, !915}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !911, file: !289, line: 36, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !911, file: !289, line: 37, baseType: !914, size: 32, offset: 32)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "latency_subs", scope: !876, file: !904, line: 52, type: !910, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !876, file: !904, line: 39, type: !920, isLocal: true, isDefinition: true)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, elements: !926)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !904, line: 35, size: 96, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !921, file: !904, line: 36, baseType: !807, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !921, file: !904, line: 37, baseType: !164, size: 8, offset: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !921, file: !904, line: 38, baseType: !839, size: 32, offset: 64)
!926 = !{!927}
!927 = !DISubrange(count: 0)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !876, file: !904, line: 48, type: !330, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !932, file: !939, line: 47, type: !953, isLocal: true, isDefinition: true)
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !934, retainedTypes: !935, globals: !936, splitDebugInlining: false, nameTableKind: None)
!933 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration")
!934 = !{!807}
!935 = !{!153, !103}
!936 = !{!937, !930, !949}
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "cpus_states", scope: !932, file: !939, line: 50, type: !940, isLocal: true, isDefinition: true)
!939 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 32, elements: !761)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !808, line: 114, size: 128, elements: !944)
!944 = !{!945, !946, !947, !948}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !943, file: !808, line: 115, baseType: !807, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !943, file: !808, line: 141, baseType: !164, size: 8, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !943, file: !808, line: 149, baseType: !108, size: 32, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !943, file: !808, line: 156, baseType: !108, size: 32, offset: 96)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !932, file: !939, line: 55, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 8, elements: !761)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, elements: !926)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !956, file: !963, line: 17, type: !1087, isLocal: false, isDefinition: true)
!956 = distinct !DICompileUnit(language: DW_LANG_C99, file: !957, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !958, globals: !959, splitDebugInlining: false, nameTableKind: None)
!957 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/runtime_obs_registration")
!958 = !{!153, !103, !108, !102}
!959 = !{!954, !960, !1083}
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !962, file: !963, line: 198, type: !1071, isLocal: true, isDefinition: true)
!962 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !963, file: !963, line: 175, type: !964, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !956, retainedNodes: !1068)
!963 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!964 = !DISubroutineType(types: !965)
!965 = !{null, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !195, line: 245, size: 1024, elements: !968)
!968 = !{!969, !1027, !1039, !1040, !1041, !1042, !1048, !1063}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !967, file: !195, line: 247, baseType: !970, size: 384)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !195, line: 57, size: 384, elements: !971)
!971 = !{!972, !996, !1003, !1004, !1005, !1014, !1015, !1016}
!972 = !DIDerivedType(tag: DW_TAG_member, scope: !970, file: !195, line: 60, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !970, file: !195, line: 60, size: 64, elements: !974)
!974 = !{!975, !990}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !973, file: !195, line: 61, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !133, line: 49, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !133, line: 37, size: 64, elements: !978)
!978 = !{!979, !985}
!979 = !DIDerivedType(tag: DW_TAG_member, scope: !977, file: !133, line: 38, baseType: !980, size: 32)
!980 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !977, file: !133, line: 38, size: 32, elements: !981)
!981 = !{!982, !984}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !980, file: !133, line: 39, baseType: !983, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !980, file: !133, line: 40, baseType: !983, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, scope: !977, file: !133, line: 42, baseType: !986, size: 32, offset: 32)
!986 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !977, file: !133, line: 42, size: 32, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !986, file: !133, line: 43, baseType: !983, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !986, file: !133, line: 44, baseType: !983, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !973, file: !195, line: 62, baseType: !991, size: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !207, line: 49, size: 64, elements: !992)
!992 = !{!993}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !991, file: !207, line: 50, baseType: !994, size: 64)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 64, elements: !212)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !970, file: !195, line: 68, baseType: !997, size: 32, offset: 64)
