; ModuleID = 'build/arduino_due/basic/sys_heap/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, i32, i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.wdt_sam_dev_cfg = type { %struct.sys_memory_stats* }
%struct.sys_memory_stats = type { i32, i32, i32 }
%struct.wdt_driver_api = type { i32 (%struct.device*, i8)*, i32 (%struct.device*)*, i32 (%struct.device*, %struct.wdt_timeout_cfg*)*, i32 (%struct.device*, i32)* }
%struct.wdt_timeout_cfg = type { %struct._thread_arch, void (%struct.device*, i32)*, i8 }
%struct._thread_arch = type { i32, i32 }
%struct.wdt_sam_dev_data = type { void (%struct.device*, i32)*, i32, i8, i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam_dev_cfg = type { %struct.Uart*, i32, %struct.pinctrl_dev_config* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "heap", scope: !27, file: !107, line: 13, type: !112, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "heap_mem", scope: !27, file: !107, line: 12, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !110)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !{!115, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !112, file: !113, line: 57, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !113, line: 57, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !112, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !112, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 214, baseType: !32)
!121 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !127, line: 54, type: !128, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!126 = !{!122}
!127 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!103, !103}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "state", scope: !133, file: !134, line: 227, type: !163, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "rand32", scope: !134, file: !134, line: 225, type: !135, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !138, retainedNodes: !162)
!134 = !DIFile(filename: "zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !148, globals: !161, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!140 = !{!30, !141}
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !142, line: 54, baseType: !32, size: 32, elements: !143)
!142 = !DIFile(filename: "zephyr/lib/os/heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!145 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!146 = !DIEnumerator(name: "FREE_PREV", value: 2)
!147 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!148 = !{!102, !103, !149, !150, !137, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !142, line: 58, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 58, size: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !155, file: !142, line: 58, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !{!131}
!162 = !{}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !164)
!164 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !167, file: !232, line: 235, type: !233, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !169, globals: !231, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!169 = !{!102, !103, !170, !181}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !172, line: 46, baseType: !173)
!172 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 41, size: 128, elements: !174)
!174 = !{!175, !177, !178, !180}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !173, file: !172, line: 42, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !173, file: !172, line: 43, baseType: !176, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !173, file: !172, line: 44, baseType: !179, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !173, file: !172, line: 45, baseType: !179, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !183, line: 75, baseType: !184)
!183 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 41, size: 2176, elements: !185)
!185 = !{!186, !187, !188, !189, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !209, !213, !214, !215, !216, !217, !218, !219, !220, !224, !225, !226, !227, !228, !229, !230}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !184, file: !183, line: 42, baseType: !176, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !184, file: !183, line: 43, baseType: !176, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !184, file: !183, line: 44, baseType: !179, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !184, file: !183, line: 45, baseType: !190, size: 32, offset: 96)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 32, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 1)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !184, file: !183, line: 46, baseType: !176, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !184, file: !183, line: 47, baseType: !176, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !184, file: !183, line: 48, baseType: !179, size: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !184, file: !183, line: 49, baseType: !176, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !184, file: !183, line: 50, baseType: !176, size: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !184, file: !183, line: 51, baseType: !179, size: 32, offset: 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !184, file: !183, line: 52, baseType: !176, size: 32, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !184, file: !183, line: 53, baseType: !190, size: 32, offset: 352)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !184, file: !183, line: 54, baseType: !176, size: 32, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !184, file: !183, line: 55, baseType: !190, size: 32, offset: 416)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !184, file: !183, line: 56, baseType: !176, size: 32, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !184, file: !183, line: 57, baseType: !190, size: 32, offset: 480)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !184, file: !183, line: 58, baseType: !206, size: 96, offset: 512)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 96, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 3)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !184, file: !183, line: 59, baseType: !210, size: 160, offset: 608)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 160, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 5)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !184, file: !183, line: 60, baseType: !176, size: 32, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !184, file: !183, line: 61, baseType: !176, size: 32, offset: 800)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !184, file: !183, line: 62, baseType: !179, size: 32, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !184, file: !183, line: 63, baseType: !179, size: 32, offset: 864)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !184, file: !183, line: 64, baseType: !176, size: 32, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !184, file: !183, line: 65, baseType: !176, size: 32, offset: 928)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !184, file: !183, line: 66, baseType: !176, size: 32, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !184, file: !183, line: 67, baseType: !221, size: 832, offset: 992)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 832, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 26)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !184, file: !183, line: 68, baseType: !176, size: 32, offset: 1824)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !184, file: !183, line: 69, baseType: !179, size: 32, offset: 1856)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !184, file: !183, line: 70, baseType: !210, size: 160, offset: 1888)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !184, file: !183, line: 71, baseType: !176, size: 32, offset: 2048)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !184, file: !183, line: 72, baseType: !176, size: 32, offset: 2080)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !184, file: !183, line: 73, baseType: !179, size: 32, offset: 2112)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !184, file: !183, line: 74, baseType: !176, size: 32, offset: 2144)
!231 = !{!165}
!232 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !235, line: 51, size: 64, elements: !236)
!235 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = !{!237, !267}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !234, file: !235, line: 60, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DISubroutineType(types: !240)
!240 = !{!103, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !244, line: 378, size: 192, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{!246, !249, !250, !251, !260, !261}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !244, line: 380, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !243, file: !244, line: 382, baseType: !13, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !243, file: !244, line: 384, baseType: !13, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !243, file: !244, line: 386, baseType: !252, size: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !244, line: 351, size: 16, elements: !254)
!254 = !{!255, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !253, file: !244, line: 359, baseType: !256, size: 8)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !257)
!257 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !253, file: !244, line: 364, baseType: !259, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!259 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !244, line: 388, baseType: !102, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !243, file: !244, line: 396, baseType: !262, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !244, line: 43, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !266)
!266 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !234, file: !235, line: 65, baseType: !241, size: 32, offset: 32)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "static_regions", scope: !270, file: !277, line: 62, type: !410, isLocal: true, isDefinition: true)
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !272, globals: !273, splitDebugInlining: false, nameTableKind: None)
!271 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!272 = !{!120, !103, !137, !102}
!273 = !{!274, !268}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !276, file: !277, line: 198, type: !398, isLocal: true, isDefinition: true)
!276 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !277, file: !277, line: 175, type: !278, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !270, retainedNodes: !393)
!277 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = !DISubroutineType(types: !279)
!279 = !{null, !280}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !282, line: 245, size: 1024, elements: !283)
!282 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !{!284, !351, !364, !365, !366, !367, !373, !388}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !281, file: !282, line: 247, baseType: !285, size: 384)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !282, line: 57, size: 384, elements: !286)
!286 = !{!287, !315, !323, !324, !325, !336, !337, !338}
!287 = !DIDerivedType(tag: DW_TAG_member, scope: !285, file: !282, line: 60, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !285, file: !282, line: 60, size: 64, elements: !289)
!289 = !{!290, !306}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !288, file: !282, line: 61, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !292, line: 49, baseType: !293)
!292 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !292, line: 37, size: 64, elements: !294)
!294 = !{!295, !301}
!295 = !DIDerivedType(tag: DW_TAG_member, scope: !293, file: !292, line: 38, baseType: !296, size: 32)
!296 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !292, line: 38, size: 32, elements: !297)
!297 = !{!298, !300}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !296, file: !292, line: 39, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !292, line: 40, baseType: !299, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, scope: !293, file: !292, line: 42, baseType: !302, size: 32, offset: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !292, line: 42, size: 32, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !302, file: !292, line: 43, baseType: !299, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !302, file: !292, line: 44, baseType: !299, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !288, file: !282, line: 62, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !308, line: 49, size: 64, elements: !309)
!308 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !307, file: !308, line: 50, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 64, elements: !313)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!313 = !{!314}
!314 = !DISubrange(count: 2)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !285, file: !282, line: 68, baseType: !316, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !318, line: 233, baseType: !319)
!318 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 231, size: 64, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !319, file: !318, line: 232, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !292, line: 48, baseType: !293)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !285, file: !282, line: 71, baseType: !256, size: 8, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !285, file: !282, line: 74, baseType: !256, size: 8, offset: 104)
!325 = !DIDerivedType(tag: DW_TAG_member, scope: !285, file: !282, line: 90, baseType: !326, size: 16, offset: 112)
!326 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !285, file: !282, line: 90, size: 16, elements: !327)
!327 = !{!328, !335}
!328 = !DIDerivedType(tag: DW_TAG_member, scope: !326, file: !282, line: 91, baseType: !329, size: 16)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !282, line: 91, size: 16, elements: !330)
!330 = !{!331, !334}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !329, file: !282, line: 96, baseType: !332, size: 8)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !333)
!333 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !329, file: !282, line: 97, baseType: !256, size: 8, offset: 8)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !326, file: !282, line: 100, baseType: !151, size: 16)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !285, file: !282, line: 107, baseType: !137, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !285, file: !282, line: 127, baseType: !102, size: 32, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !285, file: !282, line: 131, baseType: !339, size: 192, offset: 192)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !318, line: 244, size: 192, elements: !340)
!340 = !{!341, !342, !348}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !339, file: !318, line: 245, baseType: !291, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !339, file: !318, line: 246, baseType: !343, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !318, line: 242, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !339, file: !318, line: 249, baseType: !349, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !350)
!350 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !281, file: !282, line: 250, baseType: !352, size: 288, offset: 384)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !353, line: 25, size: 288, elements: !354)
!353 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !{!355, !356, !357, !358, !359, !360, !361, !362, !363}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !352, file: !353, line: 26, baseType: !137, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !352, file: !353, line: 27, baseType: !137, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !352, file: !353, line: 28, baseType: !137, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !352, file: !353, line: 29, baseType: !137, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !352, file: !353, line: 30, baseType: !137, size: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !352, file: !353, line: 31, baseType: !137, size: 32, offset: 160)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !352, file: !353, line: 32, baseType: !137, size: 32, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !352, file: !353, line: 33, baseType: !137, size: 32, offset: 224)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !352, file: !353, line: 34, baseType: !137, size: 32, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !281, file: !282, line: 253, baseType: !102, size: 32, offset: 672)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !281, file: !282, line: 256, baseType: !317, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !281, file: !282, line: 294, baseType: !103, size: 32, offset: 768)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !281, file: !282, line: 300, baseType: !368, size: 96, offset: 800)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !282, line: 149, size: 96, elements: !369)
!369 = !{!370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !368, file: !282, line: 153, baseType: !22, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !368, file: !282, line: 162, baseType: !120, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !368, file: !282, line: 168, baseType: !120, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !281, file: !282, line: 325, baseType: !374, size: 32, offset: 896)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !376, line: 5073, size: 160, elements: !377)
!376 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!377 = !{!378, !384, !385}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !375, file: !376, line: 5074, baseType: !379, size: 96)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !379, file: !113, line: 57, baseType: !116, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !379, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !379, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !375, file: !376, line: 5075, baseType: !317, size: 64, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !375, file: !376, line: 5076, baseType: !386, offset: 160)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !387, line: 43, elements: !162)
!387 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !281, file: !282, line: 343, baseType: !389, size: 64, offset: 928)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !353, line: 60, size: 64, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !389, file: !353, line: 63, baseType: !137, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !389, file: !353, line: 66, baseType: !137, size: 32, offset: 32)
!393 = !{!394, !395, !396, !397}
!394 = !DILocalVariable(name: "thread", arg: 1, scope: !276, file: !277, line: 175, type: !280)
!395 = !DILocalVariable(name: "region_num", scope: !276, file: !277, line: 200, type: !256)
!396 = !DILocalVariable(name: "guard_start", scope: !276, file: !277, line: 265, type: !22)
!397 = !DILocalVariable(name: "guard_size", scope: !276, file: !277, line: 266, type: !120)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 96, elements: !191)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !400, line: 52, size: 96, elements: !401)
!400 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !{!402, !403, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !399, file: !400, line: 53, baseType: !22, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !399, file: !400, line: 54, baseType: !120, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !399, file: !400, line: 55, baseType: !405, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !406, line: 151, baseType: !407)
!406 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 149, size: 32, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !407, file: !406, line: 150, baseType: !137, size: 32)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 96, elements: !191)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !414, file: !446, line: 39, type: !256, isLocal: true, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !416, globals: !445, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!416 = !{!417, !102, !103, !433, !256}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !419, line: 1168, baseType: !420)
!419 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 1155, size: 352, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !420, file: !419, line: 1157, baseType: !179, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !420, file: !419, line: 1158, baseType: !176, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !420, file: !419, line: 1159, baseType: !176, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !420, file: !419, line: 1160, baseType: !176, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !420, file: !419, line: 1161, baseType: !176, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !420, file: !419, line: 1162, baseType: !176, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !420, file: !419, line: 1163, baseType: !176, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !420, file: !419, line: 1164, baseType: !176, size: 32, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !420, file: !419, line: 1165, baseType: !176, size: 32, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !420, file: !419, line: 1166, baseType: !176, size: 32, offset: 288)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !420, file: !419, line: 1167, baseType: !176, size: 32, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !436, line: 27, size: 96, elements: !437)
!436 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !435, file: !436, line: 29, baseType: !137, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !435, file: !436, line: 31, baseType: !247, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !435, file: !436, line: 37, baseType: !441, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !406, line: 146, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !406, line: 141, size: 32, elements: !443)
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !442, file: !406, line: 143, baseType: !137, size: 32)
!445 = !{!412}
!446 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !449, file: !456, line: 21, type: !128, isLocal: true, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !451, globals: !455, splitDebugInlining: false, nameTableKind: None)
!450 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!451 = !{!452, !103, !102}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !454, line: 22, baseType: !103)
!454 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!455 = !{!447}
!456 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !459, file: !464, line: 13, type: !481, isLocal: true, isDefinition: true)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !461, splitDebugInlining: false, nameTableKind: None)
!460 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!461 = !{!462, !457}
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "mpu_config", scope: !459, file: !464, line: 37, type: !465, isLocal: false, isDefinition: true)
!464 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !436, line: 41, size: 64, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !466, file: !436, line: 43, baseType: !137, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !466, file: !436, line: 45, baseType: !470, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !436, line: 27, size: 96, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !472, file: !436, line: 29, baseType: !137, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !472, file: !436, line: 31, baseType: !247, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !472, file: !436, line: 37, baseType: !477, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !406, line: 146, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !406, line: 141, size: 32, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !478, file: !406, line: 143, baseType: !137, size: 32)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 192, elements: !313)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !484, file: !541, line: 603, type: !543, isLocal: true, isDefinition: true, align: 32)
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !486, globals: !538, splitDebugInlining: false, nameTableKind: None)
!485 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!486 = !{!102, !103, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !490, line: 336, size: 160, elements: !491)
!490 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!491 = !{!492, !512, !516, !520, !533}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !489, file: !490, line: 365, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DISubroutineType(types: !495)
!495 = !{!103, !496, !511}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !244, line: 378, size: 192, elements: !499)
!499 = !{!500, !501, !502, !503, !509, !510}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !498, file: !244, line: 380, baseType: !247, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !498, file: !244, line: 382, baseType: !13, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !498, file: !244, line: 384, baseType: !13, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !498, file: !244, line: 386, baseType: !504, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !244, line: 351, size: 16, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !505, file: !244, line: 359, baseType: !256, size: 8)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !505, file: !244, line: 364, baseType: !259, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !498, file: !244, line: 388, baseType: !102, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !498, file: !244, line: 396, baseType: !262, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !489, file: !490, line: 366, baseType: !513, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !496, !257}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !489, file: !490, line: 374, baseType: !517, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = !DISubroutineType(types: !519)
!519 = !{!103, !496}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !489, file: !490, line: 377, baseType: !521, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!522 = !DISubroutineType(types: !523)
!523 = !{!103, !496, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !490, line: 122, size: 64, elements: !527)
!527 = !{!528, !529, !530, !531, !532}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !526, file: !490, line: 123, baseType: !137, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !526, file: !490, line: 124, baseType: !256, size: 8, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !526, file: !490, line: 125, baseType: !256, size: 8, offset: 40)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !526, file: !490, line: 126, baseType: !256, size: 8, offset: 48)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !526, file: !490, line: 127, baseType: !256, size: 8, offset: 56)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !489, file: !490, line: 379, baseType: !534, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DISubroutineType(types: !536)
!536 = !{!103, !496, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!538 = !{!482, !539}
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !484, file: !541, line: 38, type: !542, isLocal: true, isDefinition: true)
!541 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !235, line: 51, size: 64, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !544, file: !235, line: 60, baseType: !517, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !544, file: !235, line: 65, baseType: !496, size: 32, offset: 32)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !550, file: !555, line: 7, type: !556, isLocal: false, isDefinition: true, align: 16)
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !552, splitDebugInlining: false, nameTableKind: None)
!551 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!552 = !{!548, !553}
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !550, file: !555, line: 12, type: !556, isLocal: false, isDefinition: true, align: 16)
!555 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 48, elements: !207)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !559, file: !620, line: 234, type: !655, isLocal: true, isDefinition: true)
!559 = distinct !DICompileUnit(language: DW_LANG_C99, file: !560, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !561, globals: !617, splitDebugInlining: false, nameTableKind: None)
!560 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!561 = !{!562, !137}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !565, line: 134, size: 128, elements: !566)
!565 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!566 = !{!567, !587, !592, !612}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !564, file: !565, line: 135, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !565, line: 113, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = !DISubroutineType(types: !571)
!571 = !{!103, !572, !256}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !244, line: 378, size: 192, elements: !575)
!575 = !{!576, !577, !578, !579, !585, !586}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !574, file: !244, line: 380, baseType: !247, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !574, file: !244, line: 382, baseType: !13, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !574, file: !244, line: 384, baseType: !13, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !574, file: !244, line: 386, baseType: !580, size: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !244, line: 351, size: 16, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !581, file: !244, line: 359, baseType: !256, size: 8)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !581, file: !244, line: 364, baseType: !259, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !574, file: !244, line: 388, baseType: !102, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !574, file: !244, line: 396, baseType: !262, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !564, file: !565, line: 136, baseType: !588, size: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !565, line: 119, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DISubroutineType(types: !591)
!591 = !{!103, !572}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !564, file: !565, line: 137, baseType: !593, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !565, line: 125, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DISubroutineType(types: !596)
!596 = !{!103, !572, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !565, line: 88, size: 128, elements: !600)
!600 = !{!601, !606, !611}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !599, file: !565, line: 90, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !565, line: 72, size: 64, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !602, file: !565, line: 74, baseType: !137, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !602, file: !565, line: 76, baseType: !137, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !599, file: !565, line: 92, baseType: !607, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !565, line: 85, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !572, !103}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !599, file: !565, line: 104, baseType: !256, size: 8, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !564, file: !565, line: 138, baseType: !613, size: 32, offset: 96)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !565, line: 132, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!615 = !DISubroutineType(types: !616)
!616 = !{!103, !572, !103}
!617 = !{!618, !622, !624, !631, !557, !633, !635, !643}
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !559, file: !620, line: 256, type: !621, isLocal: false, isDefinition: true, align: 16)
!620 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 80, elements: !211)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !559, file: !620, line: 256, type: !573, isLocal: false, isDefinition: true, align: 32)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !559, file: !620, line: 256, type: !626, isLocal: true, isDefinition: true, align: 32)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !235, line: 51, size: 64, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !627, file: !235, line: 60, baseType: !589, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !627, file: !235, line: 65, baseType: !572, size: 32, offset: 32)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !559, file: !620, line: 256, type: !581, isLocal: true, isDefinition: true, align: 8)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !559, file: !620, line: 227, type: !563, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !559, file: !620, line: 45, type: !637, isLocal: true, isDefinition: true)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !620, line: 38, size: 96, elements: !638)
!638 = !{!639, !640, !641, !642}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !637, file: !620, line: 39, baseType: !607, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !637, file: !620, line: 40, baseType: !137, size: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !637, file: !620, line: 41, baseType: !259, size: 8, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !637, file: !620, line: 42, baseType: !259, size: 8, offset: 72)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !645, file: !620, line: 240, type: !648, isLocal: true, isDefinition: true, align: 32)
!645 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !620, file: !620, line: 238, type: !646, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !559, retainedNodes: !162)
!646 = !DISubroutineType(types: !647)
!647 = !{null}
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !649)
!649 = !{!650, !652, !653, !654}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !648, file: !10, line: 55, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !648, file: !10, line: 57, baseType: !651, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !648, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !648, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !620, line: 34, size: 32, elements: !657)
!657 = !{!658}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !656, file: !620, line: 35, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !661, line: 45, baseType: !662)
!661 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !661, line: 41, size: 96, elements: !663)
!663 = !{!664, !665, !666}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !662, file: !661, line: 42, baseType: !176, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !662, file: !661, line: 43, baseType: !176, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !662, file: !661, line: 44, baseType: !179, size: 32, offset: 64)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !669, file: !757, line: 494, type: !804, isLocal: true, isDefinition: true)
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !671, retainedTypes: !704, globals: !754, splitDebugInlining: false, nameTableKind: None)
!670 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!671 = !{!672, !679, !685, !692, !697}
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !490, line: 47, baseType: !32, size: 32, elements: !673)
!673 = !{!674, !675, !676, !677, !678}
!674 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!675 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!676 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!677 = !DIEnumerator(name: "UART_BREAK", value: 8)
!678 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!679 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !490, line: 84, baseType: !32, size: 32, elements: !680)
!680 = !{!681, !682, !683, !684}
!681 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!682 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!683 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!684 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!685 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !490, line: 92, baseType: !32, size: 32, elements: !686)
!686 = !{!687, !688, !689, !690, !691}
!687 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!688 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!689 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!690 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!691 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!692 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !490, line: 107, baseType: !32, size: 32, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!695 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!696 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!697 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !490, line: 75, baseType: !32, size: 32, elements: !698)
!698 = !{!699, !700, !701, !702, !703}
!699 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!700 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!701 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!702 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!703 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!704 = !{!705, !102, !257, !137}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !490, line: 336, size: 160, elements: !708)
!708 = !{!709, !728, !732, !736, !749}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !707, file: !490, line: 365, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DISubroutineType(types: !712)
!712 = !{!103, !713, !511}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !244, line: 378, size: 192, elements: !716)
!716 = !{!717, !718, !719, !720, !726, !727}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !715, file: !244, line: 380, baseType: !247, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !715, file: !244, line: 382, baseType: !13, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !715, file: !244, line: 384, baseType: !13, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !715, file: !244, line: 386, baseType: !721, size: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !244, line: 351, size: 16, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !722, file: !244, line: 359, baseType: !256, size: 8)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !722, file: !244, line: 364, baseType: !259, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !715, file: !244, line: 388, baseType: !102, size: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !715, file: !244, line: 396, baseType: !262, size: 32, offset: 160)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !707, file: !490, line: 366, baseType: !729, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !713, !257}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !707, file: !490, line: 374, baseType: !733, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DISubroutineType(types: !735)
!735 = !{!103, !713}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !707, file: !490, line: 377, baseType: !737, size: 32, offset: 96)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = !DISubroutineType(types: !739)
!739 = !{!103, !713, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !490, line: 122, size: 64, elements: !743)
!743 = !{!744, !745, !746, !747, !748}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !742, file: !490, line: 123, baseType: !137, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !742, file: !490, line: 124, baseType: !256, size: 8, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !742, file: !490, line: 125, baseType: !256, size: 8, offset: 40)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !742, file: !490, line: 126, baseType: !256, size: 8, offset: 48)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !742, file: !490, line: 127, baseType: !256, size: 8, offset: 56)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !707, file: !490, line: 379, baseType: !750, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DISubroutineType(types: !752)
!752 = !{!103, !713, !753}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!754 = !{!755, !761, !763, !770, !772, !774, !667, !779, !798, !801}
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !669, file: !757, line: 494, type: !758, isLocal: false, isDefinition: true, align: 16)
!757 = !DIFile(filename: "zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 96, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 6)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !669, file: !757, line: 494, type: !714, isLocal: false, isDefinition: true, align: 32)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !669, file: !757, line: 494, type: !765, isLocal: true, isDefinition: true, align: 32)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !235, line: 51, size: 64, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !766, file: !235, line: 60, baseType: !733, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !766, file: !235, line: 65, baseType: !713, size: 32, offset: 32)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_21", scope: !669, file: !757, line: 494, type: !722, isLocal: true, isDefinition: true, align: 8)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "uart_sam_driver_api", scope: !669, file: !757, line: 419, type: !706, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "uart0_sam_data", scope: !669, file: !757, line: 494, type: !776, isLocal: true, isDefinition: true)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_data", file: !757, line: 38, size: 32, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !776, file: !757, line: 39, baseType: !137, size: 32)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_21", scope: !669, file: !757, line: 494, type: !781, isLocal: true, isDefinition: true)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !783, line: 60, size: 64, elements: !784)
!783 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!784 = !{!785, !797}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !782, file: !783, line: 69, baseType: !786, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !783, line: 50, size: 64, elements: !789)
!789 = !{!790, !795, !796}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !788, file: !783, line: 52, baseType: !791, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !794, line: 32, baseType: !137)
!794 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl/pinctrl_soc_sam_common.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !788, file: !783, line: 54, baseType: !256, size: 8, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !788, file: !783, line: 56, baseType: !256, size: 8, offset: 40)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !782, file: !783, line: 71, baseType: !256, size: 8, offset: 32)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_21", scope: !669, file: !757, line: 494, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 64, elements: !191)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_21", scope: !669, file: !757, line: 494, type: !803, isLocal: true, isDefinition: true)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 64, elements: !313)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_cfg", file: !757, line: 27, size: 96, elements: !806)
!806 = !{!807, !836, !837}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !805, file: !757, line: 28, baseType: !808, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uart", file: !810, line: 62, baseType: !811)
!810 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !810, line: 41, size: 2368, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "UART_CR", scope: !811, file: !810, line: 42, baseType: !176, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "UART_MR", scope: !811, file: !810, line: 43, baseType: !176, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IER", scope: !811, file: !810, line: 44, baseType: !176, size: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IDR", scope: !811, file: !810, line: 45, baseType: !176, size: 32, offset: 96)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IMR", scope: !811, file: !810, line: 46, baseType: !179, size: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "UART_SR", scope: !811, file: !810, line: 47, baseType: !179, size: 32, offset: 160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RHR", scope: !811, file: !810, line: 48, baseType: !179, size: 32, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "UART_THR", scope: !811, file: !810, line: 49, baseType: !176, size: 32, offset: 224)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "UART_BRGR", scope: !811, file: !810, line: 50, baseType: !176, size: 32, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !811, file: !810, line: 51, baseType: !823, size: 1760, offset: 288)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 1760, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 55)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RPR", scope: !811, file: !810, line: 52, baseType: !176, size: 32, offset: 2048)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RCR", scope: !811, file: !810, line: 53, baseType: !176, size: 32, offset: 2080)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TPR", scope: !811, file: !810, line: 54, baseType: !176, size: 32, offset: 2112)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TCR", scope: !811, file: !810, line: 55, baseType: !176, size: 32, offset: 2144)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNPR", scope: !811, file: !810, line: 56, baseType: !176, size: 32, offset: 2176)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNCR", scope: !811, file: !810, line: 57, baseType: !176, size: 32, offset: 2208)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNPR", scope: !811, file: !810, line: 58, baseType: !176, size: 32, offset: 2240)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNCR", scope: !811, file: !810, line: 59, baseType: !176, size: 32, offset: 2272)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTCR", scope: !811, file: !810, line: 60, baseType: !176, size: 32, offset: 2304)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTSR", scope: !811, file: !810, line: 61, baseType: !179, size: 32, offset: 2336)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "periph_id", scope: !805, file: !757, line: 29, baseType: !137, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pcfg", scope: !805, file: !757, line: 30, baseType: !838, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "overflow_cyc", scope: !841, file: !975, line: 65, type: !176, isLocal: true, isDefinition: true)
!841 = distinct !DICompileUnit(language: DW_LANG_C99, file: !842, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !843, retainedTypes: !897, globals: !972, splitDebugInlining: false, nameTableKind: None)
!842 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/timer/cortex_m_systick.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!843 = !{!844}
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !845, line: 57, baseType: !103, size: 32, elements: !846)
!845 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/sam3x8e.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!847 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!848 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!849 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!850 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!851 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!852 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!853 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!854 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!855 = !DIEnumerator(name: "SUPC_IRQn", value: 0)
!856 = !DIEnumerator(name: "RSTC_IRQn", value: 1)
!857 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!858 = !DIEnumerator(name: "RTT_IRQn", value: 3)
!859 = !DIEnumerator(name: "WDT_IRQn", value: 4)
!860 = !DIEnumerator(name: "PMC_IRQn", value: 5)
!861 = !DIEnumerator(name: "EFC0_IRQn", value: 6)
!862 = !DIEnumerator(name: "EFC1_IRQn", value: 7)
!863 = !DIEnumerator(name: "UART_IRQn", value: 8)
!864 = !DIEnumerator(name: "SMC_IRQn", value: 9)
!865 = !DIEnumerator(name: "PIOA_IRQn", value: 11)
!866 = !DIEnumerator(name: "PIOB_IRQn", value: 12)
!867 = !DIEnumerator(name: "PIOC_IRQn", value: 13)
!868 = !DIEnumerator(name: "PIOD_IRQn", value: 14)
!869 = !DIEnumerator(name: "USART0_IRQn", value: 17)
!870 = !DIEnumerator(name: "USART1_IRQn", value: 18)
!871 = !DIEnumerator(name: "USART2_IRQn", value: 19)
!872 = !DIEnumerator(name: "USART3_IRQn", value: 20)
!873 = !DIEnumerator(name: "HSMCI_IRQn", value: 21)
!874 = !DIEnumerator(name: "TWI0_IRQn", value: 22)
!875 = !DIEnumerator(name: "TWI1_IRQn", value: 23)
!876 = !DIEnumerator(name: "SPI0_IRQn", value: 24)
!877 = !DIEnumerator(name: "SSC_IRQn", value: 26)
!878 = !DIEnumerator(name: "TC0_IRQn", value: 27)
!879 = !DIEnumerator(name: "TC1_IRQn", value: 28)
!880 = !DIEnumerator(name: "TC2_IRQn", value: 29)
!881 = !DIEnumerator(name: "TC3_IRQn", value: 30)
!882 = !DIEnumerator(name: "TC4_IRQn", value: 31)
!883 = !DIEnumerator(name: "TC5_IRQn", value: 32)
!884 = !DIEnumerator(name: "TC6_IRQn", value: 33)
!885 = !DIEnumerator(name: "TC7_IRQn", value: 34)
!886 = !DIEnumerator(name: "TC8_IRQn", value: 35)
!887 = !DIEnumerator(name: "PWM_IRQn", value: 36)
!888 = !DIEnumerator(name: "ADC_IRQn", value: 37)
!889 = !DIEnumerator(name: "DACC_IRQn", value: 38)
!890 = !DIEnumerator(name: "DMAC_IRQn", value: 39)
!891 = !DIEnumerator(name: "UOTGHS_IRQn", value: 40)
!892 = !DIEnumerator(name: "TRNG_IRQn", value: 41)
!893 = !DIEnumerator(name: "EMAC_IRQn", value: 42)
!894 = !DIEnumerator(name: "CAN0_IRQn", value: 43)
!895 = !DIEnumerator(name: "CAN1_IRQn", value: 44)
!896 = !DIEnumerator(name: "PERIPH_COUNT_IRQn", value: 45)
!897 = !{!898, !900, !651, !256, !137, !908, !939}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !899, line: 46, baseType: !349)
!899 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !419, line: 712, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 706, size: 128, elements: !903)
!903 = !{!904, !905, !906, !907}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !902, file: !419, line: 708, baseType: !176, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !902, file: !419, line: 709, baseType: !176, size: 32, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !902, file: !419, line: 710, baseType: !176, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !902, file: !419, line: 711, baseType: !179, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !419, line: 360, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 345, size: 28704, elements: !911)
!911 = !{!912, !914, !918, !919, !920, !921, !922, !923, !924, !925, !929, !934, !938}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !910, file: !419, line: 347, baseType: !913, size: 256)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 256, elements: !159)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !910, file: !419, line: 348, baseType: !915, size: 768, offset: 256)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 768, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 24)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !910, file: !419, line: 349, baseType: !913, size: 256, offset: 1024)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !910, file: !419, line: 350, baseType: !915, size: 768, offset: 1280)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !910, file: !419, line: 351, baseType: !913, size: 256, offset: 2048)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !910, file: !419, line: 352, baseType: !915, size: 768, offset: 2304)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !910, file: !419, line: 353, baseType: !913, size: 256, offset: 3072)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !910, file: !419, line: 354, baseType: !915, size: 768, offset: 3328)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !910, file: !419, line: 355, baseType: !913, size: 256, offset: 4096)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !910, file: !419, line: 356, baseType: !926, size: 1792, offset: 4352)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 1792, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 56)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !910, file: !419, line: 357, baseType: !930, size: 1920, offset: 6144)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 1920, elements: !932)
!931 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !256)
!932 = !{!933}
!933 = !DISubrange(count: 240)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !910, file: !419, line: 358, baseType: !935, size: 20608, offset: 8064)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 20608, elements: !936)
!936 = !{!937}
!937 = !DISubrange(count: 644)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !910, file: !419, line: 359, baseType: !176, size: 32, offset: 28672)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !419, line: 402, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 379, size: 1120, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948, !949, !953, !954, !955, !956, !957, !958, !959, !960, !962, !963, !964, !968, !969, !971}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !941, file: !419, line: 381, baseType: !179, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !941, file: !419, line: 382, baseType: !176, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !941, file: !419, line: 383, baseType: !176, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !941, file: !419, line: 384, baseType: !176, size: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !941, file: !419, line: 385, baseType: !176, size: 32, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !941, file: !419, line: 386, baseType: !176, size: 32, offset: 160)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !941, file: !419, line: 387, baseType: !950, size: 96, offset: 192)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 96, elements: !951)
!951 = !{!952}
!952 = !DISubrange(count: 12)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !941, file: !419, line: 388, baseType: !176, size: 32, offset: 288)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !941, file: !419, line: 389, baseType: !176, size: 32, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !941, file: !419, line: 390, baseType: !176, size: 32, offset: 352)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !941, file: !419, line: 391, baseType: !176, size: 32, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !941, file: !419, line: 392, baseType: !176, size: 32, offset: 416)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !941, file: !419, line: 393, baseType: !176, size: 32, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !941, file: !419, line: 394, baseType: !176, size: 32, offset: 480)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !941, file: !419, line: 395, baseType: !961, size: 64, offset: 512)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !313)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !941, file: !419, line: 396, baseType: !179, size: 32, offset: 576)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !941, file: !419, line: 397, baseType: !179, size: 32, offset: 608)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !941, file: !419, line: 398, baseType: !965, size: 128, offset: 640)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 128, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 4)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !941, file: !419, line: 399, baseType: !210, size: 160, offset: 768)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !941, file: !419, line: 400, baseType: !970, size: 160, offset: 928)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 160, elements: !211)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !941, file: !419, line: 401, baseType: !176, size: 32, offset: 1088)
!972 = !{!973, !999, !1002, !1004, !1006, !839}
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "__init_sys_clock_driver_init", scope: !841, file: !975, line: 285, type: !976, isLocal: true, isDefinition: true, align: 32)
!975 = !DIFile(filename: "zephyr/drivers/timer/cortex_m_systick.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !235, line: 51, size: 64, elements: !978)
!978 = !{!979, !998}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !977, file: !235, line: 60, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DISubroutineType(types: !982)
!982 = !{!103, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !244, line: 378, size: 192, elements: !986)
!986 = !{!987, !988, !989, !990, !996, !997}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !985, file: !244, line: 380, baseType: !247, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !985, file: !244, line: 382, baseType: !13, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !985, file: !244, line: 384, baseType: !13, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !985, file: !244, line: 386, baseType: !991, size: 32, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !244, line: 351, size: 16, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !992, file: !244, line: 359, baseType: !256, size: 8)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !992, file: !244, line: 364, baseType: !259, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !985, file: !244, line: 388, baseType: !102, size: 32, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !985, file: !244, line: 396, baseType: !262, size: 32, offset: 160)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !977, file: !235, line: 65, baseType: !983, size: 32, offset: 32)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "lock", scope: !841, file: !975, line: 34, type: !1001, isLocal: true, isDefinition: true)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !387, line: 43, elements: !162)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "last_load", scope: !841, file: !975, line: 36, type: !137, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "cycle_count", scope: !841, file: !975, line: 48, type: !137, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "announced_cycles", scope: !841, file: !975, line: 54, type: !137, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "sam_port_addrs", scope: !1010, file: !1076, line: 21, type: !1077, isLocal: true, isDefinition: true)
!1010 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1011, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1012, globals: !1073, splitDebugInlining: false, nameTableKind: None)
!1011 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/pinctrl/pinctrl_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/basic/sys_heap")
!1012 = !{!1013}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pio", file: !1015, line: 96, baseType: !1016)
!1015 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1015, line: 41, size: 1888, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PER", scope: !1016, file: !1015, line: 42, baseType: !176, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PDR", scope: !1016, file: !1015, line: 43, baseType: !176, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PSR", scope: !1016, file: !1015, line: 44, baseType: !179, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !1016, file: !1015, line: 45, baseType: !190, size: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OER", scope: !1016, file: !1015, line: 46, baseType: !176, size: 32, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ODR", scope: !1016, file: !1015, line: 47, baseType: !176, size: 32, offset: 160)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OSR", scope: !1016, file: !1015, line: 48, baseType: !179, size: 32, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !1016, file: !1015, line: 49, baseType: !190, size: 32, offset: 224)
