; ModuleID = 'build/96b_carbon_nrf51/condvar/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.k_condvar = type { %struct._wait_q_t }
%struct.z_thread_stack_element = type { i8 }
%struct.log_source_const_data = type { i8*, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "count_mutex", scope: !27, file: !116, line: 16, type: !256, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/condition_variables/condvar/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !110, !111}
!102 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !102)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !141, !143, !154}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "count_threshold_cv", scope: !27, file: !116, line: 17, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/kernel/condition_variables/condvar/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !118, line: 2828, size: 64, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2829, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !116, line: 14, type: !109, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "tstacks", scope: !27, file: !116, line: 21, type: !145, isLocal: false, isDefinition: true, align: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 24576, elements: !151)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !147, line: 47, size: 8, elements: !148)
!147 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 48, baseType: !150, size: 8)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152, !153}
!152 = !DISubrange(count: 3)
!153 = !DISubrange(count: 1024)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "t", scope: !27, file: !116, line: 23, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 3456, elements: !255)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !158, line: 245, size: 1152, elements: !159)
!158 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!159 = !{!160, !209, !222, !223, !224, !228, !229, !250}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !157, file: !158, line: 247, baseType: !161, size: 384)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !158, line: 57, size: 384, elements: !162)
!162 = !{!163, !177, !179, !182, !183, !196, !197, !198}
!163 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !158, line: 60, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !158, line: 60, size: 64, elements: !165)
!165 = !{!166, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !164, file: !158, line: 61, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !164, file: !158, line: 62, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !170, line: 49, size: 64, elements: !171)
!170 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !169, file: !170, line: 50, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !175)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!175 = !{!176}
!176 = !DISubrange(count: 2)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !161, file: !158, line: 68, baseType: !178, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !161, file: !158, line: 71, baseType: !180, size: 8, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !181)
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !161, file: !158, line: 74, baseType: !180, size: 8, offset: 104)
!183 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !158, line: 90, baseType: !184, size: 16, offset: 112)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !158, line: 90, size: 16, elements: !185)
!185 = !{!186, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !184, file: !158, line: 91, baseType: !187, size: 16)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !184, file: !158, line: 91, size: 16, elements: !188)
!188 = !{!189, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !187, file: !158, line: 96, baseType: !190, size: 8)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !191)
!191 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !187, file: !158, line: 97, baseType: !180, size: 8, offset: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !184, file: !158, line: 100, baseType: !194, size: 16)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !195)
!195 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !161, file: !158, line: 107, baseType: !110, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !161, file: !158, line: 127, baseType: !107, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !161, file: !158, line: 131, baseType: !199, size: 192, offset: 192)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !200)
!200 = !{!201, !202, !208}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !199, file: !122, line: 245, baseType: !167, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !199, file: !122, line: 246, baseType: !203, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !199, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !157, file: !158, line: 250, baseType: !210, size: 288, offset: 384)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !211, line: 25, size: 288, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !210, file: !211, line: 26, baseType: !110, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !210, file: !211, line: 27, baseType: !110, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !210, file: !211, line: 28, baseType: !110, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !210, file: !211, line: 29, baseType: !110, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !210, file: !211, line: 30, baseType: !110, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !210, file: !211, line: 31, baseType: !110, size: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !210, file: !211, line: 32, baseType: !110, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !210, file: !211, line: 33, baseType: !110, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !210, file: !211, line: 34, baseType: !110, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !157, file: !158, line: 253, baseType: !107, size: 32, offset: 672)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !157, file: !158, line: 256, baseType: !121, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !158, line: 279, baseType: !225, size: 256, offset: 768)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !157, file: !158, line: 294, baseType: !109, size: 32, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !157, file: !158, line: 325, baseType: !230, size: 32, offset: 1056)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !232)
!232 = !{!233, !244, !245}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !231, file: !118, line: 5074, baseType: !234, size: 96)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !235, line: 56, size: 96, elements: !236)
!235 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = !{!237, !240, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !234, file: !235, line: 57, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !235, line: 57, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !234, file: !235, line: 58, baseType: !107, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !234, file: !235, line: 59, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !243, line: 214, baseType: !32)
!243 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !231, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !231, file: !118, line: 5076, baseType: !246, size: 32, offset: 160)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !247, line: 43, size: 32, elements: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = !{!249}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !246, file: !247, line: 52, baseType: !22, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !157, file: !158, line: 343, baseType: !251, size: 64, offset: 1088)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !211, line: 60, size: 64, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !251, file: !211, line: 63, baseType: !110, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !251, file: !211, line: 66, baseType: !110, size: 32, offset: 32)
!255 = !{!152}
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !118, line: 2720, size: 160, elements: !257)
!257 = !{!258, !259, !261, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !256, file: !118, line: 2722, baseType: !121, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !256, file: !118, line: 2724, baseType: !260, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !256, file: !118, line: 2727, baseType: !110, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !256, file: !118, line: 2730, baseType: !109, size: 32, offset: 128)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !265, file: !282, line: 18, type: !283, isLocal: false, isDefinition: true)
!265 = distinct !DICompileUnit(language: DW_LANG_C99, file: !266, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !267, globals: !281, splitDebugInlining: false, nameTableKind: None)
!266 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!267 = !{!22, !107, !24, !268, !270, !272, !242, !109, !275, !276, !277, !278, !279, !280, !194, !273}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!281 = !{!263}
!282 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !285, line: 16, size: 64, elements: !286)
!285 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !284, file: !285, line: 17, baseType: !273, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !284, file: !285, line: 18, baseType: !180, size: 8, offset: 32)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "_char_out", scope: !291, file: !295, line: 54, type: !296, isLocal: false, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !293, globals: !294, splitDebugInlining: false, nameTableKind: None)
!292 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!293 = !{!107, !109}
!294 = !{!289}
!295 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DISubroutineType(types: !298)
!298 = !{!109, !109}
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !301, file: !335, line: 22, type: !367, isLocal: false, isDefinition: true)
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !315, globals: !332, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!303 = !{!304, !30}
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !305, line: 27, baseType: !32, size: 32, elements: !306)
!305 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314}
!307 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!308 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!309 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!310 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!311 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!312 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!313 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!314 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!315 = !{!107, !103, !109, !24, !316, !279, !110, !111}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !318, line: 54, size: 96, elements: !319)
!318 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!319 = !{!320, !327, !331}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !317, file: !318, line: 55, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !322, line: 33, baseType: !323)
!322 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !322, line: 29, size: 32, elements: !324)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !322, line: 30, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !317, file: !318, line: 60, baseType: !328, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !304}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !317, file: !318, line: 65, baseType: !328, size: 32, offset: 64)
!332 = !{!299, !333, !341, !346, !348, !357, !359}
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !301, file: !335, line: 27, type: !336, isLocal: true, isDefinition: true)
!335 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 32, elements: !339)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !338, line: 22, baseType: !102)
!338 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = !{!340}
!340 = !DISubrange(count: 1)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !301, file: !335, line: 44, type: !343, isLocal: true, isDefinition: true)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !247, line: 43, size: 32, elements: !344)
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !343, file: !247, line: 52, baseType: !22, size: 32)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !301, file: !335, line: 49, type: !343, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !301, file: !335, line: 36, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 128, elements: !339)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !305, line: 114, size: 128, elements: !352)
!352 = !{!353, !354, !355, !356}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !351, file: !305, line: 115, baseType: !304, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !351, file: !305, line: 141, baseType: !180, size: 8, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !351, file: !305, line: 149, baseType: !110, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !351, file: !305, line: 156, baseType: !110, size: 32, offset: 96)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !301, file: !335, line: 40, type: !350, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !301, file: !335, line: 28, type: !361, isLocal: true, isDefinition: true)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !322, line: 40, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !322, line: 35, size: 64, elements: !363)
!363 = !{!364, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !362, file: !322, line: 36, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !362, file: !322, line: 37, baseType: !365, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !285, line: 16, size: 64, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !368, file: !285, line: 17, baseType: !273, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !368, file: !285, line: 18, baseType: !180, size: 8, offset: 32)
!372 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!373 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !376, file: !405, line: 50, type: !392, isLocal: true, isDefinition: true)
!376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !377, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !378, globals: !402, splitDebugInlining: false, nameTableKind: None)
!377 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!378 = !{!379, !103, !242, !109, !107, !110, !111, !381, !279, !392, !393}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !380)
!380 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !383, line: 45, size: 64, elements: !384)
!383 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !{!385, !391}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !382, file: !383, line: 46, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !322, line: 33, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !322, line: 29, size: 32, elements: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !322, line: 30, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !382, file: !383, line: 48, baseType: !110, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !383, line: 38, size: 64, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !394, file: !383, line: 39, baseType: !386, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !394, file: !383, line: 41, baseType: !398, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !383, line: 35, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !392}
!402 = !{!403, !409, !417, !374, !419, !429}
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "latency_lock", scope: !376, file: !405, line: 44, type: !406, isLocal: true, isDefinition: true)
!405 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !247, line: 43, size: 32, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !406, file: !247, line: 52, baseType: !22, size: 32)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !376, file: !405, line: 46, type: !411, isLocal: true, isDefinition: true)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !322, line: 40, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !322, line: 35, size: 64, elements: !413)
!413 = !{!414, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !412, file: !322, line: 36, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !412, file: !322, line: 37, baseType: !415, size: 32, offset: 32)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "latency_subs", scope: !376, file: !405, line: 52, type: !411, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !376, file: !405, line: 39, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, elements: !427)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 35, size: 96, elements: !423)
!423 = !{!424, !425, !426}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !422, file: !405, line: 36, baseType: !304, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !422, file: !405, line: 37, baseType: !180, size: 8, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !422, file: !405, line: 38, baseType: !337, size: 32, offset: 64)
!427 = !{!428}
!428 = !DISubrange(count: 0)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !376, file: !405, line: 48, type: !392, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !433, file: !440, line: 47, type: !454, isLocal: true, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !435, retainedTypes: !436, globals: !437, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!435 = !{!304}
!436 = !{!242, !109}
!437 = !{!438, !431, !450}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "cpus_states", scope: !433, file: !440, line: 50, type: !441, isLocal: true, isDefinition: true)
!440 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 32, elements: !339)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !305, line: 114, size: 128, elements: !445)
!445 = !{!446, !447, !448, !449}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !444, file: !305, line: 115, baseType: !304, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !444, file: !305, line: 141, baseType: !180, size: 8, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !444, file: !305, line: 149, baseType: !110, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !444, file: !305, line: 156, baseType: !110, size: 32, offset: 96)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !433, file: !440, line: 55, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 8, elements: !339)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, elements: !427)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !457, file: !464, line: 21, type: !296, isLocal: true, isDefinition: true)
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !459, globals: !463, splitDebugInlining: false, nameTableKind: None)
!458 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!459 = !{!460, !109, !107}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !462, line: 22, baseType: !109)
!462 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = !{!455}
!464 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !467, file: !564, line: 31, type: !581, isLocal: false, isDefinition: true)
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !469, globals: !561, splitDebugInlining: false, nameTableKind: None)
!468 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!469 = !{!470, !180, !107, !109, !534, !535, !550, !110}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !472, line: 247, baseType: !473)
!472 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 216, size: 20576, elements: !474)
!474 = !{!475, !481, !482, !483, !487, !488, !492, !493, !494, !498, !499, !503, !504, !508, !509, !511, !512, !514, !515, !516, !517, !521, !522, !523, !524, !528, !529, !533}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !473, file: !472, line: 217, baseType: !476, size: 960)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 960, elements: !479)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!479 = !{!480}
!480 = !DISubrange(count: 30)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !473, file: !472, line: 218, baseType: !478, size: 32, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !473, file: !472, line: 219, baseType: !478, size: 32, offset: 992)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !473, file: !472, line: 220, baseType: !484, size: 1088, offset: 1024)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1088, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 34)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !473, file: !472, line: 221, baseType: !478, size: 32, offset: 2112)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !473, file: !472, line: 222, baseType: !489, size: 4032, offset: 2144)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 4032, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 126)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !473, file: !472, line: 223, baseType: !478, size: 32, offset: 6176)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !473, file: !472, line: 224, baseType: !478, size: 32, offset: 6208)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !473, file: !472, line: 225, baseType: !495, size: 1952, offset: 6240)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1952, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 61)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !473, file: !472, line: 226, baseType: !478, size: 32, offset: 8192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !473, file: !472, line: 227, baseType: !500, size: 288, offset: 8224)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 288, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 9)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !473, file: !472, line: 228, baseType: !477, size: 32, offset: 8512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !473, file: !472, line: 229, baseType: !505, size: 1696, offset: 8544)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1696, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 53)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !473, file: !472, line: 230, baseType: !478, size: 32, offset: 10240)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !473, file: !472, line: 231, baseType: !510, size: 96, offset: 10272)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 96, elements: !255)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !473, file: !472, line: 232, baseType: !478, size: 32, offset: 10368)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !473, file: !472, line: 233, baseType: !513, size: 64, offset: 10400)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 64, elements: !175)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !473, file: !472, line: 234, baseType: !478, size: 32, offset: 10464)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !473, file: !472, line: 236, baseType: !477, size: 32, offset: 10496)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !473, file: !472, line: 237, baseType: !478, size: 32, offset: 10528)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !473, file: !472, line: 238, baseType: !518, size: 224, offset: 10560)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 224, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 7)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !473, file: !472, line: 239, baseType: !478, size: 32, offset: 10784)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !473, file: !472, line: 241, baseType: !510, size: 96, offset: 10816)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !473, file: !472, line: 242, baseType: !478, size: 32, offset: 10912)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !473, file: !472, line: 243, baseType: !525, size: 256, offset: 10944)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 256, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 8)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !473, file: !472, line: 244, baseType: !478, size: 32, offset: 11200)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !473, file: !472, line: 245, baseType: !530, size: 9312, offset: 11232)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 9312, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 291)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !473, file: !472, line: 246, baseType: !478, size: 32, offset: 20544)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !537, line: 352, baseType: !538)
!537 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !537, line: 341, size: 320, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !549}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !538, file: !537, line: 343, baseType: !477, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !538, file: !537, line: 344, baseType: !478, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !538, file: !537, line: 345, baseType: !110, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !538, file: !537, line: 346, baseType: !478, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !538, file: !537, line: 347, baseType: !478, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !538, file: !537, line: 348, baseType: !478, size: 32, offset: 160)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !538, file: !537, line: 349, baseType: !110, size: 32, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !538, file: !537, line: 350, baseType: !548, size: 64, offset: 224)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 64, elements: !175)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !538, file: !537, line: 351, baseType: !478, size: 32, offset: 288)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !552, file: !551, line: 167, baseType: !560)
!551 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!552 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !551, file: !551, line: 134, type: !553, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !467, retainedNodes: !555)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !110}
!555 = !{!556, !557, !559}
!556 = !DILocalVariable(name: "time_us", arg: 1, scope: !552, file: !551, line: 134, type: !110)
!557 = !DILocalVariable(name: "delay_cycles", scope: !552, file: !551, line: 168, type: !558)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!559 = !DILocalVariable(name: "cycles", scope: !552, file: !551, line: 171, type: !110)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!561 = !{!465, !562, !577}
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !467, file: !564, line: 71, type: !565, isLocal: true, isDefinition: true, align: 32)
!564 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !567, line: 51, size: 64, elements: !568)
!567 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!568 = !{!569, !576}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !566, file: !567, line: 60, baseType: !570, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DISubroutineType(types: !572)
!572 = !{!109, !573}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !567, line: 48, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !566, file: !567, line: 65, baseType: !573, size: 32, offset: 32)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !552, file: !551, line: 161, type: !579, isLocal: true, isDefinition: true, align: 128)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 48, elements: !255)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !285, line: 16, size: 64, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !582, file: !285, line: 17, baseType: !273, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !582, file: !285, line: 18, baseType: !180, size: 8, offset: 32)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !588, file: !786, line: 18, type: !1020, isLocal: false, isDefinition: true)
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !590, retainedTypes: !705, globals: !782, splitDebugInlining: false, nameTableKind: None)
!589 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!590 = !{!591, !597, !30, !602, !607, !612, !618, !624, !633, !637, !670, !677, !696}
!591 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !592, line: 23, baseType: !32, size: 32, elements: !593)
!592 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!593 = !{!594, !595, !596}
!594 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!595 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!596 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!597 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !592, line: 48, baseType: !32, size: 32, elements: !598)
!598 = !{!599, !600, !601}
!599 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!600 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!601 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 167, baseType: !32, size: 32, elements: !604)
!603 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!604 = !{!605, !606}
!605 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!606 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!607 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 107, baseType: !32, size: 32, elements: !608)
!608 = !{!609, !610, !611}
!609 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!610 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!611 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 208, baseType: !32, size: 32, elements: !613)
!613 = !{!614, !615, !616, !617}
!614 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!615 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!616 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!617 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!618 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 261, baseType: !32, size: 32, elements: !619)
!619 = !{!620, !621, !622, !623}
!620 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!621 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!622 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!623 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!624 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 237, baseType: !32, size: 32, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !632}
!626 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!627 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!628 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!629 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!630 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!631 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!632 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 152, baseType: !32, size: 32, elements: !634)
!634 = !{!635, !636}
!635 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!636 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !472, line: 71, baseType: !109, size: 32, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!639 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!640 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!641 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!642 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!643 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!644 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!645 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!646 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!647 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!648 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!649 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!650 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!651 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!652 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!653 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!654 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!655 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!656 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!657 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!658 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!659 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!660 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!661 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!662 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!663 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!664 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!665 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!666 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!667 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!668 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!669 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !671, line: 44, baseType: !32, size: 32, elements: !672)
!671 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!672 = !{!673, !674, !675, !676}
!673 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!674 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!675 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!676 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !678, line: 54, baseType: !32, size: 32, elements: !679)
!678 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!680 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!681 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!682 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!683 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!684 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!685 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!686 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!687 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!688 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!689 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!690 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!691 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!692 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!693 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!694 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!695 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 53, baseType: !32, size: 32, elements: !698)
!697 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!698 = !{!699, !700, !701, !702, !703, !704}
!699 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!700 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!701 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!702 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!703 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!704 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!705 = !{!591, !107, !109, !706, !754, !755, !756, !757, !103, !110, !111, !758, !534, !280, !392, !759, !781, !242}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !472, line: 291, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 260, size: 10912, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !721, !722, !723, !724, !725, !726, !730, !731, !732, !736, !737, !738, !739, !740, !741, !742, !746, !747, !748, !749, !753}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !708, file: !472, line: 261, baseType: !478, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !708, file: !472, line: 262, baseType: !478, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !708, file: !472, line: 263, baseType: !478, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !708, file: !472, line: 264, baseType: !478, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !708, file: !472, line: 265, baseType: !478, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !708, file: !472, line: 266, baseType: !478, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !708, file: !472, line: 267, baseType: !478, size: 32, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !708, file: !472, line: 268, baseType: !718, size: 1824, offset: 224)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1824, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 57)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !708, file: !472, line: 269, baseType: !478, size: 32, offset: 2048)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !708, file: !472, line: 270, baseType: !478, size: 32, offset: 2080)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !708, file: !472, line: 271, baseType: !477, size: 32, offset: 2112)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !708, file: !472, line: 272, baseType: !478, size: 32, offset: 2144)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !708, file: !472, line: 273, baseType: !478, size: 32, offset: 2176)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !708, file: !472, line: 274, baseType: !727, size: 3968, offset: 2208)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 3968, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 124)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !708, file: !472, line: 275, baseType: !478, size: 32, offset: 6176)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !708, file: !472, line: 276, baseType: !478, size: 32, offset: 6208)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !708, file: !472, line: 277, baseType: !733, size: 2016, offset: 6240)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 2016, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 63)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !708, file: !472, line: 278, baseType: !477, size: 32, offset: 8256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !708, file: !472, line: 279, baseType: !477, size: 32, offset: 8288)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !708, file: !472, line: 280, baseType: !477, size: 32, offset: 8320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !708, file: !472, line: 281, baseType: !477, size: 32, offset: 8352)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !708, file: !472, line: 282, baseType: !477, size: 32, offset: 8384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !708, file: !472, line: 283, baseType: !477, size: 32, offset: 8416)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !708, file: !472, line: 285, baseType: !743, size: 1984, offset: 8448)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1984, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 62)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !708, file: !472, line: 286, baseType: !478, size: 32, offset: 10432)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !708, file: !472, line: 287, baseType: !518, size: 224, offset: 10464)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !708, file: !472, line: 288, baseType: !478, size: 32, offset: 10688)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !708, file: !472, line: 289, baseType: !750, size: 160, offset: 10720)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 160, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 5)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "XTALFREQ", scope: !708, file: !472, line: 290, baseType: !478, size: 32, offset: 10880)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !603, line: 146, baseType: !607)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !603, line: 164, baseType: !633)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!758 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !537, line: 326, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !537, line: 314, size: 6400, elements: !762)
!762 = !{!763, !765, !769, !770, !771, !772, !773, !774, !775, !779}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !761, file: !537, line: 316, baseType: !764, size: 32)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 32, elements: !339)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !761, file: !537, line: 317, baseType: !766, size: 992, offset: 32)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 992, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 31)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !761, file: !537, line: 318, baseType: !764, size: 32, offset: 1024)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !761, file: !537, line: 319, baseType: !766, size: 992, offset: 1056)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !761, file: !537, line: 320, baseType: !764, size: 32, offset: 2048)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !761, file: !537, line: 321, baseType: !766, size: 992, offset: 2080)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !761, file: !537, line: 322, baseType: !764, size: 32, offset: 3072)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !761, file: !537, line: 323, baseType: !766, size: 992, offset: 3104)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !761, file: !537, line: 324, baseType: !776, size: 2048, offset: 4096)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 2048, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !761, file: !537, line: 325, baseType: !780, size: 256, offset: 6144)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 256, elements: !526)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !671, line: 56, baseType: !107)
!782 = !{!586, !783, !835, !876, !882, !899, !910, !912, !929, !931, !941, !944, !960, !998, !1012}
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "on", scope: !785, file: !786, line: 549, type: !337, isLocal: true, isDefinition: true)
!785 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !786, file: !786, line: 547, type: !787, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !588, retainedNodes: !789)
!786 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!787 = !DISubroutineType(types: !788)
!788 = !{null, !597}
!789 = !{!790, !791, !794}
!790 = !DILocalVariable(name: "start_mode", arg: 1, scope: !785, file: !786, line: 547, type: !597)
!791 = !DILocalVariable(name: "err", scope: !792, file: !786, line: 553, type: !109)
!792 = distinct !DILexicalBlock(scope: !793, file: !786, line: 552, column: 31)
!793 = distinct !DILexicalBlock(scope: !785, file: !786, line: 552, column: 6)
!794 = !DILocalVariable(name: "mgr", scope: !792, file: !786, line: 554, type: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !797, line: 154, size: 256, elements: !798)
!797 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !{!799, !811, !812, !828, !832, !833, !834}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !796, file: !797, line: 158, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !322, line: 40, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !322, line: 35, size: 64, elements: !802)
!802 = !{!803, !810}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !801, file: !322, line: 36, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !322, line: 33, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !322, line: 29, size: 32, elements: !807)
!807 = !{!808}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !806, file: !322, line: 30, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !801, file: !322, line: 37, baseType: !804, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !796, file: !797, line: 163, baseType: !800, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !796, file: !797, line: 166, baseType: !813, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !797, line: 133, size: 96, elements: !816)
!816 = !{!817, !826, !827}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !815, file: !797, line: 135, baseType: !818, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !797, line: 129, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !795, !822}
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !797, line: 101, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !795, !109}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !815, file: !797, line: 138, baseType: !818, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !815, file: !797, line: 143, baseType: !818, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !796, file: !797, line: 169, baseType: !829, size: 32, offset: 160)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !247, line: 43, size: 32, elements: !830)
!830 = !{!831}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !829, file: !247, line: 52, baseType: !22, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !796, file: !797, line: 172, baseType: !109, size: 32, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !796, file: !797, line: 175, baseType: !194, size: 16, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !796, file: !797, line: 178, baseType: !194, size: 16, offset: 240)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "cli", scope: !785, file: !786, line: 550, type: !837, isLocal: true, isDefinition: true)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !797, line: 273, size: 128, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !837, file: !797, line: 280, baseType: !805, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !837, file: !797, line: 283, baseType: !841, size: 96, offset: 32)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !842, line: 138, size: 96, elements: !843)
!842 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!843 = !{!844, !873, !874}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !841, file: !842, line: 149, baseType: !845, size: 32)
!845 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !842, line: 139, size: 32, elements: !846)
!846 = !{!847, !868}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !845, file: !842, line: 145, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !118, line: 5397, size: 128, elements: !850)
!850 = !{!851, !866, !867}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !849, file: !118, line: 5399, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !854)
!854 = !{!855, !861}
!855 = !DIDerivedType(tag: DW_TAG_member, scope: !853, file: !127, line: 38, baseType: !856, size: 32)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !853, file: !127, line: 38, size: 32, elements: !857)
!857 = !{!858, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !856, file: !127, line: 39, baseType: !859, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !856, file: !127, line: 40, baseType: !859, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, scope: !853, file: !127, line: 42, baseType: !862, size: 32, offset: 32)
!862 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !853, file: !127, line: 42, size: 32, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !862, file: !127, line: 43, baseType: !859, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !862, file: !127, line: 44, baseType: !859, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !849, file: !118, line: 5405, baseType: !32, size: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !849, file: !118, line: 5408, baseType: !109, size: 32, offset: 96)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !845, file: !842, line: 148, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !842, line: 98, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DISubroutineType(types: !872)
!872 = !{null, null}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !841, file: !842, line: 165, baseType: !478, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !841, file: !842, line: 174, baseType: !875, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !109)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !588, file: !786, line: 733, type: !878, isLocal: false, isDefinition: true, align: 16)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !879, size: 80, elements: !751)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !881, line: 43, baseType: !379)
!881 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !588, file: !786, line: 733, type: !884, isLocal: false, isDefinition: true, align: 32)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !881, line: 378, size: 192, elements: !886)
!886 = !{!887, !888, !889, !890, !896, !897}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !885, file: !881, line: 380, baseType: !273, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !885, file: !881, line: 382, baseType: !13, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !885, file: !881, line: 384, baseType: !13, size: 32, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !885, file: !881, line: 386, baseType: !891, size: 32, offset: 96)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !881, line: 351, size: 16, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !892, file: !881, line: 359, baseType: !180, size: 8)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !892, file: !881, line: 364, baseType: !758, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !885, file: !881, line: 388, baseType: !107, size: 32, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !885, file: !881, line: 396, baseType: !898, size: 32, offset: 160)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !588, file: !786, line: 733, type: !901, isLocal: true, isDefinition: true, align: 32)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !567, line: 51, size: 64, elements: !903)
!903 = !{!904, !909}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !902, file: !567, line: 60, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DISubroutineType(types: !907)
!907 = !{!109, !908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !902, file: !567, line: 65, baseType: !908, size: 32, offset: 32)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !588, file: !786, line: 79, type: !337, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "data", scope: !588, file: !786, line: 702, type: !914, isLocal: true, isDefinition: true)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !786, line: 69, size: 704, elements: !915)
!915 = !{!916, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !914, file: !786, line: 70, baseType: !917, size: 512)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 512, elements: !175)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !914, file: !786, line: 71, baseType: !919, size: 192, offset: 512)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 192, elements: !175)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !786, line: 52, size: 96, elements: !921)
!921 = !{!922, !927, !928}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !920, file: !786, line: 53, baseType: !923, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !671, line: 72, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 32)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !908, !781, !107}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !920, file: !786, line: 54, baseType: !107, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !920, file: !786, line: 55, baseType: !110, size: 32, offset: 64)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_23", scope: !588, file: !786, line: 733, type: !892, isLocal: true, isDefinition: true, align: 8)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "d", scope: !933, file: !786, line: 476, type: !939, isLocal: true, isDefinition: true)
!933 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !786, file: !786, line: 474, type: !787, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !588, retainedNodes: !934)
!934 = !{!935, !936, !937, !938}
!935 = !DILocalVariable(name: "mode", arg: 1, scope: !933, file: !786, line: 474, type: !597)
!936 = !DILocalVariable(name: "type", scope: !933, file: !786, line: 486, type: !754)
!937 = !DILocalVariable(name: "isr_mode", scope: !933, file: !786, line: 500, type: !758)
!938 = !DILocalVariable(name: "key", scope: !933, file: !786, line: 501, type: !109)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !603, line: 177, baseType: !602)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "target_type", scope: !933, file: !786, line: 477, type: !943, isLocal: true, isDefinition: true)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "config", scope: !588, file: !786, line: 704, type: !946, isLocal: true, isDefinition: true)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !786, line: 74, size: 192, elements: !948)
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !947, file: !786, line: 76, baseType: !950, size: 192)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 192, elements: !175)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !786, line: 61, size: 96, elements: !952)
!952 = !{!953, !958, !959}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !951, file: !786, line: 62, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !786, line: 58, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(types: !957)
!957 = !{null}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !951, file: !786, line: 63, baseType: !954, size: 32, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !951, file: !786, line: 65, baseType: !273, size: 32, offset: 64)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !588, file: !786, line: 695, type: !962, isLocal: true, isDefinition: true)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !671, line: 100, size: 224, elements: !964)
!964 = !{!965, !970, !971, !976, !982, !987, !993}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !963, file: !671, line: 101, baseType: !966, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !671, line: 76, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{!109, !908, !781}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !963, file: !671, line: 102, baseType: !966, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !963, file: !671, line: 103, baseType: !972, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !671, line: 83, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(types: !975)
!975 = !{!109, !908, !781, !923, !107}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !963, file: !671, line: 104, baseType: !977, size: 32, offset: 96)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !671, line: 79, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DISubroutineType(types: !980)
!980 = !{!109, !908, !781, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !963, file: !671, line: 105, baseType: !983, size: 32, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !671, line: 88, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{!670, !908, !781}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !963, file: !671, line: 106, baseType: !988, size: 32, offset: 160)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !671, line: 92, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = !DISubroutineType(types: !991)
!991 = !{!109, !908, !781, !992}
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !671, line: 64, baseType: !107)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !963, file: !671, line: 107, baseType: !994, size: 32, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !671, line: 96, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DISubroutineType(types: !997)
!997 = !{!109, !908, !781, !107}
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "transitions", scope: !1000, file: !786, line: 655, type: !814, isLocal: true, isDefinition: true)
!1000 = distinct !DISubprogram(name: "clk_init", scope: !786, file: !786, line: 651, type: !906, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !588, retainedNodes: !1001)
!1001 = !{!1002, !1003, !1005, !1006, !1008}
!1002 = !DILocalVariable(name: "dev", arg: 1, scope: !1000, file: !786, line: 651, type: !908)
!1003 = !DILocalVariable(name: "nrfx_err", scope: !1000, file: !786, line: 653, type: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !678, line: 72, baseType: !677)
!1005 = !DILocalVariable(name: "err", scope: !1000, file: !786, line: 654, type: !109)
!1006 = !DILocalVariable(name: "i", scope: !1007, file: !786, line: 678, type: !591)
!1007 = distinct !DILexicalBlock(scope: !1000, file: !786, line: 678, column: 2)
!1008 = !DILocalVariable(name: "subdata", scope: !1009, file: !786, line: 680, type: !1011)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !786, line: 679, column: 42)
!1010 = distinct !DILexicalBlock(scope: !1007, file: !786, line: 678, column: 2)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "__isr_nrfx_isr_irq_0", scope: !1000, file: !786, line: 660, type: !1014, isLocal: true, isDefinition: true, align: 32)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1014, file: !10, line: 55, baseType: !392, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1014, file: !10, line: 57, baseType: !392, size: 32, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1014, file: !10, line: 59, baseType: !107, size: 32, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1014, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !285, line: 16, size: 64, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1021, file: !285, line: 17, baseType: !273, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1021, file: !285, line: 18, baseType: !180, size: 8, offset: 32)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !1027, file: !1032, line: 7, type: !1033, isLocal: false, isDefinition: true, align: 16)
!1027 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1028, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1029, splitDebugInlining: false, nameTableKind: None)
!1028 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!1029 = !{!1025, !1030, !1034}
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !1027, file: !1032, line: 12, type: !1033, isLocal: false, isDefinition: true, align: 16)
!1032 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !879, size: 48, elements: !255)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_49", scope: !1027, file: !1032, line: 17, type: !1033, isLocal: false, isDefinition: true, align: 16)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !1038, file: !1095, line: 603, type: !1097, isLocal: true, isDefinition: true, align: 32)
!1038 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1039, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !1040, globals: !1092, splitDebugInlining: false, nameTableKind: None)
!1039 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/condvar")
!1040 = !{!107, !109, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !1044, line: 336, size: 160, elements: !1045)
!1044 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1045 = !{!1046, !1066, !1070, !1074, !1087}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !1043, file: !1044, line: 365, baseType: !1047, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 32)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!109, !1050, !1065}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !881, line: 378, size: 192, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1063, !1064}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1052, file: !881, line: 380, baseType: !273, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1052, file: !881, line: 382, baseType: !13, size: 32, offset: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1052, file: !881, line: 384, baseType: !13, size: 32, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1052, file: !881, line: 386, baseType: !1058, size: 32, offset: 96)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 32)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !881, line: 351, size: 16, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1059, file: !881, line: 359, baseType: !180, size: 8)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1059, file: !881, line: 364, baseType: !758, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
