; ModuleID = 'build/adafruit_trinket_m0/subsys/pm/latency/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.test_api = type { void (%struct.device*)*, void (%struct.device*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.dev_test_data = type { %struct.pm_policy_latency_subscription, %struct.pm_policy_latency_request }
%struct.pm_policy_latency_subscription = type { %struct._snode, void (i32)* }
%struct._snode = type { %struct._snode* }
%struct.pm_policy_latency_request = type { %struct._snode, i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.10, i8*, i32 }
%union.anon.10 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_app", scope: !27, file: !199, line: 14, type: !201, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !107, globals: !196, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/latency/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency")
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !38, line: 27, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!40 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!41 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!42 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!43 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!44 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!45 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!46 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!47 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!48 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!49 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!50 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!51 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!52 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!53 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!54 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!55 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!56 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!106 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!107 = !{!108, !109, !123, !124, !117, !125, !135, !154, !155, !159, !161}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !110, file: !111, line: 80, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !115)
!115 = !{!116, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !111, line: 47, baseType: !117, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !114, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !114, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !114, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !110, file: !111, line: 82, baseType: !108, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !127)
!127 = !{!128, !146, !150}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !126, file: !31, line: 89, baseType: !129, size: 96)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !130)
!130 = !{!131, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !129, file: !31, line: 67, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !133)
!133 = !{!134, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !132, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !132, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !132, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !132, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !132, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !129, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !129, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !135)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !126, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !31, line: 94, baseType: !151, offset: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: -1)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !156, line: 46, baseType: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !158)
!158 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !160)
!160 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "test_api", file: !164, line: 8, size: 64, elements: !165)
!164 = !DIFile(filename: "zephyr/samples/subsys/pm/latency/src/test.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!165 = !{!166, !195}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !163, file: !164, line: 9, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !173, line: 378, size: 192, elements: !174)
!173 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !{!175, !179, !180, !181, !188, !189}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !173, line: 380, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !172, file: !173, line: 382, baseType: !13, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !172, file: !173, line: 384, baseType: !13, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !172, file: !173, line: 386, baseType: !182, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !173, line: 351, size: 16, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !183, file: !173, line: 359, baseType: !117, size: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !183, file: !173, line: 364, baseType: !187, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!187 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !172, file: !173, line: 388, baseType: !108, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !172, file: !173, line: 396, baseType: !190, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !173, line: 43, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !194)
!194 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !163, file: !164, line: 10, baseType: !167, size: 32, offset: 32)
!196 = !{!25, !197}
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !199, line: 14, type: !200, isLocal: true, isDefinition: true)
!199 = !DIFile(filename: "zephyr/samples/subsys/pm/latency/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 17, baseType: !176, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 18, baseType: !117, size: 8, offset: 32)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "log_const_soc_pm", scope: !209, file: !260, line: 11, type: !262, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !223, globals: !257, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/latency/src/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency")
!211 = !{!212, !30, !37}
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !213, line: 27, baseType: !32, size: 32, elements: !214)
!213 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222}
!215 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!216 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!217 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!218 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!219 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!220 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!221 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!222 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!223 = !{!108, !224, !123, !124, !235, !117, !236, !135}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !226)
!226 = !{!227, !234}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !225, file: !111, line: 80, baseType: !228, size: 32)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !229)
!229 = !{!230, !231, !232, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !228, file: !111, line: 47, baseType: !117, size: 8)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !228, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !228, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !228, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !225, file: !111, line: 82, baseType: !108, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !238)
!238 = !{!239, !255, !256}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !237, file: !31, line: 89, baseType: !240, size: 96)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !241)
!241 = !{!242, !253, !254}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !240, file: !31, line: 67, baseType: !243, size: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !243, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !243, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !243, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !243, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !243, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !243, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !243, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !240, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !240, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !237, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !237, file: !31, line: 94, baseType: !151, offset: 128)
!257 = !{!207, !258}
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !209, file: !260, line: 11, type: !261, isLocal: true, isDefinition: true)
!260 = !DIFile(filename: "zephyr/samples/subsys/pm/latency/src/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !203, line: 17, baseType: !176, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !263, file: !203, line: 18, baseType: !117, size: 8, offset: 32)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "log_const_dev_test", scope: !269, file: !308, line: 13, type: !381, isLocal: false, isDefinition: true)
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !271, retainedTypes: !272, globals: !305, splitDebugInlining: false, nameTableKind: None)
!270 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/latency/src/test.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency")
!271 = !{!30}
!272 = !{!108, !273, !123, !124, !117, !284, !135, !154}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !275)
!275 = !{!276, !283}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !274, file: !111, line: 80, baseType: !277, size: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !277, file: !111, line: 47, baseType: !117, size: 8)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !277, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !277, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !277, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !274, file: !111, line: 82, baseType: !108, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !286)
!286 = !{!287, !303, !304}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !285, file: !31, line: 89, baseType: !288, size: 96)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !289)
!289 = !{!290, !301, !302}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !288, file: !31, line: 67, baseType: !291, size: 32)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !291, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !291, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !291, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !291, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !291, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !291, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !291, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !288, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !288, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !285, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !285, file: !31, line: 94, baseType: !151, offset: 128)
!305 = !{!267, !306, !312, !328, !340, !366, !368, !378}
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "__devicehdl_dev_test", scope: !269, file: !308, line: 62, type: !309, isLocal: false, isDefinition: true, align: 16)
!308 = !DIFile(filename: "zephyr/samples/subsys/pm/latency/src/test.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 48, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 3)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "__device_dev_test", scope: !269, file: !308, line: 62, type: !314, isLocal: true, isDefinition: true, align: 32)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !173, line: 378, size: 192, elements: !316)
!316 = !{!317, !318, !319, !320, !326, !327}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !173, line: 380, baseType: !176, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !315, file: !173, line: 382, baseType: !13, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !315, file: !173, line: 384, baseType: !13, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !315, file: !173, line: 386, baseType: !321, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !173, line: 351, size: 16, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !322, file: !173, line: 359, baseType: !117, size: 8)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !322, file: !173, line: 364, baseType: !187, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !173, line: 388, baseType: !108, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !315, file: !173, line: 396, baseType: !190, size: 32, offset: 160)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "__init___device_dev_test", scope: !269, file: !308, line: 62, type: !330, isLocal: true, isDefinition: true, align: 32)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !332, line: 51, size: 64, elements: !333)
!332 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !{!334, !339}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !331, file: !332, line: 60, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DISubroutineType(types: !337)
!337 = !{!123, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !331, file: !332, line: 65, baseType: !338, size: 32, offset: 32)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "data", scope: !269, file: !308, line: 60, type: !342, isLocal: true, isDefinition: true)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_test_data", file: !308, line: 15, size: 128, elements: !343)
!343 = !{!344, !361}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !342, file: !308, line: 16, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !346, line: 38, size: 64, elements: !347)
!346 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!347 = !{!348, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !345, file: !346, line: 39, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !350, line: 33, baseType: !351)
!350 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !350, line: 29, size: 32, elements: !352)
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !351, file: !350, line: 30, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !345, file: !346, line: 41, baseType: !356, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !346, line: 35, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !360}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !123)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !342, file: !308, line: 17, baseType: !362, size: 64, offset: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !346, line: 45, size: 64, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !362, file: !346, line: 46, baseType: !349, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !362, file: !346, line: 48, baseType: !135, size: 32, offset: 32)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "__devstate_dev_test", scope: !269, file: !308, line: 62, type: !322, isLocal: true, isDefinition: true, align: 8)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "dev_test_api", scope: !269, file: !308, line: 50, type: !370, isLocal: true, isDefinition: true)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "test_api", file: !164, line: 8, size: 64, elements: !372)
!372 = !{!373, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !371, file: !164, line: 9, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !338}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !371, file: !164, line: 10, baseType: !374, size: 32, offset: 32)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !269, file: !308, line: 13, type: !380, isLocal: true, isDefinition: true)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !203, line: 17, baseType: !176, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !382, file: !203, line: 18, baseType: !117, size: 8, offset: 32)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "__devicehdl_dev_test", scope: !388, file: !393, line: 22, type: !309, isLocal: false, isDefinition: true, align: 16)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !390, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency")
!390 = !{!391, !394, !396, !386}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_22", scope: !388, file: !393, line: 7, type: !309, isLocal: false, isDefinition: true, align: 16)
!393 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency")
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_29", scope: !388, file: !393, line: 12, type: !309, isLocal: false, isDefinition: true, align: 16)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_27", scope: !388, file: !393, line: 17, type: !309, isLocal: false, isDefinition: true, align: 16)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !400, file: !453, line: 18, type: !455, isLocal: false, isDefinition: true)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !271, retainedTypes: !402, globals: !450, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency")
!402 = !{!22, !108, !24, !403, !405, !407, !408, !123, !235, !410, !412, !413, !414, !415, !416, !418, !124, !117, !429, !135, !176}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !409, line: 214, baseType: !32)
!409 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!411 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !417)
!417 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 32)
!419 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !420)
!420 = !{!421, !428}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !419, file: !111, line: 80, baseType: !422, size: 32)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !423)
!423 = !{!424, !425, !426, !427}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !422, file: !111, line: 47, baseType: !117, size: 8)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !422, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !422, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !422, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !419, file: !111, line: 82, baseType: !108, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !431)
!431 = !{!432, !448, !449}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !430, file: !31, line: 89, baseType: !433, size: 96)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !434)
!434 = !{!435, !446, !447}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !433, file: !31, line: 67, baseType: !436, size: 32)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !436, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !436, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !436, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !436, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !436, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !436, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !436, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !433, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !433, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !430, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !430, file: !31, line: 94, baseType: !151, offset: 128)
!450 = !{!398, !451}
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !400, file: !453, line: 18, type: !454, isLocal: true, isDefinition: true)
!453 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !456, file: !203, line: 17, baseType: !176, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !456, file: !203, line: 18, baseType: !117, size: 8, offset: 32)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "_char_out", scope: !462, file: !467, line: 54, type: !468, isLocal: false, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !464, retainedTypes: !465, globals: !466, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency")
!464 = !{!37}
!465 = !{!108, !123}
!466 = !{!460}
!467 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DISubroutineType(types: !470)
!470 = !{!123, !123}
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !473, file: !1205, line: 202, type: !1206, isLocal: true, isDefinition: true, align: 32)
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !464, retainedTypes: !475, globals: !1204, splitDebugInlining: false, nameTableKind: None)
!474 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/subsys/pm/latency")
!475 = !{!108, !123, !476, !598, !935, !936, !1003}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !478, line: 335, baseType: !479)
!478 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !478, line: 320, size: 288, elements: !480)
!480 = !{!481, !492, !500, !514, !525, !536, !538, !549, !550, !561, !562, !577, !578, !588}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !479, file: !478, line: 321, baseType: !482, size: 16)
!482 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !478, line: 50, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !478, line: 43, size: 16, elements: !485)
!485 = !{!486, !491}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !484, file: !478, line: 48, baseType: !487, size: 16)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !484, file: !478, line: 44, size: 16, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !487, file: !478, line: 45, baseType: !416, size: 7, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !487, file: !478, line: 47, baseType: !416, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !484, file: !478, line: 49, baseType: !416, size: 16)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !479, file: !478, line: 322, baseType: !493, size: 16, offset: 16)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 16, elements: !498)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !495, line: 52, baseType: !496)
!495 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21e18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!498 = !{!499}
!499 = !DISubrange(count: 2)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !479, file: !478, line: 323, baseType: !501, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !478, line: 107, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !478, line: 94, size: 32, elements: !504)
!504 = !{!505, !513}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !503, file: !478, line: 105, baseType: !506, size: 32)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !503, file: !478, line: 95, size: 32, elements: !507)
!507 = !{!508, !509, !510, !511, !512}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !506, file: !478, line: 97, baseType: !135, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !506, file: !478, line: 99, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !506, file: !478, line: 100, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !506, file: !478, line: 102, baseType: !135, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !506, file: !478, line: 103, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !503, file: !478, line: 106, baseType: !135, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !479, file: !478, line: 324, baseType: !515, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !478, line: 155, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !478, line: 148, size: 32, elements: !518)
!518 = !{!519, !524}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !517, file: !478, line: 153, baseType: !520, size: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !517, file: !478, line: 149, size: 32, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !520, file: !478, line: 150, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !520, file: !478, line: 151, baseType: !135, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !517, file: !478, line: 154, baseType: !135, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !479, file: !478, line: 325, baseType: !526, size: 8, offset: 96)
!526 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !478, line: 194, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !478, line: 187, size: 8, elements: !529)
!529 = !{!530, !535}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !528, file: !478, line: 192, baseType: !531, size: 8)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !528, file: !478, line: 188, size: 8, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !531, file: !478, line: 189, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !531, file: !478, line: 190, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !528, file: !478, line: 193, baseType: !117, size: 8)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !479, file: !478, line: 326, baseType: !537, size: 24, offset: 104)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 24, elements: !310)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !479, file: !478, line: 327, baseType: !539, size: 8, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !478, line: 215, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !478, line: 208, size: 8, elements: !542)
!542 = !{!543, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !541, file: !478, line: 213, baseType: !544, size: 8)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !541, file: !478, line: 209, size: 8, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !544, file: !478, line: 210, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !544, file: !478, line: 211, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !541, file: !478, line: 214, baseType: !117, size: 8)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !479, file: !478, line: 328, baseType: !537, size: 24, offset: 136)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !479, file: !478, line: 329, baseType: !551, size: 8, offset: 160)
!551 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !478, line: 236, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !478, line: 229, size: 8, elements: !554)
!554 = !{!555, !560}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !553, file: !478, line: 234, baseType: !556, size: 8)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !553, file: !478, line: 230, size: 8, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !556, file: !478, line: 231, baseType: !496, size: 1, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !556, file: !478, line: 232, baseType: !496, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !553, file: !478, line: 235, baseType: !117, size: 8)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !479, file: !478, line: 330, baseType: !537, size: 24, offset: 168)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !479, file: !478, line: 331, baseType: !563, size: 16, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !478, line: 262, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !478, line: 250, size: 16, elements: !566)
!566 = !{!567, !576}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !565, file: !478, line: 260, baseType: !568, size: 16)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !565, file: !478, line: 251, size: 16, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !568, file: !478, line: 252, baseType: !416, size: 1, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !568, file: !478, line: 253, baseType: !416, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !568, file: !478, line: 254, baseType: !416, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !568, file: !478, line: 255, baseType: !416, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !568, file: !478, line: 256, baseType: !416, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !568, file: !478, line: 258, baseType: !416, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !565, file: !478, line: 261, baseType: !416, size: 16)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !479, file: !478, line: 332, baseType: !493, size: 16, offset: 208)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !479, file: !478, line: 333, baseType: !579, size: 32, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !478, line: 290, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !478, line: 284, size: 32, elements: !582)
!582 = !{!583, !587}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !581, file: !478, line: 288, baseType: !584, size: 32)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !581, file: !478, line: 285, size: 32, elements: !585)
!585 = !{!586}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !584, file: !478, line: 286, baseType: !135, size: 22, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !581, file: !478, line: 289, baseType: !135, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !479, file: !478, line: 334, baseType: !589, size: 16, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !478, line: 308, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !478, line: 303, size: 16, elements: !592)
!592 = !{!593, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !591, file: !478, line: 306, baseType: !594, size: 16)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !591, file: !478, line: 304, size: 16, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !594, file: !478, line: 305, baseType: !416, size: 16, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !591, file: !478, line: 307, baseType: !416, size: 16)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !600, line: 928, baseType: !601)
!600 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 899, size: 672, elements: !602)
!602 = !{!603, !627, !651, !677, !702, !718, !719, !737, !738, !755, !766, !767, !782, !802, !803, !815, !827, !837, !838, !855, !857, !868, !869, !881, !893, !894, !905, !921}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !601, file: !600, line: 900, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !600, line: 64, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 43, size: 32, elements: !607)
!607 = !{!608, !626}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !606, file: !600, line: 62, baseType: !609, size: 32)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !606, file: !600, line: 44, size: 32, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !609, file: !600, line: 45, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !609, file: !600, line: 46, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !609, file: !600, line: 47, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !609, file: !600, line: 48, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !609, file: !600, line: 49, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !609, file: !600, line: 50, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !609, file: !600, line: 51, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !609, file: !600, line: 52, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !609, file: !600, line: 53, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !609, file: !600, line: 54, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !609, file: !600, line: 55, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !609, file: !600, line: 56, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !609, file: !600, line: 58, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !609, file: !600, line: 59, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !609, file: !600, line: 60, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !606, file: !600, line: 63, baseType: !135, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !601, file: !600, line: 901, baseType: !628, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !600, line: 125, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 104, size: 32, elements: !631)
!631 = !{!632, !650}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !630, file: !600, line: 123, baseType: !633, size: 32)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !630, file: !600, line: 105, size: 32, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !633, file: !600, line: 106, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !633, file: !600, line: 107, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !633, file: !600, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !633, file: !600, line: 109, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !633, file: !600, line: 110, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !633, file: !600, line: 111, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !633, file: !600, line: 112, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !633, file: !600, line: 113, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !633, file: !600, line: 114, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !633, file: !600, line: 115, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !633, file: !600, line: 116, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !633, file: !600, line: 117, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !633, file: !600, line: 119, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !633, file: !600, line: 120, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !633, file: !600, line: 121, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !630, file: !600, line: 124, baseType: !135, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !601, file: !600, line: 902, baseType: !652, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !600, line: 186, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 165, size: 32, elements: !655)
!655 = !{!656, !676}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !654, file: !600, line: 184, baseType: !657, size: 32)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !654, file: !600, line: 166, size: 32, elements: !658)
!658 = !{!659, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !657, file: !600, line: 167, baseType: !660, size: 1, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !657, file: !600, line: 168, baseType: !660, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !657, file: !600, line: 169, baseType: !660, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !657, file: !600, line: 170, baseType: !660, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !657, file: !600, line: 171, baseType: !660, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !657, file: !600, line: 172, baseType: !660, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !657, file: !600, line: 173, baseType: !660, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !657, file: !600, line: 174, baseType: !660, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !657, file: !600, line: 175, baseType: !660, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !657, file: !600, line: 176, baseType: !660, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !657, file: !600, line: 177, baseType: !660, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !657, file: !600, line: 178, baseType: !660, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !657, file: !600, line: 180, baseType: !660, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !657, file: !600, line: 181, baseType: !660, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !657, file: !600, line: 182, baseType: !660, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !654, file: !600, line: 185, baseType: !135, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !601, file: !600, line: 903, baseType: !678, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !600, line: 247, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 226, size: 32, elements: !682)
!682 = !{!683, !701}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !681, file: !600, line: 245, baseType: !684, size: 32)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !681, file: !600, line: 227, size: 32, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !684, file: !600, line: 228, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !684, file: !600, line: 229, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !684, file: !600, line: 230, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !684, file: !600, line: 231, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !684, file: !600, line: 232, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !684, file: !600, line: 233, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !684, file: !600, line: 234, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !684, file: !600, line: 235, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !684, file: !600, line: 236, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !684, file: !600, line: 237, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !684, file: !600, line: 238, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !684, file: !600, line: 239, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !684, file: !600, line: 241, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !684, file: !600, line: 242, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !684, file: !600, line: 243, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !681, file: !600, line: 246, baseType: !135, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !601, file: !600, line: 904, baseType: !703, size: 16, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !600, line: 300, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 287, size: 16, elements: !706)
!706 = !{!707, !717}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !705, file: !600, line: 298, baseType: !708, size: 16)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !600, line: 288, size: 16, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !708, file: !600, line: 290, baseType: !416, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !708, file: !600, line: 291, baseType: !416, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !708, file: !600, line: 293, baseType: !416, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !708, file: !600, line: 294, baseType: !416, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !708, file: !600, line: 295, baseType: !416, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !708, file: !600, line: 296, baseType: !416, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !708, file: !600, line: 297, baseType: !416, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !705, file: !600, line: 299, baseType: !416, size: 16)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !601, file: !600, line: 905, baseType: !493, size: 16, offset: 144)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !601, file: !600, line: 906, baseType: !720, size: 16, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !600, line: 352, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 336, size: 16, elements: !723)
!723 = !{!724, !736}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !722, file: !600, line: 350, baseType: !725, size: 16)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !722, file: !600, line: 337, size: 16, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !725, file: !600, line: 339, baseType: !416, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !725, file: !600, line: 340, baseType: !416, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !725, file: !600, line: 341, baseType: !416, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !725, file: !600, line: 342, baseType: !416, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !725, file: !600, line: 343, baseType: !416, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !725, file: !600, line: 344, baseType: !416, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !725, file: !600, line: 345, baseType: !416, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !725, file: !600, line: 346, baseType: !416, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !725, file: !600, line: 348, baseType: !416, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !722, file: !600, line: 351, baseType: !416, size: 16)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !601, file: !600, line: 907, baseType: !493, size: 16, offset: 176)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !601, file: !600, line: 908, baseType: !739, size: 32, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !600, line: 398, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 381, size: 32, elements: !742)
!742 = !{!743, !754}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !741, file: !600, line: 396, baseType: !744, size: 32)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !741, file: !600, line: 382, size: 32, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !744, file: !600, line: 384, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !744, file: !600, line: 385, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !744, file: !600, line: 386, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !744, file: !600, line: 388, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !744, file: !600, line: 389, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !744, file: !600, line: 390, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !744, file: !600, line: 392, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !744, file: !600, line: 394, baseType: !135, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !741, file: !600, line: 397, baseType: !135, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !601, file: !600, line: 909, baseType: !756, size: 8, offset: 224)
!756 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !600, line: 433, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 426, size: 8, elements: !759)
!759 = !{!760, !765}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !758, file: !600, line: 431, baseType: !761, size: 8)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !758, file: !600, line: 427, size: 8, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !761, file: !600, line: 428, baseType: !117, size: 5, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !761, file: !600, line: 430, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !758, file: !600, line: 432, baseType: !117, size: 8)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !601, file: !600, line: 910, baseType: !537, size: 24, offset: 232)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !601, file: !600, line: 911, baseType: !768, size: 32, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !600, line: 462, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 448, size: 32, elements: !771)
!771 = !{!772, !781}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !770, file: !600, line: 460, baseType: !773, size: 32)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !770, file: !600, line: 449, size: 32, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !773, file: !600, line: 451, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !773, file: !600, line: 453, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !773, file: !600, line: 454, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !773, file: !600, line: 455, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !773, file: !600, line: 457, baseType: !135, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !773, file: !600, line: 459, baseType: !135, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !770, file: !600, line: 461, baseType: !135, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !601, file: !600, line: 912, baseType: !783, size: 16, offset: 288)
!783 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !600, line: 520, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 503, size: 16, elements: !786)
!786 = !{!787, !801}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !785, file: !600, line: 518, baseType: !788, size: 16)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !785, file: !600, line: 504, size: 16, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !788, file: !600, line: 506, baseType: !416, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !788, file: !600, line: 507, baseType: !416, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !788, file: !600, line: 508, baseType: !416, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !788, file: !600, line: 509, baseType: !416, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !788, file: !600, line: 510, baseType: !416, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !788, file: !600, line: 511, baseType: !416, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !788, file: !600, line: 512, baseType: !416, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !788, file: !600, line: 513, baseType: !416, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !788, file: !600, line: 514, baseType: !416, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !788, file: !600, line: 515, baseType: !416, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !788, file: !600, line: 516, baseType: !416, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !785, file: !600, line: 519, baseType: !416, size: 16)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !601, file: !600, line: 913, baseType: !493, size: 16, offset: 304)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !601, file: !600, line: 914, baseType: !804, size: 32, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !600, line: 559, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 552, size: 32, elements: !807)
!807 = !{!808, !814}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !806, file: !600, line: 557, baseType: !809, size: 32)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !806, file: !600, line: 553, size: 32, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !809, file: !600, line: 554, baseType: !135, size: 10, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !809, file: !600, line: 555, baseType: !135, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !809, file: !600, line: 556, baseType: !135, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !806, file: !600, line: 558, baseType: !135, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !601, file: !600, line: 915, baseType: !816, size: 32, offset: 352)
!816 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !600, line: 585, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 578, size: 32, elements: !819)
!819 = !{!820, !826}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !818, file: !600, line: 583, baseType: !821, size: 32)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !818, file: !600, line: 579, size: 32, elements: !822)
!822 = !{!823, !824, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !821, file: !600, line: 580, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !821, file: !600, line: 581, baseType: !135, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !821, file: !600, line: 582, baseType: !135, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !818, file: !600, line: 584, baseType: !135, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !601, file: !600, line: 916, baseType: !828, size: 8, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !600, line: 610, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 604, size: 8, elements: !831)
!831 = !{!832, !836}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !830, file: !600, line: 608, baseType: !833, size: 8)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !830, file: !600, line: 605, size: 8, elements: !834)
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !833, file: !600, line: 607, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !830, file: !600, line: 609, baseType: !117, size: 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !601, file: !600, line: 917, baseType: !537, size: 24, offset: 392)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !601, file: !600, line: 918, baseType: !839, size: 32, offset: 416)
!839 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !600, line: 639, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 622, size: 32, elements: !842)
!842 = !{!843, !854}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !841, file: !600, line: 637, baseType: !844, size: 32)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !841, file: !600, line: 623, size: 32, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !844, file: !600, line: 625, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !844, file: !600, line: 626, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !844, file: !600, line: 627, baseType: !135, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !844, file: !600, line: 629, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !844, file: !600, line: 631, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !844, file: !600, line: 632, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !844, file: !600, line: 634, baseType: !135, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !844, file: !600, line: 635, baseType: !135, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !841, file: !600, line: 638, baseType: !135, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !601, file: !600, line: 919, baseType: !856, size: 32, offset: 448)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 32, elements: !148)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !601, file: !600, line: 920, baseType: !858, size: 16, offset: 480)
!858 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !600, line: 715, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 706, size: 16, elements: !861)
!861 = !{!862, !867}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !860, file: !600, line: 713, baseType: !863, size: 16)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !600, line: 707, size: 16, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !863, file: !600, line: 709, baseType: !416, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !863, file: !600, line: 711, baseType: !416, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !860, file: !600, line: 714, baseType: !416, size: 16)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !601, file: !600, line: 921, baseType: !493, size: 16, offset: 496)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !601, file: !600, line: 922, baseType: !870, size: 32, offset: 512)
!870 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !600, line: 739, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 729, size: 32, elements: !873)
!873 = !{!874, !880}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !872, file: !600, line: 737, baseType: !875, size: 32)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !872, file: !600, line: 730, size: 32, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !875, file: !600, line: 732, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !875, file: !600, line: 733, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !875, file: !600, line: 735, baseType: !135, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !872, file: !600, line: 738, baseType: !135, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !601, file: !600, line: 923, baseType: !882, size: 8, offset: 544)
!882 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !600, line: 765, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 756, size: 8, elements: !885)
!885 = !{!886, !892}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !884, file: !600, line: 763, baseType: !887, size: 8)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !884, file: !600, line: 757, size: 8, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !887, file: !600, line: 759, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !887, file: !600, line: 761, baseType: !117, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !887, file: !600, line: 762, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !884, file: !600, line: 764, baseType: !117, size: 8)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !601, file: !600, line: 924, baseType: !537, size: 24, offset: 552)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !601, file: !600, line: 925, baseType: !895, size: 32, offset: 576)
!895 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !600, line: 789, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !600, line: 781, size: 32, elements: !898)
!898 = !{!899, !904}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !897, file: !600, line: 787, baseType: !900, size: 32)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !897, file: !600, line: 782, size: 32, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !900, file: !600, line: 783, baseType: !135, size: 12, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !900, file: !600, line: 785, baseType: !135, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !897, file: !600, line: 788, baseType: !135, size: 32)
