; ModuleID = 'build/actinius_icarus_bee/sensor_batch_processing/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.rtio_executor_api = type { i32 (%struct.rtio*)*, void (%struct.rtio*, %struct.rtio_sqe*, i32)*, void (%struct.rtio*, %struct.rtio_sqe*, i32)* }
%struct.rtio = type { %struct.rtio_executor*, i32, %struct.rtio_sq*, %struct.rtio_cq* }
%struct.rtio_executor = type { %struct.rtio_executor_api* }
%struct.rtio_sq = type { %struct.rtio_spsc, [0 x %struct.rtio_sqe] }
%struct.rtio_spsc = type { i32, i32, i32, i32, i32 }
%struct.rtio_sqe = type { i8, i8, i16, %struct.rtio_iodev*, i8*, %union.anon.3 }
%struct.rtio_iodev = type { %struct.rtio_iodev_api*, %struct.rtio_iodev_sq*, i8* }
%struct.rtio_iodev_api = type { void (%struct.rtio_sqe*, %struct.rtio*)* }
%struct.rtio_iodev_sq = type { %struct.rtio_spsc, [0 x %struct.rtio_iodev_sqe] }
%struct.rtio_iodev_sqe = type { %struct.rtio_sqe*, %struct.rtio* }
%union.anon.3 = type { %struct.anon.4 }
%struct.anon.4 = type { i32, i8* }
%struct.rtio_cq = type { %struct.rtio_spsc, [0 x %struct.anon.4] }
%struct.rtio_simple_executor = type { %struct.rtio_executor }
%struct.rtio_spsc__sq_ez_io = type { %struct.rtio_spsc, [8 x %struct.rtio_sqe] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !119, line: 12, type: !252, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !103, globals: !116, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/rtio/sensor_batch_processing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_RTIO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_RTIO_IODEV", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_LAST", value: 68)
!103 = !{!104, !105, !108, !109, !113, !114}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !110, line: 46, baseType: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !112)
!112 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !115)
!115 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!116 = !{!25, !117, !227, !229, !235, !237, !245}
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "simple_exec", scope: !27, file: !119, line: 24, type: !120, isLocal: false, isDefinition: true)
!119 = !DIFile(filename: "zephyr/samples/subsys/rtio/sensor_batch_processing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_simple_executor", file: !121, line: 57, size: 32, elements: !122)
!121 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_executor_simple.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !120, file: !121, line: 58, baseType: !124, size: 32)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !126)
!125 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !124, file: !125, line: 211, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !131)
!131 = !{!132, !222, !226}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !130, file: !125, line: 177, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!108, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !138)
!138 = !{!139, !141, !145, !210}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !137, file: !125, line: 228, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !137, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !143, line: 22, baseType: !144)
!143 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!144 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !137, file: !125, line: 254, baseType: !146, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !148)
!148 = !{!149, !159}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !147, file: !125, line: 143, baseType: !150, size: 160)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_spsc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = !{!153, !154, !155, !156, !157}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !150, file: !151, line: 60, baseType: !24, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !150, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !150, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !150, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !150, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !147, file: !125, line: 144, baseType: !160, offset: 160)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, elements: !197)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !162)
!162 = !{!163, !166, !167, !170, !200, !201}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !161, file: !125, line: 110, baseType: !164, size: 8)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !165)
!165 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !161, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !161, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !169)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !161, file: !125, line: 116, baseType: !171, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !174)
!174 = !{!175, !186, !199}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !173, file: !125, line: 308, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !178, file: !125, line: 271, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !184, !136}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !173, file: !125, line: 311, baseType: !187, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !188, file: !125, line: 299, baseType: !150, size: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !188, file: !125, line: 300, baseType: !192, offset: 160)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, elements: !197)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !193, file: !125, line: 289, baseType: !184, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !193, file: !125, line: 290, baseType: !136, size: 32, offset: 32)
!197 = !{!198}
!198 = !DISubrange(count: -1)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !161, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !125, line: 127, baseType: !202, size: 64, offset: 96)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !125, line: 127, size: 64, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !125, line: 128, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !202, file: !125, line: 128, size: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !205, file: !125, line: 129, baseType: !113, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !205, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !137, file: !125, line: 257, baseType: !211, size: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !212, file: !125, line: 162, baseType: !150, size: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !212, file: !125, line: 163, baseType: !216, offset: 160)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, elements: !197)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !218)
!218 = !{!219, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !217, file: !125, line: 151, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !108)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !217, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !130, file: !125, line: 182, baseType: !223, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !136, !184, !108}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !130, file: !125, line: 187, baseType: !223, size: 32, offset: 64)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "ez_io", scope: !27, file: !119, line: 25, type: !137, isLocal: false, isDefinition: true, align: 32)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "bufs", scope: !27, file: !119, line: 27, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 1024, elements: !232)
!232 = !{!233, !234}
!233 = !DISubrange(count: 8)
!234 = !DISubrange(count: 16)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "z_rtio_simple_api", scope: !27, file: !121, line: 64, type: !129, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "_sq_ez_io", scope: !27, file: !119, line: 25, type: !239, isLocal: true, isDefinition: true)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc__sq_ez_io", file: !119, line: 25, size: 1440, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !239, file: !119, line: 25, baseType: !150, size: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !239, file: !119, line: 25, baseType: !243, size: 1280, offset: 160)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1280, elements: !244)
!244 = !{!233}
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "_cq_ez_io", scope: !27, file: !119, line: 25, type: !247, isLocal: true, isDefinition: true)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc__cq_ez_io", file: !119, line: 25, size: 672, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !247, file: !119, line: 25, baseType: !150, size: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !247, file: !119, line: 25, baseType: !251, size: 512, offset: 160)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 512, elements: !244)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !255)
!254 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !254, line: 17, baseType: !105, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !253, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "log_const_vnd_sensor", scope: !260, file: !265, line: 14, type: !489, isLocal: false, isDefinition: true)
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !262, globals: !450, splitDebugInlining: false, nameTableKind: None)
!261 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/rtio/sensor_batch_processing/src/vnd_sensor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!262 = !{!104, !108, !263, !109, !443, !113, !114}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnd_sensor_data", file: !265, line: 21, size: 960, elements: !266)
!265 = !DIFile(filename: "zephyr/samples/subsys/rtio/sensor_batch_processing/src/vnd_sensor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = !{!267, !357, !407, !430, !449}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !264, file: !265, line: 22, baseType: !268, size: 96)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !269)
!269 = !{!270, !345, !356}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !268, file: !125, line: 308, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !274)
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !273, file: !125, line: 271, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279, !298}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !282)
!282 = !{!283, !284, !285, !286, !289, !290}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !281, file: !125, line: 110, baseType: !164, size: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !281, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !281, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !281, file: !125, line: 116, baseType: !287, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !281, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !125, line: 127, baseType: !291, size: 64, offset: 96)
!291 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !125, line: 127, size: 64, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, scope: !291, file: !125, line: 128, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !125, line: 128, size: 64, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !294, file: !125, line: 129, baseType: !113, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !294, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !300)
!300 = !{!301, !319, !320, !334}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !299, file: !125, line: 228, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !304)
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !303, file: !125, line: 211, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !309)
!309 = !{!310, !314, !318}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !308, file: !125, line: 177, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!108, !298}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !308, file: !125, line: 182, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !298, !279, !108}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !308, file: !125, line: 187, baseType: !315, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !299, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !299, file: !125, line: 254, baseType: !321, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !323)
!323 = !{!324, !332}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !322, file: !125, line: 143, baseType: !325, size: 160)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !326)
!326 = !{!327, !328, !329, !330, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !325, file: !151, line: 60, baseType: !24, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !325, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !325, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !325, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !325, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !322, file: !125, line: 144, baseType: !333, offset: 160)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, elements: !197)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !299, file: !125, line: 257, baseType: !335, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !336, file: !125, line: 162, baseType: !325, size: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !336, file: !125, line: 163, baseType: !340, offset: 160)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, elements: !197)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !341, file: !125, line: 151, baseType: !220, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !341, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !268, file: !125, line: 311, baseType: !346, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !347, file: !125, line: 299, baseType: !325, size: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !347, file: !125, line: 300, baseType: !351, offset: 160)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, elements: !197)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !352, file: !125, line: 289, baseType: !279, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !352, file: !125, line: 290, baseType: !298, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !264, file: !265, line: 23, baseType: !358, size: 448, offset: 128)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !359, line: 1318, size: 448, elements: !360)
!359 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !{!361, !388, !394, !399, !400, !405, !406}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !358, file: !359, line: 1324, baseType: !362, size: 192)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !363, line: 244, size: 192, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !381, !387}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !362, file: !363, line: 245, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !367, line: 49, baseType: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !367, line: 37, size: 64, elements: !369)
!369 = !{!370, !376}
!370 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !367, line: 38, baseType: !371, size: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 38, size: 32, elements: !372)
!372 = !{!373, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !371, file: !367, line: 39, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !367, line: 40, baseType: !374, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !367, line: 42, baseType: !377, size: 32, offset: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 42, size: 32, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !377, file: !367, line: 43, baseType: !374, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !377, file: !367, line: 44, baseType: !374, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !362, file: !363, line: 246, baseType: !382, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !363, line: 242, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !362, file: !363, line: 249, baseType: !111, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !358, file: !359, line: 1327, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !363, line: 233, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 231, size: 64, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !390, file: !363, line: 232, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !367, line: 48, baseType: !368)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !358, file: !359, line: 1330, baseType: !395, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !358, file: !359, line: 1333, baseType: !395, size: 32, offset: 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !358, file: !359, line: 1336, baseType: !401, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !110, line: 67, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 65, size: 64, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !402, file: !110, line: 66, baseType: !109, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !358, file: !359, line: 1339, baseType: !113, size: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !358, file: !359, line: 1342, baseType: !104, size: 32, offset: 416)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !264, file: !265, line: 24, baseType: !408, size: 32, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !411, line: 378, size: 192, elements: !412)
!411 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = !{!413, !414, !415, !416, !423, !424}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !411, line: 380, baseType: !105, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !410, file: !411, line: 382, baseType: !13, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !410, file: !411, line: 384, baseType: !13, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !410, file: !411, line: 386, baseType: !417, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !411, line: 351, size: 16, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !418, file: !411, line: 359, baseType: !164, size: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !418, file: !411, line: 364, baseType: !422, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!422 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !411, line: 388, baseType: !104, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !410, file: !411, line: 396, baseType: !425, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !411, line: 43, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !429)
!429 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !264, file: !265, line: 25, baseType: !431, size: 320, offset: 608)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !359, line: 4204, size: 320, elements: !432)
!432 = !{!433, !434, !438, !441, !442, !444, !445, !446, !447, !448}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !431, file: !359, line: 4206, baseType: !389, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !431, file: !359, line: 4208, baseType: !435, offset: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!436 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!437 = !{}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !431, file: !359, line: 4210, baseType: !439, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !440, line: 214, baseType: !32)
!440 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !431, file: !359, line: 4212, baseType: !113, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !431, file: !359, line: 4214, baseType: !443, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !431, file: !359, line: 4216, baseType: !443, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !431, file: !359, line: 4218, baseType: !443, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !431, file: !359, line: 4220, baseType: !443, size: 32, offset: 224)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !431, file: !359, line: 4222, baseType: !113, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !359, line: 4227, baseType: !164, size: 8, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_number", scope: !264, file: !265, line: 26, baseType: !113, size: 32, offset: 928)
!450 = !{!258, !451, !458, !463, !465, !476, !478, !485, !487}
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "vnd_sensor_iodev_sq_0", scope: !260, file: !265, line: 152, type: !453, isLocal: false, isDefinition: true)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc_vnd_sensor_iodev_sq_0", file: !265, line: 152, size: 672, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !453, file: !265, line: 152, baseType: !325, size: 160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !453, file: !265, line: 152, baseType: !457, size: 512, offset: 160)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 512, elements: !244)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !260, file: !265, line: 152, type: !460, isLocal: false, isDefinition: true, align: 16)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 64, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 4)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !260, file: !265, line: 152, type: !409, isLocal: false, isDefinition: true, align: 32)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !260, file: !265, line: 152, type: !467, isLocal: true, isDefinition: true, align: 32)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !469, line: 51, size: 64, elements: !470)
!469 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!470 = !{!471, !475}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !468, file: !469, line: 60, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DISubroutineType(types: !474)
!474 = !{!108, !408}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !468, file: !469, line: 65, baseType: !408, size: 32, offset: 32)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !260, file: !265, line: 152, type: !418, isLocal: true, isDefinition: true, align: 8)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "vnd_sensor_config_0", scope: !260, file: !265, line: 152, type: !480, isLocal: true, isDefinition: true)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnd_sensor_config", file: !265, line: 16, size: 64, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sample_period", scope: !481, file: !265, line: 17, baseType: !113, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sample_size", scope: !481, file: !265, line: 18, baseType: !439, size: 32, offset: 32)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "vnd_sensor_data_0", scope: !260, file: !265, line: 152, type: !264, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "vnd_sensor_iodev_api", scope: !260, file: !265, line: 127, type: !272, isLocal: true, isDefinition: true)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !254, line: 17, baseType: !105, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !490, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !496, file: !501, line: 22, type: !502, isLocal: false, isDefinition: true, align: 16)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !498, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!498 = !{!499, !505, !507, !494}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_57", scope: !496, file: !501, line: 7, type: !502, isLocal: false, isDefinition: true, align: 16)
!501 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 48, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 3)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_6", scope: !496, file: !501, line: 12, type: !502, isLocal: false, isDefinition: true, align: 16)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_85", scope: !496, file: !501, line: 17, type: !502, isLocal: false, isDefinition: true, align: 16)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !511, file: !524, line: 18, type: !525, isLocal: false, isDefinition: true)
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !513, globals: !523, splitDebugInlining: false, nameTableKind: None)
!512 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!513 = !{!22, !104, !24, !514, !516, !518, !439, !108, !519, !520, !521, !522, !443, !209, !168, !105}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!523 = !{!509}
!524 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !526, file: !254, line: 17, baseType: !105, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !526, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "_char_out", scope: !532, file: !536, line: 54, type: !537, isLocal: false, isDefinition: true)
!532 = distinct !DICompileUnit(language: DW_LANG_C99, file: !533, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !534, globals: !535, splitDebugInlining: false, nameTableKind: None)
!533 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!534 = !{!104, !108}
!535 = !{!530}
!536 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DISubroutineType(types: !539)
!539 = !{!108, !108}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !542, file: !595, line: 35, type: !611, isLocal: false, isDefinition: true)
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !544, globals: !592, splitDebugInlining: false, nameTableKind: None)
!543 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!544 = !{!104, !108, !545, !113, !556}
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !547, file: !546, line: 167, baseType: !555)
!546 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !546, file: !546, line: 134, type: !548, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !542, retainedNodes: !550)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !113}
!550 = !{!551, !552, !554}
!551 = !DILocalVariable(name: "time_us", arg: 1, scope: !547, file: !546, line: 134, type: !113)
!552 = !DILocalVariable(name: "delay_cycles", scope: !547, file: !546, line: 168, type: !553)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!554 = !DILocalVariable(name: "cycles", scope: !547, file: !546, line: 171, type: !113)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !558, line: 1928, baseType: !559)
!558 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !558, line: 1909, size: 11360, elements: !560)
!560 = !{!561, !567, !568, !569, !570, !574, !575, !576, !577, !579, !580, !582, !583, !584, !585, !586, !590, !591}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !559, file: !558, line: 1910, baseType: !562, size: 8192)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 8192, elements: !565)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!565 = !{!566}
!566 = !DISubrange(count: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !559, file: !558, line: 1911, baseType: !563, size: 32, offset: 8192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !559, file: !558, line: 1912, baseType: !563, size: 32, offset: 8224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !559, file: !558, line: 1913, baseType: !563, size: 32, offset: 8256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !559, file: !558, line: 1914, baseType: !571, size: 1984, offset: 8288)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 1984, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 62)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !559, file: !558, line: 1915, baseType: !564, size: 32, offset: 10272)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !559, file: !558, line: 1916, baseType: !563, size: 32, offset: 10304)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !559, file: !558, line: 1917, baseType: !564, size: 32, offset: 10336)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !559, file: !558, line: 1918, baseType: !578, size: 96, offset: 10368)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 96, elements: !503)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !559, file: !558, line: 1919, baseType: !564, size: 32, offset: 10464)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !559, file: !558, line: 1920, baseType: !581, size: 256, offset: 10496)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 256, elements: !244)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !559, file: !558, line: 1921, baseType: !564, size: 32, offset: 10752)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !559, file: !558, line: 1922, baseType: !563, size: 32, offset: 10784)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !559, file: !558, line: 1923, baseType: !564, size: 32, offset: 10816)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !559, file: !558, line: 1924, baseType: !564, size: 32, offset: 10848)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !559, file: !558, line: 1925, baseType: !587, size: 416, offset: 10880)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 416, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 13)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !559, file: !558, line: 1926, baseType: !564, size: 32, offset: 11296)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !559, file: !558, line: 1927, baseType: !564, size: 32, offset: 11328)
!592 = !{!540, !593, !607}
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !542, file: !595, line: 65, type: !596, isLocal: true, isDefinition: true, align: 32)
!595 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !469, line: 51, size: 64, elements: !598)
!598 = !{!599, !606}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !597, file: !469, line: 60, baseType: !600, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = !DISubroutineType(types: !602)
!602 = !{!108, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !469, line: 48, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !597, file: !469, line: 65, baseType: !603, size: 32, offset: 32)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !547, file: !546, line: 161, type: !609, isLocal: true, isDefinition: true, align: 128)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 48, elements: !503)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !612, file: !254, line: 17, baseType: !105, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !612, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !618, file: !652, line: 22, type: !680, isLocal: false, isDefinition: true)
!618 = distinct !DICompileUnit(language: DW_LANG_C99, file: !619, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !620, retainedTypes: !632, globals: !649, splitDebugInlining: false, nameTableKind: None)
!619 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!620 = !{!621, !30}
!621 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !622, line: 27, baseType: !32, size: 32, elements: !623)
!622 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631}
!624 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!625 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!626 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!627 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!628 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!629 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!630 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!631 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!632 = !{!104, !109, !108, !24, !633, !443, !113, !114}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !635, line: 54, size: 96, elements: !636)
!635 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!636 = !{!637, !644, !648}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !634, file: !635, line: 55, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !639, line: 33, baseType: !640)
!639 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !639, line: 29, size: 32, elements: !641)
!641 = !{!642}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !639, line: 30, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !634, file: !635, line: 60, baseType: !645, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !621}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !634, file: !635, line: 65, baseType: !645, size: 32, offset: 64)
!649 = !{!616, !650, !656, !659, !661, !670, !672}
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !618, file: !652, line: 27, type: !653, isLocal: true, isDefinition: true)
!652 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 32, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 1)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !618, file: !652, line: 44, type: !658, isLocal: true, isDefinition: true)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !618, file: !652, line: 49, type: !658, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !618, file: !652, line: 36, type: !663, isLocal: true, isDefinition: true)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 128, elements: !654)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !622, line: 114, size: 128, elements: !665)
!665 = !{!666, !667, !668, !669}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !664, file: !622, line: 115, baseType: !621, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !664, file: !622, line: 141, baseType: !164, size: 8, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !664, file: !622, line: 149, baseType: !113, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !664, file: !622, line: 156, baseType: !113, size: 32, offset: 96)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !618, file: !652, line: 40, type: !663, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !618, file: !652, line: 28, type: !674, isLocal: true, isDefinition: true)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !639, line: 40, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !639, line: 35, size: 64, elements: !676)
!676 = !{!677, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !675, file: !639, line: 36, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !675, file: !639, line: 37, baseType: !678, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !681, file: !254, line: 17, baseType: !105, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !681, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!685 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!686 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !689, file: !715, line: 50, type: !220, isLocal: true, isDefinition: true)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !620, retainedTypes: !691, globals: !712, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!691 = !{!428, !109, !439, !108, !104, !113, !114, !692, !443, !220, !703}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !694, line: 45, size: 64, elements: !695)
!694 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!695 = !{!696, !702}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !693, file: !694, line: 46, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !639, line: 33, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !639, line: 29, size: 32, elements: !699)
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !698, file: !639, line: 30, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !693, file: !694, line: 48, baseType: !113, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !694, line: 38, size: 64, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !704, file: !694, line: 39, baseType: !697, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !704, file: !694, line: 41, baseType: !708, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !694, line: 35, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !220}
!712 = !{!713, !717, !725, !687, !727, !737}
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "latency_lock", scope: !689, file: !715, line: 44, type: !716, isLocal: true, isDefinition: true)
!715 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !689, file: !715, line: 46, type: !719, isLocal: true, isDefinition: true)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !639, line: 40, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !639, line: 35, size: 64, elements: !721)
!721 = !{!722, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !720, file: !639, line: 36, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !720, file: !639, line: 37, baseType: !723, size: 32, offset: 32)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "latency_subs", scope: !689, file: !715, line: 52, type: !719, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !689, file: !715, line: 39, type: !729, isLocal: true, isDefinition: true)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, elements: !735)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !715, line: 35, size: 96, elements: !731)
!731 = !{!732, !733, !734}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !730, file: !715, line: 36, baseType: !621, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !730, file: !715, line: 37, baseType: !164, size: 8, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !730, file: !715, line: 38, baseType: !142, size: 32, offset: 64)
!735 = !{!736}
!736 = !DISubrange(count: 0)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !689, file: !715, line: 48, type: !220, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !741, file: !748, line: 47, type: !762, isLocal: true, isDefinition: true)
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !743, retainedTypes: !744, globals: !745, splitDebugInlining: false, nameTableKind: None)
!742 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!743 = !{!621}
!744 = !{!439, !108}
!745 = !{!746, !739, !758}
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "cpus_states", scope: !741, file: !748, line: 50, type: !749, isLocal: true, isDefinition: true)
!748 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 32, elements: !654)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !622, line: 114, size: 128, elements: !753)
!753 = !{!754, !755, !756, !757}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !752, file: !622, line: 115, baseType: !621, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !752, file: !622, line: 141, baseType: !164, size: 8, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !752, file: !622, line: 149, baseType: !113, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !752, file: !622, line: 156, baseType: !113, size: 32, offset: 96)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !741, file: !748, line: 55, type: !760, isLocal: true, isDefinition: true)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 8, elements: !654)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, elements: !735)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !765, file: !772, line: 17, type: !905, isLocal: false, isDefinition: true)
!765 = distinct !DICompileUnit(language: DW_LANG_C99, file: !766, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !767, globals: !768, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!767 = !{!439, !108, !113, !104}
!768 = !{!763, !769, !901}
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !771, file: !772, line: 198, type: !888, isLocal: true, isDefinition: true)
!771 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !772, file: !772, line: 175, type: !773, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !765, retainedNodes: !885)
!772 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!773 = !DISubroutineType(types: !774)
!774 = !{null, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !777, line: 245, size: 1024, elements: !778)
!777 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!778 = !{!779, !842, !855, !856, !857, !858, !864, !880}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !776, file: !777, line: 247, baseType: !780, size: 384)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !777, line: 57, size: 384, elements: !781)
!781 = !{!782, !809, !816, !817, !818, !829, !830, !831}
!782 = !DIDerivedType(tag: DW_TAG_member, scope: !780, file: !777, line: 60, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !780, file: !777, line: 60, size: 64, elements: !784)
!784 = !{!785, !800}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !783, file: !777, line: 61, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !367, line: 49, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !367, line: 37, size: 64, elements: !788)
!788 = !{!789, !795}
!789 = !DIDerivedType(tag: DW_TAG_member, scope: !787, file: !367, line: 38, baseType: !790, size: 32)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !787, file: !367, line: 38, size: 32, elements: !791)
!791 = !{!792, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !790, file: !367, line: 39, baseType: !793, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !790, file: !367, line: 40, baseType: !793, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, scope: !787, file: !367, line: 42, baseType: !796, size: 32, offset: 32)
!796 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !787, file: !367, line: 42, size: 32, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !796, file: !367, line: 43, baseType: !793, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !796, file: !367, line: 44, baseType: !793, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !783, file: !777, line: 62, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !802, line: 49, size: 64, elements: !803)
!802 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!803 = !{!804}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !801, file: !802, line: 50, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 64, elements: !807)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!807 = !{!808}
!808 = !DISubrange(count: 2)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !780, file: !777, line: 68, baseType: !810, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !363, line: 233, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 231, size: 64, elements: !813)
!813 = !{!814}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !812, file: !363, line: 232, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !367, line: 48, baseType: !787)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !780, file: !777, line: 71, baseType: !164, size: 8, offset: 96)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !780, file: !777, line: 74, baseType: !164, size: 8, offset: 104)
!818 = !DIDerivedType(tag: DW_TAG_member, scope: !780, file: !777, line: 90, baseType: !819, size: 16, offset: 112)
!819 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !780, file: !777, line: 90, size: 16, elements: !820)
!820 = !{!821, !828}
!821 = !DIDerivedType(tag: DW_TAG_member, scope: !819, file: !777, line: 91, baseType: !822, size: 16)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !819, file: !777, line: 91, size: 16, elements: !823)
!823 = !{!824, !827}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !822, file: !777, line: 96, baseType: !825, size: 8)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !826)
!826 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !822, file: !777, line: 97, baseType: !164, size: 8, offset: 8)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !819, file: !777, line: 100, baseType: !168, size: 16)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !780, file: !777, line: 107, baseType: !113, size: 32, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !780, file: !777, line: 127, baseType: !104, size: 32, offset: 160)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !780, file: !777, line: 131, baseType: !832, size: 192, offset: 192)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !363, line: 244, size: 192, elements: !833)
!833 = !{!834, !835, !841}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !832, file: !363, line: 245, baseType: !786, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !832, file: !363, line: 246, baseType: !836, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !363, line: 242, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !840}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !832, file: !363, line: 249, baseType: !111, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !776, file: !777, line: 250, baseType: !843, size: 288, offset: 384)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !844, line: 25, size: 288, elements: !845)
!844 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !843, file: !844, line: 26, baseType: !113, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !843, file: !844, line: 27, baseType: !113, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !843, file: !844, line: 28, baseType: !113, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !843, file: !844, line: 29, baseType: !113, size: 32, offset: 96)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !843, file: !844, line: 30, baseType: !113, size: 32, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !843, file: !844, line: 31, baseType: !113, size: 32, offset: 160)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !843, file: !844, line: 32, baseType: !113, size: 32, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !843, file: !844, line: 33, baseType: !113, size: 32, offset: 224)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !843, file: !844, line: 34, baseType: !113, size: 32, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !776, file: !777, line: 253, baseType: !104, size: 32, offset: 672)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !776, file: !777, line: 256, baseType: !811, size: 64, offset: 704)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !776, file: !777, line: 294, baseType: !108, size: 32, offset: 768)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !776, file: !777, line: 300, baseType: !859, size: 96, offset: 800)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !777, line: 149, size: 96, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !859, file: !777, line: 153, baseType: !22, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !859, file: !777, line: 162, baseType: !439, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !859, file: !777, line: 168, baseType: !439, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !776, file: !777, line: 325, baseType: !865, size: 32, offset: 896)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !359, line: 5073, size: 160, elements: !867)
!867 = !{!868, !877, !878}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !866, file: !359, line: 5074, baseType: !869, size: 96)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !870, line: 56, size: 96, elements: !871)
!870 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!871 = !{!872, !875, !876}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !869, file: !870, line: 57, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !870, line: 57, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !869, file: !870, line: 58, baseType: !104, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !869, file: !870, line: 59, baseType: !439, size: 32, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !866, file: !359, line: 5075, baseType: !811, size: 64, offset: 96)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !866, file: !359, line: 5076, baseType: !879, offset: 160)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !776, file: !777, line: 343, baseType: !881, size: 64, offset: 928)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !844, line: 60, size: 64, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !881, file: !844, line: 63, baseType: !113, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !881, file: !844, line: 66, baseType: !113, size: 32, offset: 32)
!885 = !{!886, !887}
!886 = !DILocalVariable(name: "thread", arg: 1, scope: !771, file: !772, line: 175, type: !775)
!887 = !DILocalVariable(name: "region_num", scope: !771, file: !772, line: 200, type: !164)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, elements: !735)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !890, line: 52, size: 96, elements: !891)
!890 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !889, file: !890, line: 53, baseType: !22, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !889, file: !890, line: 54, baseType: !439, size: 32, offset: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !889, file: !890, line: 55, baseType: !895, size: 32, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !896, line: 304, baseType: !897)
!896 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !896, line: 301, size: 32, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !897, file: !896, line: 302, baseType: !168, size: 16)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !897, file: !896, line: 303, baseType: !168, size: 16, offset: 16)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "static_regions", scope: !765, file: !772, line: 62, type: !903, isLocal: true, isDefinition: true)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 96, elements: !654)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !889)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !906, file: !254, line: 17, baseType: !105, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !906, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !912, file: !966, line: 39, type: !164, isLocal: true, isDefinition: true)
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !914, globals: !957, splitDebugInlining: false, nameTableKind: None)
!913 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!914 = !{!915, !104, !108, !943}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !917, line: 1495, baseType: !918)
!917 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !917, line: 1474, size: 448, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !933}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !918, file: !917, line: 1476, baseType: !563, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !918, file: !917, line: 1477, baseType: !564, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !918, file: !917, line: 1478, baseType: !564, size: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !918, file: !917, line: 1479, baseType: !564, size: 32, offset: 96)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !918, file: !917, line: 1480, baseType: !564, size: 32, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !918, file: !917, line: 1481, baseType: !564, size: 32, offset: 160)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !918, file: !917, line: 1482, baseType: !564, size: 32, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !918, file: !917, line: 1483, baseType: !564, size: 32, offset: 224)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !918, file: !917, line: 1484, baseType: !564, size: 32, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !918, file: !917, line: 1485, baseType: !564, size: 32, offset: 288)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !918, file: !917, line: 1486, baseType: !564, size: 32, offset: 320)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !918, file: !917, line: 1487, baseType: !932, size: 32, offset: 352)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 32, elements: !654)
!933 = !DIDerivedType(tag: DW_TAG_member, scope: !918, file: !917, line: 1488, baseType: !934, size: 64, offset: 384)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !918, file: !917, line: 1488, size: 64, elements: !935)
!935 = !{!936, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !934, file: !917, line: 1489, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 64, elements: !807)
!938 = !DIDerivedType(tag: DW_TAG_member, scope: !934, file: !917, line: 1490, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !934, file: !917, line: 1490, size: 64, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !939, file: !917, line: 1491, baseType: !564, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !939, file: !917, line: 1492, baseType: !564, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !946, line: 27, size: 128, elements: !947)
!946 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!947 = !{!948, !949, !950}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !945, file: !946, line: 29, baseType: !113, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !945, file: !946, line: 31, baseType: !105, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !945, file: !946, line: 37, baseType: !951, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !896, line: 298, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !896, line: 289, size: 64, elements: !953)
!953 = !{!954, !955, !956}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !952, file: !896, line: 291, baseType: !164, size: 5, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !952, file: !896, line: 293, baseType: !164, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !952, file: !896, line: 295, baseType: !113, size: 32, offset: 32)
!957 = !{!910, !958}
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !912, file: !960, line: 31, type: !961, isLocal: true, isDefinition: true)
!960 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 160, elements: !654)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !960, line: 21, size: 160, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !962, file: !960, line: 22, baseType: !108, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !962, file: !960, line: 23, baseType: !945, size: 128, offset: 32)
!966 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !969, file: !976, line: 21, type: !537, isLocal: true, isDefinition: true)
!969 = distinct !DICompileUnit(language: DW_LANG_C99, file: !970, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !971, globals: !975, splitDebugInlining: false, nameTableKind: None)
!970 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!971 = !{!972, !108, !104}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !974, line: 22, baseType: !108)
!974 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!975 = !{!967}
!976 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !979, file: !984, line: 13, type: !1003, isLocal: true, isDefinition: true)
!979 = distinct !DICompileUnit(language: DW_LANG_C99, file: !980, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !981, splitDebugInlining: false, nameTableKind: None)
!980 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!981 = !{!982, !977}
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "mpu_config", scope: !979, file: !984, line: 37, type: !985, isLocal: false, isDefinition: true)
!984 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !946, line: 41, size: 64, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !986, file: !946, line: 43, baseType: !113, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !986, file: !946, line: 45, baseType: !990, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !946, line: 27, size: 128, elements: !993)
!993 = !{!994, !995, !996}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !992, file: !946, line: 29, baseType: !113, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !992, file: !946, line: 31, baseType: !105, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !992, file: !946, line: 37, baseType: !997, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !896, line: 298, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !896, line: 289, size: 64, elements: !999)
!999 = !{!1000, !1001, !1002}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !998, file: !896, line: 291, baseType: !164, size: 5, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !998, file: !896, line: 293, baseType: !164, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !998, file: !896, line: 295, baseType: !113, size: 32, offset: 32)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 256, elements: !807)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "log_const_rtio_executor_simple", scope: !1006, file: !1009, line: 12, type: !1010, isLocal: false, isDefinition: true)
!1006 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1007, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !534, globals: !1008, splitDebugInlining: false, nameTableKind: None)
!1007 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/rtio/rtio_executor_simple.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/sensor_batch_processing")
!1008 = !{!1004}
!1009 = !DIFile(filename: "zephyr/subsys/rtio/rtio_executor_simple.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1011, file: !254, line: 17, baseType: !105, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1011, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
