; ModuleID = 'build/arduino_due/subsys/logging/logger/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.log_source_dynamic_data = type { i32 }
%struct.sample_instance = type { %struct.log_source_dynamic_data*, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/logging/logger/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/logging/logger")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/logging/logger")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_handler", scope: !27, file: !114, line: 9, type: !115, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !110, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/logger/src/ext_log_system.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/logging/logger")
!29 = !{!30, !40}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ext_log_level", file: !31, line: 14, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/ext_log_system.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39}
!34 = !DIEnumerator(name: "EXT_LOG_CRITICAL", value: 0)
!35 = !DIEnumerator(name: "EXT_LOG_ERROR", value: 1)
!36 = !DIEnumerator(name: "EXT_LOG_WARNING", value: 2)
!37 = !DIEnumerator(name: "EXT_LOG_NOTICE", value: 3)
!38 = !DIEnumerator(name: "EXT_LOG_INFO", value: 4)
!39 = !DIEnumerator(name: "EXT_LOG_DEBUG", value: 5)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !41, line: 27, baseType: !32, size: 32, elements: !42)
!41 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!43 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!44 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!45 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!46 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!47 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!48 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!49 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!50 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!51 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!52 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!53 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!54 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!55 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!56 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!57 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!58 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!59 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!109 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!112 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!113 = !{!25}
!114 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/ext_log_system.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ext_log_handler", file: !31, line: 24, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !30, !119, null}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "log_const_ext_log_system", scope: !124, file: !130, line: 13, type: !144, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, globals: !127, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/logger/src/ext_log_system_adapter.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/logging/logger")
!126 = !{!30}
!127 = !{!122, !128, !136}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "log_dynamic_ext_log_system", scope: !124, file: !130, line: 13, type: !131, isLocal: false, isDefinition: true)
!130 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/ext_log_system_adapter.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_dynamic_data", file: !132, line: 29, size: 32, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !131, file: !132, line: 30, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "log_level_lut", scope: !124, file: !130, line: 16, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 48, elements: !142)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !141)
!141 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!142 = !{!143}
!143 = !DISubrange(count: 6)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !132, line: 16, size: 64, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !132, line: 17, baseType: !119, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !145, file: !132, line: 18, baseType: !140, size: 8, offset: 32)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "log_const_main", scope: !151, file: !221, line: 18, type: !222, isLocal: false, isDefinition: true)
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !153, retainedTypes: !165, globals: !218, splitDebugInlining: false, nameTableKind: None)
!152 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/logger/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/logging/logger")
!153 = !{!40, !154, !160}
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !155, line: 121, baseType: !32, size: 32, elements: !156)
!155 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!156 = !{!157, !158, !159}
!157 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!158 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!159 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !161, line: 33, baseType: !32, size: 32, elements: !162)
!161 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!162 = !{!163, !164}
!163 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!164 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!165 = !{!111, !112, !166, !135, !170, !172, !184, !140, !185, !213, !217}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !167, line: 46, baseType: !168)
!167 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !169)
!169 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !171)
!171 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !174, line: 78, size: 32, elements: !175)
!174 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!175 = !{!176, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !173, file: !174, line: 80, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !174, line: 45, size: 32, elements: !178)
!178 = !{!179, !180, !181, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !177, file: !174, line: 47, baseType: !140, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !177, file: !174, line: 50, baseType: !140, size: 8, offset: 8)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !177, file: !174, line: 53, baseType: !140, size: 8, offset: 16)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !177, file: !174, line: 56, baseType: !140, size: 8, offset: 24)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !173, file: !174, line: 82, baseType: !111, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !155, line: 88, size: 128, elements: !187)
!187 = !{!188, !205, !209}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !186, file: !155, line: 89, baseType: !189, size: 96)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !155, line: 66, size: 96, elements: !190)
!190 = !{!191, !202, !203}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !189, file: !155, line: 67, baseType: !192, size: 32)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !155, line: 51, size: 32, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !192, file: !155, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !192, file: !155, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !155, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !192, file: !155, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !192, file: !155, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !192, file: !155, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !192, file: !155, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !192, file: !155, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !189, file: !155, line: 75, baseType: !13, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !189, file: !155, line: 76, baseType: !204, size: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !155, line: 35, baseType: !135)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !186, file: !155, line: 93, baseType: !206, size: 32, offset: 96)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 32, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 4)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !155, line: 94, baseType: !210, offset: 128)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: -1)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_dynamic_data", file: !132, line: 29, size: 32, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !214, file: !132, line: 30, baseType: !135, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!218 = !{!149, !219, !227, !234, !236, !238, !388, !392, !394, !396, !398, !403, !405, !548, !550, !553, !682}
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "log_const_sample_instance_inst1", scope: !151, file: !221, line: 38, type: !222, isLocal: false, isDefinition: true)
!221 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !132, line: 16, size: 64, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !223, file: !132, line: 17, baseType: !119, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !223, file: !132, line: 18, baseType: !140, size: 8, offset: 32)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "inst1", scope: !151, file: !221, line: 38, type: !229, isLocal: false, isDefinition: true)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sample_instance", file: !230, line: 15, size: 64, elements: !231)
!230 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/sample_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !229, file: !230, line: 16, baseType: !213, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !229, file: !230, line: 17, baseType: !135, size: 32, offset: 32)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "log_const_sample_instance_inst2", scope: !151, file: !221, line: 41, type: !222, isLocal: false, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "inst2", scope: !151, file: !221, line: 41, type: !229, isLocal: false, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "_k_thread_data_log_demo_thread_id", scope: !151, file: !221, line: 328, type: !240, isLocal: false, isDefinition: true, align: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !241, line: 620, size: 384, elements: !242)
!241 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!242 = !{!243, !362, !370, !371, !376, !377, !378, !379, !380, !381, !383, !387}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !240, file: !241, line: 621, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !246, line: 245, size: 1024, elements: !247)
!246 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!247 = !{!248, !315, !328, !329, !330, !331, !339, !357}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !245, file: !246, line: 247, baseType: !249, size: 384)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !246, line: 57, size: 384, elements: !250)
!250 = !{!251, !279, !287, !288, !289, !302, !303, !304}
!251 = !DIDerivedType(tag: DW_TAG_member, scope: !249, file: !246, line: 60, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !249, file: !246, line: 60, size: 64, elements: !253)
!253 = !{!254, !270}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !252, file: !246, line: 61, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !256, line: 49, baseType: !257)
!256 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !256, line: 37, size: 64, elements: !258)
!258 = !{!259, !265}
!259 = !DIDerivedType(tag: DW_TAG_member, scope: !257, file: !256, line: 38, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !257, file: !256, line: 38, size: 32, elements: !261)
!261 = !{!262, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !260, file: !256, line: 39, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !256, line: 40, baseType: !263, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, scope: !257, file: !256, line: 42, baseType: !266, size: 32, offset: 32)
!266 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !257, file: !256, line: 42, size: 32, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !266, file: !256, line: 43, baseType: !263, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !266, file: !256, line: 44, baseType: !263, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !252, file: !246, line: 62, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !272, line: 49, size: 64, elements: !273)
!272 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !271, file: !272, line: 50, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 64, elements: !277)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!277 = !{!278}
!278 = !DISubrange(count: 2)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !249, file: !246, line: 68, baseType: !280, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !282, line: 233, baseType: !283)
!282 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !282, line: 231, size: 64, elements: !284)
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !283, file: !282, line: 232, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !256, line: 48, baseType: !257)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !249, file: !246, line: 71, baseType: !140, size: 8, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !249, file: !246, line: 74, baseType: !140, size: 8, offset: 104)
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !249, file: !246, line: 90, baseType: !290, size: 16, offset: 112)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !249, file: !246, line: 90, size: 16, elements: !291)
!291 = !{!292, !299}
!292 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !246, line: 91, baseType: !293, size: 16)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !290, file: !246, line: 91, size: 16, elements: !294)
!294 = !{!295, !298}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !293, file: !246, line: 96, baseType: !296, size: 8)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !297)
!297 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !293, file: !246, line: 97, baseType: !140, size: 8, offset: 8)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !290, file: !246, line: 100, baseType: !300, size: 16)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !301)
!301 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !249, file: !246, line: 107, baseType: !135, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !249, file: !246, line: 127, baseType: !111, size: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !249, file: !246, line: 131, baseType: !305, size: 192, offset: 192)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !282, line: 244, size: 192, elements: !306)
!306 = !{!307, !308, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !305, file: !282, line: 245, baseType: !255, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !305, file: !282, line: 246, baseType: !309, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !282, line: 242, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !305, file: !282, line: 249, baseType: !168, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !245, file: !246, line: 250, baseType: !316, size: 288, offset: 384)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !317, line: 25, size: 288, elements: !318)
!317 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !316, file: !317, line: 26, baseType: !135, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !316, file: !317, line: 27, baseType: !135, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !316, file: !317, line: 28, baseType: !135, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !316, file: !317, line: 29, baseType: !135, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !316, file: !317, line: 30, baseType: !135, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !316, file: !317, line: 31, baseType: !135, size: 32, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !316, file: !317, line: 32, baseType: !135, size: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !316, file: !317, line: 33, baseType: !135, size: 32, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !316, file: !317, line: 34, baseType: !135, size: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !245, file: !246, line: 253, baseType: !111, size: 32, offset: 672)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !245, file: !246, line: 256, baseType: !281, size: 64, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !245, file: !246, line: 294, baseType: !112, size: 32, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !245, file: !246, line: 300, baseType: !332, size: 96, offset: 800)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !246, line: 149, size: 96, elements: !333)
!333 = !{!334, !335, !338}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !332, file: !246, line: 153, baseType: !22, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !332, file: !246, line: 162, baseType: !336, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !337, line: 214, baseType: !32)
!337 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!338 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !332, file: !246, line: 168, baseType: !336, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !245, file: !246, line: 325, baseType: !340, size: 32, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !241, line: 5073, size: 160, elements: !342)
!342 = !{!343, !352, !353}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !341, file: !241, line: 5074, baseType: !344, size: 96)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !345, line: 56, size: 96, elements: !346)
!345 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = !{!347, !350, !351}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !344, file: !345, line: 57, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !345, line: 57, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !344, file: !345, line: 58, baseType: !111, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !344, file: !345, line: 59, baseType: !336, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !341, file: !241, line: 5075, baseType: !281, size: 64, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !341, file: !241, line: 5076, baseType: !354, offset: 160)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !355, line: 43, elements: !356)
!355 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !{}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !245, file: !246, line: 343, baseType: !358, size: 64, offset: 928)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !317, line: 60, size: 64, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !358, file: !317, line: 63, baseType: !135, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !358, file: !317, line: 66, baseType: !135, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !240, file: !241, line: 622, baseType: !363, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !365, line: 44, baseType: !366)
!365 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !367, line: 47, size: 8, elements: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !366, file: !367, line: 48, baseType: !121, size: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !240, file: !241, line: 623, baseType: !32, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !240, file: !241, line: 624, baseType: !372, size: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !365, line: 46, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !111, !111, !111}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !240, file: !241, line: 625, baseType: !111, size: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !240, file: !241, line: 626, baseType: !111, size: 32, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !240, file: !241, line: 627, baseType: !111, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !240, file: !241, line: 628, baseType: !112, size: 32, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !240, file: !241, line: 629, baseType: !135, size: 32, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !240, file: !241, line: 630, baseType: !382, size: 32, offset: 288)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !112)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !240, file: !241, line: 631, baseType: !384, size: 32, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DISubroutineType(types: !386)
!386 = !{null}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !240, file: !241, line: 632, baseType: !119, size: 32, offset: 352)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "log_demo_thread_id", scope: !151, file: !221, line: 328, type: !390, isLocal: false, isDefinition: true)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !246, line: 347, baseType: !244)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "log_dynamic_main", scope: !151, file: !221, line: 18, type: !214, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "log_dynamic_sample_instance_inst1", scope: !151, file: !221, line: 38, type: !214, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "log_dynamic_sample_instance_inst2", scope: !151, file: !221, line: 41, type: !214, isLocal: false, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "_k_thread_stack_log_demo_thread_id", scope: !151, file: !221, line: 328, type: !400, isLocal: false, isDefinition: true, align: 512)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 8704, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 1088)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "_k_thread_obj_log_demo_thread_id", scope: !151, file: !221, line: 328, type: !245, isLocal: false, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !407, file: !408, line: 22, type: !547, isLocal: true, isDefinition: true)
!407 = distinct !DISubprogram(name: "inline_func", scope: !408, file: !408, line: 20, type: !385, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !151, retainedNodes: !409)
!408 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/sample_module.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !{!410, !413, !414, !415, !416, !419, !421, !425, !426, !430, !431, !432, !433, !435, !436, !437, !438, !439, !440, !441, !442, !443, !447, !451, !455, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !472, !475, !476, !477, !480, !482, !484, !487, !488, !489, !493, !494, !499, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !532, !534, !535, !536, !539, !541, !543, !546}
!410 = !DILocalVariable(name: "is_user_context", scope: !411, file: !408, line: 24, type: !412)
!411 = distinct !DILexicalBlock(scope: !407, file: !408, line: 24, column: 2)
!412 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!413 = !DILocalVariable(name: "filters", scope: !411, file: !408, line: 24, type: !135)
!414 = !DILocalVariable(name: "_mode", scope: !411, file: !408, line: 24, type: !112)
!415 = !DILocalVariable(name: "_src", scope: !411, file: !408, line: 24, type: !111)
!416 = !DILocalVariable(name: "has_rw_str", scope: !417, file: !408, line: 24, type: !412)
!417 = distinct !DILexicalBlock(scope: !418, file: !408, line: 24, column: 2)
!418 = distinct !DILexicalBlock(scope: !411, file: !408, line: 24, column: 2)
!419 = !DILocalVariable(name: "_rv", scope: !420, file: !408, line: 24, type: !112)
!420 = distinct !DILexicalBlock(scope: !417, file: !408, line: 24, column: 2)
!421 = !DILocalVariable(name: "_plen", scope: !422, file: !408, line: 24, type: !112)
!422 = distinct !DILexicalBlock(scope: !423, file: !408, line: 24, column: 2)
!423 = distinct !DILexicalBlock(scope: !424, file: !408, line: 24, column: 2)
!424 = distinct !DILexicalBlock(scope: !417, file: !408, line: 24, column: 2)
!425 = !DILocalVariable(name: "flags", scope: !422, file: !408, line: 24, type: !135)
!426 = !DILocalVariable(name: "_flags", scope: !427, file: !408, line: 24, type: !135)
!427 = distinct !DILexicalBlock(scope: !428, file: !408, line: 24, column: 2)
!428 = distinct !DILexicalBlock(scope: !429, file: !408, line: 24, column: 2)
!429 = distinct !DILexicalBlock(scope: !422, file: !408, line: 24, column: 2)
!430 = !DILocalVariable(name: "_ros_pos_en", scope: !427, file: !408, line: 24, type: !412)
!431 = !DILocalVariable(name: "_rws_pos_en", scope: !427, file: !408, line: 24, type: !412)
!432 = !DILocalVariable(name: "_cros_en", scope: !427, file: !408, line: 24, type: !412)
!433 = !DILocalVariable(name: "_pbuf", scope: !427, file: !408, line: 24, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!435 = !DILocalVariable(name: "_rws_pos_idx", scope: !427, file: !408, line: 24, type: !140)
!436 = !DILocalVariable(name: "_ros_pos_idx", scope: !427, file: !408, line: 24, type: !140)
!437 = !DILocalVariable(name: "_alls_cnt", scope: !427, file: !408, line: 24, type: !140)
!438 = !DILocalVariable(name: "_fros_cnt", scope: !427, file: !408, line: 24, type: !140)
!439 = !DILocalVariable(name: "_rws_cnt", scope: !427, file: !408, line: 24, type: !140)
!440 = !DILocalVariable(name: "_ros_cnt", scope: !427, file: !408, line: 24, type: !140)
!441 = !DILocalVariable(name: "_ros_pos_buf", scope: !427, file: !408, line: 24, type: !434)
!442 = !DILocalVariable(name: "_ros_pos_buf_buf4", scope: !427, file: !408, line: 24, type: !206)
!443 = !DILocalVariable(name: "_ros_pos_buf_buf8", scope: !427, file: !408, line: 24, type: !444)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 8)
!447 = !DILocalVariable(name: "_ros_pos_buf_buf12", scope: !427, file: !408, line: 24, type: !448)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 96, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 12)
!451 = !DILocalVariable(name: "_ros_pos_buf_buf16", scope: !427, file: !408, line: 24, type: !452)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 128, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 16)
!455 = !DILocalVariable(name: "_ros_pos_buf_buf32", scope: !427, file: !408, line: 24, type: !456)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 256, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 32)
!459 = !DILocalVariable(name: "_rws_buffer", scope: !427, file: !408, line: 24, type: !434)
!460 = !DILocalVariable(name: "_rws_buffer_buf4", scope: !427, file: !408, line: 24, type: !206)
!461 = !DILocalVariable(name: "_rws_buffer_buf8", scope: !427, file: !408, line: 24, type: !444)
!462 = !DILocalVariable(name: "_rws_buffer_buf12", scope: !427, file: !408, line: 24, type: !448)
!463 = !DILocalVariable(name: "_rws_buffer_buf16", scope: !427, file: !408, line: 24, type: !452)
!464 = !DILocalVariable(name: "_rws_buffer_buf32", scope: !427, file: !408, line: 24, type: !456)
!465 = !DILocalVariable(name: "_pmax", scope: !427, file: !408, line: 24, type: !336)
!466 = !DILocalVariable(name: "_pkg_len", scope: !427, file: !408, line: 24, type: !112)
!467 = !DILocalVariable(name: "_total_len", scope: !427, file: !408, line: 24, type: !112)
!468 = !DILocalVariable(name: "_pkg_offset", scope: !427, file: !408, line: 24, type: !112)
!469 = !DILocalVariable(name: "_len_loc", scope: !427, file: !408, line: 24, type: !172)
!470 = !DILocalVariable(name: "_arg_size", scope: !471, file: !408, line: 24, type: !135)
!471 = distinct !DILexicalBlock(scope: !427, file: !408, line: 24, column: 2)
!472 = !DILocalVariable(name: "__v", scope: !473, file: !408, line: 24, type: !474)
!473 = distinct !DILexicalBlock(scope: !471, file: !408, line: 24, column: 2)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!475 = !DILocalVariable(name: "__arg_size", scope: !473, file: !408, line: 24, type: !336)
!476 = !DILocalVariable(name: "_loc", scope: !471, file: !408, line: 24, type: !135)
!477 = !DILocalVariable(name: "_pbuf_loc", scope: !478, file: !408, line: 24, type: !434)
!478 = distinct !DILexicalBlock(scope: !479, file: !408, line: 24, column: 2)
!479 = distinct !DILexicalBlock(scope: !427, file: !408, line: 24, column: 2)
!480 = !DILocalVariable(name: "i", scope: !481, file: !408, line: 24, type: !336)
!481 = distinct !DILexicalBlock(scope: !478, file: !408, line: 24, column: 2)
!482 = !DILocalVariable(name: "i", scope: !483, file: !408, line: 24, type: !336)
!483 = distinct !DILexicalBlock(scope: !478, file: !408, line: 24, column: 2)
!484 = !DILocalVariable(name: "hdr", scope: !485, file: !408, line: 24, type: !173)
!485 = distinct !DILexicalBlock(scope: !486, file: !408, line: 24, column: 2)
!486 = distinct !DILexicalBlock(scope: !427, file: !408, line: 24, column: 2)
!487 = !DILocalVariable(name: "_msg", scope: !422, file: !408, line: 24, type: !185)
!488 = !DILocalVariable(name: "__vla_expr0", scope: !422, type: !32, flags: DIFlagArtificial)
!489 = !DILocalVariable(name: "_ll_buf", scope: !422, file: !408, line: 24, type: !490)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: !488)
!493 = !DILocalVariable(name: "__vla_expr1", scope: !422, type: !32, flags: DIFlagArtificial)
!494 = !DILocalVariable(name: "_ld_buf", scope: !422, file: !408, line: 24, type: !495)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, elements: !497)
!496 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!497 = !{!498}
!498 = !DISubrange(count: !493)
!499 = !DILocalVariable(name: "_flags", scope: !500, file: !408, line: 24, type: !135)
!500 = distinct !DILexicalBlock(scope: !501, file: !408, line: 24, column: 2)
!501 = distinct !DILexicalBlock(scope: !502, file: !408, line: 24, column: 2)
!502 = distinct !DILexicalBlock(scope: !422, file: !408, line: 24, column: 2)
!503 = !DILocalVariable(name: "_ros_pos_en", scope: !500, file: !408, line: 24, type: !412)
!504 = !DILocalVariable(name: "_rws_pos_en", scope: !500, file: !408, line: 24, type: !412)
!505 = !DILocalVariable(name: "_cros_en", scope: !500, file: !408, line: 24, type: !412)
!506 = !DILocalVariable(name: "_pbuf", scope: !500, file: !408, line: 24, type: !434)
!507 = !DILocalVariable(name: "_rws_pos_idx", scope: !500, file: !408, line: 24, type: !140)
!508 = !DILocalVariable(name: "_ros_pos_idx", scope: !500, file: !408, line: 24, type: !140)
!509 = !DILocalVariable(name: "_alls_cnt", scope: !500, file: !408, line: 24, type: !140)
!510 = !DILocalVariable(name: "_fros_cnt", scope: !500, file: !408, line: 24, type: !140)
!511 = !DILocalVariable(name: "_rws_cnt", scope: !500, file: !408, line: 24, type: !140)
!512 = !DILocalVariable(name: "_ros_cnt", scope: !500, file: !408, line: 24, type: !140)
!513 = !DILocalVariable(name: "_ros_pos_buf", scope: !500, file: !408, line: 24, type: !434)
!514 = !DILocalVariable(name: "_ros_pos_buf_buf4", scope: !500, file: !408, line: 24, type: !206)
!515 = !DILocalVariable(name: "_ros_pos_buf_buf8", scope: !500, file: !408, line: 24, type: !444)
!516 = !DILocalVariable(name: "_ros_pos_buf_buf12", scope: !500, file: !408, line: 24, type: !448)
!517 = !DILocalVariable(name: "_ros_pos_buf_buf16", scope: !500, file: !408, line: 24, type: !452)
!518 = !DILocalVariable(name: "_ros_pos_buf_buf32", scope: !500, file: !408, line: 24, type: !456)
!519 = !DILocalVariable(name: "_rws_buffer", scope: !500, file: !408, line: 24, type: !434)
!520 = !DILocalVariable(name: "_rws_buffer_buf4", scope: !500, file: !408, line: 24, type: !206)
!521 = !DILocalVariable(name: "_rws_buffer_buf8", scope: !500, file: !408, line: 24, type: !444)
!522 = !DILocalVariable(name: "_rws_buffer_buf12", scope: !500, file: !408, line: 24, type: !448)
!523 = !DILocalVariable(name: "_rws_buffer_buf16", scope: !500, file: !408, line: 24, type: !452)
!524 = !DILocalVariable(name: "_rws_buffer_buf32", scope: !500, file: !408, line: 24, type: !456)
!525 = !DILocalVariable(name: "_pmax", scope: !500, file: !408, line: 24, type: !336)
!526 = !DILocalVariable(name: "_pkg_len", scope: !500, file: !408, line: 24, type: !112)
!527 = !DILocalVariable(name: "_total_len", scope: !500, file: !408, line: 24, type: !112)
!528 = !DILocalVariable(name: "_pkg_offset", scope: !500, file: !408, line: 24, type: !112)
!529 = !DILocalVariable(name: "_len_loc", scope: !500, file: !408, line: 24, type: !172)
!530 = !DILocalVariable(name: "_arg_size", scope: !531, file: !408, line: 24, type: !135)
!531 = distinct !DILexicalBlock(scope: !500, file: !408, line: 24, column: 2)
!532 = !DILocalVariable(name: "__v", scope: !533, file: !408, line: 24, type: !474)
!533 = distinct !DILexicalBlock(scope: !531, file: !408, line: 24, column: 2)
!534 = !DILocalVariable(name: "__arg_size", scope: !533, file: !408, line: 24, type: !336)
!535 = !DILocalVariable(name: "_loc", scope: !531, file: !408, line: 24, type: !135)
!536 = !DILocalVariable(name: "_pbuf_loc", scope: !537, file: !408, line: 24, type: !434)
!537 = distinct !DILexicalBlock(scope: !538, file: !408, line: 24, column: 2)
!538 = distinct !DILexicalBlock(scope: !500, file: !408, line: 24, column: 2)
!539 = !DILocalVariable(name: "i", scope: !540, file: !408, line: 24, type: !336)
!540 = distinct !DILexicalBlock(scope: !537, file: !408, line: 24, column: 2)
!541 = !DILocalVariable(name: "i", scope: !542, file: !408, line: 24, type: !336)
!542 = distinct !DILexicalBlock(scope: !537, file: !408, line: 24, column: 2)
!543 = !DILocalVariable(name: "hdr", scope: !544, file: !408, line: 24, type: !173)
!544 = distinct !DILexicalBlock(scope: !545, file: !408, line: 24, column: 2)
!545 = distinct !DILexicalBlock(scope: !500, file: !408, line: 24, column: 2)
!546 = !DILocalVariable(name: "_desc", scope: !422, file: !408, line: 24, type: !192)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "__log_current_dynamic_data", scope: !407, file: !408, line: 22, type: !213, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "__log_level", scope: !407, file: !408, line: 22, type: !552, isLocal: true, isDefinition: true)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "__log_level", scope: !555, file: !230, line: 30, type: !552, isLocal: true, isDefinition: true)
!555 = distinct !DISubprogram(name: "sample_instance_inline_call", scope: !230, file: !230, line: 28, type: !556, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !151, retainedNodes: !559)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!559 = !{!560, !561, !563, !564, !565, !566, !569, !571, !575, !576, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !609, !611, !612, !613, !616, !618, !620, !623, !624, !625, !629, !630, !634, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !667, !669, !670, !671, !674, !676, !678, !681}
!560 = !DILocalVariable(name: "inst", arg: 1, scope: !555, file: !230, line: 28, type: !558)
!561 = !DILocalVariable(name: "is_user_context", scope: !562, file: !230, line: 32, type: !412)
!562 = distinct !DILexicalBlock(scope: !555, file: !230, line: 32, column: 2)
!563 = !DILocalVariable(name: "filters", scope: !562, file: !230, line: 32, type: !135)
!564 = !DILocalVariable(name: "_mode", scope: !562, file: !230, line: 32, type: !112)
!565 = !DILocalVariable(name: "_src", scope: !562, file: !230, line: 32, type: !111)
!566 = !DILocalVariable(name: "has_rw_str", scope: !567, file: !230, line: 32, type: !412)
!567 = distinct !DILexicalBlock(scope: !568, file: !230, line: 32, column: 2)
!568 = distinct !DILexicalBlock(scope: !562, file: !230, line: 32, column: 2)
!569 = !DILocalVariable(name: "_rv", scope: !570, file: !230, line: 32, type: !112)
!570 = distinct !DILexicalBlock(scope: !567, file: !230, line: 32, column: 2)
!571 = !DILocalVariable(name: "_plen", scope: !572, file: !230, line: 32, type: !112)
!572 = distinct !DILexicalBlock(scope: !573, file: !230, line: 32, column: 2)
!573 = distinct !DILexicalBlock(scope: !574, file: !230, line: 32, column: 2)
!574 = distinct !DILexicalBlock(scope: !567, file: !230, line: 32, column: 2)
!575 = !DILocalVariable(name: "flags", scope: !572, file: !230, line: 32, type: !135)
!576 = !DILocalVariable(name: "_flags", scope: !577, file: !230, line: 32, type: !135)
!577 = distinct !DILexicalBlock(scope: !578, file: !230, line: 32, column: 2)
!578 = distinct !DILexicalBlock(scope: !579, file: !230, line: 32, column: 2)
!579 = distinct !DILexicalBlock(scope: !572, file: !230, line: 32, column: 2)
!580 = !DILocalVariable(name: "_ros_pos_en", scope: !577, file: !230, line: 32, type: !412)
!581 = !DILocalVariable(name: "_rws_pos_en", scope: !577, file: !230, line: 32, type: !412)
!582 = !DILocalVariable(name: "_cros_en", scope: !577, file: !230, line: 32, type: !412)
!583 = !DILocalVariable(name: "_pbuf", scope: !577, file: !230, line: 32, type: !434)
!584 = !DILocalVariable(name: "_rws_pos_idx", scope: !577, file: !230, line: 32, type: !140)
!585 = !DILocalVariable(name: "_ros_pos_idx", scope: !577, file: !230, line: 32, type: !140)
!586 = !DILocalVariable(name: "_alls_cnt", scope: !577, file: !230, line: 32, type: !140)
!587 = !DILocalVariable(name: "_fros_cnt", scope: !577, file: !230, line: 32, type: !140)
!588 = !DILocalVariable(name: "_rws_cnt", scope: !577, file: !230, line: 32, type: !140)
!589 = !DILocalVariable(name: "_ros_cnt", scope: !577, file: !230, line: 32, type: !140)
!590 = !DILocalVariable(name: "_ros_pos_buf", scope: !577, file: !230, line: 32, type: !434)
!591 = !DILocalVariable(name: "_ros_pos_buf_buf4", scope: !577, file: !230, line: 32, type: !206)
!592 = !DILocalVariable(name: "_ros_pos_buf_buf8", scope: !577, file: !230, line: 32, type: !444)
!593 = !DILocalVariable(name: "_ros_pos_buf_buf12", scope: !577, file: !230, line: 32, type: !448)
!594 = !DILocalVariable(name: "_ros_pos_buf_buf16", scope: !577, file: !230, line: 32, type: !452)
!595 = !DILocalVariable(name: "_ros_pos_buf_buf32", scope: !577, file: !230, line: 32, type: !456)
!596 = !DILocalVariable(name: "_rws_buffer", scope: !577, file: !230, line: 32, type: !434)
!597 = !DILocalVariable(name: "_rws_buffer_buf4", scope: !577, file: !230, line: 32, type: !206)
!598 = !DILocalVariable(name: "_rws_buffer_buf8", scope: !577, file: !230, line: 32, type: !444)
!599 = !DILocalVariable(name: "_rws_buffer_buf12", scope: !577, file: !230, line: 32, type: !448)
!600 = !DILocalVariable(name: "_rws_buffer_buf16", scope: !577, file: !230, line: 32, type: !452)
!601 = !DILocalVariable(name: "_rws_buffer_buf32", scope: !577, file: !230, line: 32, type: !456)
!602 = !DILocalVariable(name: "_pmax", scope: !577, file: !230, line: 32, type: !336)
!603 = !DILocalVariable(name: "_pkg_len", scope: !577, file: !230, line: 32, type: !112)
!604 = !DILocalVariable(name: "_total_len", scope: !577, file: !230, line: 32, type: !112)
!605 = !DILocalVariable(name: "_pkg_offset", scope: !577, file: !230, line: 32, type: !112)
!606 = !DILocalVariable(name: "_len_loc", scope: !577, file: !230, line: 32, type: !172)
!607 = !DILocalVariable(name: "_arg_size", scope: !608, file: !230, line: 32, type: !135)
!608 = distinct !DILexicalBlock(scope: !577, file: !230, line: 32, column: 2)
!609 = !DILocalVariable(name: "__v", scope: !610, file: !230, line: 32, type: !474)
!610 = distinct !DILexicalBlock(scope: !608, file: !230, line: 32, column: 2)
!611 = !DILocalVariable(name: "__arg_size", scope: !610, file: !230, line: 32, type: !336)
!612 = !DILocalVariable(name: "_loc", scope: !608, file: !230, line: 32, type: !135)
!613 = !DILocalVariable(name: "_pbuf_loc", scope: !614, file: !230, line: 32, type: !434)
!614 = distinct !DILexicalBlock(scope: !615, file: !230, line: 32, column: 2)
!615 = distinct !DILexicalBlock(scope: !577, file: !230, line: 32, column: 2)
!616 = !DILocalVariable(name: "i", scope: !617, file: !230, line: 32, type: !336)
!617 = distinct !DILexicalBlock(scope: !614, file: !230, line: 32, column: 2)
!618 = !DILocalVariable(name: "i", scope: !619, file: !230, line: 32, type: !336)
!619 = distinct !DILexicalBlock(scope: !614, file: !230, line: 32, column: 2)
!620 = !DILocalVariable(name: "hdr", scope: !621, file: !230, line: 32, type: !173)
!621 = distinct !DILexicalBlock(scope: !622, file: !230, line: 32, column: 2)
!622 = distinct !DILexicalBlock(scope: !577, file: !230, line: 32, column: 2)
!623 = !DILocalVariable(name: "_msg", scope: !572, file: !230, line: 32, type: !185)
!624 = !DILocalVariable(name: "__vla_expr0", scope: !572, type: !32, flags: DIFlagArtificial)
!625 = !DILocalVariable(name: "_ll_buf", scope: !572, file: !230, line: 32, type: !626)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: !624)
!629 = !DILocalVariable(name: "__vla_expr1", scope: !572, type: !32, flags: DIFlagArtificial)
!630 = !DILocalVariable(name: "_ld_buf", scope: !572, file: !230, line: 32, type: !631)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: !629)
!634 = !DILocalVariable(name: "_flags", scope: !635, file: !230, line: 32, type: !135)
!635 = distinct !DILexicalBlock(scope: !636, file: !230, line: 32, column: 2)
!636 = distinct !DILexicalBlock(scope: !637, file: !230, line: 32, column: 2)
!637 = distinct !DILexicalBlock(scope: !572, file: !230, line: 32, column: 2)
!638 = !DILocalVariable(name: "_ros_pos_en", scope: !635, file: !230, line: 32, type: !412)
!639 = !DILocalVariable(name: "_rws_pos_en", scope: !635, file: !230, line: 32, type: !412)
!640 = !DILocalVariable(name: "_cros_en", scope: !635, file: !230, line: 32, type: !412)
!641 = !DILocalVariable(name: "_pbuf", scope: !635, file: !230, line: 32, type: !434)
!642 = !DILocalVariable(name: "_rws_pos_idx", scope: !635, file: !230, line: 32, type: !140)
!643 = !DILocalVariable(name: "_ros_pos_idx", scope: !635, file: !230, line: 32, type: !140)
!644 = !DILocalVariable(name: "_alls_cnt", scope: !635, file: !230, line: 32, type: !140)
!645 = !DILocalVariable(name: "_fros_cnt", scope: !635, file: !230, line: 32, type: !140)
!646 = !DILocalVariable(name: "_rws_cnt", scope: !635, file: !230, line: 32, type: !140)
!647 = !DILocalVariable(name: "_ros_cnt", scope: !635, file: !230, line: 32, type: !140)
!648 = !DILocalVariable(name: "_ros_pos_buf", scope: !635, file: !230, line: 32, type: !434)
!649 = !DILocalVariable(name: "_ros_pos_buf_buf4", scope: !635, file: !230, line: 32, type: !206)
!650 = !DILocalVariable(name: "_ros_pos_buf_buf8", scope: !635, file: !230, line: 32, type: !444)
!651 = !DILocalVariable(name: "_ros_pos_buf_buf12", scope: !635, file: !230, line: 32, type: !448)
!652 = !DILocalVariable(name: "_ros_pos_buf_buf16", scope: !635, file: !230, line: 32, type: !452)
!653 = !DILocalVariable(name: "_ros_pos_buf_buf32", scope: !635, file: !230, line: 32, type: !456)
!654 = !DILocalVariable(name: "_rws_buffer", scope: !635, file: !230, line: 32, type: !434)
!655 = !DILocalVariable(name: "_rws_buffer_buf4", scope: !635, file: !230, line: 32, type: !206)
!656 = !DILocalVariable(name: "_rws_buffer_buf8", scope: !635, file: !230, line: 32, type: !444)
!657 = !DILocalVariable(name: "_rws_buffer_buf12", scope: !635, file: !230, line: 32, type: !448)
!658 = !DILocalVariable(name: "_rws_buffer_buf16", scope: !635, file: !230, line: 32, type: !452)
!659 = !DILocalVariable(name: "_rws_buffer_buf32", scope: !635, file: !230, line: 32, type: !456)
!660 = !DILocalVariable(name: "_pmax", scope: !635, file: !230, line: 32, type: !336)
!661 = !DILocalVariable(name: "_pkg_len", scope: !635, file: !230, line: 32, type: !112)
!662 = !DILocalVariable(name: "_total_len", scope: !635, file: !230, line: 32, type: !112)
!663 = !DILocalVariable(name: "_pkg_offset", scope: !635, file: !230, line: 32, type: !112)
!664 = !DILocalVariable(name: "_len_loc", scope: !635, file: !230, line: 32, type: !172)
!665 = !DILocalVariable(name: "_arg_size", scope: !666, file: !230, line: 32, type: !135)
!666 = distinct !DILexicalBlock(scope: !635, file: !230, line: 32, column: 2)
!667 = !DILocalVariable(name: "__v", scope: !668, file: !230, line: 32, type: !474)
!668 = distinct !DILexicalBlock(scope: !666, file: !230, line: 32, column: 2)
!669 = !DILocalVariable(name: "__arg_size", scope: !668, file: !230, line: 32, type: !336)
!670 = !DILocalVariable(name: "_loc", scope: !666, file: !230, line: 32, type: !135)
!671 = !DILocalVariable(name: "_pbuf_loc", scope: !672, file: !230, line: 32, type: !434)
!672 = distinct !DILexicalBlock(scope: !673, file: !230, line: 32, column: 2)
!673 = distinct !DILexicalBlock(scope: !635, file: !230, line: 32, column: 2)
!674 = !DILocalVariable(name: "i", scope: !675, file: !230, line: 32, type: !336)
!675 = distinct !DILexicalBlock(scope: !672, file: !230, line: 32, column: 2)
!676 = !DILocalVariable(name: "i", scope: !677, file: !230, line: 32, type: !336)
!677 = distinct !DILexicalBlock(scope: !672, file: !230, line: 32, column: 2)
!678 = !DILocalVariable(name: "hdr", scope: !679, file: !230, line: 32, type: !173)
!679 = distinct !DILexicalBlock(scope: !680, file: !230, line: 32, column: 2)
!680 = distinct !DILexicalBlock(scope: !635, file: !230, line: 32, column: 2)
!681 = !DILocalVariable(name: "_desc", scope: !572, file: !230, line: 32, type: !192)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "__log_current_dynamic_data", scope: !151, file: !221, line: 18, type: !213, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "log_const_sample_module", scope: !686, file: !726, line: 10, type: !733, isLocal: false, isDefinition: true)
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !688, retainedTypes: !689, globals: !723, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/logger/src/sample_module.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/logging/logger")
!688 = !{!154, !40}
!689 = !{!111, !690, !112, !184, !701, !140, !702, !135}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !174, line: 78, size: 32, elements: !692)
!692 = !{!693, !700}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !691, file: !174, line: 80, baseType: !694, size: 32)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !174, line: 45, size: 32, elements: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !694, file: !174, line: 47, baseType: !140, size: 8)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !694, file: !174, line: 50, baseType: !140, size: 8, offset: 8)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !694, file: !174, line: 53, baseType: !140, size: 8, offset: 16)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !694, file: !174, line: 56, baseType: !140, size: 8, offset: 24)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !691, file: !174, line: 82, baseType: !111, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !155, line: 88, size: 128, elements: !704)
!704 = !{!705, !721, !722}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !703, file: !155, line: 89, baseType: !706, size: 96)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !155, line: 66, size: 96, elements: !707)
!707 = !{!708, !719, !720}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !706, file: !155, line: 67, baseType: !709, size: 32)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !155, line: 51, size: 32, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !709, file: !155, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !709, file: !155, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !709, file: !155, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !709, file: !155, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !709, file: !155, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !709, file: !155, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !709, file: !155, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !709, file: !155, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !706, file: !155, line: 75, baseType: !13, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !706, file: !155, line: 76, baseType: !204, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !703, file: !155, line: 93, baseType: !206, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !703, file: !155, line: 94, baseType: !210, offset: 128)
!723 = !{!684, !724, !730}
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "log_dynamic_sample_module", scope: !686, file: !726, line: 10, type: !727, isLocal: false, isDefinition: true)
!726 = !DIFile(filename: "zephyr/samples/subsys/logging/logger/src/sample_module.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_dynamic_data", file: !132, line: 29, size: 32, elements: !728)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !727, file: !132, line: 30, baseType: !135, size: 32)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "__log_current_dynamic_data", scope: !686, file: !726, line: 10, type: !732, isLocal: true, isDefinition: true)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !132, line: 16, size: 64, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !132, line: 17, baseType: !119, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !734, file: !132, line: 18, baseType: !140, size: 8, offset: 32)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !740, file: !787, line: 18, type: !794, isLocal: false, isDefinition: true)
!740 = distinct !DICompileUnit(language: DW_LANG_C99, file: !741, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !742, retainedTypes: !743, globals: !784, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/logging/logger")
!742 = !{!154}
!743 = !{!22, !111, !24, !744, !745, !747, !336, !112, !701, !748, !750, !751, !474, !434, !300, !752, !184, !140, !763, !135, !119}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !174, line: 78, size: 32, elements: !754)
!754 = !{!755, !762}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !753, file: !174, line: 80, baseType: !756, size: 32)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !174, line: 45, size: 32, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !756, file: !174, line: 47, baseType: !140, size: 8)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !756, file: !174, line: 50, baseType: !140, size: 8, offset: 8)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !756, file: !174, line: 53, baseType: !140, size: 8, offset: 16)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !756, file: !174, line: 56, baseType: !140, size: 8, offset: 24)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !753, file: !174, line: 82, baseType: !111, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !155, line: 88, size: 128, elements: !765)
!765 = !{!766, !782, !783}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !764, file: !155, line: 89, baseType: !767, size: 96)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !155, line: 66, size: 96, elements: !768)
!768 = !{!769, !780, !781}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !767, file: !155, line: 67, baseType: !770, size: 32)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !155, line: 51, size: 32, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !770, file: !155, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !770, file: !155, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !770, file: !155, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !770, file: !155, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !770, file: !155, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !770, file: !155, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !770, file: !155, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !770, file: !155, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !767, file: !155, line: 75, baseType: !13, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !767, file: !155, line: 76, baseType: !204, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !764, file: !155, line: 93, baseType: !206, size: 32, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !764, file: !155, line: 94, baseType: !210, offset: 128)
!784 = !{!738, !785, !791}
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "log_dynamic_cbprintf_package", scope: !740, file: !787, line: 18, type: !788, isLocal: false, isDefinition: true)
!787 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_dynamic_data", file: !132, line: 29, size: 32, elements: !789)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !788, file: !132, line: 30, baseType: !135, size: 32)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "__log_current_dynamic_data", scope: !740, file: !787, line: 18, type: !793, isLocal: true, isDefinition: true)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !132, line: 16, size: 64, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !795, file: !132, line: 17, baseType: !119, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !795, file: !132, line: 18, baseType: !140, size: 8, offset: 32)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "_char_out", scope: !801, file: !805, line: 54, type: !806, isLocal: false, isDefinition: true)
!801 = distinct !DICompileUnit(language: DW_LANG_C99, file: !802, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !803, retainedTypes: !110, globals: !804, splitDebugInlining: false, nameTableKind: None)
!802 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/logging/logger")
!803 = !{!40}
!804 = !{!799}
!805 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = !DISubroutineType(types: !808)
!808 = !{!112, !112}
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !811, file: !876, line: 235, type: !877, isLocal: true, isDefinition: true, align: 32)
!811 = distinct !DICompileUnit(language: DW_LANG_C99, file: !812, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !803, retainedTypes: !813, globals: !875, splitDebugInlining: false, nameTableKind: None)
!812 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/logging/logger")
!813 = !{!111, !112, !814, !825}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !816, line: 46, baseType: !817)
!816 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !816, line: 41, size: 128, elements: !818)
!818 = !{!819, !821, !822, !824}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !817, file: !816, line: 42, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !817, file: !816, line: 43, baseType: !820, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !817, file: !816, line: 44, baseType: !823, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !820)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !817, file: !816, line: 45, baseType: !823, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !827, line: 75, baseType: !828)
!827 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !827, line: 41, size: 2176, elements: !829)
!829 = !{!830, !831, !832, !833, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !853, !857, !858, !859, !860, !861, !862, !863, !864, !868, !869, !870, !871, !872, !873, !874}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !828, file: !827, line: 42, baseType: !820, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !828, file: !827, line: 43, baseType: !820, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !828, file: !827, line: 44, baseType: !823, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !828, file: !827, line: 45, baseType: !834, size: 32, offset: 96)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 32, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 1)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !828, file: !827, line: 46, baseType: !820, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !828, file: !827, line: 47, baseType: !820, size: 32, offset: 160)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !828, file: !827, line: 48, baseType: !823, size: 32, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !828, file: !827, line: 49, baseType: !820, size: 32, offset: 224)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !828, file: !827, line: 50, baseType: !820, size: 32, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !828, file: !827, line: 51, baseType: !823, size: 32, offset: 288)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !828, file: !827, line: 52, baseType: !820, size: 32, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !828, file: !827, line: 53, baseType: !834, size: 32, offset: 352)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !828, file: !827, line: 54, baseType: !820, size: 32, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !828, file: !827, line: 55, baseType: !834, size: 32, offset: 416)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !828, file: !827, line: 56, baseType: !820, size: 32, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !828, file: !827, line: 57, baseType: !834, size: 32, offset: 480)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !828, file: !827, line: 58, baseType: !850, size: 96, offset: 512)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !820, size: 96, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 3)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !828, file: !827, line: 59, baseType: !854, size: 160, offset: 608)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 160, elements: !855)
!855 = !{!856}
!856 = !DISubrange(count: 5)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !828, file: !827, line: 60, baseType: !820, size: 32, offset: 768)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !828, file: !827, line: 61, baseType: !820, size: 32, offset: 800)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !828, file: !827, line: 62, baseType: !823, size: 32, offset: 832)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !828, file: !827, line: 63, baseType: !823, size: 32, offset: 864)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !828, file: !827, line: 64, baseType: !820, size: 32, offset: 896)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !828, file: !827, line: 65, baseType: !820, size: 32, offset: 928)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !828, file: !827, line: 66, baseType: !820, size: 32, offset: 960)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !828, file: !827, line: 67, baseType: !865, size: 832, offset: 992)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 832, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 26)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !828, file: !827, line: 68, baseType: !820, size: 32, offset: 1824)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !828, file: !827, line: 69, baseType: !823, size: 32, offset: 1856)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !828, file: !827, line: 70, baseType: !854, size: 160, offset: 1888)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !828, file: !827, line: 71, baseType: !820, size: 32, offset: 2048)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !828, file: !827, line: 72, baseType: !820, size: 32, offset: 2080)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !828, file: !827, line: 73, baseType: !823, size: 32, offset: 2112)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !828, file: !827, line: 74, baseType: !820, size: 32, offset: 2144)
!875 = !{!809}
!876 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!877 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !879, line: 51, size: 64, elements: !880)
!879 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!880 = !{!881, !906}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !878, file: !879, line: 60, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DISubroutineType(types: !884)
!884 = !{!112, !885}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !888, line: 378, size: 192, elements: !889)
!888 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!889 = !{!890, !891, !892, !893, !899, !900}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !887, file: !888, line: 380, baseType: !119, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !887, file: !888, line: 382, baseType: !13, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !887, file: !888, line: 384, baseType: !13, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !887, file: !888, line: 386, baseType: !894, size: 32, offset: 96)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !888, line: 351, size: 16, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !895, file: !888, line: 359, baseType: !140, size: 8)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !895, file: !888, line: 364, baseType: !412, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !887, file: !888, line: 388, baseType: !111, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !887, file: !888, line: 396, baseType: !901, size: 32, offset: 160)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !888, line: 43, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !905)
!905 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !878, file: !879, line: 65, baseType: !885, size: 32, offset: 32)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "log_const_log", scope: !909, file: !983, line: 25, type: !1264, isLocal: false, isDefinition: true)
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !911, retainedTypes: !912, globals: !980, splitDebugInlining: false, nameTableKind: None)
!910 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/logging/logger")
!911 = !{!160, !154, !40}
!912 = !{!336, !112, !111, !913, !184, !217, !140, !924, !135, !945, !22, !24, !166, !170, !972, !434, !976, !978}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !174, line: 78, size: 32, elements: !915)
!915 = !{!916, !923}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !914, file: !174, line: 80, baseType: !917, size: 32)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !174, line: 45, size: 32, elements: !918)
!918 = !{!919, !920, !921, !922}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !917, file: !174, line: 47, baseType: !140, size: 8)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !917, file: !174, line: 50, baseType: !140, size: 8, offset: 8)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !917, file: !174, line: 53, baseType: !140, size: 8, offset: 16)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !917, file: !174, line: 56, baseType: !140, size: 8, offset: 24)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !914, file: !174, line: 82, baseType: !111, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 32)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !155, line: 88, size: 128, elements: !926)
!926 = !{!927, !943, !944}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !925, file: !155, line: 89, baseType: !928, size: 96)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !155, line: 66, size: 96, elements: !929)
!929 = !{!930, !941, !942}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !928, file: !155, line: 67, baseType: !931, size: 32)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !155, line: 51, size: 32, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !931, file: !155, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !931, file: !155, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !931, file: !155, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !931, file: !155, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !931, file: !155, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !931, file: !155, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !931, file: !155, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !931, file: !155, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !928, file: !155, line: 75, baseType: !13, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !928, file: !155, line: 76, baseType: !204, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !925, file: !155, line: 93, baseType: !206, size: 32, offset: 96)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !925, file: !155, line: 94, baseType: !210, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !155, line: 111, size: 128, elements: !947)
!947 = !{!948, !965, !971}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !946, file: !155, line: 112, baseType: !949, size: 32)
!949 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !950, line: 49, size: 32, elements: !951)
!950 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!951 = !{!952, !958, !964}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !949, file: !950, line: 50, baseType: !953, size: 32)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !950, line: 37, size: 32, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !953, file: !950, line: 38, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !953, file: !950, line: 38, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !953, file: !950, line: 39, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !949, file: !950, line: 51, baseType: !959, size: 32)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !950, line: 43, size: 32, elements: !960)
!960 = !{!961, !962, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !959, file: !950, line: 44, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !959, file: !950, line: 44, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !959, file: !950, line: 45, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !949, file: !950, line: 52, baseType: !135, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !946, file: !155, line: 113, baseType: !966, size: 32)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !155, line: 107, size: 32, elements: !967)
!967 = !{!968, !969, !970}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !966, file: !155, line: 108, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !966, file: !155, line: 108, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !966, file: !155, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !946, file: !155, line: 114, baseType: !925, size: 128)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_dynamic_data", file: !132, line: 29, size: 32, elements: !974)
!974 = !{!975}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !973, file: !132, line: 30, baseType: !135, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!980 = !{!907, !981, !1007, !1020, !1022, !1024, !1026, !1030, !1032, !1034, !1036, !1038, !1040, !1046, !1077, !1080, !1088, !1170, !1197, !1204, !1206, !1208, !1218, !1223, !1236, !1240, !1259}
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !909, file: !983, line: 93, type: !984, isLocal: false, isDefinition: true, align: 32)
!983 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !241, line: 2909, size: 128, elements: !985)
!985 = !{!986, !1005, !1006}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !984, file: !241, line: 2910, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !282, line: 233, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !282, line: 231, size: 64, elements: !989)
!989 = !{!990}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !988, file: !282, line: 232, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !256, line: 48, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !256, line: 37, size: 64, elements: !993)
!993 = !{!994, !1000}
!994 = !DIDerivedType(tag: DW_TAG_member, scope: !992, file: !256, line: 38, baseType: !995, size: 32)
!995 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !992, file: !256, line: 38, size: 32, elements: !996)
!996 = !{!997, !999}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !995, file: !256, line: 39, baseType: !998, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !995, file: !256, line: 40, baseType: !998, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, scope: !992, file: !256, line: 42, baseType: !1001, size: 32, offset: 32)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !992, file: !256, line: 42, size: 32, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1001, file: !256, line: 43, baseType: !998, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1001, file: !256, line: 44, baseType: !998, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !984, file: !241, line: 2911, baseType: !32, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !984, file: !241, line: 2912, baseType: !32, size: 32, offset: 96)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !909, file: !983, line: 910, type: !1009, isLocal: true, isDefinition: true, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !879, line: 51, size: 64, elements: !1011)
!1011 = !{!1012, !1019}
