; ModuleID = 'build/arduino_due/sensor/tmp108/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.i2c_sam_twi_dev_cfg = type { %struct.Twi*, void ()*, i32, %struct.pinctrl_dev_config*, i8, i8 }
%struct.Twi = type { i32, i32, i32, i32, i32, [3 x i32], i32, i32, i32, i32, i32, i32, [50 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.pinctrl_dev_config = type { %struct.pinctrl_state*, i8 }
%struct.pinctrl_state = type { i32*, i8, i8 }
%struct.i2c_driver_api = type { i32 (%struct.device*, i32)*, i32 (%struct.device*, i32*)*, i32 (%struct.device*, %struct.i2c_msg*, i8, i16)*, i32 (%struct.device*, %struct.i2c_target_config*)*, i32 (%struct.device*, %struct.i2c_target_config*)*, i32 (%struct.device*)* }
%struct.i2c_msg = type { i8*, i32, i8 }
%struct.i2c_target_config = type { %struct._snode, i8, i16, %struct.i2c_target_callbacks* }
%struct._snode = type { %struct._snode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !111, file: !177, line: 235, type: !178, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !176, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!113 = !{!102, !103, !114, !126}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 41, size: 128, elements: !118)
!118 = !{!119, !122, !123, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !117, file: !116, line: 42, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !117, file: !116, line: 43, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !117, file: !116, line: 44, baseType: !124, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !117, file: !116, line: 45, baseType: !124, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !128, line: 75, baseType: !129)
!128 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 41, size: 2176, elements: !130)
!130 = !{!131, !132, !133, !134, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !154, !158, !159, !160, !161, !162, !163, !164, !165, !169, !170, !171, !172, !173, !174, !175}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !129, file: !128, line: 42, baseType: !120, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !129, file: !128, line: 43, baseType: !120, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !129, file: !128, line: 44, baseType: !124, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !129, file: !128, line: 45, baseType: !135, size: 32, offset: 96)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !129, file: !128, line: 46, baseType: !120, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !129, file: !128, line: 47, baseType: !120, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !129, file: !128, line: 48, baseType: !124, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !129, file: !128, line: 49, baseType: !120, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !129, file: !128, line: 50, baseType: !120, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !129, file: !128, line: 51, baseType: !124, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !129, file: !128, line: 52, baseType: !120, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !129, file: !128, line: 53, baseType: !135, size: 32, offset: 352)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !129, file: !128, line: 54, baseType: !120, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !129, file: !128, line: 55, baseType: !135, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !129, file: !128, line: 56, baseType: !120, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !129, file: !128, line: 57, baseType: !135, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !129, file: !128, line: 58, baseType: !151, size: 96, offset: 512)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 96, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !129, file: !128, line: 59, baseType: !155, size: 160, offset: 608)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !129, file: !128, line: 60, baseType: !120, size: 32, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !129, file: !128, line: 61, baseType: !120, size: 32, offset: 800)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !129, file: !128, line: 62, baseType: !124, size: 32, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !129, file: !128, line: 63, baseType: !124, size: 32, offset: 864)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !129, file: !128, line: 64, baseType: !120, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !129, file: !128, line: 65, baseType: !120, size: 32, offset: 928)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !129, file: !128, line: 66, baseType: !120, size: 32, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !129, file: !128, line: 67, baseType: !166, size: 832, offset: 992)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 832, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !129, file: !128, line: 68, baseType: !120, size: 32, offset: 1824)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !129, file: !128, line: 69, baseType: !124, size: 32, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !129, file: !128, line: 70, baseType: !155, size: 160, offset: 1888)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !129, file: !128, line: 71, baseType: !120, size: 32, offset: 2048)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !129, file: !128, line: 72, baseType: !120, size: 32, offset: 2080)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !129, file: !128, line: 73, baseType: !124, size: 32, offset: 2112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !129, file: !128, line: 74, baseType: !120, size: 32, offset: 2144)
!176 = !{!109}
!177 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182, !213}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !179, file: !180, line: 60, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!103, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !190)
!189 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!190 = !{!191, !195, !196, !197, !206, !207}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !189, line: 380, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !188, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !188, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !188, file: !189, line: 386, baseType: !198, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !200)
!200 = !{!201, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !199, file: !189, line: 359, baseType: !202, size: 8)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !203)
!203 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !199, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !188, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !189, line: 43, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !212)
!212 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !179, file: !180, line: 65, baseType: !186, size: 32, offset: 32)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "static_regions", scope: !216, file: !225, line: 62, type: !365, isLocal: true, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !218, globals: !221, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!218 = !{!219, !103, !121, !102}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 214, baseType: !32)
!220 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !{!222, !214}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !224, file: !225, line: 198, type: !353, isLocal: true, isDefinition: true)
!224 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !225, file: !225, line: 175, type: !226, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !348)
!225 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !230, line: 245, size: 1024, elements: !231)
!230 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !{!232, !301, !314, !315, !316, !317, !323, !343}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !229, file: !230, line: 247, baseType: !233, size: 384)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !230, line: 57, size: 384, elements: !234)
!234 = !{!235, !263, !271, !272, !273, !286, !287, !288}
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !230, line: 60, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !230, line: 60, size: 64, elements: !237)
!237 = !{!238, !254}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !236, file: !230, line: 61, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !240, line: 49, baseType: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !240, line: 37, size: 64, elements: !242)
!242 = !{!243, !249}
!243 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !240, line: 38, baseType: !244, size: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 38, size: 32, elements: !245)
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !244, file: !240, line: 39, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !240, line: 40, baseType: !247, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !240, line: 42, baseType: !250, size: 32, offset: 32)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 42, size: 32, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !250, file: !240, line: 43, baseType: !247, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !250, file: !240, line: 44, baseType: !247, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !236, file: !230, line: 62, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !256, line: 49, size: 64, elements: !257)
!256 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !255, file: !256, line: 50, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 64, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!261 = !{!262}
!262 = !DISubrange(count: 2)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !233, file: !230, line: 68, baseType: !264, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !266, line: 233, baseType: !267)
!266 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 231, size: 64, elements: !268)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !267, file: !266, line: 232, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !240, line: 48, baseType: !241)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !233, file: !230, line: 71, baseType: !202, size: 8, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !233, file: !230, line: 74, baseType: !202, size: 8, offset: 104)
!273 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !230, line: 90, baseType: !274, size: 16, offset: 112)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !230, line: 90, size: 16, elements: !275)
!275 = !{!276, !283}
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !230, line: 91, baseType: !277, size: 16)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !274, file: !230, line: 91, size: 16, elements: !278)
!278 = !{!279, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !277, file: !230, line: 96, baseType: !280, size: 8)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !281)
!281 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !277, file: !230, line: 97, baseType: !202, size: 8, offset: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !274, file: !230, line: 100, baseType: !284, size: 16)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !285)
!285 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !233, file: !230, line: 107, baseType: !121, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !233, file: !230, line: 127, baseType: !102, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !233, file: !230, line: 131, baseType: !289, size: 192, offset: 192)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !266, line: 244, size: 192, elements: !290)
!290 = !{!291, !292, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !289, file: !266, line: 245, baseType: !239, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !289, file: !266, line: 246, baseType: !293, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !266, line: 242, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !289, file: !266, line: 249, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !300)
!300 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !229, file: !230, line: 250, baseType: !302, size: 288, offset: 384)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !303, line: 25, size: 288, elements: !304)
!303 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !302, file: !303, line: 26, baseType: !121, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !302, file: !303, line: 27, baseType: !121, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !302, file: !303, line: 28, baseType: !121, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !302, file: !303, line: 29, baseType: !121, size: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !302, file: !303, line: 30, baseType: !121, size: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !302, file: !303, line: 31, baseType: !121, size: 32, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !302, file: !303, line: 32, baseType: !121, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !302, file: !303, line: 33, baseType: !121, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !302, file: !303, line: 34, baseType: !121, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !229, file: !230, line: 253, baseType: !102, size: 32, offset: 672)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !229, file: !230, line: 256, baseType: !265, size: 64, offset: 704)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !229, file: !230, line: 294, baseType: !103, size: 32, offset: 768)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !229, file: !230, line: 300, baseType: !318, size: 96, offset: 800)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !230, line: 149, size: 96, elements: !319)
!319 = !{!320, !321, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !318, file: !230, line: 153, baseType: !22, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !318, file: !230, line: 162, baseType: !219, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !318, file: !230, line: 168, baseType: !219, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !229, file: !230, line: 325, baseType: !324, size: 32, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !326, line: 5073, size: 192, elements: !327)
!326 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !{!328, !337, !338}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !325, file: !326, line: 5074, baseType: !329, size: 96)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !330, line: 56, size: 96, elements: !331)
!330 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!331 = !{!332, !335, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !329, file: !330, line: 57, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !330, line: 57, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !329, file: !330, line: 58, baseType: !102, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !329, file: !330, line: 59, baseType: !219, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !325, file: !326, line: 5075, baseType: !265, size: 64, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !325, file: !326, line: 5076, baseType: !339, size: 32, offset: 160)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !340, line: 43, size: 32, elements: !341)
!340 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !339, file: !340, line: 52, baseType: !22, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !229, file: !230, line: 343, baseType: !344, size: 64, offset: 928)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !303, line: 60, size: 64, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !344, file: !303, line: 63, baseType: !121, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !344, file: !303, line: 66, baseType: !121, size: 32, offset: 32)
!348 = !{!349, !350, !351, !352}
!349 = !DILocalVariable(name: "thread", arg: 1, scope: !224, file: !225, line: 175, type: !228)
!350 = !DILocalVariable(name: "region_num", scope: !224, file: !225, line: 200, type: !202)
!351 = !DILocalVariable(name: "guard_start", scope: !224, file: !225, line: 265, type: !22)
!352 = !DILocalVariable(name: "guard_size", scope: !224, file: !225, line: 266, type: !219)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 96, elements: !136)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !355, line: 52, size: 96, elements: !356)
!355 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !{!357, !358, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !354, file: !355, line: 53, baseType: !22, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !354, file: !355, line: 54, baseType: !219, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !354, file: !355, line: 55, baseType: !360, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !361, line: 151, baseType: !362)
!361 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 149, size: 32, elements: !363)
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !362, file: !361, line: 150, baseType: !121, size: 32)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 96, elements: !136)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !369, file: !401, line: 39, type: !202, isLocal: true, isDefinition: true)
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !371, globals: !400, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!371 = !{!372, !102, !103, !388, !202}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !374, line: 1168, baseType: !375)
!374 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 1155, size: 352, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !375, file: !374, line: 1157, baseType: !124, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !375, file: !374, line: 1158, baseType: !120, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !375, file: !374, line: 1159, baseType: !120, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !375, file: !374, line: 1160, baseType: !120, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !375, file: !374, line: 1161, baseType: !120, size: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !375, file: !374, line: 1162, baseType: !120, size: 32, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !375, file: !374, line: 1163, baseType: !120, size: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !375, file: !374, line: 1164, baseType: !120, size: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !375, file: !374, line: 1165, baseType: !120, size: 32, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !375, file: !374, line: 1166, baseType: !120, size: 32, offset: 288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !375, file: !374, line: 1167, baseType: !120, size: 32, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !391, line: 27, size: 96, elements: !392)
!391 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !390, file: !391, line: 29, baseType: !121, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !390, file: !391, line: 31, baseType: !192, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !390, file: !391, line: 37, baseType: !396, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !361, line: 146, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !361, line: 141, size: 32, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !397, file: !361, line: 143, baseType: !121, size: 32)
!400 = !{!367}
!401 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !404, file: !411, line: 21, type: !106, isLocal: true, isDefinition: true)
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !406, globals: !410, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!406 = !{!407, !103, !102}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !409, line: 22, baseType: !103)
!409 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = !{!402}
!411 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !414, file: !419, line: 13, type: !436, isLocal: true, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !416, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!416 = !{!417, !412}
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "mpu_config", scope: !414, file: !419, line: 37, type: !420, isLocal: false, isDefinition: true)
!419 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !391, line: 41, size: 64, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !421, file: !391, line: 43, baseType: !121, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !421, file: !391, line: 45, baseType: !425, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !391, line: 27, size: 96, elements: !428)
!428 = !{!429, !430, !431}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !427, file: !391, line: 29, baseType: !121, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !427, file: !391, line: 31, baseType: !192, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !427, file: !391, line: 37, baseType: !432, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !361, line: 146, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !361, line: 141, size: 32, elements: !434)
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !433, file: !361, line: 143, baseType: !121, size: 32)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 192, elements: !261)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !439, file: !496, line: 603, type: !498, isLocal: true, isDefinition: true, align: 32)
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !441, globals: !493, splitDebugInlining: false, nameTableKind: None)
!440 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!441 = !{!102, !103, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !445, line: 336, size: 160, elements: !446)
!445 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = !{!447, !467, !471, !475, !488}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !444, file: !445, line: 365, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DISubroutineType(types: !450)
!450 = !{!103, !451, !466}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !454)
!454 = !{!455, !456, !457, !458, !464, !465}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !453, file: !189, line: 380, baseType: !192, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !453, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !453, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !453, file: !189, line: 386, baseType: !459, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !460, file: !189, line: 359, baseType: !202, size: 8)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !460, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !453, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !453, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !444, file: !445, line: 366, baseType: !468, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !451, !203}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !444, file: !445, line: 374, baseType: !472, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DISubroutineType(types: !474)
!474 = !{!103, !451}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !444, file: !445, line: 377, baseType: !476, size: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = !DISubroutineType(types: !478)
!478 = !{!103, !451, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !445, line: 122, size: 64, elements: !482)
!482 = !{!483, !484, !485, !486, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !481, file: !445, line: 123, baseType: !121, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !481, file: !445, line: 124, baseType: !202, size: 8, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !481, file: !445, line: 125, baseType: !202, size: 8, offset: 40)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !481, file: !445, line: 126, baseType: !202, size: 8, offset: 48)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !481, file: !445, line: 127, baseType: !202, size: 8, offset: 56)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !444, file: !445, line: 379, baseType: !489, size: 32, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!490 = !DISubroutineType(types: !491)
!491 = !{!103, !451, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!493 = !{!437, !494}
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !439, file: !496, line: 38, type: !497, isLocal: true, isDefinition: true)
!496 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !499, file: !180, line: 60, baseType: !472, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !499, file: !180, line: 65, baseType: !451, size: 32, offset: 32)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_12", scope: !505, file: !510, line: 22, type: !511, isLocal: false, isDefinition: true, align: 16)
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !507, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!507 = !{!508, !512, !514, !503}
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !505, file: !510, line: 7, type: !511, isLocal: false, isDefinition: true, align: 16)
!510 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 48, elements: !152)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !505, file: !510, line: 12, type: !511, isLocal: false, isDefinition: true, align: 16)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !505, file: !510, line: 17, type: !511, isLocal: false, isDefinition: true, align: 16)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "i2c0_sam_config", scope: !518, file: !625, line: 381, type: !729, isLocal: true, isDefinition: true)
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !520, globals: !622, splitDebugInlining: false, nameTableKind: None)
!519 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/i2c/i2c_sam_twi.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!520 = !{!102, !103, !521, !612, !620}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_driver_api", file: !524, line: 234, size: 192, elements: !525)
!524 = !DIFile(filename: "zephyr/include/zephyr/drivers/i2c.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!525 = !{!526, !546, !552, !564, !605, !607}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !523, file: !524, line: 235, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_configure_t", file: !524, line: 212, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DISubroutineType(types: !530)
!530 = !{!103, !531, !121}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !534)
!534 = !{!535, !536, !537, !538, !544, !545}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !533, file: !189, line: 380, baseType: !192, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !533, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !533, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !533, file: !189, line: 386, baseType: !539, size: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !540, file: !189, line: 359, baseType: !202, size: 8)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !540, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !533, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !533, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "get_config", scope: !523, file: !524, line: 236, baseType: !547, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_get_config_t", file: !524, line: 214, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = !DISubroutineType(types: !550)
!550 = !{!103, !531, !551}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !523, file: !524, line: 237, baseType: !553, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_full_io_t", file: !524, line: 216, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = !DISubroutineType(types: !556)
!556 = !{!103, !531, !557, !202, !284}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_msg", file: !524, line: 184, size: 96, elements: !559)
!559 = !{!560, !562, !563}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !558, file: !524, line: 186, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !558, file: !524, line: 189, baseType: !121, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !558, file: !524, line: 192, baseType: !202, size: 8, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "target_register", scope: !523, file: !524, line: 238, baseType: !565, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_target_register_t", file: !524, line: 220, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DISubroutineType(types: !568)
!568 = !{!103, !531, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_config", file: !524, line: 385, size: 96, elements: !571)
!571 = !{!572, !579, !580, !581}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !570, file: !524, line: 387, baseType: !573, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !574, line: 33, baseType: !575)
!574 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !574, line: 29, size: 32, elements: !576)
!576 = !{!577}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !575, file: !574, line: 30, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !570, file: !524, line: 390, baseType: !202, size: 8, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !570, file: !524, line: 393, baseType: !284, size: 16, offset: 48)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !570, file: !524, line: 396, baseType: !582, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_callbacks", file: !524, line: 366, size: 160, elements: !585)
!585 = !{!586, !591, !596, !601, !603}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "write_requested", scope: !584, file: !524, line: 367, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_write_requested_cb_t", file: !524, line: 276, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DISubroutineType(types: !590)
!590 = !{!103, !569}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "read_requested", scope: !584, file: !524, line: 368, baseType: !592, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_read_requested_cb_t", file: !524, line: 319, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DISubroutineType(types: !595)
!595 = !{!103, !569, !561}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "write_received", scope: !584, file: !524, line: 369, baseType: !597, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_write_received_cb_t", file: !524, line: 297, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 32)
!599 = !DISubroutineType(types: !600)
!600 = !{!103, !569, !202}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "read_processed", scope: !584, file: !524, line: 370, baseType: !602, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_read_processed_cb_t", file: !524, line: 341, baseType: !593)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !584, file: !524, line: 371, baseType: !604, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_stop_cb_t", file: !524, line: 358, baseType: !588)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "target_unregister", scope: !523, file: !524, line: 239, baseType: !606, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_target_unregister_t", file: !524, line: 222, baseType: !566)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "recover_bus", scope: !523, file: !524, line: 243, baseType: !608, size: 32, offset: 160)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_api_recover_bus_t", file: !524, line: 232, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DISubroutineType(types: !611)
!611 = !{!103, !531}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_target_driver_api", file: !524, line: 249, size: 64, elements: !615)
!615 = !{!616, !618}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "driver_register", scope: !614, file: !524, line: 250, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_api_register_t", file: !524, line: 246, baseType: !609)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "driver_unregister", scope: !614, file: !524, line: 251, baseType: !619, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "i2c_target_api_unregister_t", file: !524, line: 247, baseType: !609)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !621, line: 46, baseType: !299)
!621 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!622 = !{!623, !629, !631, !638, !640, !642, !644, !681, !683, !685, !516, !687, !700, !719, !722, !725, !727, !772, !775, !777, !779}
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_12", scope: !518, file: !625, line: 381, type: !626, isLocal: false, isDefinition: true, align: 16)
!625 = !DIFile(filename: "zephyr/drivers/i2c/i2c_sam_twi.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 6)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "__device_dts_ord_12", scope: !518, file: !625, line: 381, type: !532, isLocal: false, isDefinition: true, align: 32)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_12", scope: !518, file: !625, line: 381, type: !633, isLocal: true, isDefinition: true, align: 32)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !634, file: !180, line: 60, baseType: !609, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !634, file: !180, line: 65, baseType: !531, size: 32, offset: 32)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !518, file: !625, line: 381, type: !626, isLocal: false, isDefinition: true, align: 16)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "__device_dts_ord_14", scope: !518, file: !625, line: 381, type: !532, isLocal: false, isDefinition: true, align: 32)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_14", scope: !518, file: !625, line: 381, type: !633, isLocal: true, isDefinition: true, align: 32)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "i2c0_sam_data", scope: !518, file: !625, line: 381, type: !646, isLocal: true, isDefinition: true)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_sam_twi_dev_data", file: !625, line: 65, size: 416, elements: !647)
!647 = !{!648, !672, !673}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !646, file: !625, line: 66, baseType: !649, size: 128)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !326, line: 2909, size: 128, elements: !650)
!650 = !{!651, !670, !671}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !649, file: !326, line: 2910, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !266, line: 233, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 231, size: 64, elements: !654)
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !653, file: !266, line: 232, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !240, line: 48, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !240, line: 37, size: 64, elements: !658)
!658 = !{!659, !665}
!659 = !DIDerivedType(tag: DW_TAG_member, scope: !657, file: !240, line: 38, baseType: !660, size: 32)
!660 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !657, file: !240, line: 38, size: 32, elements: !661)
!661 = !{!662, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !660, file: !240, line: 39, baseType: !663, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !240, line: 40, baseType: !663, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, scope: !657, file: !240, line: 42, baseType: !666, size: 32, offset: 32)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !657, file: !240, line: 42, size: 32, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !666, file: !240, line: 43, baseType: !663, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !666, file: !240, line: 44, baseType: !663, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !649, file: !326, line: 2911, baseType: !32, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !649, file: !326, line: 2912, baseType: !32, size: 32, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !646, file: !625, line: 67, baseType: !649, size: 128, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !646, file: !625, line: 68, baseType: !674, size: 160, offset: 256)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "twi_msg", file: !625, line: 51, size: 160, elements: !675)
!675 = !{!676, !677, !678, !679, !680}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !674, file: !625, line: 53, baseType: !561, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !674, file: !625, line: 55, baseType: !121, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !674, file: !625, line: 57, baseType: !121, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "twi_sr", scope: !674, file: !625, line: 59, baseType: !121, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !674, file: !625, line: 61, baseType: !202, size: 8, offset: 128)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_12", scope: !518, file: !625, line: 381, type: !540, isLocal: true, isDefinition: true, align: 8)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "i2c1_sam_data", scope: !518, file: !625, line: 381, type: !646, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_14", scope: !518, file: !625, line: 381, type: !540, isLocal: true, isDefinition: true, align: 8)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "__isr_i2c_sam_twi_isr_irq_0", scope: !689, file: !625, line: 381, type: !693, isLocal: true, isDefinition: true, align: 32)
!689 = distinct !DISubprogram(name: "i2c0_sam_irq_config", scope: !625, file: !625, line: 381, type: !690, scopeLine: 381, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !518, retainedNodes: !692)
!690 = !DISubroutineType(types: !691)
!691 = !{null}
!692 = !{}
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !694)
!694 = !{!695, !697, !698, !699}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !693, file: !10, line: 55, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !10, line: 57, baseType: !696, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !693, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !693, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_12", scope: !518, file: !625, line: 381, type: !702, isLocal: true, isDefinition: true)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !704, line: 60, size: 64, elements: !705)
!704 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!705 = !{!706, !718}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !703, file: !704, line: 69, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !704, line: 50, size: 64, elements: !710)
!710 = !{!711, !716, !717}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !709, file: !704, line: 52, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !715, line: 32, baseType: !121)
!715 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl/pinctrl_soc_sam_common.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !709, file: !704, line: 54, baseType: !202, size: 8, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !709, file: !704, line: 56, baseType: !202, size: 8, offset: 40)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !703, file: !704, line: 71, baseType: !202, size: 8, offset: 32)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_12", scope: !518, file: !625, line: 381, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 64, elements: !136)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_12", scope: !518, file: !625, line: 381, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 64, elements: !261)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "i2c_sam_twi_driver_api", scope: !518, file: !625, line: 350, type: !522, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "i2c1_sam_config", scope: !518, file: !625, line: 381, type: !729, isLocal: true, isDefinition: true)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_sam_twi_dev_cfg", file: !625, line: 42, size: 160, elements: !731)
!731 = !{!732, !765, !767, !768, !770, !771}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !730, file: !625, line: 43, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "Twi", file: !735, line: 65, baseType: !736)
!735 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/twi.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !735, line: 41, size: 2368, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !745, !746, !747, !748, !749, !750, !751, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_CR", scope: !736, file: !735, line: 42, baseType: !120, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_MMR", scope: !736, file: !735, line: 43, baseType: !120, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_SMR", scope: !736, file: !735, line: 44, baseType: !120, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_IADR", scope: !736, file: !735, line: 45, baseType: !120, size: 32, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_CWGR", scope: !736, file: !735, line: 46, baseType: !120, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !736, file: !735, line: 47, baseType: !744, size: 96, offset: 160)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 96, elements: !152)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_SR", scope: !736, file: !735, line: 48, baseType: !124, size: 32, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_IER", scope: !736, file: !735, line: 49, baseType: !120, size: 32, offset: 288)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_IDR", scope: !736, file: !735, line: 50, baseType: !120, size: 32, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_IMR", scope: !736, file: !735, line: 51, baseType: !124, size: 32, offset: 352)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_RHR", scope: !736, file: !735, line: 52, baseType: !124, size: 32, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_THR", scope: !736, file: !735, line: 53, baseType: !120, size: 32, offset: 416)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !736, file: !735, line: 54, baseType: !752, size: 1600, offset: 448)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 1600, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 50)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_RPR", scope: !736, file: !735, line: 55, baseType: !120, size: 32, offset: 2048)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_RCR", scope: !736, file: !735, line: 56, baseType: !120, size: 32, offset: 2080)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_TPR", scope: !736, file: !735, line: 57, baseType: !120, size: 32, offset: 2112)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_TCR", scope: !736, file: !735, line: 58, baseType: !120, size: 32, offset: 2144)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_RNPR", scope: !736, file: !735, line: 59, baseType: !120, size: 32, offset: 2176)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_RNCR", scope: !736, file: !735, line: 60, baseType: !120, size: 32, offset: 2208)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_TNPR", scope: !736, file: !735, line: 61, baseType: !120, size: 32, offset: 2240)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_TNCR", scope: !736, file: !735, line: 62, baseType: !120, size: 32, offset: 2272)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_PTCR", scope: !736, file: !735, line: 63, baseType: !120, size: 32, offset: 2304)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "TWI_PTSR", scope: !736, file: !735, line: 64, baseType: !124, size: 32, offset: 2336)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "irq_config", scope: !730, file: !625, line: 44, baseType: !766, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate", scope: !730, file: !625, line: 45, baseType: !121, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pcfg", scope: !730, file: !625, line: 46, baseType: !769, size: 32, offset: 96)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "periph_id", scope: !730, file: !625, line: 47, baseType: !202, size: 8, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "irq_id", scope: !730, file: !625, line: 48, baseType: !202, size: 8, offset: 136)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "__isr_i2c_sam_twi_isr_irq_1", scope: !774, file: !625, line: 381, type: !693, isLocal: true, isDefinition: true, align: 32)
!774 = distinct !DISubprogram(name: "i2c1_sam_irq_config", scope: !625, file: !625, line: 381, type: !690, scopeLine: 381, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !518, retainedNodes: !692)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_14", scope: !518, file: !625, line: 381, type: !702, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_14", scope: !518, file: !625, line: 381, type: !721, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_14", scope: !518, file: !625, line: 381, type: !724, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !783, file: !844, line: 234, type: !876, isLocal: true, isDefinition: true)
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !785, globals: !841, splitDebugInlining: false, nameTableKind: None)
!784 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!785 = !{!786, !121}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !789, line: 134, size: 128, elements: !790)
!789 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!790 = !{!791, !811, !816, !836}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !788, file: !789, line: 135, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !789, line: 113, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = !DISubroutineType(types: !795)
!795 = !{!103, !796, !202}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !799)
!799 = !{!800, !801, !802, !803, !809, !810}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !798, file: !189, line: 380, baseType: !192, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !798, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !798, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !798, file: !189, line: 386, baseType: !804, size: 32, offset: 96)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !805, file: !189, line: 359, baseType: !202, size: 8)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !805, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !798, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !798, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !788, file: !789, line: 136, baseType: !812, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !789, line: 119, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DISubroutineType(types: !815)
!815 = !{!103, !796}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !788, file: !789, line: 137, baseType: !817, size: 32, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !789, line: 125, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DISubroutineType(types: !820)
!820 = !{!103, !796, !821}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !789, line: 88, size: 128, elements: !824)
!824 = !{!825, !830, !835}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !823, file: !789, line: 90, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !789, line: 72, size: 64, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !826, file: !789, line: 74, baseType: !121, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !826, file: !789, line: 76, baseType: !121, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !823, file: !789, line: 92, baseType: !831, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !789, line: 85, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !796, !103}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !823, file: !789, line: 104, baseType: !202, size: 8, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !788, file: !789, line: 138, baseType: !837, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !789, line: 132, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DISubroutineType(types: !840)
!840 = !{!103, !796, !103}
!841 = !{!842, !846, !848, !855, !781, !857, !859, !867}
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !783, file: !844, line: 256, type: !845, isLocal: false, isDefinition: true, align: 16)
!844 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 80, elements: !156)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !783, file: !844, line: 256, type: !797, isLocal: false, isDefinition: true, align: 32)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !783, file: !844, line: 256, type: !850, isLocal: true, isDefinition: true, align: 32)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !851, file: !180, line: 60, baseType: !813, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !851, file: !180, line: 65, baseType: !796, size: 32, offset: 32)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !783, file: !844, line: 256, type: !805, isLocal: true, isDefinition: true, align: 8)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !783, file: !844, line: 227, type: !787, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !783, file: !844, line: 45, type: !861, isLocal: true, isDefinition: true)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !844, line: 38, size: 96, elements: !862)
!862 = !{!863, !864, !865, !866}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !861, file: !844, line: 39, baseType: !831, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !861, file: !844, line: 40, baseType: !121, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !861, file: !844, line: 41, baseType: !205, size: 8, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !861, file: !844, line: 42, baseType: !205, size: 8, offset: 72)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !869, file: !844, line: 240, type: !870, isLocal: true, isDefinition: true, align: 32)
!869 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !844, file: !844, line: 238, type: !690, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !783, retainedNodes: !692)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !870, file: !10, line: 55, baseType: !696, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !870, file: !10, line: 57, baseType: !696, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !870, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !870, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !844, line: 34, size: 32, elements: !878)
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !877, file: !844, line: 35, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !882, line: 45, baseType: !883)
!882 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !882, line: 41, size: 96, elements: !884)
!884 = !{!885, !886, !887}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !883, file: !882, line: 42, baseType: !120, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !883, file: !882, line: 43, baseType: !120, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !883, file: !882, line: 44, baseType: !124, size: 32, offset: 64)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !890, file: !978, line: 494, type: !1016, isLocal: true, isDefinition: true)
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !892, retainedTypes: !925, globals: !975, splitDebugInlining: false, nameTableKind: None)
!891 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/tmp108")
!892 = !{!893, !900, !906, !913, !918}
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !445, line: 47, baseType: !32, size: 32, elements: !894)
!894 = !{!895, !896, !897, !898, !899}
!895 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!896 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!897 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!898 = !DIEnumerator(name: "UART_BREAK", value: 8)
!899 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !445, line: 84, baseType: !32, size: 32, elements: !901)
!901 = !{!902, !903, !904, !905}
!902 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!903 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!904 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!905 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !445, line: 92, baseType: !32, size: 32, elements: !907)
!907 = !{!908, !909, !910, !911, !912}
!908 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!909 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!910 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!911 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!912 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !445, line: 107, baseType: !32, size: 32, elements: !914)
!914 = !{!915, !916, !917}
!915 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!916 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!917 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !445, line: 75, baseType: !32, size: 32, elements: !919)
!919 = !{!920, !921, !922, !923, !924}
!920 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!921 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!922 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!923 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!924 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!925 = !{!926, !102, !203, !121}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !445, line: 336, size: 160, elements: !929)
!929 = !{!930, !949, !953, !957, !970}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !928, file: !445, line: 365, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DISubroutineType(types: !933)
!933 = !{!103, !934, !466}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !937)
!937 = !{!938, !939, !940, !941, !947, !948}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !189, line: 380, baseType: !192, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !936, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !936, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !936, file: !189, line: 386, baseType: !942, size: 32, offset: 96)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !943, file: !189, line: 359, baseType: !202, size: 8)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !943, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !936, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !936, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !928, file: !445, line: 366, baseType: !950, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !934, !203}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !928, file: !445, line: 374, baseType: !954, size: 32, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DISubroutineType(types: !956)
!956 = !{!103, !934}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !928, file: !445, line: 377, baseType: !958, size: 32, offset: 96)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = !DISubroutineType(types: !960)
!960 = !{!103, !934, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !445, line: 122, size: 64, elements: !964)
!964 = !{!965, !966, !967, !968, !969}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !963, file: !445, line: 123, baseType: !121, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !963, file: !445, line: 124, baseType: !202, size: 8, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !963, file: !445, line: 125, baseType: !202, size: 8, offset: 40)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !963, file: !445, line: 126, baseType: !202, size: 8, offset: 48)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !963, file: !445, line: 127, baseType: !202, size: 8, offset: 56)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !928, file: !445, line: 379, baseType: !971, size: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!972 = !DISubroutineType(types: !973)
!973 = !{!103, !934, !974}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!975 = !{!976, !979, !981, !988, !990, !992, !888, !997, !1011, !1014}
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !890, file: !978, line: 494, type: !626, isLocal: false, isDefinition: true, align: 16)
!978 = !DIFile(filename: "zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !890, file: !978, line: 494, type: !935, isLocal: false, isDefinition: true, align: 32)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !890, file: !978, line: 494, type: !983, isLocal: true, isDefinition: true, align: 32)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !984, file: !180, line: 60, baseType: !954, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !984, file: !180, line: 65, baseType: !934, size: 32, offset: 32)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_21", scope: !890, file: !978, line: 494, type: !943, isLocal: true, isDefinition: true, align: 8)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "uart_sam_driver_api", scope: !890, file: !978, line: 419, type: !927, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "uart0_sam_data", scope: !890, file: !978, line: 494, type: !994, isLocal: true, isDefinition: true)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_data", file: !978, line: 38, size: 32, elements: !995)
!995 = !{!996}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !994, file: !978, line: 39, baseType: !121, size: 32)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_21", scope: !890, file: !978, line: 494, type: !999, isLocal: true, isDefinition: true)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !704, line: 60, size: 64, elements: !1001)
!1001 = !{!1002, !1010}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !1000, file: !704, line: 69, baseType: !1003, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !704, line: 50, size: 64, elements: !1006)
