; ModuleID = './build/sd_read_write_data_dma.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GPT_REGISTER_GLOABL_T = type { i32, i32, i32 }
%struct.gpt_context_t = type { i32, %struct.gpt_callback_context_t, i8, i8 }
%struct.gpt_callback_context_t = type { void (i8*)*, i8* }
%struct.gpt_sw_context_t = type { [32 x %struct.gpt_sw_timer_t], i32, i32, i32, i32, i8, i8, i8 }
%struct.gpt_sw_timer_t = type { %struct.gpt_callback_context_t, i32, i8, i8 }
%struct.GDMA_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PDMA_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32 }
%struct.VDMA_REGISTER_T = type { i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32 }
%struct.gdma_user_callback_t = type { void (i32, i8*)*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !2, file: !3, line: 51, type: !90, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !53, globals: !89, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!4 = !{!5, !17, !37, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 163, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!10 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!11 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!12 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!13 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!14 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!15 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!16 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 186, baseType: !18, size: 32, elements: !19)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!20 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!21 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!22 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!23 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!24 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!25 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!26 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!27 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!28 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!29 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!30 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!31 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!32 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!33 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!34 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!35 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!36 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 176, baseType: !18, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!40 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!41 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!42 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!43 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 98, baseType: !18, size: 32, elements: !46)
!45 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!46 = !{!47, !48, !49, !50, !51, !52}
!47 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!48 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!49 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!50 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!51 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!52 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!53 = !{!54, !88}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !56, line: 276, baseType: !57)
!56 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 260, size: 525312, elements: !58)
!58 = !{!59, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !78, !79, !83, !87}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !57, file: !56, line: 261, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !62, line: 48, baseType: !63)
!62 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !64, line: 79, baseType: !18)
!64 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !57, file: !56, line: 262, baseType: !60, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !57, file: !56, line: 263, baseType: !60, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !57, file: !56, line: 264, baseType: !60, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !57, file: !56, line: 265, baseType: !60, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !57, file: !56, line: 266, baseType: !60, size: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !57, file: !56, line: 267, baseType: !60, size: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !57, file: !56, line: 268, baseType: !60, size: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !57, file: !56, line: 269, baseType: !60, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !57, file: !56, line: 270, baseType: !60, size: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !57, file: !56, line: 271, baseType: !75, size: 32, offset: 320)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !57, file: !56, line: 272, baseType: !60, size: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !57, file: !56, line: 273, baseType: !80, size: 523904, offset: 384)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 16372)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !57, file: !56, line: 274, baseType: !84, size: 512, offset: 524288)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !57, file: !56, line: 275, baseType: !84, size: 512, offset: 524800)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!89 = !{!0}
!90 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !91)
!91 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "gpt_lock_sleep_name", scope: !94, file: !95, line: 46, type: !164, isLocal: true, isDefinition: true)
!94 = distinct !DICompileUnit(language: DW_LANG_C99, file: !95, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !96, retainedTypes: !150, globals: !155, splitDebugInlining: false, nameTableKind: None)
!95 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!96 = !{!97, !105, !115, !119, !123, !142, !146}
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 387, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!99 = !{!100, !101, !102, !103, !104}
!100 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!101 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!102 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!103 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!104 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 846, baseType: !18, size: 32, elements: !107)
!106 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!107 = !{!108, !109, !110, !111, !112, !113, !114}
!108 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!109 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!110 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!111 = !DIEnumerator(name: "HAL_GPT_3", value: 3)
!112 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!113 = !DIEnumerator(name: "HAL_GPT_5", value: 5)
!114 = !DIEnumerator(name: "HAL_GPT_MAX_PORT", value: 6)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 397, baseType: !18, size: 32, elements: !116)
!116 = !{!117, !118}
!117 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!118 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 857, baseType: !18, size: 32, elements: !120)
!120 = !{!121, !122}
!121 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!122 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 87, baseType: !18, size: 32, elements: !125)
!124 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_gpt_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!126 = !DIEnumerator(name: "GPT_DIVIDE_1", value: 0)
!127 = !DIEnumerator(name: "GPT_DIVIDE_2", value: 1)
!128 = !DIEnumerator(name: "GPT_DIVIDE_3", value: 2)
!129 = !DIEnumerator(name: "GPT_DIVIDE_4", value: 3)
!130 = !DIEnumerator(name: "GPT_DIVIDE_5", value: 4)
!131 = !DIEnumerator(name: "GPT_DIVIDE_6", value: 5)
!132 = !DIEnumerator(name: "GPT_DIVIDE_7", value: 6)
!133 = !DIEnumerator(name: "GPT_DIVIDE_8", value: 7)
!134 = !DIEnumerator(name: "GPT_DIVIDE_9", value: 8)
!135 = !DIEnumerator(name: "GPT_DIVIDE_10", value: 9)
!136 = !DIEnumerator(name: "GPT_DIVIDE_11", value: 10)
!137 = !DIEnumerator(name: "GPT_DIVIDE_12", value: 11)
!138 = !DIEnumerator(name: "GPT_DIVIDE_13", value: 12)
!139 = !DIEnumerator(name: "GPT_DIVIDE_16", value: 13)
!140 = !DIEnumerator(name: "GPT_DIVIDE_32", value: 14)
!141 = !DIEnumerator(name: "GPT_DIVIDE_64", value: 15)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 380, baseType: !18, size: 32, elements: !143)
!143 = !{!144, !145}
!144 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!145 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 82, baseType: !18, size: 32, elements: !147)
!147 = !{!148, !149}
!148 = !DIEnumerator(name: "GPT_CLOCK_UNGATE", value: 0)
!149 = !DIEnumerator(name: "GPT_CLOCK_GATE", value: 64)
!150 = !{!61, !88, !151}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !98, line: 371, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !88}
!155 = !{!156, !92}
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "gpt_lock_sleep_handle", scope: !94, file: !95, line: 47, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 48, elements: !162)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !62, line: 24, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !64, line: 43, baseType: !161)
!161 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!162 = !{!163}
!163 = !DISubrange(count: 6)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 192, elements: !162)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "gp_gpt", scope: !170, file: !171, line: 48, type: !387, isLocal: false, isDefinition: true)
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !172, retainedTypes: !315, globals: !330, splitDebugInlining: false, nameTableKind: None)
!171 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!172 = !{!173, !146, !232, !238, !105, !142, !115}
!173 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 1170, baseType: !18, size: 32, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!175 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_26M", value: 9)
!176 = !DIEnumerator(name: "HAL_CLOCK_CG_CAMINF48M", value: 10)
!177 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_BUSCK", value: 13)
!178 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_N9", value: 15)
!179 = !DIEnumerator(name: "HAL_CLOCK_CG_BUS", value: 20)
!180 = !DIEnumerator(name: "HAL_CLOCK_CG_CM", value: 21)
!181 = !DIEnumerator(name: "HAL_CLOCK_CG_BSI", value: 23)
!182 = !DIEnumerator(name: "HAL_CLOCK_CG_SEJ", value: 32)
!183 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA", value: 33)
!184 = !DIEnumerator(name: "HAL_CLOCK_CG_USB48M", value: 34)
!185 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC0", value: 35)
!186 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C_D2D", value: 38)
!187 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C2", value: 39)
!188 = !DIEnumerator(name: "HAL_CLOCK_CG_CM4_OSTIMER", value: 42)
!189 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA_AO", value: 44)
!190 = !DIEnumerator(name: "HAL_CLOCK_CG_UART0", value: 45)
!191 = !DIEnumerator(name: "HAL_CLOCK_CG_UART1", value: 46)
!192 = !DIEnumerator(name: "HAL_CLOCK_CG_UART2", value: 47)
!193 = !DIEnumerator(name: "HAL_CLOCK_CG_UART3", value: 48)
!194 = !DIEnumerator(name: "HAL_CLOCK_CG_SPISLV", value: 51)
!195 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI0", value: 52)
!196 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI1", value: 53)
!197 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI2", value: 54)
!198 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI3", value: 55)
!199 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM0", value: 64)
!200 = !DIEnumerator(name: "HAL_CLOCK_CG_BTIF", value: 65)
!201 = !DIEnumerator(name: "HAL_CLOCK_CG_GPTIMER", value: 66)
!202 = !DIEnumerator(name: "HAL_CLOCK_CG_GPCOUNTER", value: 67)
!203 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM1", value: 68)
!204 = !DIEnumerator(name: "HAL_CLOCK_CG_EFUSE", value: 70)
!205 = !DIEnumerator(name: "HAL_CLOCK_CG_LPM", value: 71)
!206 = !DIEnumerator(name: "HAL_CLOCK_CG_CM_SYSROM", value: 72)
!207 = !DIEnumerator(name: "HAL_CLOCK_CG_SFC", value: 73)
!208 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC1", value: 74)
!209 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_DMA", value: 76)
!210 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_BUS", value: 77)
!211 = !DIEnumerator(name: "HAL_CLOCK_CG_DISP_PWM", value: 78)
!212 = !DIEnumerator(name: "HAL_CLOCK_CG_TRNG", value: 80)
!213 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM2", value: 83)
!214 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM3", value: 84)
!215 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM4", value: 85)
!216 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM5", value: 86)
!217 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD", value: 96)
!218 = !DIEnumerator(name: "HAL_CLOCK_CG_RESEIZER", value: 97)
!219 = !DIEnumerator(name: "HAL_CLOCK_CG_ROTDMA", value: 98)
!220 = !DIEnumerator(name: "HAL_CLOCK_CG_CAM_BCLK", value: 99)
!221 = !DIEnumerator(name: "HAL_CLOCK_CG_PAD2CAM", value: 100)
!222 = !DIEnumerator(name: "HAL_CLOCK_CG_G2D", value: 101)
!223 = !DIEnumerator(name: "HAL_CLOCK_CG_MM_COLOR", value: 102)
!224 = !DIEnumerator(name: "HAL_CLOCK_CG_AAL", value: 103)
!225 = !DIEnumerator(name: "HAL_CLOCK_CG_DSI0", value: 104)
!226 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD_APB", value: 105)
!227 = !DIEnumerator(name: "HAL_CLOCK_CG_AUXADC", value: 130)
!228 = !DIEnumerator(name: "HAL_CLOCK_CG_GPDAC", value: 134)
!229 = !DIEnumerator(name: "HAL_CLOCK_CG_SENSOR_DMA", value: 136)
!230 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C1", value: 137)
!231 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C0", value: 138)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 75, baseType: !18, size: 32, elements: !233)
!233 = !{!234, !235, !236, !237}
!234 = !DIEnumerator(name: "GPT_MODE_ONE_SHOT", value: 0)
!235 = !DIEnumerator(name: "GPT_MODE_REPEAT", value: 16)
!236 = !DIEnumerator(name: "GPT_MODE_KEEP_GO", value: 32)
!237 = !DIEnumerator(name: "GPT_MODE_FREE_RUN", value: 48)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !56, line: 44, baseType: !7, size: 32, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!240 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!241 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!242 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!243 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!244 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!245 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!246 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!247 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!248 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!249 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!250 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!251 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!252 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!253 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!254 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!255 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!256 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!257 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!258 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!259 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!260 = !DIEnumerator(name: "KP_IRQn", value: 10)
!261 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!262 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!263 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!264 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!265 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!266 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!267 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!268 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!269 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!270 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!271 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!272 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!273 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!274 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!275 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!276 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!277 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!278 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!279 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!280 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!281 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!282 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!283 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!284 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!285 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!286 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!287 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!288 = !DIEnumerator(name: "SF_IRQn", value: 38)
!289 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!290 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!291 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!292 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!293 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!294 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!295 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!296 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!297 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!298 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!299 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!300 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!301 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!302 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!303 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!304 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!305 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!306 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!307 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!308 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!309 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!310 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!311 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!312 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!313 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!314 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!315 = !{!61, !316, !88}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_T", file: !56, line: 1272, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1262, size: 288, elements: !319)
!319 = !{!320, !321, !322, !323, !325, !326, !327, !328, !329}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !318, file: !56, line: 1263, baseType: !60, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !318, file: !56, line: 1264, baseType: !60, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !318, file: !56, line: 1265, baseType: !60, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !318, file: !56, line: 1266, baseType: !324, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !318, file: !56, line: 1267, baseType: !60, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !318, file: !56, line: 1268, baseType: !60, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !318, file: !56, line: 1269, baseType: !60, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !318, file: !56, line: 1270, baseType: !60, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !318, file: !56, line: 1271, baseType: !60, size: 32, offset: 256)
!330 = !{!168, !331, !340, !346, !362, !385}
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "gp_gpt_glb", scope: !170, file: !171, line: 49, type: !333, isLocal: false, isDefinition: true)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_GLOABL_T", file: !56, line: 1260, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1256, size: 96, elements: !336)
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQSTA", scope: !335, file: !56, line: 1257, baseType: !324, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK0", scope: !335, file: !56, line: 1258, baseType: !60, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK1", scope: !335, file: !56, line: 1259, baseType: !60, size: 32, offset: 64)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "flag", scope: !342, file: !171, line: 88, type: !91, isLocal: true, isDefinition: true)
!342 = distinct !DISubprogram(name: "gpt_get_lfosc_clock", scope: !171, file: !171, line: 86, type: !343, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !170, retainedNodes: !345)
!343 = !DISubroutineType(types: !344)
!344 = !{null}
!345 = !{}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !170, file: !171, line: 51, type: !348, isLocal: false, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 768, elements: !162)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_context_t", file: !124, line: 116, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 111, size: 128, elements: !351)
!351 = !{!352, !354, !360, !361}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !350, file: !124, line: 112, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !98, line: 400, baseType: !115)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !350, file: !124, line: 113, baseType: !355, size: 64, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_callback_context_t", file: !124, line: 109, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 106, size: 64, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !356, file: !124, line: 107, baseType: !151, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !356, file: !124, line: 108, baseType: !88, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "has_initilized", scope: !350, file: !124, line: 114, baseType: !91, size: 8, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "is_gpt_locked_sleep", scope: !350, file: !124, line: 115, baseType: !91, size: 8, offset: 104)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "gpt_sw_context", scope: !170, file: !171, line: 52, type: !364, isLocal: false, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_context_t", file: !124, line: 134, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 125, size: 4256, elements: !366)
!366 = !{!367, !378, !379, !380, !381, !382, !383, !384}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !365, file: !124, line: 126, baseType: !368, size: 4096)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 4096, elements: !376)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_timer_t", file: !124, line: 123, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 118, size: 128, elements: !371)
!371 = !{!372, !373, !374, !375}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !370, file: !124, line: 119, baseType: !355, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "time_out_ms", scope: !370, file: !124, line: 120, baseType: !61, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !370, file: !124, line: 121, baseType: !91, size: 8, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !370, file: !124, line: 122, baseType: !91, size: 8, offset: 104)
!376 = !{!377}
!377 = !DISubrange(count: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_time", scope: !365, file: !124, line: 127, baseType: !61, size: 32, offset: 4096)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "last_absolute_time", scope: !365, file: !124, line: 128, baseType: !61, size: 32, offset: 4128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "used_timer_count", scope: !365, file: !124, line: 129, baseType: !61, size: 32, offset: 4160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "running_timer_count", scope: !365, file: !124, line: 130, baseType: !61, size: 32, offset: 4192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_init", scope: !365, file: !124, line: 131, baseType: !91, size: 8, offset: 4224)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "is_start_from_isr", scope: !365, file: !124, line: 132, baseType: !91, size: 8, offset: 4232)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "is_sw_gpt", scope: !365, file: !124, line: 133, baseType: !91, size: 8, offset: 4240)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "gpt_clock_source", scope: !170, file: !171, line: 53, type: !61, isLocal: false, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 192, elements: !162)
!388 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "gdma", scope: !391, file: !392, line: 46, type: !616, isLocal: false, isDefinition: true)
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !393, retainedTypes: !470, globals: !471, splitDebugInlining: false, nameTableKind: None)
!392 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_pdma_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!393 = !{!394, !399, !404, !173, !411, !417, !238, !427, !432, !438, !442, !446, !452, !466}
!394 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !395, line: 201, baseType: !7, size: 32, elements: !396)
!395 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gdma.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!396 = !{!397, !398}
!397 = !DIEnumerator(name: "HAL_GDMA_EVENT_TRANSACTION_ERROR", value: -1)
!398 = !DIEnumerator(name: "HAL_GDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !400, line: 124, baseType: !18, size: 32, elements: !401)
!400 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!401 = !{!402, !403}
!402 = !DIEnumerator(name: "DMA_PD", value: 0)
!403 = !DIEnumerator(name: "DMA_AO", value: 1)
!404 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !405, line: 101, baseType: !7, size: 32, elements: !406)
!405 = !DIFile(filename: "../../../../../driver/chip/inc/hal_clock.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!406 = !{!407, !408, !409, !410}
!407 = !DIEnumerator(name: "HAL_CLOCK_STATUS_UNINITIALIZED", value: -3)
!408 = !DIEnumerator(name: "HAL_CLOCK_STATUS_INVALID_PARAMETER", value: -2)
!409 = !DIEnumerator(name: "HAL_CLOCK_STATUS_ERROR", value: -1)
!410 = !DIEnumerator(name: "HAL_CLOCK_STATUS_OK", value: 0)
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !400, line: 166, baseType: !7, size: 32, elements: !412)
!412 = !{!413, !414, !415, !416}
!413 = !DIEnumerator(name: "PDMA_ERROR", value: -3)
!414 = !DIEnumerator(name: "PDMA_ERROR_CHANNEL", value: -2)
!415 = !DIEnumerator(name: "PDMA_INVALID_PARAMETER", value: -1)
!416 = !DIEnumerator(name: "PDMA_OK", value: 0)
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !400, line: 137, baseType: !18, size: 32, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426}
!419 = !DIEnumerator(name: "PDMA_START_CHANNEL", value: 1)
!420 = !DIEnumerator(name: "PDMA_MSDC1", value: 1)
!421 = !DIEnumerator(name: "PDMA_MSDC2", value: 2)
!422 = !DIEnumerator(name: "PDMA_I2C0_TX", value: 3)
!423 = !DIEnumerator(name: "PDMA_I2C0_RX", value: 4)
!424 = !DIEnumerator(name: "PDMA_I2C1_TX", value: 5)
!425 = !DIEnumerator(name: "PDMA_I2C1_RX", value: 6)
!426 = !DIEnumerator(name: "PDMA_END_CHANNEL", value: 7)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !400, line: 151, baseType: !18, size: 32, elements: !428)
!428 = !{!429, !430, !431}
!429 = !DIEnumerator(name: "PDMA_BYTE", value: 0)
!430 = !DIEnumerator(name: "PDMA_HALF_WORD", value: 1)
!431 = !DIEnumerator(name: "PDMA_WORD", value: 2)
!432 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !400, line: 180, baseType: !18, size: 32, elements: !433)
!433 = !{!434, !435, !436, !437}
!434 = !DIEnumerator(name: "PDMA_TX", value: 0)
!435 = !DIEnumerator(name: "PDMA_RX", value: 1)
!436 = !DIEnumerator(name: "PDMA_TX_RINGBUFF", value: 2)
!437 = !DIEnumerator(name: "PDMA_RX_RINGBUFF", value: 3)
!438 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !400, line: 174, baseType: !18, size: 32, elements: !439)
!439 = !{!440, !441}
!440 = !DIEnumerator(name: "PDMA_IDLE", value: 0)
!441 = !DIEnumerator(name: "PDMA_BUSY", value: 1)
!442 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !400, line: 159, baseType: !7, size: 32, elements: !443)
!443 = !{!444, !445}
!444 = !DIEnumerator(name: "PDMA_EVENT_TRANSACTION_ERROR", value: -1)
!445 = !DIEnumerator(name: "PDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !400, line: 206, baseType: !7, size: 32, elements: !447)
!447 = !{!448, !449, !450, !451}
!448 = !DIEnumerator(name: "VDMA_ERROR", value: -3)
!449 = !DIEnumerator(name: "VDMA_ERROR_CHANNEL", value: -2)
!450 = !DIEnumerator(name: "VDMA_INVALID_PARAMETER", value: -1)
!451 = !DIEnumerator(name: "VDMA_OK", value: 0)
!452 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !400, line: 189, baseType: !18, size: 32, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!454 = !DIEnumerator(name: "VDMA_START_CHANNEL", value: 8)
!455 = !DIEnumerator(name: "VDMA_UART1TX", value: 8)
!456 = !DIEnumerator(name: "VDMA_UART1RX", value: 9)
!457 = !DIEnumerator(name: "VDMA_UART2TX", value: 10)
!458 = !DIEnumerator(name: "VDMA_UART2RX", value: 11)
!459 = !DIEnumerator(name: "VDMA_UART3TX", value: 12)
!460 = !DIEnumerator(name: "VDMA_UART3RX", value: 13)
!461 = !DIEnumerator(name: "VDMA_UART0TX", value: 14)
!462 = !DIEnumerator(name: "VDMA_UART0RX", value: 15)
!463 = !DIEnumerator(name: "VDMA_BTIFTX", value: 16)
!464 = !DIEnumerator(name: "VDMA_BTIFRX", value: 17)
!465 = !DIEnumerator(name: "VDMA_END_CHANNEL", value: 18)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !400, line: 222, baseType: !7, size: 32, elements: !467)
!467 = !{!468, !469}
!468 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_ERROR", value: -1)
!469 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!470 = !{!88}
!471 = !{!389, !472, !480, !498, !506, !508, !533, !541, !549, !552, !565, !589, !595, !603, !608}
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "gdma_global", scope: !391, file: !392, line: 49, type: !474, isLocal: false, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 32, elements: !76)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDMA_REGISTER_GLOBAL_T", file: !56, line: 843, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 841, size: 32, elements: !478)
!478 = !{!479}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_GLBSTA", scope: !477, file: !56, line: 842, baseType: !60, size: 32)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "pdma", scope: !391, file: !392, line: 52, type: !482, isLocal: false, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 192, elements: !162)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDMA_REGISTER_T", file: !56, line: 859, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 848, size: 320, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !497}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_WPPT", scope: !485, file: !56, line: 849, baseType: !60, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_WPTO", scope: !485, file: !56, line: 850, baseType: !60, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_COUNT", scope: !485, file: !56, line: 851, baseType: !60, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_CON", scope: !485, file: !56, line: 852, baseType: !60, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_START", scope: !485, file: !56, line: 853, baseType: !60, size: 32, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_INTSTA", scope: !485, file: !56, line: 854, baseType: !60, size: 32, offset: 160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_ACKINT", scope: !485, file: !56, line: 855, baseType: !60, size: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_RLCT", scope: !485, file: !56, line: 856, baseType: !324, size: 32, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "DUMMY_OFFSET", scope: !485, file: !56, line: 857, baseType: !496, size: 32, offset: 256)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, elements: !76)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_PGMADDR", scope: !485, file: !56, line: 858, baseType: !60, size: 32, offset: 288)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "pdma_global", scope: !391, file: !392, line: 55, type: !500, isLocal: false, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 192, elements: !162)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PDMA_REGISTER_GLOBAL_T", file: !56, line: 865, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 863, size: 32, elements: !504)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "PDMA_GLBSTA", scope: !503, file: !56, line: 864, baseType: !60, size: 32)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "g_pdma_global_running_bit", scope: !391, file: !392, line: 58, type: !158, isLocal: false, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "vdma", scope: !391, file: !392, line: 64, type: !510, isLocal: false, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 320, elements: !531)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "VDMA_REGISTER_T", file: !56, line: 885, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 870, size: 448, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !524, !525, !526, !527, !528, !529, !530}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_COUNT", scope: !513, file: !56, line: 871, baseType: !60, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_CON", scope: !513, file: !56, line: 872, baseType: !60, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_START", scope: !513, file: !56, line: 873, baseType: !60, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_INTSTA", scope: !513, file: !56, line: 874, baseType: !60, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_ACKINT", scope: !513, file: !56, line: 875, baseType: !60, size: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "DUMMY_OFFSET", scope: !513, file: !56, line: 876, baseType: !521, size: 64, offset: 160)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 2)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_PGMADDR", scope: !513, file: !56, line: 877, baseType: !60, size: 32, offset: 224)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_WRPTR", scope: !513, file: !56, line: 878, baseType: !324, size: 32, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_RDPTR", scope: !513, file: !56, line: 879, baseType: !324, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_FFCNT", scope: !513, file: !56, line: 880, baseType: !324, size: 32, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_FFSTA", scope: !513, file: !56, line: 881, baseType: !324, size: 32, offset: 352)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_ALTLEN", scope: !513, file: !56, line: 882, baseType: !60, size: 32, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_FFSIZE", scope: !513, file: !56, line: 883, baseType: !60, size: 32, offset: 416)
!531 = !{!532}
!532 = !DISubrange(count: 10)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "vdma_port", scope: !391, file: !392, line: 69, type: !535, isLocal: false, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 320, elements: !531)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "VDMA_REGISTER_PORT_T", file: !56, line: 891, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 889, size: 32, elements: !539)
!539 = !{!540}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_PORT", scope: !538, file: !56, line: 890, baseType: !60, size: 32)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "vdma_global", scope: !391, file: !392, line: 75, type: !543, isLocal: false, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 320, elements: !531)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "VDMA_REGISTER_GLOBAL_T", file: !56, line: 898, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 896, size: 32, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "VDMA_GLBSTA", scope: !546, file: !56, line: 897, baseType: !60, size: 32)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "g_vdma_global_running_bit", scope: !391, file: !392, line: 80, type: !551, isLocal: false, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 80, elements: !531)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "g_gdma_callback", scope: !391, file: !392, line: 92, type: !554, isLocal: false, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 64, elements: !76)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdma_user_callback_t", file: !392, line: 89, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 86, size: 64, elements: !557)
!557 = !{!558, !564}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !556, file: !392, line: 87, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gdma_callback_t", file: !395, line: 230, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !563, !88}
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gdma_event_t", file: !395, line: 204, baseType: !394)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !556, file: !392, line: 88, baseType: !88, size: 32, offset: 32)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "count", scope: !567, file: !392, line: 1122, type: !61, isLocal: true, isDefinition: true)
!567 = distinct !DISubprogram(name: "pd_domain_dma_interrupt_hander", scope: !392, file: !392, line: 1108, type: !568, scopeLine: 1110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !391, retainedNodes: !572)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !570}
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !56, line: 125, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !56, line: 123, baseType: !238)
!572 = !{!573, !574, !575, !576, !582, !588}
!573 = !DILocalVariable(name: "irq_number", arg: 1, scope: !567, file: !392, line: 1108, type: !570)
!574 = !DILocalVariable(name: "global_status", scope: !567, file: !392, line: 1113, type: !60)
!575 = !DILocalVariable(name: "gdma_callback", scope: !567, file: !392, line: 1116, type: !559)
!576 = !DILocalVariable(name: "pdma_callback", scope: !567, file: !392, line: 1117, type: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_callback_t", file: !400, line: 288, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !581, !88}
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_event_t", file: !400, line: 162, baseType: !442)
!582 = !DILocalVariable(name: "vdma_callback", scope: !567, file: !392, line: 1118, type: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "vdma_callback_t", file: !400, line: 291, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !587, !88}
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "vdma_event_t", file: !400, line: 225, baseType: !466)
!588 = !DILocalVariable(name: "argument", scope: !567, file: !392, line: 1119, type: !88)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "pdma_init_status", scope: !391, file: !392, line: 61, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 56, elements: !593)
!592 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !159)
!593 = !{!594}
!594 = !DISubrange(count: 7)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "g_pdma_callback", scope: !391, file: !392, line: 104, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 384, elements: !162)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_user_callback_t", file: !392, line: 101, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 98, size: 64, elements: !600)
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !599, file: !392, line: 99, baseType: !577, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !599, file: !392, line: 100, baseType: !88, size: 32, offset: 32)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "vdma_init_status", scope: !391, file: !392, line: 83, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 144, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 18)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "g_vdma_callback", scope: !391, file: !392, line: 120, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 640, elements: !531)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "vdma_user_callback_t", file: !392, line: 117, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 114, size: 64, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !612, file: !392, line: 115, baseType: !583, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !612, file: !392, line: 116, baseType: !88, size: 32, offset: 32)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 32, elements: !76)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDMA_REGISTER_T", file: !56, line: 837, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 826, size: 320, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_SRC", scope: !619, file: !56, line: 827, baseType: !60, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_DST", scope: !619, file: !56, line: 828, baseType: !60, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_WPPT", scope: !619, file: !56, line: 829, baseType: !60, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_WPTO", scope: !619, file: !56, line: 830, baseType: !60, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_COUNT", scope: !619, file: !56, line: 831, baseType: !60, size: 32, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_CON", scope: !619, file: !56, line: 832, baseType: !60, size: 32, offset: 160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_START", scope: !619, file: !56, line: 833, baseType: !60, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_INTSTA", scope: !619, file: !56, line: 834, baseType: !60, size: 32, offset: 224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_ACKINT", scope: !619, file: !56, line: 835, baseType: !60, size: 32, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "GDMA_RLCT", scope: !619, file: !56, line: 836, baseType: !324, size: 32, offset: 288)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "gpio_register_base", scope: !633, file: !634, line: 64, type: !734, isLocal: false, isDefinition: true)
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !634, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !729, globals: !733, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!635 = !{!636, !688, !695, !699, !705, !709, !718, !723}
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 339, baseType: !18, size: 32, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!638 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!639 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!640 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!641 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!642 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!643 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!644 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!645 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!646 = !DIEnumerator(name: "HAL_GPIO_8", value: 8)
!647 = !DIEnumerator(name: "HAL_GPIO_9", value: 9)
!648 = !DIEnumerator(name: "HAL_GPIO_10", value: 10)
!649 = !DIEnumerator(name: "HAL_GPIO_11", value: 11)
!650 = !DIEnumerator(name: "HAL_GPIO_12", value: 12)
!651 = !DIEnumerator(name: "HAL_GPIO_13", value: 13)
!652 = !DIEnumerator(name: "HAL_GPIO_14", value: 14)
!653 = !DIEnumerator(name: "HAL_GPIO_15", value: 15)
!654 = !DIEnumerator(name: "HAL_GPIO_16", value: 16)
!655 = !DIEnumerator(name: "HAL_GPIO_17", value: 17)
!656 = !DIEnumerator(name: "HAL_GPIO_18", value: 18)
!657 = !DIEnumerator(name: "HAL_GPIO_19", value: 19)
!658 = !DIEnumerator(name: "HAL_GPIO_20", value: 20)
!659 = !DIEnumerator(name: "HAL_GPIO_21", value: 21)
!660 = !DIEnumerator(name: "HAL_GPIO_22", value: 22)
!661 = !DIEnumerator(name: "HAL_GPIO_23", value: 23)
!662 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!663 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!664 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!665 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!666 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!667 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!668 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!669 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!670 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!671 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!672 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!673 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!674 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!675 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!676 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!677 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!678 = !DIEnumerator(name: "HAL_GPIO_40", value: 40)
!679 = !DIEnumerator(name: "HAL_GPIO_41", value: 41)
!680 = !DIEnumerator(name: "HAL_GPIO_42", value: 42)
!681 = !DIEnumerator(name: "HAL_GPIO_43", value: 43)
!682 = !DIEnumerator(name: "HAL_GPIO_44", value: 44)
!683 = !DIEnumerator(name: "HAL_GPIO_45", value: 45)
!684 = !DIEnumerator(name: "HAL_GPIO_46", value: 46)
!685 = !DIEnumerator(name: "HAL_GPIO_47", value: 47)
!686 = !DIEnumerator(name: "HAL_GPIO_48", value: 48)
!687 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 49)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 224, baseType: !7, size: 32, elements: !690)
!689 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!690 = !{!691, !692, !693, !694}
!691 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!692 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!693 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!694 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 210, baseType: !18, size: 32, elements: !696)
!696 = !{!697, !698}
!697 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!698 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 233, baseType: !7, size: 32, elements: !700)
!700 = !{!701, !702, !703, !704}
!701 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!702 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!703 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!704 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 217, baseType: !18, size: 32, elements: !706)
!706 = !{!707, !708}
!707 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!708 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!709 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 415, baseType: !18, size: 32, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716, !717}
!711 = !DIEnumerator(name: "HAL_GPIO_CLOCK_0", value: 0)
!712 = !DIEnumerator(name: "HAL_GPIO_CLOCK_1", value: 1)
!713 = !DIEnumerator(name: "HAL_GPIO_CLOCK_2", value: 2)
!714 = !DIEnumerator(name: "HAL_GPIO_CLOCK_3", value: 3)
!715 = !DIEnumerator(name: "HAL_GPIO_CLOCK_4", value: 4)
!716 = !DIEnumerator(name: "HAL_GPIO_CLOCK_5", value: 5)
!717 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MAX", value: 6)
!718 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 427, baseType: !18, size: 32, elements: !719)
!719 = !{!720, !721, !722}
!720 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_26M", value: 1)
!721 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_32K", value: 4)
!722 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_MAX", value: 5)
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 242, baseType: !18, size: 32, elements: !724)
!724 = !{!725, !726, !727, !728}
!725 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!726 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!727 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!728 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!729 = !{!88, !730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_direction_t", file: !689, line: 213, baseType: !695)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !689, line: 220, baseType: !705)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !689, line: 247, baseType: !723)
!733 = !{!631}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !56, line: 1554, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1522, size: 29440, elements: !737)
!737 = !{!738, !750, !754, !763, !764, !773, !774, !783, !784, !794, !795, !804, !805, !814, !815, !824, !825, !834, !838, !847, !848, !857, !858, !867, !876, !877, !886, !890, !899, !900}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !736, file: !56, line: 1523, baseType: !739, size: 256)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 256, elements: !522)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !56, line: 1400, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1395, size: 128, elements: !742)
!742 = !{!743, !744, !745, !746}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !741, file: !56, line: 1396, baseType: !60, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !741, file: !56, line: 1397, baseType: !60, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !741, file: !56, line: 1398, baseType: !60, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !741, file: !56, line: 1399, baseType: !747, size: 32, offset: 96)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 32, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 4)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !736, file: !56, line: 1524, baseType: !751, size: 1792, offset: 256)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 1792, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 224)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !736, file: !56, line: 1525, baseType: !755, size: 256, offset: 2048)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 256, elements: !522)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !56, line: 1409, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1404, size: 128, elements: !758)
!758 = !{!759, !760, !761, !762}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !757, file: !56, line: 1405, baseType: !60, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !757, file: !56, line: 1406, baseType: !60, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !757, file: !56, line: 1407, baseType: !60, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !757, file: !56, line: 1408, baseType: !747, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !736, file: !56, line: 1526, baseType: !751, size: 1792, offset: 2304)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !736, file: !56, line: 1527, baseType: !765, size: 256, offset: 4096)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 256, elements: !522)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !56, line: 1417, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1412, size: 128, elements: !768)
!768 = !{!769, !770, !771, !772}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !767, file: !56, line: 1413, baseType: !60, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !767, file: !56, line: 1414, baseType: !60, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !767, file: !56, line: 1415, baseType: !60, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !767, file: !56, line: 1416, baseType: !747, size: 32, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !736, file: !56, line: 1528, baseType: !751, size: 1792, offset: 4352)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !736, file: !56, line: 1529, baseType: !775, size: 256, offset: 6144)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 256, elements: !522)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !56, line: 1426, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1421, size: 128, elements: !778)
!778 = !{!779, !780, !781, !782}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !777, file: !56, line: 1422, baseType: !60, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !777, file: !56, line: 1423, baseType: !60, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !777, file: !56, line: 1424, baseType: !60, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !777, file: !56, line: 1425, baseType: !747, size: 32, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !736, file: !56, line: 1530, baseType: !751, size: 1792, offset: 6400)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !736, file: !56, line: 1531, baseType: !785, size: 256, offset: 8192)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 256, elements: !522)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !56, line: 1432, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1429, size: 128, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !787, file: !56, line: 1430, baseType: !60, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !787, file: !56, line: 1431, baseType: !791, size: 96, offset: 32)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 96, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 12)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !736, file: !56, line: 1532, baseType: !751, size: 1792, offset: 8448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !736, file: !56, line: 1533, baseType: !796, size: 256, offset: 10240)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 256, elements: !522)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !56, line: 1440, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1435, size: 128, elements: !799)
!799 = !{!800, !801, !802, !803}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !798, file: !56, line: 1436, baseType: !60, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !798, file: !56, line: 1437, baseType: !60, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !798, file: !56, line: 1438, baseType: !60, size: 32, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !798, file: !56, line: 1439, baseType: !747, size: 32, offset: 96)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !736, file: !56, line: 1534, baseType: !751, size: 1792, offset: 10496)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !736, file: !56, line: 1535, baseType: !806, size: 256, offset: 12288)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 256, elements: !522)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !56, line: 1448, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1443, size: 128, elements: !809)
!809 = !{!810, !811, !812, !813}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !808, file: !56, line: 1444, baseType: !60, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !808, file: !56, line: 1445, baseType: !60, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !808, file: !56, line: 1446, baseType: !60, size: 32, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !808, file: !56, line: 1447, baseType: !747, size: 32, offset: 96)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !736, file: !56, line: 1536, baseType: !751, size: 1792, offset: 12544)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !736, file: !56, line: 1537, baseType: !816, size: 256, offset: 14336)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 256, elements: !522)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !56, line: 1455, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1450, size: 128, elements: !819)
!819 = !{!820, !821, !822, !823}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !818, file: !56, line: 1451, baseType: !60, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !818, file: !56, line: 1452, baseType: !60, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !818, file: !56, line: 1453, baseType: !60, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !818, file: !56, line: 1454, baseType: !747, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !736, file: !56, line: 1538, baseType: !751, size: 1792, offset: 14592)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !736, file: !56, line: 1539, baseType: !826, size: 512, offset: 16384)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 512, elements: !748)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !56, line: 1463, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1458, size: 128, elements: !829)
!829 = !{!830, !831, !832, !833}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !828, file: !56, line: 1459, baseType: !60, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !828, file: !56, line: 1460, baseType: !60, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !828, file: !56, line: 1461, baseType: !60, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !828, file: !56, line: 1462, baseType: !747, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !736, file: !56, line: 1540, baseType: !835, size: 1536, offset: 16896)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 1536, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !736, file: !56, line: 1541, baseType: !839, size: 256, offset: 18432)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 256, elements: !522)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !56, line: 1471, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1466, size: 128, elements: !842)
!842 = !{!843, !844, !845, !846}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !841, file: !56, line: 1467, baseType: !60, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !841, file: !56, line: 1468, baseType: !60, size: 32, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !841, file: !56, line: 1469, baseType: !60, size: 32, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !841, file: !56, line: 1470, baseType: !747, size: 32, offset: 96)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !736, file: !56, line: 1542, baseType: !751, size: 1792, offset: 18688)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !736, file: !56, line: 1543, baseType: !849, size: 256, offset: 20480)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 256, elements: !522)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !56, line: 1480, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1475, size: 128, elements: !852)
!852 = !{!853, !854, !855, !856}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !851, file: !56, line: 1476, baseType: !60, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !851, file: !56, line: 1477, baseType: !60, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !851, file: !56, line: 1478, baseType: !60, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !851, file: !56, line: 1479, baseType: !747, size: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !736, file: !56, line: 1544, baseType: !751, size: 1792, offset: 20736)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !736, file: !56, line: 1545, baseType: !859, size: 256, offset: 22528)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !860, size: 256, elements: !522)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !56, line: 1489, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1484, size: 128, elements: !862)
!862 = !{!863, !864, !865, !866}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !861, file: !56, line: 1485, baseType: !60, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !861, file: !56, line: 1486, baseType: !60, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !861, file: !56, line: 1487, baseType: !60, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !861, file: !56, line: 1488, baseType: !747, size: 32, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !736, file: !56, line: 1546, baseType: !868, size: 256, offset: 22784)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !869, size: 256, elements: !522)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !56, line: 1497, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1492, size: 128, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !870, file: !56, line: 1493, baseType: !60, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !870, file: !56, line: 1494, baseType: !60, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !870, file: !56, line: 1495, baseType: !60, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !870, file: !56, line: 1496, baseType: !747, size: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !736, file: !56, line: 1547, baseType: !835, size: 1536, offset: 23040)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !736, file: !56, line: 1548, baseType: !878, size: 896, offset: 24576)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !879, size: 896, elements: !593)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !56, line: 1505, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1500, size: 128, elements: !881)
!881 = !{!882, !883, !884, !885}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !880, file: !56, line: 1501, baseType: !60, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !880, file: !56, line: 1502, baseType: !60, size: 32, offset: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !880, file: !56, line: 1503, baseType: !60, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !880, file: !56, line: 1504, baseType: !747, size: 32, offset: 96)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !736, file: !56, line: 1549, baseType: !887, size: 1152, offset: 25472)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 1152, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 144)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !736, file: !56, line: 1550, baseType: !891, size: 512, offset: 26624)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !892, size: 512, elements: !748)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !56, line: 1513, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1508, size: 128, elements: !894)
!894 = !{!895, !896, !897, !898}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !893, file: !56, line: 1509, baseType: !60, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !893, file: !56, line: 1510, baseType: !60, size: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !893, file: !56, line: 1511, baseType: !60, size: 32, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !893, file: !56, line: 1512, baseType: !747, size: 32, offset: 96)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !736, file: !56, line: 1551, baseType: !835, size: 1536, offset: 27136)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !736, file: !56, line: 1552, baseType: !901, size: 768, offset: 28672)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 768, elements: !162)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !56, line: 1519, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1516, size: 128, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !903, file: !56, line: 1517, baseType: !60, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !903, file: !56, line: 1518, baseType: !791, size: 96, offset: 32)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "g_uart_hwstatus", scope: !909, file: !910, line: 101, type: !1070, isLocal: true, isDefinition: true)
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !911, retainedTypes: !981, globals: !991, splitDebugInlining: false, nameTableKind: None)
!910 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!911 = !{!912, !452, !919, !446, !925, !930, !935, !942, !958, !964, !968, !404, !973, !466}
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 180, baseType: !18, size: 32, elements: !913)
!913 = !{!914, !915, !916, !917, !918}
!914 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!915 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!916 = !DIEnumerator(name: "HAL_UART_2", value: 2)
!917 = !DIEnumerator(name: "HAL_UART_3", value: 3)
!918 = !DIEnumerator(name: "HAL_UART_MAX", value: 4)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !920, line: 355, baseType: !7, size: 32, elements: !921)
!920 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!921 = !{!922, !923, !924}
!922 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!923 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!924 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !910, line: 65, baseType: !18, size: 32, elements: !926)
!926 = !{!927, !928, !929}
!927 = !DIEnumerator(name: "UART_HWSTATUS_UNINITIALIZED", value: 0)
!928 = !DIEnumerator(name: "UART_HWSTATUS_POLL_INITIALIZED", value: 1)
!929 = !DIEnumerator(name: "UART_HWSTATUS_DMA_INITIALIZED", value: 2)
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !910, line: 77, baseType: !18, size: 32, elements: !931)
!931 = !{!932, !933, !934}
!932 = !DIEnumerator(name: "UART_FLOWCONTROL_NONE", value: 0)
!933 = !DIEnumerator(name: "UART_FLOWCONTROL_SOFTWARE", value: 1)
!934 = !DIEnumerator(name: "UART_FLOWCONTROL_HARDWARE", value: 2)
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !920, line: 345, baseType: !7, size: 32, elements: !936)
!936 = !{!937, !938, !939, !940, !941}
!937 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!938 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!939 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!940 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!941 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!942 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !920, line: 302, baseType: !18, size: 32, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957}
!944 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!945 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!946 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!947 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!948 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!949 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!950 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!951 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!952 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!953 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!954 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!955 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!956 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!957 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!958 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !920, line: 321, baseType: !18, size: 32, elements: !959)
!959 = !{!960, !961, !962, !963}
!960 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!961 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!962 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!963 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!964 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !920, line: 330, baseType: !18, size: 32, elements: !965)
!965 = !{!966, !967}
!966 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!967 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!968 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !920, line: 337, baseType: !18, size: 32, elements: !969)
!969 = !{!970, !971, !972}
!970 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!971 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!972 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!973 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !974, line: 152, baseType: !7, size: 32, elements: !975)
!974 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!975 = !{!976, !977, !978, !979, !980}
!976 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!977 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!978 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!979 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!980 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!981 = !{!88, !982, !61, !983}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_dma_callback_data_t", file: !985, line: 96, baseType: !986)
!985 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_uart_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !985, line: 93, size: 64, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "is_rx", scope: !986, file: !985, line: 94, baseType: !91, size: 8)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "uart_port", scope: !986, file: !985, line: 95, baseType: !990, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !106, line: 186, baseType: !912)
!991 = !{!992, !995, !997, !999, !1001, !1005, !1014, !1028, !907, !1030, !1043, !1048, !1062, !1068}
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "g_uart_frist_send_complete_interrupt", scope: !909, file: !910, line: 92, type: !994, isLocal: true, isDefinition: true)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !748)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "g_uart_restore_init", scope: !909, file: !910, line: 93, type: !91, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "g_uart_send_lock_status", scope: !909, file: !910, line: 94, type: !994, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler", scope: !909, file: !910, line: 95, type: !747, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "g_uart_flowcontrol_status", scope: !909, file: !910, line: 96, type: !1003, isLocal: true, isDefinition: true)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1004, size: 128, elements: !748)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_flowcontrol_t", file: !910, line: 81, baseType: !930)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "g_uart_sw_flowcontrol_config", scope: !909, file: !910, line: 97, type: !1007, isLocal: true, isDefinition: true)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 96, elements: !748)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_sw_flowcontrol_config_t", file: !910, line: 87, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !910, line: 83, size: 24, elements: !1010)
!1010 = !{!1011, !1012, !1013}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "xon", scope: !1009, file: !910, line: 84, baseType: !159, size: 8)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !1009, file: !910, line: 85, baseType: !159, size: 8, offset: 8)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "escape_character", scope: !1009, file: !910, line: 86, baseType: !159, size: 8, offset: 16)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "g_uart_config", scope: !909, file: !910, line: 98, type: !1016, isLocal: true, isDefinition: true)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 512, elements: !748)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !920, line: 378, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !920, line: 373, size: 128, elements: !1019)
!1019 = !{!1020, !1022, !1024, !1026}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1018, file: !920, line: 374, baseType: !1021, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !920, line: 317, baseType: !942)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !1018, file: !920, line: 375, baseType: !1023, size: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !920, line: 326, baseType: !958)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !1018, file: !920, line: 376, baseType: !1025, size: 32, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !920, line: 333, baseType: !964)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1018, file: !920, line: 377, baseType: !1027, size: 32, offset: 96)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !920, line: 341, baseType: !968)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(name: "g_uart_irq_pending_status", scope: !909, file: !910, line: 99, type: !994, isLocal: true, isDefinition: true)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "g_uart_callback", scope: !909, file: !910, line: 102, type: !1032, isLocal: true, isDefinition: true)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 256, elements: !748)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_callback_t", file: !910, line: 74, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !910, line: 71, size: 64, elements: !1035)
!1035 = !{!1036, !1042}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1034, file: !910, line: 72, baseType: !1037, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !920, line: 410, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !1041, !88}
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !920, line: 359, baseType: !919)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1034, file: !910, line: 73, baseType: !88, size: 32, offset: 32)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "g_uart_dma_callback_data", scope: !909, file: !910, line: 103, type: !1045, isLocal: true, isDefinition: true)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 512, elements: !1046)
!1046 = !{!1047}
!1047 = !DISubrange(count: 8)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "g_uart_dma_config", scope: !909, file: !910, line: 104, type: !1050, isLocal: true, isDefinition: true)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 896, elements: !748)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !920, line: 390, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !920, line: 382, size: 224, elements: !1053)
!1053 = !{!1054, !1056, !1057, !1058, !1059, !1060, !1061}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !1052, file: !920, line: 383, baseType: !1055, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !1052, file: !920, line: 384, baseType: !61, size: 32, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !1052, file: !920, line: 385, baseType: !61, size: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !1052, file: !920, line: 386, baseType: !1055, size: 32, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !1052, file: !920, line: 387, baseType: !61, size: 32, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !1052, file: !920, line: 388, baseType: !61, size: 32, offset: 160)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !1052, file: !920, line: 389, baseType: !61, size: 32, offset: 192)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(name: "g_uart_baudrate_map", scope: !909, file: !910, line: 105, type: !1064, isLocal: true, isDefinition: true)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 416, elements: !1066)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!1066 = !{!1067}
!1067 = !DISubrange(count: 13)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(name: "g_uart_global_data_initialized", scope: !909, file: !910, line: 90, type: !91, isLocal: true, isDefinition: true)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1071, size: 128, elements: !748)
!1071 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_hwstatus_t", file: !910, line: 69, baseType: !925)
!1073 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1074 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "g_uart_regbase", scope: !1077, file: !1078, line: 53, type: !1160, isLocal: false, isDefinition: true)
!1077 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1078, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1079, retainedTypes: !1090, globals: !1146, splitDebugInlining: false, nameTableKind: None)
!1078 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart_internal_platform.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/sd_read_write_data_dma/GCC")
!1079 = !{!173, !238, !452, !912, !1080}
!1080 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !985, line: 46, baseType: !18, size: 32, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!1082 = !DIEnumerator(name: "UART_INTERRUPT_NONE", value: 0)
!1083 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_ERROR", value: 1)
!1084 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_TIMEOUT", value: 2)
!1085 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_BREAK", value: 3)
!1086 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_AVAILABLE", value: 4)
!1087 = !DIEnumerator(name: "UART_INTERRUPT_SEND_AVAILABLE", value: 5)
!1088 = !DIEnumerator(name: "UART_INTERRUPT_SOFTWARE_FLOWCONTROL", value: 6)
!1089 = !DIEnumerator(name: "UART_INTERRUPT_HARDWARE_FLOWCONTROL", value: 7)
!1090 = !{!1091}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 32)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_REGISTER_T", file: !56, line: 588, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 542, size: 800, elements: !1094)
!1094 = !{!1095, !1101, !1106, !1112, !1113, !1118, !1123, !1124, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "RBR_THR_DLL", scope: !1093, file: !56, line: 547, baseType: !1096, size: 32)
!1096 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1093, file: !56, line: 543, size: 32, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "RBR", scope: !1096, file: !56, line: 544, baseType: !324, size: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "THR", scope: !1096, file: !56, line: 545, baseType: !60, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "DLL", scope: !1096, file: !56, line: 546, baseType: !60, size: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "IER_DLM", scope: !1093, file: !56, line: 551, baseType: !1102, size: 32, offset: 32)
!1102 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1093, file: !56, line: 548, size: 32, elements: !1103)
!1103 = !{!1104, !1105}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !1102, file: !56, line: 549, baseType: !60, size: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "DLM", scope: !1102, file: !56, line: 550, baseType: !60, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "IIR_FCR_EFR", scope: !1093, file: !56, line: 556, baseType: !1107, size: 32, offset: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1093, file: !56, line: 552, size: 32, elements: !1108)
!1108 = !{!1109, !1110, !1111}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "IIR", scope: !1107, file: !56, line: 553, baseType: !324, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !1107, file: !56, line: 554, baseType: !60, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "EFR", scope: !1107, file: !56, line: 555, baseType: !60, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "LCR", scope: !1093, file: !56, line: 557, baseType: !60, size: 32, offset: 96)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "MCR_XON1", scope: !1093, file: !56, line: 561, baseType: !1114, size: 32, offset: 128)
!1114 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1093, file: !56, line: 558, size: 32, elements: !1115)
!1115 = !{!1116, !1117}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !1114, file: !56, line: 559, baseType: !60, size: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "XON1", scope: !1114, file: !56, line: 560, baseType: !60, size: 32)
