; ModuleID = 'build/adafruit_feather_m0_lora/subsys/logging/dictionary/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.16 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config.17 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.16*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/dictionary/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/dictionary")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/dictionary")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_hello_world", scope: !27, file: !166, line: 14, type: !168, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !107, globals: !163, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/dictionary/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/dictionary")
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !38, line: 27, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!40 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!41 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!42 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!43 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!44 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!45 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!46 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!47 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!48 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!49 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!50 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!51 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!52 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!53 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!54 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!55 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!56 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!106 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!107 = !{!108, !109, !123, !124, !117, !125, !135, !154, !157, !158, !159, !161}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !110, file: !111, line: 80, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !115)
!115 = !{!116, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !111, line: 47, baseType: !117, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !114, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !114, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !114, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !110, file: !111, line: 82, baseType: !108, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !127)
!127 = !{!128, !146, !150}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !126, file: !31, line: 89, baseType: !129, size: 96)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !130)
!130 = !{!131, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !129, file: !31, line: 67, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !133)
!133 = !{!134, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !132, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !132, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !132, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !132, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !132, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !129, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !129, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !135)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !126, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !31, line: 94, baseType: !151, offset: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: -1)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!163 = !{!25, !164, !174}
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !166, line: 14, type: !167, isLocal: true, isDefinition: true)
!166 = !DIFile(filename: "zephyr/samples/subsys/logging/dictionary/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !170, line: 16, size: 64, elements: !171)
!170 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !170, line: 17, baseType: !154, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !169, file: !170, line: 18, baseType: !117, size: 8, offset: 32)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "hexdump_msg", scope: !27, file: !166, line: 16, type: !154, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !178, file: !231, line: 18, type: !233, isLocal: false, isDefinition: true)
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !180, retainedTypes: !181, globals: !228, splitDebugInlining: false, nameTableKind: None)
!179 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/dictionary")
!180 = !{!30}
!181 = !{!22, !108, !24, !182, !184, !186, !187, !123, !157, !189, !159, !191, !192, !193, !194, !196, !124, !117, !207, !135, !154}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !188, line: 214, baseType: !32)
!188 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !195)
!195 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !198)
!198 = !{!199, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !197, file: !111, line: 80, baseType: !200, size: 32)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !201)
!201 = !{!202, !203, !204, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !200, file: !111, line: 47, baseType: !117, size: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !200, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !200, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !200, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !197, file: !111, line: 82, baseType: !108, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !209)
!209 = !{!210, !226, !227}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !208, file: !31, line: 89, baseType: !211, size: 96)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !212)
!212 = !{!213, !224, !225}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !211, file: !31, line: 67, baseType: !214, size: 32)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !214, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !214, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !214, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !214, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !214, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !214, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !214, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !211, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !211, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !208, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !31, line: 94, baseType: !151, offset: 128)
!228 = !{!176, !229}
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !178, file: !231, line: 18, type: !232, isLocal: true, isDefinition: true)
!231 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !170, line: 16, size: 64, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !234, file: !170, line: 17, baseType: !154, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !234, file: !170, line: 18, baseType: !117, size: 8, offset: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "_char_out", scope: !240, file: !245, line: 54, type: !246, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !243, globals: !244, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/dictionary")
!242 = !{!37}
!243 = !{!108, !123}
!244 = !{!238}
!245 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!123, !123}
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !251, file: !985, line: 202, type: !986, isLocal: true, isDefinition: true, align: 32)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !253, globals: !984, splitDebugInlining: false, nameTableKind: None)
!252 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/dictionary")
!253 = !{!108, !123, !254, !378, !715, !716, !783}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !256, line: 335, baseType: !257)
!256 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !256, line: 320, size: 288, elements: !258)
!258 = !{!259, !270, !278, !292, !303, !314, !318, !329, !330, !341, !342, !357, !358, !368}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !257, file: !256, line: 321, baseType: !260, size: 16)
!260 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !256, line: 50, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 43, size: 16, elements: !263)
!263 = !{!264, !269}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !262, file: !256, line: 48, baseType: !265, size: 16)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !256, line: 44, size: 16, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !265, file: !256, line: 45, baseType: !194, size: 7, flags: DIFlagBitField, extraData: i64 0)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !265, file: !256, line: 47, baseType: !194, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !262, file: !256, line: 49, baseType: !194, size: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !257, file: !256, line: 322, baseType: !271, size: 16, offset: 16)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 16, elements: !276)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !273, line: 52, baseType: !274)
!273 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!276 = !{!277}
!277 = !DISubrange(count: 2)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !257, file: !256, line: 323, baseType: !279, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !256, line: 107, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 94, size: 32, elements: !282)
!282 = !{!283, !291}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !281, file: !256, line: 105, baseType: !284, size: 32)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !281, file: !256, line: 95, size: 32, elements: !285)
!285 = !{!286, !287, !288, !289, !290}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !284, file: !256, line: 97, baseType: !135, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !284, file: !256, line: 99, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !284, file: !256, line: 100, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !284, file: !256, line: 102, baseType: !135, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !284, file: !256, line: 103, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !281, file: !256, line: 106, baseType: !135, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !257, file: !256, line: 324, baseType: !293, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !256, line: 155, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 148, size: 32, elements: !296)
!296 = !{!297, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !295, file: !256, line: 153, baseType: !298, size: 32)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !295, file: !256, line: 149, size: 32, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !298, file: !256, line: 150, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !298, file: !256, line: 151, baseType: !135, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !295, file: !256, line: 154, baseType: !135, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !257, file: !256, line: 325, baseType: !304, size: 8, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !256, line: 194, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 187, size: 8, elements: !307)
!307 = !{!308, !313}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !306, file: !256, line: 192, baseType: !309, size: 8)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !306, file: !256, line: 188, size: 8, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !309, file: !256, line: 189, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !309, file: !256, line: 190, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !306, file: !256, line: 193, baseType: !117, size: 8)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !257, file: !256, line: 326, baseType: !315, size: 24, offset: 104)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 24, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 3)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !257, file: !256, line: 327, baseType: !319, size: 8, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !256, line: 215, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 208, size: 8, elements: !322)
!322 = !{!323, !328}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !321, file: !256, line: 213, baseType: !324, size: 8)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !321, file: !256, line: 209, size: 8, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !324, file: !256, line: 210, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !324, file: !256, line: 211, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !321, file: !256, line: 214, baseType: !117, size: 8)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !257, file: !256, line: 328, baseType: !315, size: 24, offset: 136)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !257, file: !256, line: 329, baseType: !331, size: 8, offset: 160)
!331 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !256, line: 236, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 229, size: 8, elements: !334)
!334 = !{!335, !340}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !333, file: !256, line: 234, baseType: !336, size: 8)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !256, line: 230, size: 8, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !336, file: !256, line: 231, baseType: !274, size: 1, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !336, file: !256, line: 232, baseType: !274, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !333, file: !256, line: 235, baseType: !117, size: 8)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !257, file: !256, line: 330, baseType: !315, size: 24, offset: 168)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !257, file: !256, line: 331, baseType: !343, size: 16, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !256, line: 262, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 250, size: 16, elements: !346)
!346 = !{!347, !356}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !345, file: !256, line: 260, baseType: !348, size: 16)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !345, file: !256, line: 251, size: 16, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !348, file: !256, line: 252, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !348, file: !256, line: 253, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !348, file: !256, line: 254, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !348, file: !256, line: 255, baseType: !194, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !348, file: !256, line: 256, baseType: !194, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !348, file: !256, line: 258, baseType: !194, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !345, file: !256, line: 261, baseType: !194, size: 16)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !257, file: !256, line: 332, baseType: !271, size: 16, offset: 208)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !257, file: !256, line: 333, baseType: !359, size: 32, offset: 224)
!359 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !256, line: 290, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 284, size: 32, elements: !362)
!362 = !{!363, !367}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !361, file: !256, line: 288, baseType: !364, size: 32)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !361, file: !256, line: 285, size: 32, elements: !365)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !364, file: !256, line: 286, baseType: !135, size: 22, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !361, file: !256, line: 289, baseType: !135, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !257, file: !256, line: 334, baseType: !369, size: 16, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !256, line: 308, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !256, line: 303, size: 16, elements: !372)
!372 = !{!373, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !371, file: !256, line: 306, baseType: !374, size: 16)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !371, file: !256, line: 304, size: 16, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !374, file: !256, line: 305, baseType: !194, size: 16, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !371, file: !256, line: 307, baseType: !194, size: 16)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !380, line: 928, baseType: !381)
!380 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !380, line: 899, size: 672, elements: !382)
!382 = !{!383, !407, !431, !457, !482, !498, !499, !517, !518, !535, !546, !547, !562, !582, !583, !595, !607, !617, !618, !635, !637, !648, !649, !661, !673, !674, !685, !701}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !381, file: !380, line: 900, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !380, line: 64, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 43, size: 32, elements: !387)
!387 = !{!388, !406}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !386, file: !380, line: 62, baseType: !389, size: 32)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !380, line: 44, size: 32, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !389, file: !380, line: 45, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !389, file: !380, line: 46, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !389, file: !380, line: 47, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !389, file: !380, line: 48, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !389, file: !380, line: 49, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !389, file: !380, line: 50, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !389, file: !380, line: 51, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !389, file: !380, line: 52, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !389, file: !380, line: 53, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !389, file: !380, line: 54, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !389, file: !380, line: 55, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !389, file: !380, line: 56, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !389, file: !380, line: 58, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !389, file: !380, line: 59, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !389, file: !380, line: 60, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !386, file: !380, line: 63, baseType: !135, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !381, file: !380, line: 901, baseType: !408, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !380, line: 125, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 104, size: 32, elements: !411)
!411 = !{!412, !430}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !410, file: !380, line: 123, baseType: !413, size: 32)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !380, line: 105, size: 32, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !413, file: !380, line: 106, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !413, file: !380, line: 107, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !413, file: !380, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !413, file: !380, line: 109, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !413, file: !380, line: 110, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !413, file: !380, line: 111, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !413, file: !380, line: 112, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !413, file: !380, line: 113, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !413, file: !380, line: 114, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !413, file: !380, line: 115, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !413, file: !380, line: 116, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !413, file: !380, line: 117, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !413, file: !380, line: 119, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !413, file: !380, line: 120, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !413, file: !380, line: 121, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !410, file: !380, line: 124, baseType: !135, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !381, file: !380, line: 902, baseType: !432, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !380, line: 186, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 165, size: 32, elements: !435)
!435 = !{!436, !456}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !434, file: !380, line: 184, baseType: !437, size: 32)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !434, file: !380, line: 166, size: 32, elements: !438)
!438 = !{!439, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !437, file: !380, line: 167, baseType: !440, size: 1, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !437, file: !380, line: 168, baseType: !440, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !437, file: !380, line: 169, baseType: !440, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !437, file: !380, line: 170, baseType: !440, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !437, file: !380, line: 171, baseType: !440, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !437, file: !380, line: 172, baseType: !440, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !437, file: !380, line: 173, baseType: !440, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !437, file: !380, line: 174, baseType: !440, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !437, file: !380, line: 175, baseType: !440, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !437, file: !380, line: 176, baseType: !440, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !437, file: !380, line: 177, baseType: !440, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !437, file: !380, line: 178, baseType: !440, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !437, file: !380, line: 180, baseType: !440, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !437, file: !380, line: 181, baseType: !440, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !437, file: !380, line: 182, baseType: !440, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !434, file: !380, line: 185, baseType: !135, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !381, file: !380, line: 903, baseType: !458, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !380, line: 247, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 226, size: 32, elements: !462)
!462 = !{!463, !481}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !461, file: !380, line: 245, baseType: !464, size: 32)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !461, file: !380, line: 227, size: 32, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !464, file: !380, line: 228, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !464, file: !380, line: 229, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !464, file: !380, line: 230, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !464, file: !380, line: 231, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !464, file: !380, line: 232, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !464, file: !380, line: 233, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !464, file: !380, line: 234, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !464, file: !380, line: 235, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !464, file: !380, line: 236, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !464, file: !380, line: 237, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !464, file: !380, line: 238, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !464, file: !380, line: 239, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !464, file: !380, line: 241, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !464, file: !380, line: 242, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !464, file: !380, line: 243, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !461, file: !380, line: 246, baseType: !135, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !381, file: !380, line: 904, baseType: !483, size: 16, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !380, line: 300, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 287, size: 16, elements: !486)
!486 = !{!487, !497}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !485, file: !380, line: 298, baseType: !488, size: 16)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !485, file: !380, line: 288, size: 16, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !488, file: !380, line: 290, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !488, file: !380, line: 291, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !488, file: !380, line: 293, baseType: !194, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !488, file: !380, line: 294, baseType: !194, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !488, file: !380, line: 295, baseType: !194, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !488, file: !380, line: 296, baseType: !194, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !488, file: !380, line: 297, baseType: !194, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !485, file: !380, line: 299, baseType: !194, size: 16)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !381, file: !380, line: 905, baseType: !271, size: 16, offset: 144)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !381, file: !380, line: 906, baseType: !500, size: 16, offset: 160)
!500 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !380, line: 352, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 336, size: 16, elements: !503)
!503 = !{!504, !516}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !502, file: !380, line: 350, baseType: !505, size: 16)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !502, file: !380, line: 337, size: 16, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !505, file: !380, line: 339, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !505, file: !380, line: 340, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !505, file: !380, line: 341, baseType: !194, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !505, file: !380, line: 342, baseType: !194, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !505, file: !380, line: 343, baseType: !194, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !505, file: !380, line: 344, baseType: !194, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !505, file: !380, line: 345, baseType: !194, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !505, file: !380, line: 346, baseType: !194, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !505, file: !380, line: 348, baseType: !194, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !502, file: !380, line: 351, baseType: !194, size: 16)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !381, file: !380, line: 907, baseType: !271, size: 16, offset: 176)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !381, file: !380, line: 908, baseType: !519, size: 32, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !380, line: 398, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 381, size: 32, elements: !522)
!522 = !{!523, !534}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !521, file: !380, line: 396, baseType: !524, size: 32)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !521, file: !380, line: 382, size: 32, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !524, file: !380, line: 384, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !524, file: !380, line: 385, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !524, file: !380, line: 386, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !524, file: !380, line: 388, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !524, file: !380, line: 389, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !524, file: !380, line: 390, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !524, file: !380, line: 392, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !524, file: !380, line: 394, baseType: !135, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !521, file: !380, line: 397, baseType: !135, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !381, file: !380, line: 909, baseType: !536, size: 8, offset: 224)
!536 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !380, line: 433, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 426, size: 8, elements: !539)
!539 = !{!540, !545}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !538, file: !380, line: 431, baseType: !541, size: 8)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !538, file: !380, line: 427, size: 8, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !541, file: !380, line: 428, baseType: !117, size: 5, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !541, file: !380, line: 430, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !538, file: !380, line: 432, baseType: !117, size: 8)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !381, file: !380, line: 910, baseType: !315, size: 24, offset: 232)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !381, file: !380, line: 911, baseType: !548, size: 32, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !380, line: 462, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 448, size: 32, elements: !551)
!551 = !{!552, !561}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !550, file: !380, line: 460, baseType: !553, size: 32)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !550, file: !380, line: 449, size: 32, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !553, file: !380, line: 451, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !553, file: !380, line: 453, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !553, file: !380, line: 454, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !553, file: !380, line: 455, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !553, file: !380, line: 457, baseType: !135, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !553, file: !380, line: 459, baseType: !135, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !550, file: !380, line: 461, baseType: !135, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !381, file: !380, line: 912, baseType: !563, size: 16, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !380, line: 520, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 503, size: 16, elements: !566)
!566 = !{!567, !581}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !565, file: !380, line: 518, baseType: !568, size: 16)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !565, file: !380, line: 504, size: 16, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !568, file: !380, line: 506, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !568, file: !380, line: 507, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !568, file: !380, line: 508, baseType: !194, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !568, file: !380, line: 509, baseType: !194, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !568, file: !380, line: 510, baseType: !194, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !568, file: !380, line: 511, baseType: !194, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !568, file: !380, line: 512, baseType: !194, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !568, file: !380, line: 513, baseType: !194, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !568, file: !380, line: 514, baseType: !194, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !568, file: !380, line: 515, baseType: !194, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !568, file: !380, line: 516, baseType: !194, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !565, file: !380, line: 519, baseType: !194, size: 16)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !381, file: !380, line: 913, baseType: !271, size: 16, offset: 304)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !381, file: !380, line: 914, baseType: !584, size: 32, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !380, line: 559, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 552, size: 32, elements: !587)
!587 = !{!588, !594}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !586, file: !380, line: 557, baseType: !589, size: 32)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !586, file: !380, line: 553, size: 32, elements: !590)
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !589, file: !380, line: 554, baseType: !135, size: 10, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !589, file: !380, line: 555, baseType: !135, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !589, file: !380, line: 556, baseType: !135, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !586, file: !380, line: 558, baseType: !135, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !381, file: !380, line: 915, baseType: !596, size: 32, offset: 352)
!596 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !380, line: 585, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 578, size: 32, elements: !599)
!599 = !{!600, !606}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !598, file: !380, line: 583, baseType: !601, size: 32)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !598, file: !380, line: 579, size: 32, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !601, file: !380, line: 580, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !601, file: !380, line: 581, baseType: !135, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !601, file: !380, line: 582, baseType: !135, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !598, file: !380, line: 584, baseType: !135, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !381, file: !380, line: 916, baseType: !608, size: 8, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !380, line: 610, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 604, size: 8, elements: !611)
!611 = !{!612, !616}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !610, file: !380, line: 608, baseType: !613, size: 8)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !610, file: !380, line: 605, size: 8, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !613, file: !380, line: 607, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !610, file: !380, line: 609, baseType: !117, size: 8)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !381, file: !380, line: 917, baseType: !315, size: 24, offset: 392)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !381, file: !380, line: 918, baseType: !619, size: 32, offset: 416)
!619 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !380, line: 639, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 622, size: 32, elements: !622)
!622 = !{!623, !634}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !621, file: !380, line: 637, baseType: !624, size: 32)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !621, file: !380, line: 623, size: 32, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !624, file: !380, line: 625, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !624, file: !380, line: 626, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !624, file: !380, line: 627, baseType: !135, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !624, file: !380, line: 629, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !624, file: !380, line: 631, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !624, file: !380, line: 632, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !624, file: !380, line: 634, baseType: !135, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !624, file: !380, line: 635, baseType: !135, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !621, file: !380, line: 638, baseType: !135, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !381, file: !380, line: 919, baseType: !636, size: 32, offset: 448)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 32, elements: !148)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !381, file: !380, line: 920, baseType: !638, size: 16, offset: 480)
!638 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !380, line: 715, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 706, size: 16, elements: !641)
!641 = !{!642, !647}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !640, file: !380, line: 713, baseType: !643, size: 16)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !640, file: !380, line: 707, size: 16, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !643, file: !380, line: 709, baseType: !194, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !643, file: !380, line: 711, baseType: !194, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !640, file: !380, line: 714, baseType: !194, size: 16)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !381, file: !380, line: 921, baseType: !271, size: 16, offset: 496)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !381, file: !380, line: 922, baseType: !650, size: 32, offset: 512)
!650 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !380, line: 739, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 729, size: 32, elements: !653)
!653 = !{!654, !660}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !652, file: !380, line: 737, baseType: !655, size: 32)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !652, file: !380, line: 730, size: 32, elements: !656)
!656 = !{!657, !658, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !655, file: !380, line: 732, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !655, file: !380, line: 733, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !655, file: !380, line: 735, baseType: !135, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !652, file: !380, line: 738, baseType: !135, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !381, file: !380, line: 923, baseType: !662, size: 8, offset: 544)
!662 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !380, line: 765, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 756, size: 8, elements: !665)
!665 = !{!666, !672}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !664, file: !380, line: 763, baseType: !667, size: 8)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !380, line: 757, size: 8, elements: !668)
!668 = !{!669, !670, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !667, file: !380, line: 759, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !667, file: !380, line: 761, baseType: !117, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !667, file: !380, line: 762, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !664, file: !380, line: 764, baseType: !117, size: 8)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !381, file: !380, line: 924, baseType: !315, size: 24, offset: 552)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !381, file: !380, line: 925, baseType: !675, size: 32, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !380, line: 789, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 781, size: 32, elements: !678)
!678 = !{!679, !684}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !677, file: !380, line: 787, baseType: !680, size: 32)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !380, line: 782, size: 32, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !680, file: !380, line: 783, baseType: !135, size: 12, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !680, file: !380, line: 785, baseType: !135, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !677, file: !380, line: 788, baseType: !135, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !381, file: !380, line: 926, baseType: !686, size: 32, offset: 608)
!686 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !380, line: 820, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 805, size: 32, elements: !689)
!689 = !{!690, !700}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !688, file: !380, line: 818, baseType: !691, size: 32)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !688, file: !380, line: 806, size: 32, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !691, file: !380, line: 807, baseType: !135, size: 2, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !691, file: !380, line: 808, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !691, file: !380, line: 809, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !691, file: !380, line: 810, baseType: !135, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !691, file: !380, line: 812, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !691, file: !380, line: 814, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !691, file: !380, line: 816, baseType: !135, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !688, file: !380, line: 819, baseType: !135, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !381, file: !380, line: 927, baseType: !702, size: 8, offset: 640)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !380, line: 881, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !380, line: 872, size: 8, elements: !706)
!706 = !{!707, !714}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !705, file: !380, line: 879, baseType: !708, size: 8)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !380, line: 873, size: 8, elements: !709)
!709 = !{!710, !711, !712, !713}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !708, file: !380, line: 874, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !708, file: !380, line: 875, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !708, file: !380, line: 876, baseType: !117, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !708, file: !380, line: 877, baseType: !117, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !705, file: !380, line: 880, baseType: !117, size: 8)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !718, line: 290, baseType: !719)
!718 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !718, line: 284, size: 96, elements: !720)
!720 = !{!721, !731, !742, !755, !772}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !719, file: !718, line: 285, baseType: !722, size: 8)
!722 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !718, line: 49, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !718, line: 43, size: 8, elements: !725)
!725 = !{!726, !730}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !724, file: !718, line: 47, baseType: !727, size: 8)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !724, file: !718, line: 44, size: 8, elements: !728)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !727, file: !718, line: 45, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !724, file: !718, line: 48, baseType: !117, size: 8)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !719, file: !718, line: 286, baseType: !732, size: 8, offset: 8)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !718, line: 67, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !718, line: 61, size: 8, elements: !736)
!736 = !{!737, !741}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !735, file: !718, line: 65, baseType: !738, size: 8)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !735, file: !718, line: 62, size: 8, elements: !739)
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !738, file: !718, line: 64, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !735, file: !718, line: 66, baseType: !117, size: 8)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !719, file: !718, line: 287, baseType: !743, size: 16, offset: 16)
!743 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !718, line: 89, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !718, line: 79, size: 16, elements: !746)
!746 = !{!747, !754}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !745, file: !718, line: 87, baseType: !748, size: 16)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !745, file: !718, line: 80, size: 16, elements: !749)
!749 = !{!750, !751, !752, !753}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !748, file: !718, line: 81, baseType: !194, size: 6, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !748, file: !718, line: 83, baseType: !194, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !748, file: !718, line: 85, baseType: !194, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !748, file: !718, line: 86, baseType: !194, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !745, file: !718, line: 88, baseType: !194, size: 16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !719, file: !718, line: 288, baseType: !756, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !718, line: 214, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !718, line: 199, size: 32, elements: !759)
!759 = !{!760, !771}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !758, file: !718, line: 212, baseType: !761, size: 32)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !758, file: !718, line: 200, size: 32, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !761, file: !718, line: 201, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !761, file: !718, line: 203, baseType: !135, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !761, file: !718, line: 205, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !761, file: !718, line: 206, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !761, file: !718, line: 207, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !761, file: !718, line: 208, baseType: !135, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !761, file: !718, line: 209, baseType: !135, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !761, file: !718, line: 210, baseType: !135, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !758, file: !718, line: 213, baseType: !135, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !719, file: !718, line: 289, baseType: !773, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !718, line: 268, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !718, line: 260, size: 32, elements: !776)
!776 = !{!777, !782}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !775, file: !718, line: 266, baseType: !778, size: 32)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !775, file: !718, line: 261, size: 32, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !778, file: !718, line: 262, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !778, file: !718, line: 264, baseType: !135, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !775, file: !718, line: 267, baseType: !135, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !785, line: 513, baseType: !786)
!785 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !785, line: 494, size: 480, elements: !787)
!787 = !{!788, !794, !804, !808, !818, !828, !838, !848, !852, !868, !884, !900, !930, !934, !944, !954, !964, !968}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !786, file: !785, line: 495, baseType: !789, size: 8)
!789 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !785, line: 45, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !785, line: 43, size: 8, elements: !792)
!792 = !{!793}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !791, file: !785, line: 44, baseType: !117, size: 8)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !786, file: !785, line: 496, baseType: !795, size: 8, offset: 8)
!795 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !785, line: 61, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !785, line: 55, size: 8, elements: !798)
!798 = !{!799, !803}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !797, file: !785, line: 59, baseType: !800, size: 8)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !797, file: !785, line: 56, size: 8, elements: !801)
!801 = !{!802}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !800, file: !785, line: 57, baseType: !117, size: 2, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !797, file: !785, line: 60, baseType: !117, size: 8)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !786, file: !785, line: 497, baseType: !805, size: 48, offset: 16)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 48, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 6)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !786, file: !785, line: 498, baseType: !809, size: 8, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !785, line: 86, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !785, line: 80, size: 8, elements: !812)
!812 = !{!813, !817}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !811, file: !785, line: 84, baseType: !814, size: 8)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !811, file: !785, line: 81, size: 8, elements: !815)
!815 = !{!816}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !814, file: !785, line: 82, baseType: !117, size: 3, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !811, file: !785, line: 85, baseType: !117, size: 8)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !786, file: !785, line: 499, baseType: !819, size: 8, offset: 72)
!819 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !785, line: 121, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !785, line: 115, size: 8, elements: !822)
!822 = !{!823, !827}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !821, file: !785, line: 119, baseType: !824, size: 8)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !821, file: !785, line: 116, size: 8, elements: !825)
!825 = !{!826}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !824, file: !785, line: 117, baseType: !117, size: 3, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !821, file: !785, line: 120, baseType: !117, size: 8)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !786, file: !785, line: 500, baseType: !829, size: 8, offset: 80)
!829 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !785, line: 156, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !785, line: 150, size: 8, elements: !832)
!832 = !{!833, !837}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !831, file: !785, line: 154, baseType: !834, size: 8)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !831, file: !785, line: 151, size: 8, elements: !835)
!835 = !{!836}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !834, file: !785, line: 152, baseType: !117, size: 3, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !831, file: !785, line: 155, baseType: !117, size: 8)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !786, file: !785, line: 501, baseType: !839, size: 8, offset: 88)
!839 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !785, line: 191, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !785, line: 185, size: 8, elements: !842)
!842 = !{!843, !847}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !841, file: !785, line: 189, baseType: !844, size: 8)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !841, file: !785, line: 186, size: 8, elements: !845)
!845 = !{!846}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !844, file: !785, line: 187, baseType: !117, size: 3, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !841, file: !785, line: 190, baseType: !117, size: 8)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !786, file: !785, line: 502, baseType: !849, size: 64, offset: 96)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 64, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 8)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !786, file: !785, line: 503, baseType: !853, size: 32, offset: 160)
!853 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !785, line: 232, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !785, line: 220, size: 32, elements: !856)
!856 = !{!857, !867}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !855, file: !785, line: 230, baseType: !858, size: 32)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !855, file: !785, line: 221, size: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !866}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !858, file: !785, line: 222, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !858, file: !785, line: 223, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !858, file: !785, line: 224, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !858, file: !785, line: 225, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !858, file: !785, line: 226, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !858, file: !785, line: 227, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !858, file: !785, line: 228, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !855, file: !785, line: 231, baseType: !135, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !786, file: !785, line: 504, baseType: !869, size: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !785, line: 268, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !785, line: 256, size: 32, elements: !872)
!872 = !{!873, !883}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !871, file: !785, line: 266, baseType: !874, size: 32)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !785, line: 257, size: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !874, file: !785, line: 258, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !874, file: !785, line: 259, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !874, file: !785, line: 260, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !874, file: !785, line: 261, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !874, file: !785, line: 262, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !874, file: !785, line: 263, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !874, file: !785, line: 264, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !871, file: !785, line: 267, baseType: !135, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !786, file: !785, line: 505, baseType: !885, size: 32, offset: 224)
!885 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !785, line: 304, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !785, line: 292, size: 32, elements: !888)
!888 = !{!889, !899}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !887, file: !785, line: 302, baseType: !890, size: 32)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !785, line: 293, size: 32, elements: !891)
!891 = !{!892, !893, !894, !895, !896, !897, !898}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !890, file: !785, line: 294, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !890, file: !785, line: 295, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !890, file: !785, line: 296, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !890, file: !785, line: 297, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !890, file: !785, line: 298, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
