; ModuleID = 'build/arduino_due/drivers/ipm/ipm_mcux/remote/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.wdt_sam_dev_cfg = type { %struct._thread_stack_info* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.wdt_driver_api = type { i32 (%struct.device*, i8)*, i32 (%struct.device*)*, i32 (%struct.device*, %struct.wdt_timeout_cfg*)*, i32 (%struct.device*, i32)* }
%struct.wdt_timeout_cfg = type { %struct._thread_arch, void (%struct.device*, i32)*, i8 }
%struct._thread_arch = type { i32, i32 }
%struct.wdt_sam_dev_data = type { void (%struct.device*, i32)*, i32, i8, i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam_dev_cfg = type { %struct.Uart*, i32, %struct.pinctrl_dev_config* }
%struct.Uart = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, [55 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.pinctrl_dev_config = type { %struct.pinctrl_state*, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !111, file: !177, line: 235, type: !178, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !176, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!113 = !{!102, !103, !114, !126}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 41, size: 128, elements: !118)
!118 = !{!119, !122, !123, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !117, file: !116, line: 42, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !117, file: !116, line: 43, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !117, file: !116, line: 44, baseType: !124, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !117, file: !116, line: 45, baseType: !124, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !128, line: 75, baseType: !129)
!128 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 41, size: 2176, elements: !130)
!130 = !{!131, !132, !133, !134, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !154, !158, !159, !160, !161, !162, !163, !164, !165, !169, !170, !171, !172, !173, !174, !175}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !129, file: !128, line: 42, baseType: !120, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !129, file: !128, line: 43, baseType: !120, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !129, file: !128, line: 44, baseType: !124, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !129, file: !128, line: 45, baseType: !135, size: 32, offset: 96)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !129, file: !128, line: 46, baseType: !120, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !129, file: !128, line: 47, baseType: !120, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !129, file: !128, line: 48, baseType: !124, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !129, file: !128, line: 49, baseType: !120, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !129, file: !128, line: 50, baseType: !120, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !129, file: !128, line: 51, baseType: !124, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !129, file: !128, line: 52, baseType: !120, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !129, file: !128, line: 53, baseType: !135, size: 32, offset: 352)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !129, file: !128, line: 54, baseType: !120, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !129, file: !128, line: 55, baseType: !135, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !129, file: !128, line: 56, baseType: !120, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !129, file: !128, line: 57, baseType: !135, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !129, file: !128, line: 58, baseType: !151, size: 96, offset: 512)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 96, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !129, file: !128, line: 59, baseType: !155, size: 160, offset: 608)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !129, file: !128, line: 60, baseType: !120, size: 32, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !129, file: !128, line: 61, baseType: !120, size: 32, offset: 800)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !129, file: !128, line: 62, baseType: !124, size: 32, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !129, file: !128, line: 63, baseType: !124, size: 32, offset: 864)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !129, file: !128, line: 64, baseType: !120, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !129, file: !128, line: 65, baseType: !120, size: 32, offset: 928)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !129, file: !128, line: 66, baseType: !120, size: 32, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !129, file: !128, line: 67, baseType: !166, size: 832, offset: 992)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 832, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !129, file: !128, line: 68, baseType: !120, size: 32, offset: 1824)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !129, file: !128, line: 69, baseType: !124, size: 32, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !129, file: !128, line: 70, baseType: !155, size: 160, offset: 1888)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !129, file: !128, line: 71, baseType: !120, size: 32, offset: 2048)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !129, file: !128, line: 72, baseType: !120, size: 32, offset: 2080)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !129, file: !128, line: 73, baseType: !124, size: 32, offset: 2112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !129, file: !128, line: 74, baseType: !120, size: 32, offset: 2144)
!176 = !{!109}
!177 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182, !213}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !179, file: !180, line: 60, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!103, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !190)
!189 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!190 = !{!191, !195, !196, !197, !206, !207}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !189, line: 380, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !188, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !188, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !188, file: !189, line: 386, baseType: !198, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !200)
!200 = !{!201, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !199, file: !189, line: 359, baseType: !202, size: 8)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !203)
!203 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !199, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !188, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !189, line: 43, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !212)
!212 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !179, file: !180, line: 65, baseType: !186, size: 32, offset: 32)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "static_regions", scope: !216, file: !225, line: 62, type: !364, isLocal: true, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !218, globals: !221, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!218 = !{!219, !103, !121, !102}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 214, baseType: !32)
!220 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !{!222, !214}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !224, file: !225, line: 198, type: !352, isLocal: true, isDefinition: true)
!224 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !225, file: !225, line: 175, type: !226, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !347)
!225 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !230, line: 245, size: 1024, elements: !231)
!230 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !{!232, !301, !314, !315, !316, !317, !323, !342}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !229, file: !230, line: 247, baseType: !233, size: 384)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !230, line: 57, size: 384, elements: !234)
!234 = !{!235, !263, !271, !272, !273, !286, !287, !288}
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !230, line: 60, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !230, line: 60, size: 64, elements: !237)
!237 = !{!238, !254}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !236, file: !230, line: 61, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !240, line: 49, baseType: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !240, line: 37, size: 64, elements: !242)
!242 = !{!243, !249}
!243 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !240, line: 38, baseType: !244, size: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 38, size: 32, elements: !245)
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !244, file: !240, line: 39, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !240, line: 40, baseType: !247, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !240, line: 42, baseType: !250, size: 32, offset: 32)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 42, size: 32, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !250, file: !240, line: 43, baseType: !247, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !250, file: !240, line: 44, baseType: !247, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !236, file: !230, line: 62, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !256, line: 49, size: 64, elements: !257)
!256 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !255, file: !256, line: 50, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 64, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!261 = !{!262}
!262 = !DISubrange(count: 2)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !233, file: !230, line: 68, baseType: !264, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !266, line: 233, baseType: !267)
!266 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 231, size: 64, elements: !268)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !267, file: !266, line: 232, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !240, line: 48, baseType: !241)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !233, file: !230, line: 71, baseType: !202, size: 8, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !233, file: !230, line: 74, baseType: !202, size: 8, offset: 104)
!273 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !230, line: 90, baseType: !274, size: 16, offset: 112)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !230, line: 90, size: 16, elements: !275)
!275 = !{!276, !283}
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !230, line: 91, baseType: !277, size: 16)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !274, file: !230, line: 91, size: 16, elements: !278)
!278 = !{!279, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !277, file: !230, line: 96, baseType: !280, size: 8)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !281)
!281 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !277, file: !230, line: 97, baseType: !202, size: 8, offset: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !274, file: !230, line: 100, baseType: !284, size: 16)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !285)
!285 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !233, file: !230, line: 107, baseType: !121, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !233, file: !230, line: 127, baseType: !102, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !233, file: !230, line: 131, baseType: !289, size: 192, offset: 192)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !266, line: 244, size: 192, elements: !290)
!290 = !{!291, !292, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !289, file: !266, line: 245, baseType: !239, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !289, file: !266, line: 246, baseType: !293, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !266, line: 242, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !289, file: !266, line: 249, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !300)
!300 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !229, file: !230, line: 250, baseType: !302, size: 288, offset: 384)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !303, line: 25, size: 288, elements: !304)
!303 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !302, file: !303, line: 26, baseType: !121, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !302, file: !303, line: 27, baseType: !121, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !302, file: !303, line: 28, baseType: !121, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !302, file: !303, line: 29, baseType: !121, size: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !302, file: !303, line: 30, baseType: !121, size: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !302, file: !303, line: 31, baseType: !121, size: 32, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !302, file: !303, line: 32, baseType: !121, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !302, file: !303, line: 33, baseType: !121, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !302, file: !303, line: 34, baseType: !121, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !229, file: !230, line: 253, baseType: !102, size: 32, offset: 672)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !229, file: !230, line: 256, baseType: !265, size: 64, offset: 704)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !229, file: !230, line: 294, baseType: !103, size: 32, offset: 768)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !229, file: !230, line: 300, baseType: !318, size: 96, offset: 800)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !230, line: 149, size: 96, elements: !319)
!319 = !{!320, !321, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !318, file: !230, line: 153, baseType: !22, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !318, file: !230, line: 162, baseType: !219, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !318, file: !230, line: 168, baseType: !219, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !229, file: !230, line: 325, baseType: !324, size: 32, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !326, line: 5073, size: 160, elements: !327)
!326 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !{!328, !337, !338}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !325, file: !326, line: 5074, baseType: !329, size: 96)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !330, line: 56, size: 96, elements: !331)
!330 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!331 = !{!332, !335, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !329, file: !330, line: 57, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !330, line: 57, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !329, file: !330, line: 58, baseType: !102, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !329, file: !330, line: 59, baseType: !219, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !325, file: !326, line: 5075, baseType: !265, size: 64, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !325, file: !326, line: 5076, baseType: !339, offset: 160)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !340, line: 43, elements: !341)
!340 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!341 = !{}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !229, file: !230, line: 343, baseType: !343, size: 64, offset: 928)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !303, line: 60, size: 64, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !343, file: !303, line: 63, baseType: !121, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !343, file: !303, line: 66, baseType: !121, size: 32, offset: 32)
!347 = !{!348, !349, !350, !351}
!348 = !DILocalVariable(name: "thread", arg: 1, scope: !224, file: !225, line: 175, type: !228)
!349 = !DILocalVariable(name: "region_num", scope: !224, file: !225, line: 200, type: !202)
!350 = !DILocalVariable(name: "guard_start", scope: !224, file: !225, line: 265, type: !22)
!351 = !DILocalVariable(name: "guard_size", scope: !224, file: !225, line: 266, type: !219)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 96, elements: !136)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !354, line: 52, size: 96, elements: !355)
!354 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !353, file: !354, line: 53, baseType: !22, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !353, file: !354, line: 54, baseType: !219, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !353, file: !354, line: 55, baseType: !359, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !360, line: 151, baseType: !361)
!360 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 149, size: 32, elements: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !361, file: !360, line: 150, baseType: !121, size: 32)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 96, elements: !136)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !368, file: !400, line: 39, type: !202, isLocal: true, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !370, globals: !399, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!370 = !{!371, !102, !103, !387, !202}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !373, line: 1168, baseType: !374)
!373 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 1155, size: 352, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !374, file: !373, line: 1157, baseType: !124, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !374, file: !373, line: 1158, baseType: !120, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !374, file: !373, line: 1159, baseType: !120, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !374, file: !373, line: 1160, baseType: !120, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !374, file: !373, line: 1161, baseType: !120, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !374, file: !373, line: 1162, baseType: !120, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !374, file: !373, line: 1163, baseType: !120, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !374, file: !373, line: 1164, baseType: !120, size: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !374, file: !373, line: 1165, baseType: !120, size: 32, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !374, file: !373, line: 1166, baseType: !120, size: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !374, file: !373, line: 1167, baseType: !120, size: 32, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !390, line: 27, size: 96, elements: !391)
!390 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !389, file: !390, line: 29, baseType: !121, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !389, file: !390, line: 31, baseType: !192, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !389, file: !390, line: 37, baseType: !395, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !360, line: 146, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !360, line: 141, size: 32, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !396, file: !360, line: 143, baseType: !121, size: 32)
!399 = !{!366}
!400 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !403, file: !408, line: 13, type: !425, isLocal: true, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !405, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!405 = !{!406, !401}
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "mpu_config", scope: !403, file: !408, line: 37, type: !409, isLocal: false, isDefinition: true)
!408 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !390, line: 41, size: 64, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !410, file: !390, line: 43, baseType: !121, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !410, file: !390, line: 45, baseType: !414, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !390, line: 27, size: 96, elements: !417)
!417 = !{!418, !419, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !416, file: !390, line: 29, baseType: !121, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !416, file: !390, line: 31, baseType: !192, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !416, file: !390, line: 37, baseType: !421, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !360, line: 146, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !360, line: 141, size: 32, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !422, file: !360, line: 143, baseType: !121, size: 32)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 192, elements: !261)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !428, file: !485, line: 603, type: !487, isLocal: true, isDefinition: true, align: 32)
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !430, globals: !482, splitDebugInlining: false, nameTableKind: None)
!429 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!430 = !{!102, !103, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !434, line: 336, size: 160, elements: !435)
!434 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!435 = !{!436, !456, !460, !464, !477}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !433, file: !434, line: 365, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DISubroutineType(types: !439)
!439 = !{!103, !440, !455}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !443)
!443 = !{!444, !445, !446, !447, !453, !454}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !442, file: !189, line: 380, baseType: !192, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !442, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !442, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !442, file: !189, line: 386, baseType: !448, size: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !449, file: !189, line: 359, baseType: !202, size: 8)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !449, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !442, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !442, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !433, file: !434, line: 366, baseType: !457, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !440, !203}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !433, file: !434, line: 374, baseType: !461, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = !DISubroutineType(types: !463)
!463 = !{!103, !440}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !433, file: !434, line: 377, baseType: !465, size: 32, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DISubroutineType(types: !467)
!467 = !{!103, !440, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !434, line: 122, size: 64, elements: !471)
!471 = !{!472, !473, !474, !475, !476}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !470, file: !434, line: 123, baseType: !121, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !470, file: !434, line: 124, baseType: !202, size: 8, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !470, file: !434, line: 125, baseType: !202, size: 8, offset: 40)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !470, file: !434, line: 126, baseType: !202, size: 8, offset: 48)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !470, file: !434, line: 127, baseType: !202, size: 8, offset: 56)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !433, file: !434, line: 379, baseType: !478, size: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DISubroutineType(types: !480)
!480 = !{!103, !440, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!482 = !{!426, !483}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !428, file: !485, line: 38, type: !486, isLocal: true, isDefinition: true)
!485 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !488, file: !180, line: 60, baseType: !461, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !488, file: !180, line: 65, baseType: !440, size: 32, offset: 32)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !494, file: !499, line: 7, type: !500, isLocal: false, isDefinition: true, align: 16)
!494 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !496, splitDebugInlining: false, nameTableKind: None)
!495 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!496 = !{!492, !497}
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !494, file: !499, line: 12, type: !500, isLocal: false, isDefinition: true, align: 16)
!499 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 48, elements: !152)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !503, file: !564, line: 234, type: !599, isLocal: true, isDefinition: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !505, globals: !561, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!505 = !{!506, !121}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !509, line: 134, size: 128, elements: !510)
!509 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!510 = !{!511, !531, !536, !556}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !508, file: !509, line: 135, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !509, line: 113, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!514 = !DISubroutineType(types: !515)
!515 = !{!103, !516, !202}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !519)
!519 = !{!520, !521, !522, !523, !529, !530}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !518, file: !189, line: 380, baseType: !192, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !518, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !518, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !518, file: !189, line: 386, baseType: !524, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !525, file: !189, line: 359, baseType: !202, size: 8)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !525, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !518, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !518, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !508, file: !509, line: 136, baseType: !532, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !509, line: 119, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!534 = !DISubroutineType(types: !535)
!535 = !{!103, !516}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !508, file: !509, line: 137, baseType: !537, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !509, line: 125, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = !DISubroutineType(types: !540)
!540 = !{!103, !516, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !509, line: 88, size: 128, elements: !544)
!544 = !{!545, !550, !555}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !543, file: !509, line: 90, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !509, line: 72, size: 64, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !546, file: !509, line: 74, baseType: !121, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !546, file: !509, line: 76, baseType: !121, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !543, file: !509, line: 92, baseType: !551, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !509, line: 85, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !516, !103}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !543, file: !509, line: 104, baseType: !202, size: 8, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !508, file: !509, line: 138, baseType: !557, size: 32, offset: 96)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !509, line: 132, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DISubroutineType(types: !560)
!560 = !{!103, !516, !103}
!561 = !{!562, !566, !568, !575, !501, !577, !579, !587}
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !503, file: !564, line: 256, type: !565, isLocal: false, isDefinition: true, align: 16)
!564 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 80, elements: !156)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !503, file: !564, line: 256, type: !517, isLocal: false, isDefinition: true, align: 32)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !503, file: !564, line: 256, type: !570, isLocal: true, isDefinition: true, align: 32)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !571, file: !180, line: 60, baseType: !533, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !571, file: !180, line: 65, baseType: !516, size: 32, offset: 32)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !503, file: !564, line: 256, type: !525, isLocal: true, isDefinition: true, align: 8)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !503, file: !564, line: 227, type: !507, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !503, file: !564, line: 45, type: !581, isLocal: true, isDefinition: true)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !564, line: 38, size: 96, elements: !582)
!582 = !{!583, !584, !585, !586}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !581, file: !564, line: 39, baseType: !551, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !581, file: !564, line: 40, baseType: !121, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !581, file: !564, line: 41, baseType: !205, size: 8, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !581, file: !564, line: 42, baseType: !205, size: 8, offset: 72)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !589, file: !564, line: 240, type: !592, isLocal: true, isDefinition: true, align: 32)
!589 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !564, file: !564, line: 238, type: !590, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !503, retainedNodes: !341)
!590 = !DISubroutineType(types: !591)
!591 = !{null}
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !593)
!593 = !{!594, !596, !597, !598}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !592, file: !10, line: 55, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !592, file: !10, line: 57, baseType: !595, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !592, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !592, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !564, line: 34, size: 32, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !600, file: !564, line: 35, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !605, line: 45, baseType: !606)
!605 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !605, line: 41, size: 96, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !606, file: !605, line: 42, baseType: !120, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !606, file: !605, line: 43, baseType: !120, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !606, file: !605, line: 44, baseType: !124, size: 32, offset: 64)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !613, file: !701, line: 494, type: !748, isLocal: true, isDefinition: true)
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !615, retainedTypes: !648, globals: !698, splitDebugInlining: false, nameTableKind: None)
!614 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!615 = !{!616, !623, !629, !636, !641}
!616 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !434, line: 47, baseType: !32, size: 32, elements: !617)
!617 = !{!618, !619, !620, !621, !622}
!618 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!619 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!620 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!621 = !DIEnumerator(name: "UART_BREAK", value: 8)
!622 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!623 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !434, line: 84, baseType: !32, size: 32, elements: !624)
!624 = !{!625, !626, !627, !628}
!625 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!626 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!627 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!628 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !434, line: 92, baseType: !32, size: 32, elements: !630)
!630 = !{!631, !632, !633, !634, !635}
!631 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!632 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!633 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!634 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!635 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !434, line: 107, baseType: !32, size: 32, elements: !637)
!637 = !{!638, !639, !640}
!638 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!639 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!640 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !434, line: 75, baseType: !32, size: 32, elements: !642)
!642 = !{!643, !644, !645, !646, !647}
!643 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!644 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!645 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!646 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!647 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!648 = !{!649, !102, !203, !121}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !434, line: 336, size: 160, elements: !652)
!652 = !{!653, !672, !676, !680, !693}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !651, file: !434, line: 365, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = !DISubroutineType(types: !656)
!656 = !{!103, !657, !455}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !660)
!660 = !{!661, !662, !663, !664, !670, !671}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !659, file: !189, line: 380, baseType: !192, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !659, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !659, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !659, file: !189, line: 386, baseType: !665, size: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !666, file: !189, line: 359, baseType: !202, size: 8)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !666, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !659, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !659, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !651, file: !434, line: 366, baseType: !673, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !657, !203}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !651, file: !434, line: 374, baseType: !677, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 32)
!678 = !DISubroutineType(types: !679)
!679 = !{!103, !657}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !651, file: !434, line: 377, baseType: !681, size: 32, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!682 = !DISubroutineType(types: !683)
!683 = !{!103, !657, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !434, line: 122, size: 64, elements: !687)
!687 = !{!688, !689, !690, !691, !692}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !686, file: !434, line: 123, baseType: !121, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !686, file: !434, line: 124, baseType: !202, size: 8, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !686, file: !434, line: 125, baseType: !202, size: 8, offset: 40)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !686, file: !434, line: 126, baseType: !202, size: 8, offset: 48)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !686, file: !434, line: 127, baseType: !202, size: 8, offset: 56)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !651, file: !434, line: 379, baseType: !694, size: 32, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DISubroutineType(types: !696)
!696 = !{!103, !657, !697}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!698 = !{!699, !705, !707, !714, !716, !718, !611, !723, !742, !745}
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !613, file: !701, line: 494, type: !702, isLocal: false, isDefinition: true, align: 16)
!701 = !DIFile(filename: "zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 6)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !613, file: !701, line: 494, type: !658, isLocal: false, isDefinition: true, align: 32)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !613, file: !701, line: 494, type: !709, isLocal: true, isDefinition: true, align: 32)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !711)
!711 = !{!712, !713}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !710, file: !180, line: 60, baseType: !677, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !710, file: !180, line: 65, baseType: !657, size: 32, offset: 32)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_21", scope: !613, file: !701, line: 494, type: !666, isLocal: true, isDefinition: true, align: 8)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "uart_sam_driver_api", scope: !613, file: !701, line: 419, type: !650, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "uart0_sam_data", scope: !613, file: !701, line: 494, type: !720, isLocal: true, isDefinition: true)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_data", file: !701, line: 38, size: 32, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !720, file: !701, line: 39, baseType: !121, size: 32)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_21", scope: !613, file: !701, line: 494, type: !725, isLocal: true, isDefinition: true)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !727, line: 60, size: 64, elements: !728)
!727 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!728 = !{!729, !741}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !726, file: !727, line: 69, baseType: !730, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !727, line: 50, size: 64, elements: !733)
!733 = !{!734, !739, !740}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !732, file: !727, line: 52, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !738, line: 32, baseType: !121)
!738 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl/pinctrl_soc_sam_common.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !732, file: !727, line: 54, baseType: !202, size: 8, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !732, file: !727, line: 56, baseType: !202, size: 8, offset: 40)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !726, file: !727, line: 71, baseType: !202, size: 8, offset: 32)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_21", scope: !613, file: !701, line: 494, type: !744, isLocal: true, isDefinition: true)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 64, elements: !136)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_21", scope: !613, file: !701, line: 494, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 64, elements: !261)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_cfg", file: !701, line: 27, size: 96, elements: !750)
!750 = !{!751, !780, !781}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !749, file: !701, line: 28, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uart", file: !754, line: 62, baseType: !755)
!754 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !754, line: 41, size: 2368, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "UART_CR", scope: !755, file: !754, line: 42, baseType: !120, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "UART_MR", scope: !755, file: !754, line: 43, baseType: !120, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IER", scope: !755, file: !754, line: 44, baseType: !120, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IDR", scope: !755, file: !754, line: 45, baseType: !120, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IMR", scope: !755, file: !754, line: 46, baseType: !124, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "UART_SR", scope: !755, file: !754, line: 47, baseType: !124, size: 32, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RHR", scope: !755, file: !754, line: 48, baseType: !124, size: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "UART_THR", scope: !755, file: !754, line: 49, baseType: !120, size: 32, offset: 224)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "UART_BRGR", scope: !755, file: !754, line: 50, baseType: !120, size: 32, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !755, file: !754, line: 51, baseType: !767, size: 1760, offset: 288)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 1760, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 55)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RPR", scope: !755, file: !754, line: 52, baseType: !120, size: 32, offset: 2048)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RCR", scope: !755, file: !754, line: 53, baseType: !120, size: 32, offset: 2080)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TPR", scope: !755, file: !754, line: 54, baseType: !120, size: 32, offset: 2112)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TCR", scope: !755, file: !754, line: 55, baseType: !120, size: 32, offset: 2144)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNPR", scope: !755, file: !754, line: 56, baseType: !120, size: 32, offset: 2176)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNCR", scope: !755, file: !754, line: 57, baseType: !120, size: 32, offset: 2208)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNPR", scope: !755, file: !754, line: 58, baseType: !120, size: 32, offset: 2240)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNCR", scope: !755, file: !754, line: 59, baseType: !120, size: 32, offset: 2272)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTCR", scope: !755, file: !754, line: 60, baseType: !120, size: 32, offset: 2304)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTSR", scope: !755, file: !754, line: 61, baseType: !124, size: 32, offset: 2336)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "periph_id", scope: !749, file: !701, line: 29, baseType: !121, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pcfg", scope: !749, file: !701, line: 30, baseType: !782, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "overflow_cyc", scope: !785, file: !921, line: 65, type: !120, isLocal: true, isDefinition: true)
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !787, retainedTypes: !841, globals: !918, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/timer/cortex_m_systick.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!787 = !{!788}
!788 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !789, line: 57, baseType: !103, size: 32, elements: !790)
!789 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/sam3x8e.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840}
!791 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!792 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!793 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!794 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!795 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!796 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!797 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!798 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!799 = !DIEnumerator(name: "SUPC_IRQn", value: 0)
!800 = !DIEnumerator(name: "RSTC_IRQn", value: 1)
!801 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!802 = !DIEnumerator(name: "RTT_IRQn", value: 3)
!803 = !DIEnumerator(name: "WDT_IRQn", value: 4)
!804 = !DIEnumerator(name: "PMC_IRQn", value: 5)
!805 = !DIEnumerator(name: "EFC0_IRQn", value: 6)
!806 = !DIEnumerator(name: "EFC1_IRQn", value: 7)
!807 = !DIEnumerator(name: "UART_IRQn", value: 8)
!808 = !DIEnumerator(name: "SMC_IRQn", value: 9)
!809 = !DIEnumerator(name: "PIOA_IRQn", value: 11)
!810 = !DIEnumerator(name: "PIOB_IRQn", value: 12)
!811 = !DIEnumerator(name: "PIOC_IRQn", value: 13)
!812 = !DIEnumerator(name: "PIOD_IRQn", value: 14)
!813 = !DIEnumerator(name: "USART0_IRQn", value: 17)
!814 = !DIEnumerator(name: "USART1_IRQn", value: 18)
!815 = !DIEnumerator(name: "USART2_IRQn", value: 19)
!816 = !DIEnumerator(name: "USART3_IRQn", value: 20)
!817 = !DIEnumerator(name: "HSMCI_IRQn", value: 21)
!818 = !DIEnumerator(name: "TWI0_IRQn", value: 22)
!819 = !DIEnumerator(name: "TWI1_IRQn", value: 23)
!820 = !DIEnumerator(name: "SPI0_IRQn", value: 24)
!821 = !DIEnumerator(name: "SSC_IRQn", value: 26)
!822 = !DIEnumerator(name: "TC0_IRQn", value: 27)
!823 = !DIEnumerator(name: "TC1_IRQn", value: 28)
!824 = !DIEnumerator(name: "TC2_IRQn", value: 29)
!825 = !DIEnumerator(name: "TC3_IRQn", value: 30)
!826 = !DIEnumerator(name: "TC4_IRQn", value: 31)
!827 = !DIEnumerator(name: "TC5_IRQn", value: 32)
!828 = !DIEnumerator(name: "TC6_IRQn", value: 33)
!829 = !DIEnumerator(name: "TC7_IRQn", value: 34)
!830 = !DIEnumerator(name: "TC8_IRQn", value: 35)
!831 = !DIEnumerator(name: "PWM_IRQn", value: 36)
!832 = !DIEnumerator(name: "ADC_IRQn", value: 37)
!833 = !DIEnumerator(name: "DACC_IRQn", value: 38)
!834 = !DIEnumerator(name: "DMAC_IRQn", value: 39)
!835 = !DIEnumerator(name: "UOTGHS_IRQn", value: 40)
!836 = !DIEnumerator(name: "TRNG_IRQn", value: 41)
!837 = !DIEnumerator(name: "EMAC_IRQn", value: 42)
!838 = !DIEnumerator(name: "CAN0_IRQn", value: 43)
!839 = !DIEnumerator(name: "CAN1_IRQn", value: 44)
!840 = !DIEnumerator(name: "PERIPH_COUNT_IRQn", value: 45)
!841 = !{!842, !844, !595, !202, !121, !852, !885}
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !843, line: 46, baseType: !299)
!843 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !373, line: 712, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 706, size: 128, elements: !847)
!847 = !{!848, !849, !850, !851}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !846, file: !373, line: 708, baseType: !120, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !846, file: !373, line: 709, baseType: !120, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !846, file: !373, line: 710, baseType: !120, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !846, file: !373, line: 711, baseType: !124, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !373, line: 360, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 345, size: 28704, elements: !855)
!855 = !{!856, !860, !864, !865, !866, !867, !868, !869, !870, !871, !875, !880, !884}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !854, file: !373, line: 347, baseType: !857, size: 256)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 8)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !854, file: !373, line: 348, baseType: !861, size: 768, offset: 256)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 768, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 24)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !854, file: !373, line: 349, baseType: !857, size: 256, offset: 1024)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !854, file: !373, line: 350, baseType: !861, size: 768, offset: 1280)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !854, file: !373, line: 351, baseType: !857, size: 256, offset: 2048)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !854, file: !373, line: 352, baseType: !861, size: 768, offset: 2304)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !854, file: !373, line: 353, baseType: !857, size: 256, offset: 3072)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !854, file: !373, line: 354, baseType: !861, size: 768, offset: 3328)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !854, file: !373, line: 355, baseType: !857, size: 256, offset: 4096)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !854, file: !373, line: 356, baseType: !872, size: 1792, offset: 4352)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 1792, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 56)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !854, file: !373, line: 357, baseType: !876, size: 1920, offset: 6144)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, size: 1920, elements: !878)
!877 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !202)
!878 = !{!879}
!879 = !DISubrange(count: 240)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !854, file: !373, line: 358, baseType: !881, size: 20608, offset: 8064)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 20608, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: 644)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !854, file: !373, line: 359, baseType: !120, size: 32, offset: 28672)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !373, line: 402, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 379, size: 1120, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !899, !900, !901, !902, !903, !904, !905, !906, !908, !909, !910, !914, !915, !917}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !887, file: !373, line: 381, baseType: !124, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !887, file: !373, line: 382, baseType: !120, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !887, file: !373, line: 383, baseType: !120, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !887, file: !373, line: 384, baseType: !120, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !887, file: !373, line: 385, baseType: !120, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !887, file: !373, line: 386, baseType: !120, size: 32, offset: 160)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !887, file: !373, line: 387, baseType: !896, size: 96, offset: 192)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, size: 96, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 12)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !887, file: !373, line: 388, baseType: !120, size: 32, offset: 288)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !887, file: !373, line: 389, baseType: !120, size: 32, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !887, file: !373, line: 390, baseType: !120, size: 32, offset: 352)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !887, file: !373, line: 391, baseType: !120, size: 32, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !887, file: !373, line: 392, baseType: !120, size: 32, offset: 416)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !887, file: !373, line: 393, baseType: !120, size: 32, offset: 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !887, file: !373, line: 394, baseType: !120, size: 32, offset: 480)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !887, file: !373, line: 395, baseType: !907, size: 64, offset: 512)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 64, elements: !261)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !887, file: !373, line: 396, baseType: !124, size: 32, offset: 576)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !887, file: !373, line: 397, baseType: !124, size: 32, offset: 608)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !887, file: !373, line: 398, baseType: !911, size: 128, offset: 640)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 128, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 4)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !887, file: !373, line: 399, baseType: !155, size: 160, offset: 768)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !887, file: !373, line: 400, baseType: !916, size: 160, offset: 928)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 160, elements: !156)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !887, file: !373, line: 401, baseType: !120, size: 32, offset: 1088)
!918 = !{!919, !945, !948, !950, !952, !783}
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "__init_sys_clock_driver_init", scope: !785, file: !921, line: 285, type: !922, isLocal: true, isDefinition: true, align: 32)
!921 = !DIFile(filename: "zephyr/drivers/timer/cortex_m_systick.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !924)
!924 = !{!925, !944}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !923, file: !180, line: 60, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DISubroutineType(types: !928)
!928 = !{!103, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !932)
!932 = !{!933, !934, !935, !936, !942, !943}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !189, line: 380, baseType: !192, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !931, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !931, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !931, file: !189, line: 386, baseType: !937, size: 32, offset: 96)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !938, file: !189, line: 359, baseType: !202, size: 8)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !938, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !931, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !931, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !923, file: !180, line: 65, baseType: !929, size: 32, offset: 32)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "lock", scope: !785, file: !921, line: 34, type: !947, isLocal: true, isDefinition: true)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !340, line: 43, elements: !341)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "last_load", scope: !785, file: !921, line: 36, type: !121, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(name: "cycle_count", scope: !785, file: !921, line: 48, type: !121, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "announced_cycles", scope: !785, file: !921, line: 54, type: !121, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "sam_port_addrs", scope: !956, file: !1022, line: 21, type: !1023, isLocal: true, isDefinition: true)
!956 = distinct !DICompileUnit(language: DW_LANG_C99, file: !957, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !958, globals: !1019, splitDebugInlining: false, nameTableKind: None)
!957 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/pinctrl/pinctrl_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/remote")
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pio", file: !961, line: 96, baseType: !962)
!961 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !961, line: 41, size: 1888, elements: !963)
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PER", scope: !962, file: !961, line: 42, baseType: !120, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PDR", scope: !962, file: !961, line: 43, baseType: !120, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PSR", scope: !962, file: !961, line: 44, baseType: !124, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !962, file: !961, line: 45, baseType: !135, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OER", scope: !962, file: !961, line: 46, baseType: !120, size: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ODR", scope: !962, file: !961, line: 47, baseType: !120, size: 32, offset: 160)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OSR", scope: !962, file: !961, line: 48, baseType: !124, size: 32, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !962, file: !961, line: 49, baseType: !135, size: 32, offset: 224)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFER", scope: !962, file: !961, line: 50, baseType: !120, size: 32, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFDR", scope: !962, file: !961, line: 51, baseType: !120, size: 32, offset: 288)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFSR", scope: !962, file: !961, line: 52, baseType: !124, size: 32, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !962, file: !961, line: 53, baseType: !135, size: 32, offset: 352)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SODR", scope: !962, file: !961, line: 54, baseType: !120, size: 32, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_CODR", scope: !962, file: !961, line: 55, baseType: !120, size: 32, offset: 416)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ODSR", scope: !962, file: !961, line: 56, baseType: !120, size: 32, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PDSR", scope: !962, file: !961, line: 57, baseType: !124, size: 32, offset: 480)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IER", scope: !962, file: !961, line: 58, baseType: !120, size: 32, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IDR", scope: !962, file: !961, line: 59, baseType: !120, size: 32, offset: 544)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IMR", scope: !962, file: !961, line: 60, baseType: !124, size: 32, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ISR", scope: !962, file: !961, line: 61, baseType: !124, size: 32, offset: 608)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDER", scope: !962, file: !961, line: 62, baseType: !120, size: 32, offset: 640)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDDR", scope: !962, file: !961, line: 63, baseType: !120, size: 32, offset: 672)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDSR", scope: !962, file: !961, line: 64, baseType: !124, size: 32, offset: 704)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !962, file: !961, line: 65, baseType: !135, size: 32, offset: 736)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUDR", scope: !962, file: !961, line: 66, baseType: !120, size: 32, offset: 768)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUER", scope: !962, file: !961, line: 67, baseType: !120, size: 32, offset: 800)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUSR", scope: !962, file: !961, line: 68, baseType: !124, size: 32, offset: 832)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !962, file: !961, line: 69, baseType: !135, size: 32, offset: 864)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ABSR", scope: !962, file: !961, line: 70, baseType: !120, size: 32, offset: 896)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !962, file: !961, line: 71, baseType: !994, size: 96, offset: 928)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 96, elements: !152)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SCIFSR", scope: !962, file: !961, line: 72, baseType: !120, size: 32, offset: 1024)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_DIFSR", scope: !962, file: !961, line: 73, baseType: !120, size: 32, offset: 1056)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFDGSR", scope: !962, file: !961, line: 74, baseType: !124, size: 32, offset: 1088)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SCDR", scope: !962, file: !961, line: 75, baseType: !120, size: 32, offset: 1120)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !962, file: !961, line: 76, baseType: !911, size: 128, offset: 1152)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OWER", scope: !962, file: !961, line: 77, baseType: !120, size: 32, offset: 1280)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OWDR", scope: !962, file: !961, line: 78, baseType: !120, size: 32, offset: 1312)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OWSR", scope: !962, file: !961, line: 79, baseType: !124, size: 32, offset: 1344)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !962, file: !961, line: 80, baseType: !135, size: 32, offset: 1376)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_AIMER", scope: !962, file: !961, line: 81, baseType: !120, size: 32, offset: 1408)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_AIMDR", scope: !962, file: !961, line: 82, baseType: !120, size: 32, offset: 1440)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_AIMMR", scope: !962, file: !961, line: 83, baseType: !124, size: 32, offset: 1472)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved9", scope: !962, file: !961, line: 84, baseType: !135, size: 32, offset: 1504)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ESR", scope: !962, file: !961, line: 85, baseType: !120, size: 32, offset: 1536)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_LSR", scope: !962, file: !961, line: 86, baseType: !120, size: 32, offset: 1568)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ELSR", scope: !962, file: !961, line: 87, baseType: !124, size: 32, offset: 1600)
