; ModuleID = 'nuttx.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "armv7-none-unknown-eabi"

%struct.section_mapping_s = type { i32, i32, i32, i32 }
%struct.dq_entry_s = type { %struct.dq_entry_s*, %struct.dq_entry_s* }
%struct.task_tcb_s = type { %struct.tcb_s }
%struct.tcb_s = type { %struct.tcb_s*, %struct.tcb_s*, %struct.task_group_s*, i32, i8, i8, void ()*, %union.entry_u, i8, i16, i16, i16, i32, %struct.wdog_s, i32, i8*, i8*, %struct.sem_s*, i32, i32, %struct.sq_queue_s, %struct.sq_queue_s, %struct.siginfo, %struct.mqueue_inode_s*, %struct.pthread_mutex_s*, %struct.xcptcontext, [32 x i8] }
%struct.task_group_s = type { i32, i32, i8, i8, i8, i8, %struct.sem_s, i32*, %struct.sem_s, %struct.join_s*, %struct.join_s*, %struct.task_info_s*, %struct.sq_queue_s, %struct.sq_queue_s, i8*, %struct.filelist, %struct.streamlist }
%struct.sem_s = type { i16 }
%struct.join_s = type { %struct.join_s*, i8, i8, i8, i32, %struct.sem_s, %struct.sem_s, i8* }
%struct.task_info_s = type { %struct.sem_s, i8**, i8, [4 x void (i8*)*], %struct.getopt_s, i32 }
%struct.getopt_s = type { i8*, i32, i32, i32, i8*, i8 }
%struct.filelist = type { %struct.sem_s, i8, %struct.file** }
%struct.file = type { i32, i32, %struct.inode*, i8* }
%struct.inode = type { %struct.inode*, %struct.inode*, %struct.inode*, i16, i16, %union.inode_ops_u, i8*, [1 x i8] }
%union.inode_ops_u = type { %struct.file_operations* }

!1 = distinct !DIGlobalVariable(name: "g_srctype", scope: !2, file: !28, line: 83, type: !40, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !15, globals: !34, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/arch/arm/src/chip/sam_irq.c", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/arch/arm/src", checksumkind: CSK_MD5, checksum: "9337fa34312188258845b5c40acabd5d")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sam_srctype_e", file: !6, line: 42, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "chip/sam_irq.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/arch/arm/src", checksumkind: CSK_MD5, checksum: "ec5912e691fe2b7c838a184b54057f51")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "SRCTYPE_IHIGH", value: 0)
!10 = !DIEnumerator(name: "SRCTYPE_XLOW", value: 1)
!11 = !DIEnumerator(name: "SRCTYPE_IRISING", value: 2)
!12 = !DIEnumerator(name: "SRCTYPE_XFALLING", value: 3)
!13 = !DIEnumerator(name: "SRCTYPE_XHIGH", value: 4)
!14 = !DIEnumerator(name: "SRCTYPE_XRISING", value: 5)
!15 = !{!16, !18, !23, !25, !27, !33}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !19, line: 172, baseType: !20)
!19 = !DIFile(filename: "include/stdint.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "b66f8593177b980ee1de20b71b61ef8f")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "_uint32_t", file: !21, line: 60, baseType: !22)
!21 = !DIFile(filename: "include/arch/types.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "3cb099b7f4e7636df33c4e06ad51a4f2")
!22 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !19, line: 234, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "_size_t", file: !21, line: 86, baseType: !7)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 119, baseType: !24)
!26 = !DIFile(filename: "include/sys/types.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "58ffc3844ec6ffadd013009ac7eb6b67")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "doirq_t", file: !28, line: 60, baseType: !29)
!28 = !DIFile(filename: "chip/sam_irq.c", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/arch/arm/src", checksumkind: CSK_MD5, checksum: "9337fa34312188258845b5c40acabd5d")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !33, !32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !{!35, !0}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "g_current_regs", scope: !2, file: !28, line: 72, type: !37, isLocal: false, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 32, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 48, elements: !45)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !19, line: 161, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "_uint8_t", file: !21, line: 54, baseType: !44)
!44 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !{!46}
!46 = !DISubrange(count: 6)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "g_section_mapping", scope: !49, file: !54, line: 50, type: !71, isLocal: false, isDefinition: true)
!49 = distinct !DICompileUnit(language: DW_LANG_C99, file: !50, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !51, splitDebugInlining: false, nameTableKind: None)
!50 = !DIFile(filename: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/arch/arm/src/chip/sam_memorymap.c", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/arch/arm/src", checksumkind: CSK_MD5, checksum: "b945d0d0691d7544f777917367a73e01")
!51 = !{!47, !52, !56, !69}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "g_num_mappings", scope: !49, file: !54, line: 231, type: !55, isLocal: false, isDefinition: true)
!54 = !DIFile(filename: "chip/sama5d3x_memorymap.c", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/arch/arm/src", checksumkind: CSK_MD5, checksum: "71bff4f757326a12c43ac065c1c6e2b7")
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "g_operational_mapping", scope: !49, file: !54, line: 242, type: !58, isLocal: false, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !67)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_mapping_s", file: !61, line: 901, size: 128, elements: !62)
!61 = !DIFile(filename: "armv7-a/mmu.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/arch/arm/src", checksumkind: CSK_MD5, checksum: "e568a3427d4a26444031720fd42ca2b1")
!62 = !{!63, !64, !65, !66}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "physbase", scope: !60, file: !61, line: 903, baseType: !18, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "virtbase", scope: !60, file: !61, line: 904, baseType: !18, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mmuflags", scope: !60, file: !61, line: 905, baseType: !18, size: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "nsections", scope: !60, file: !61, line: 906, baseType: !18, size: 32, offset: 96)
!67 = !{!68}
!68 = !DISubrange(count: 2)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "g_num_opmappings", scope: !49, file: !54, line: 268, type: !55, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 1920, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 15)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "g_piobase", scope: !76, file: !87, line: 58, type: !99, isLocal: false, isDefinition: true)
!76 = distinct !DICompileUnit(language: DW_LANG_C99, file: !77, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !78, retainedTypes: !83, globals: !84, splitDebugInlining: false, nameTableKind: None)
!77 = !DIFile(filename: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/arch/arm/src/chip/sam_pio.c", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/arch/arm/src", checksumkind: CSK_MD5, checksum: "5c206047a2d6bdd2278232e3282a5188")
!78 = !{!79}
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 297, baseType: !33, size: 32, elements: !80)
!80 = !{!81, !82}
!81 = !DIEnumerator(name: "ERROR", value: -1)
!82 = !DIEnumerator(name: "OK", value: 0)
!83 = !{!16}
!84 = !{!74, !85, !91, !94}
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "g_forced", scope: !76, file: !87, line: 168, type: !88, isLocal: true, isDefinition: true)
!87 = !DIFile(filename: "chip/sama5d3x4x_pio.c", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/arch/arm/src", checksumkind: CSK_MD5, checksum: "a80fe0d6005021a0b0c19e4960af2769")
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 5)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "g_piopid", scope: !76, file: !87, line: 103, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 40, elements: !89)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "g_piointerrupt", scope: !76, file: !87, line: 124, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 40, elements: !89)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 160, elements: !89)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "g_waitingforsignal", scope: !103, file: !104, line: 143, type: !162, isLocal: false, isDefinition: true)
!103 = distinct !DICompileUnit(language: DW_LANG_C99, file: !104, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !105, retainedTypes: !129, globals: !152, splitDebugInlining: false, nameTableKind: None)
!104 = !DIFile(filename: "init/nx_start.c", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/sched", checksumkind: CSK_MD5, checksum: "d658144970e782242091f3dbc120313e")
!105 = !{!106, !116}
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nx_initstate_e", file: !107, line: 53, baseType: !7, size: 32, elements: !108)
!107 = !DIFile(filename: "include/nuttx/init.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "1dc31a5659cee00e7b2f6abb19fd2dc6")
!108 = !{!109, !110, !111, !112, !113, !114, !115}
!109 = !DIEnumerator(name: "OSINIT_POWERUP", value: 0)
!110 = !DIEnumerator(name: "OSINIT_BOOT", value: 1)
!111 = !DIEnumerator(name: "OSINIT_TASKLISTS", value: 2)
!112 = !DIEnumerator(name: "OSINIT_MEMORY", value: 3)
!113 = !DIEnumerator(name: "OSINIT_HARDWARE", value: 4)
!114 = !DIEnumerator(name: "OSINIT_OSREADY", value: 5)
!115 = !DIEnumerator(name: "OSINIT_IDLELOOP", value: 6)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tstate_e", file: !117, line: 202, baseType: !7, size: 32, elements: !118)
!117 = !DIFile(filename: "include/nuttx/sched.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "c90b3a479f9369b40c8b83c581b8d4c9")
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!119 = !DIEnumerator(name: "TSTATE_TASK_INVALID", value: 0)
!120 = !DIEnumerator(name: "TSTATE_TASK_PENDING", value: 1)
!121 = !DIEnumerator(name: "TSTATE_TASK_READYTORUN", value: 2)
!122 = !DIEnumerator(name: "TSTATE_TASK_RUNNING", value: 3)
!123 = !DIEnumerator(name: "TSTATE_TASK_INACTIVE", value: 4)
!124 = !DIEnumerator(name: "TSTATE_WAIT_SEM", value: 5)
!125 = !DIEnumerator(name: "TSTATE_WAIT_SIG", value: 6)
!126 = !DIEnumerator(name: "TSTATE_WAIT_MQNOTEMPTY", value: 7)
!127 = !DIEnumerator(name: "TSTATE_WAIT_MQNOTFULL", value: 8)
!128 = !DIEnumerator(name: "NUM_TASK_STATES", value: 9)
!129 = !{!130, !131, !138, !144}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "main_t", file: !26, line: 293, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DISubroutineType(types: !134)
!134 = !{!33, !33, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "dq_queue_t", file: !140, line: 112, baseType: !141)
!140 = !DIFile(filename: "include/queue.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "d6e79b86d02a4c727e89328f47fb9b99")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dq_queue_s", file: !140, line: 107, size: 64, elements: !142)
!142 = !{!143, !151}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !140, line: 109, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "dq_entry_t", file: !140, line: 98, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dq_entry_s", file: !140, line: 93, size: 64, elements: !147)
!147 = !{!148, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flink", scope: !146, file: !140, line: 95, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "blink", scope: !146, file: !140, line: 96, baseType: !149, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !141, file: !140, line: 110, baseType: !144, size: 32, offset: 32)
!152 = !{!153, !166, !168, !508, !510, !101, !512, !514, !516, !518, !521, !524, !527, !529, !535, !539}
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "g_tasklisttable", scope: !103, file: !104, line: 202, type: !155, isLocal: false, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 576, elements: !164)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tasklist_s", file: !158, line: 97, size: 64, elements: !159)
!158 = !DIFile(filename: "sched/sched.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/sched", checksumkind: CSK_MD5, checksum: "fe14b3999fd7d0572356892b327c736c")
!159 = !{!160, !163}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !157, file: !158, line: 99, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !139)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !157, file: !158, line: 100, baseType: !42, size: 8, offset: 32)
!164 = !{!165}
!165 = !DISubrange(count: 9)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "g_readytorun", scope: !103, file: !104, line: 87, type: !162, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "g_running_tasks", scope: !103, file: !104, line: 127, type: !170, isLocal: false, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 32, elements: !38)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcb_s", file: !117, line: 539, size: 1248, elements: !173)
!173 = !{!174, !175, !176, !372, !373, !374, !375, !380, !392, !393, !394, !395, !396, !397, !413, !414, !415, !416, !417, !420, !421, !422, !423, !435, !489, !497, !504}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "flink", scope: !172, file: !117, line: 543, baseType: !171, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "blink", scope: !172, file: !117, line: 544, baseType: !171, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !172, file: !117, line: 548, baseType: !177, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_group_s", file: !117, line: 407, size: 3200, elements: !179)
!179 = !{!180, !182, !183, !184, !185, !186, !187, !197, !199, !200, !203, !204, !232, !244, !245, !248, !334}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tg_pid", scope: !178, file: !117, line: 412, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !26, line: 148, baseType: !33)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tg_ppid", scope: !178, file: !117, line: 413, baseType: !181, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tg_flags", scope: !178, file: !117, line: 414, baseType: !42, size: 8, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tg_nmembers", scope: !178, file: !117, line: 425, baseType: !42, size: 8, offset: 72)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tg_nwaiters", scope: !178, file: !117, line: 452, baseType: !42, size: 8, offset: 80)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tg_waitflags", scope: !178, file: !117, line: 453, baseType: !42, size: 8, offset: 88)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tg_exitsem", scope: !178, file: !117, line: 454, baseType: !188, size: 16, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !189, line: 117, baseType: !190)
!189 = !DIFile(filename: "include/semaphore.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "01a0d7de40acc1eca172d03e00bee02d")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sem_s", file: !189, line: 98, size: 16, elements: !191)
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "semcount", scope: !190, file: !189, line: 100, baseType: !193, size: 16)
!193 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !19, line: 163, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "_int16_t", file: !21, line: 56, baseType: !196)
!196 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tg_statloc", scope: !178, file: !117, line: 455, baseType: !198, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tg_joinsem", scope: !178, file: !117, line: 463, baseType: !188, size: 16, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tg_joinhead", scope: !178, file: !117, line: 464, baseType: !201, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "join_s", file: !117, line: 399, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tg_jointail", scope: !178, file: !117, line: 465, baseType: !201, size: 32, offset: 224)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tg_info", scope: !178, file: !117, line: 470, baseType: !205, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_info_s", file: !207, line: 120, size: 448, elements: !208)
!207 = !DIFile(filename: "include/nuttx/tls.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "2bf51f74d9e4d6265f7f293f1d801bed")
!208 = !{!209, !210, !211, !213, !221, !230}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ta_sem", scope: !206, file: !207, line: 122, baseType: !188, size: 16)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !206, file: !207, line: 123, baseType: !135, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ta_tlsset", scope: !206, file: !207, line: 128, baseType: !212, size: 8, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "tls_ndxset_t", file: !207, line: 82, baseType: !42)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ta_tlsdtor", scope: !206, file: !207, line: 129, baseType: !214, size: 128, offset: 96)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 128, elements: !219)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "tls_dtor_t", file: !207, line: 85, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !130}
!219 = !{!220}
!220 = !DISubrange(count: 4)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ta_getopt", scope: !206, file: !207, line: 132, baseType: !222, size: 192, offset: 224)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "getopt_s", file: !207, line: 105, size: 192, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "go_optarg", scope: !222, file: !207, line: 109, baseType: !136, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "go_opterr", scope: !222, file: !207, line: 110, baseType: !33, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "go_optind", scope: !222, file: !207, line: 111, baseType: !33, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "go_optopt", scope: !222, file: !207, line: 112, baseType: !33, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "go_optptr", scope: !222, file: !207, line: 116, baseType: !136, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "go_binitialized", scope: !222, file: !207, line: 117, baseType: !98, size: 8, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ta_umask", scope: !206, file: !207, line: 133, baseType: !231, size: 32, offset: 416)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !26, line: 101, baseType: !7)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tg_sigactionq", scope: !178, file: !117, line: 474, baseType: !233, size: 64, offset: 288)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "sq_queue_t", file: !140, line: 105, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sq_queue_s", file: !140, line: 100, size: 64, elements: !235)
!235 = !{!236, !243}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !234, file: !140, line: 102, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "sq_entry_t", file: !140, line: 91, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sq_entry_s", file: !140, line: 87, size: 32, elements: !240)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flink", scope: !239, file: !140, line: 89, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !234, file: !140, line: 103, baseType: !237, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tg_sigpendingq", scope: !178, file: !117, line: 475, baseType: !233, size: 64, offset: 352)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "itimer", scope: !178, file: !117, line: 489, baseType: !246, size: 32, offset: 416)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_t", file: !247, line: 103, baseType: !130)
!247 = !DIFile(filename: "include/time.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "2739a52c3d83b76619c6d5218ee6bc9d")
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tg_filelist", scope: !178, file: !117, line: 501, baseType: !249, size: 64, offset: 448)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filelist", file: !250, line: 416, size: 64, elements: !251)
!250 = !DIFile(filename: "include/nuttx/fs/fs.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "53e2de4b69cb0423f321ee00b8bc3d32")
!251 = !{!252, !253, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "fl_sem", scope: !249, file: !250, line: 418, baseType: !188, size: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "fl_rows", scope: !249, file: !250, line: 419, baseType: !42, size: 8, offset: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "fl_files", scope: !249, file: !250, line: 420, baseType: !255, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !250, line: 401, size: 128, elements: !258)
!258 = !{!259, !260, !265, !333}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "f_oflags", scope: !257, file: !250, line: 403, baseType: !33, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "f_pos", scope: !257, file: !250, line: 404, baseType: !261, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !26, line: 215, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !19, line: 171, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "_int32_t", file: !21, line: 59, baseType: !264)
!264 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "f_inode", scope: !257, file: !250, line: 405, baseType: !266, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !250, line: 374, size: 224, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !277, !330, !331}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_parent", scope: !267, file: !250, line: 376, baseType: !266, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_peer", scope: !267, file: !250, line: 377, baseType: !266, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_child", scope: !267, file: !250, line: 378, baseType: !266, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_crefs", scope: !267, file: !250, line: 379, baseType: !194, size: 16, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !267, file: !250, line: 380, baseType: !274, size: 16, offset: 112)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !19, line: 164, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "_uint16_t", file: !21, line: 57, baseType: !276)
!276 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !267, file: !250, line: 381, baseType: !278, size: 32, offset: 128)
!278 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "inode_ops_u", file: !250, line: 356, size: 32, elements: !279)
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_ops", scope: !278, file: !250, line: 358, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_operations", file: !250, line: 190, size: 256, elements: !284)
!284 = !{!285, !289, !290, !296, !302, !306, !310, !326}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !283, file: !250, line: 194, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DISubroutineType(types: !288)
!288 = !{!33, !256}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !283, file: !250, line: 201, baseType: !286, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !283, file: !250, line: 202, baseType: !291, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{!294, !256, !136, !25}
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !26, line: 120, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ssize_t", file: !21, line: 84, baseType: !33)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !283, file: !250, line: 203, baseType: !297, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{!294, !256, !300, !25}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !283, file: !250, line: 205, baseType: !303, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(types: !305)
!305 = !{!261, !256, !261, !33}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl", scope: !283, file: !250, line: 206, baseType: !307, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DISubroutineType(types: !309)
!309 = !{!33, !256, !33, !22}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !283, file: !250, line: 210, baseType: !311, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!33, !256, !314, !98}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !316, line: 109, size: 192, elements: !317)
!316 = !DIFile(filename: "include/sys/poll.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "456812860ad5c77241a583211569341d")
!317 = !{!318, !319, !321, !322, !323, !325}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !315, file: !316, line: 113, baseType: !33, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !315, file: !316, line: 114, baseType: !320, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "pollevent_t", file: !316, line: 98, baseType: !18)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !315, file: !316, line: 115, baseType: !320, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !315, file: !316, line: 119, baseType: !130, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !315, file: !316, line: 120, baseType: !324, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !315, file: !316, line: 121, baseType: !130, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !283, file: !250, line: 212, baseType: !327, size: 32, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DISubroutineType(types: !329)
!329 = !{!33, !266}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_private", scope: !267, file: !250, line: 390, baseType: !130, size: 32, offset: 160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_name", scope: !267, file: !250, line: 391, baseType: !332, size: 8, offset: 192)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 8, elements: !38)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "f_priv", scope: !257, file: !250, line: 406, baseType: !130, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tg_streamlist", scope: !178, file: !117, line: 514, baseType: !335, size: 2688, offset: 512)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamlist", file: !250, line: 482, size: 2688, elements: !336)
!336 = !{!337, !338, !370, !371}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sl_sem", scope: !335, file: !250, line: 484, baseType: !188, size: 16)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sl_std", scope: !335, file: !250, line: 485, baseType: !339, size: 2592, offset: 32)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 2592, elements: !368)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_struct", file: !250, line: 460, size: 864, elements: !341)
!341 = !{!342, !344, !345, !354, !356, !357, !358, !359, !363, !364, !365, !366}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fs_next", scope: !340, file: !250, line: 462, baseType: !343, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fs_fd", scope: !340, file: !250, line: 463, baseType: !33, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fs_lock", scope: !340, file: !250, line: 465, baseType: !346, size: 96, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "rmutex_t", file: !347, line: 55, baseType: !348)
!347 = !DIFile(filename: "include/nuttx/mutex.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "cd590dda71c7db0d38a713301da6e570")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rmutex_s", file: !347, line: 48, size: 96, elements: !349)
!349 = !{!350, !352, !353}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !348, file: !347, line: 50, baseType: !351, size: 16)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "mutex_t", file: !347, line: 46, baseType: !188)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "holder", scope: !348, file: !347, line: 51, baseType: !181, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !348, file: !347, line: 52, baseType: !274, size: 16, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fs_bufstart", scope: !340, file: !250, line: 466, baseType: !355, size: 32, offset: 160)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fs_bufend", scope: !340, file: !250, line: 467, baseType: !355, size: 32, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fs_bufpos", scope: !340, file: !250, line: 468, baseType: !355, size: 32, offset: 224)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fs_bufread", scope: !340, file: !250, line: 469, baseType: !355, size: 32, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fs_buffer", scope: !340, file: !250, line: 471, baseType: !360, size: 512, offset: 288)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 512, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fs_oflags", scope: !340, file: !250, line: 474, baseType: !274, size: 16, offset: 800)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !340, file: !250, line: 475, baseType: !42, size: 8, offset: 816)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fs_nungotten", scope: !340, file: !250, line: 477, baseType: !42, size: 8, offset: 824)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ungotten", scope: !340, file: !250, line: 478, baseType: !367, size: 16, offset: 832)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 16, elements: !67)
!368 = !{!369}
!369 = !DISubrange(count: 3)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sl_head", scope: !335, file: !250, line: 486, baseType: !343, size: 32, offset: 2624)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sl_tail", scope: !335, file: !250, line: 487, baseType: !343, size: 32, offset: 2656)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !172, file: !117, line: 552, baseType: !181, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !172, file: !117, line: 553, baseType: !42, size: 8, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority", scope: !172, file: !117, line: 554, baseType: !42, size: 8, offset: 136)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !172, file: !117, line: 556, baseType: !376, size: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "start_t", file: !117, line: 244, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DISubroutineType(types: !379)
!379 = !{null}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !172, file: !117, line: 557, baseType: !381, size: 32, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_t", file: !117, line: 256, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "entry_u", file: !117, line: 250, size: 32, elements: !383)
!383 = !{!384, !391}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pthread", scope: !382, file: !117, line: 252, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_startroutine_t", file: !386, line: 210, baseType: !387)
!386 = !DIFile(filename: "include/pthread.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "abb61ea1c679206e84a3345ce8b076d9")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !390}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_addr_t", file: !386, line: 206, baseType: !130)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !382, file: !117, line: 253, baseType: !131, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "task_state", scope: !172, file: !117, line: 559, baseType: !42, size: 8, offset: 224)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !172, file: !117, line: 574, baseType: !274, size: 16, offset: 240)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "lockcount", scope: !172, file: !117, line: 575, baseType: !194, size: 16, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "errcode", scope: !172, file: !117, line: 582, baseType: !194, size: 16, offset: 272)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !172, file: !117, line: 585, baseType: !262, size: 32, offset: 288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "waitdog", scope: !172, file: !117, line: 592, baseType: !398, size: 128, offset: 320)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdog_s", file: !399, line: 66, size: 128, elements: !400)
!399 = !DIFile(filename: "include/nuttx/wdog.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "04fa7448f4bfb4704b948ed7ce4df316")
!400 = !{!401, !403, !409, !412}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !399, line: 68, baseType: !402, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !398, file: !399, line: 69, baseType: !404, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdentry_t", file: !399, line: 62, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !408}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdparm_t", file: !399, line: 53, baseType: !23)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !398, file: !399, line: 73, baseType: !410, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "sclock_t", file: !411, line: 219, baseType: !262)
!411 = !DIFile(filename: "include/nuttx/clock.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "868e8231ffcaba15d73f9a34699977e2")
!412 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !398, file: !399, line: 74, baseType: !408, size: 32, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "adj_stack_size", scope: !172, file: !117, line: 596, baseType: !25, size: 32, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "stack_alloc_ptr", scope: !172, file: !117, line: 599, baseType: !130, size: 32, offset: 480)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "stack_base_ptr", scope: !172, file: !117, line: 601, baseType: !130, size: 32, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "waitsem", scope: !172, file: !117, line: 613, baseType: !324, size: 32, offset: 544)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sigprocmask", scope: !172, file: !117, line: 617, baseType: !418, size: 32, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !419, line: 322, baseType: !18)
!419 = !DIFile(filename: "include/signal.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "e7e42fda935770e0f4e3264da8b6d944")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sigwaitmask", scope: !172, file: !117, line: 618, baseType: !418, size: 32, offset: 608)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sigpendactionq", scope: !172, file: !117, line: 619, baseType: !233, size: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sigpostedq", scope: !172, file: !117, line: 620, baseType: !233, size: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sigunbinfo", scope: !172, file: !117, line: 621, baseType: !424, size: 64, offset: 768)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !419, line: 377, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "siginfo", file: !419, line: 361, size: 64, elements: !426)
!426 = !{!427, !428, !429, !430}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !425, file: !419, line: 363, baseType: !42, size: 8)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !425, file: !419, line: 364, baseType: !42, size: 8, offset: 8)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !425, file: !419, line: 365, baseType: !42, size: 8, offset: 16)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "si_value", scope: !425, file: !419, line: 366, baseType: !431, size: 32, offset: 32)
!431 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !419, line: 334, size: 32, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !431, file: !419, line: 336, baseType: !33, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !431, file: !419, line: 337, baseType: !130, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "msgwaitq", scope: !172, file: !117, line: 626, baseType: !436, size: 32, offset: 832)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqueue_inode_s", file: !438, line: 88, size: 672, elements: !439)
!438 = !DIFile(filename: "include/nuttx/mqueue.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "31336604d5acf9aea0655219d0e6fb3d")
!439 = !{!440, !441, !448, !449, !450, !451, !452, !453, !454, !460, !487}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !437, file: !438, line: 90, baseType: !266, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "msglist", scope: !437, file: !438, line: 91, baseType: !442, size: 64, offset: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_node", file: !443, line: 215, size: 64, elements: !444)
!443 = !DIFile(filename: "include/nuttx/list.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "973f54a00af4d9987c48945250c1b984")
!444 = !{!445, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !442, file: !443, line: 217, baseType: !446, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !442, file: !443, line: 218, baseType: !446, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "maxmsgs", scope: !437, file: !438, line: 92, baseType: !194, size: 16, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "nmsgs", scope: !437, file: !438, line: 93, baseType: !194, size: 16, offset: 112)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nwaitnotfull", scope: !437, file: !438, line: 94, baseType: !194, size: 16, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nwaitnotempty", scope: !437, file: !438, line: 95, baseType: !194, size: 16, offset: 144)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "maxmsgsize", scope: !437, file: !438, line: 97, baseType: !42, size: 8, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ntpid", scope: !437, file: !438, line: 102, baseType: !181, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ntevent", scope: !437, file: !438, line: 103, baseType: !455, size: 64, offset: 224)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigevent", file: !419, line: 347, size: 64, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify", scope: !455, file: !419, line: 349, baseType: !42, size: 8)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_signo", scope: !455, file: !419, line: 350, baseType: !42, size: 8, offset: 8)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_value", scope: !455, file: !419, line: 351, baseType: !431, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ntwork", scope: !437, file: !438, line: 104, baseType: !461, size: 256, offset: 288)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigwork_s", file: !462, line: 50, size: 256, elements: !463)
!462 = !DIFile(filename: "include/nuttx/signal.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "344f813c463eca320f27e8be1a3380cb")
!463 = !{!464, !481, !482}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !461, file: !462, line: 52, baseType: !465, size: 192)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_s", file: !466, line: 246, size: 192, elements: !467)
!466 = !DIFile(filename: "include/nuttx/wqueue.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "b0240cdf1b1e8eb9ea405c81444e3706")
!467 = !{!468, !478, !480}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !465, file: !466, line: 256, baseType: !469, size: 128)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !465, file: !466, line: 248, size: 128, elements: !470)
!470 = !{!471, !477}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !469, file: !466, line: 254, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !466, line: 250, size: 64, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !472, file: !466, line: 252, baseType: !239, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "qtime", scope: !472, file: !466, line: 253, baseType: !476, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !26, line: 239, baseType: !18)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !469, file: !466, line: 255, baseType: !398, size: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !465, file: !466, line: 257, baseType: !479, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "worker_t", file: !466, line: 239, baseType: !216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !465, file: !466, line: 258, baseType: !130, size: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !461, file: !462, line: 53, baseType: !431, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !461, file: !462, line: 54, baseType: !483, size: 32, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigev_notify_function_t", file: !419, line: 345, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !431}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !437, file: !438, line: 106, baseType: !488, size: 128, offset: 544)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 128, elements: !219)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mhead", scope: !172, file: !117, line: 632, baseType: !490, size: 32, offset: 864)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_s", file: !386, line: 291, size: 128, elements: !492)
!492 = !{!493, !494, !495, !496}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flink", scope: !491, file: !386, line: 296, baseType: !490, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !491, file: !386, line: 301, baseType: !188, size: 16, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !491, file: !386, line: 302, baseType: !181, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !491, file: !386, line: 304, baseType: !42, size: 8, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "xcp", scope: !172, file: !117, line: 656, baseType: !498, size: 96, offset: 896)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xcptcontext", file: !499, line: 239, size: 96, elements: !500)
!499 = !DIFile(filename: "include/arch/armv7-a/irq.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx", checksumkind: CSK_MD5, checksum: "96a5e25a682c392d1fbdc2de69470083")
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sigdeliver", scope: !498, file: !499, line: 245, baseType: !130, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "saved_regs", scope: !498, file: !499, line: 251, baseType: !32, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !498, file: !499, line: 268, baseType: !32, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !117, line: 659, baseType: !505, size: 256, offset: 992)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 256, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 32)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "g_pendingtasks", scope: !103, file: !104, line: 135, type: !162, isLocal: false, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "g_waitingforsemaphore", scope: !103, file: !104, line: 139, type: !162, isLocal: false, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "g_waitingformqnotempty", scope: !103, file: !104, line: 150, type: !162, isLocal: false, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "g_waitingformqnotfull", scope: !103, file: !104, line: 158, type: !162, isLocal: false, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "g_inactivetasks", scope: !103, file: !104, line: 179, type: !162, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "g_lastpid", scope: !103, file: !104, line: 183, type: !520, isLocal: false, isDefinition: true)
!520 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !181)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "g_pidhash", scope: !103, file: !104, line: 192, type: !523, isLocal: false, isDefinition: true)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "g_npidhash", scope: !103, file: !104, line: 193, type: !526, isLocal: false, isDefinition: true)
!526 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !33)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "g_nx_initstate", scope: !103, file: !104, line: 279, type: !42, isLocal: false, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "g_idletcb", scope: !103, file: !104, line: 293, type: !531, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 1248, elements: !38)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_tcb_s", file: !117, line: 675, size: 1248, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "cmn", scope: !532, file: !117, line: 679, baseType: !172, size: 1248)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "g_idleargv", scope: !103, file: !104, line: 310, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 64, elements: !538)
!538 = !{!39, !68}
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "g_idlename", scope: !103, file: !104, line: 301, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 80, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 10)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "g_noname", scope: !546, file: !547, line: 61, type: !788, isLocal: true, isDefinition: true)
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !549, globals: !787, splitDebugInlining: false, nameTableKind: None)
!547 = !DIFile(filename: "task/task_setup.c", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/sched", checksumkind: CSK_MD5, checksum: "79e90c34f0bfb6812b9924ec44bad37f")
!548 = !{!79, !116}
!549 = !{!550, !130, !136, !42, !131, !774, !781, !135}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcb_s", file: !117, line: 539, size: 1248, elements: !552)
!552 = !{!553, !554, !555, !712, !713, !714, !715, !716, !722, !723, !724, !725, !726, !727, !735, !736, !737, !738, !740, !741, !742, !743, !744, !756, !759, !767, !773}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flink", scope: !551, file: !117, line: 543, baseType: !550, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "blink", scope: !551, file: !117, line: 544, baseType: !550, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !551, file: !117, line: 548, baseType: !556, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_group_s", file: !117, line: 407, size: 3200, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !570, !571, !572, !586, !587, !605, !617, !618, !619, !682}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tg_pid", scope: !557, file: !117, line: 412, baseType: !181, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "tg_ppid", scope: !557, file: !117, line: 413, baseType: !181, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tg_flags", scope: !557, file: !117, line: 414, baseType: !42, size: 8, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tg_nmembers", scope: !557, file: !117, line: 425, baseType: !42, size: 8, offset: 72)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tg_nwaiters", scope: !557, file: !117, line: 452, baseType: !42, size: 8, offset: 80)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tg_waitflags", scope: !557, file: !117, line: 453, baseType: !42, size: 8, offset: 88)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tg_exitsem", scope: !557, file: !117, line: 454, baseType: !566, size: 16, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !189, line: 117, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sem_s", file: !189, line: 98, size: 16, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "semcount", scope: !567, file: !189, line: 100, baseType: !193, size: 16)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tg_statloc", scope: !557, file: !117, line: 455, baseType: !198, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tg_joinsem", scope: !557, file: !117, line: 463, baseType: !566, size: 16, offset: 160)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tg_joinhead", scope: !557, file: !117, line: 464, baseType: !573, size: 32, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "join_s", file: !575, line: 50, size: 160, elements: !576)
!575 = !DIFile(filename: "pthread/pthread.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/sched", checksumkind: CSK_MD5, checksum: "5e9f84f72846989b236e445714562157")
!576 = !{!577, !578, !579, !580, !581, !583, !584, !585}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !574, file: !575, line: 52, baseType: !573, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "crefs", scope: !574, file: !575, line: 53, baseType: !42, size: 8, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !574, file: !575, line: 54, baseType: !98, size: 8, offset: 40)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "terminated", scope: !574, file: !575, line: 55, baseType: !98, size: 8, offset: 48)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !574, file: !575, line: 56, baseType: !582, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !386, line: 245, baseType: !181)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "exit_sem", scope: !574, file: !575, line: 57, baseType: !566, size: 16, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "data_sem", scope: !574, file: !575, line: 58, baseType: !566, size: 16, offset: 112)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "exit_value", scope: !574, file: !575, line: 59, baseType: !390, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tg_jointail", scope: !557, file: !117, line: 465, baseType: !573, size: 32, offset: 224)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tg_info", scope: !557, file: !117, line: 470, baseType: !588, size: 32, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_info_s", file: !207, line: 120, size: 448, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !604}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ta_sem", scope: !589, file: !207, line: 122, baseType: !566, size: 16)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !589, file: !207, line: 123, baseType: !135, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ta_tlsset", scope: !589, file: !207, line: 128, baseType: !212, size: 8, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ta_tlsdtor", scope: !589, file: !207, line: 129, baseType: !214, size: 128, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ta_getopt", scope: !589, file: !207, line: 132, baseType: !596, size: 192, offset: 224)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "getopt_s", file: !207, line: 105, size: 192, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "go_optarg", scope: !596, file: !207, line: 109, baseType: !136, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "go_opterr", scope: !596, file: !207, line: 110, baseType: !33, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "go_optind", scope: !596, file: !207, line: 111, baseType: !33, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "go_optopt", scope: !596, file: !207, line: 112, baseType: !33, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "go_optptr", scope: !596, file: !207, line: 116, baseType: !136, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "go_binitialized", scope: !596, file: !207, line: 117, baseType: !98, size: 8, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ta_umask", scope: !589, file: !207, line: 133, baseType: !231, size: 32, offset: 416)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tg_sigactionq", scope: !557, file: !117, line: 474, baseType: !606, size: 64, offset: 288)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "sq_queue_t", file: !140, line: 105, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sq_queue_s", file: !140, line: 100, size: 64, elements: !608)
!608 = !{!609, !616}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !607, file: !140, line: 102, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "sq_entry_t", file: !140, line: 91, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sq_entry_s", file: !140, line: 87, size: 32, elements: !613)
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "flink", scope: !612, file: !140, line: 89, baseType: !615, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !607, file: !140, line: 103, baseType: !610, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tg_sigpendingq", scope: !557, file: !117, line: 475, baseType: !606, size: 64, offset: 352)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "itimer", scope: !557, file: !117, line: 489, baseType: !246, size: 32, offset: 416)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "tg_filelist", scope: !557, file: !117, line: 501, baseType: !620, size: 64, offset: 448)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filelist", file: !250, line: 416, size: 64, elements: !621)
!621 = !{!622, !623, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "fl_sem", scope: !620, file: !250, line: 418, baseType: !566, size: 16)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "fl_rows", scope: !620, file: !250, line: 419, baseType: !42, size: 8, offset: 16)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fl_files", scope: !620, file: !250, line: 420, baseType: !625, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !250, line: 401, size: 128, elements: !628)
!628 = !{!629, !630, !631, !681}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "f_oflags", scope: !627, file: !250, line: 403, baseType: !33, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "f_pos", scope: !627, file: !250, line: 404, baseType: !261, size: 32, offset: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "f_inode", scope: !627, file: !250, line: 405, baseType: !632, size: 32, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !250, line: 374, size: 224, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !679, !680}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_parent", scope: !633, file: !250, line: 376, baseType: !632, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_peer", scope: !633, file: !250, line: 377, baseType: !632, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_child", scope: !633, file: !250, line: 378, baseType: !632, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "i_crefs", scope: !633, file: !250, line: 379, baseType: !194, size: 16, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !633, file: !250, line: 380, baseType: !274, size: 16, offset: 112)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !633, file: !250, line: 381, baseType: !641, size: 32, offset: 128)
!641 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "inode_ops_u", file: !250, line: 356, size: 32, elements: !642)
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_ops", scope: !641, file: !250, line: 358, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_operations", file: !250, line: 190, size: 256, elements: !647)
!647 = !{!648, !652, !653, !657, !661, !665, !669, !675}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !646, file: !250, line: 194, baseType: !649, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = !DISubroutineType(types: !651)
!651 = !{!33, !626}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !646, file: !250, line: 201, baseType: !649, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !646, file: !250, line: 202, baseType: !654, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = !DISubroutineType(types: !656)
!656 = !{!294, !626, !136, !25}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !646, file: !250, line: 203, baseType: !658, size: 32, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DISubroutineType(types: !660)
!660 = !{!294, !626, !300, !25}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !646, file: !250, line: 205, baseType: !662, size: 32, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = !DISubroutineType(types: !664)
!664 = !{!261, !626, !261, !33}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl", scope: !646, file: !250, line: 206, baseType: !666, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DISubroutineType(types: !668)
!668 = !{!33, !626, !33, !22}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !646, file: !250, line: 210, baseType: !670, size: 32, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DISubroutineType(types: !672)
!672 = !{!33, !626, !673, !98}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !250, line: 182, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !646, file: !250, line: 212, baseType: !676, size: 32, offset: 224)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DISubroutineType(types: !678)
!678 = !{!33, !632}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_private", scope: !633, file: !250, line: 390, baseType: !130, size: 32, offset: 160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_name", scope: !633, file: !250, line: 391, baseType: !332, size: 8, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "f_priv", scope: !627, file: !250, line: 406, baseType: !130, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tg_streamlist", scope: !557, file: !117, line: 514, baseType: !683, size: 2688, offset: 512)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "streamlist", file: !250, line: 482, size: 2688, elements: !684)
!684 = !{!685, !686, !710, !711}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "sl_sem", scope: !683, file: !250, line: 484, baseType: !566, size: 16)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "sl_std", scope: !683, file: !250, line: 485, baseType: !687, size: 2592, offset: 32)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 2592, elements: !368)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_struct", file: !250, line: 460, size: 864, elements: !689)
!689 = !{!690, !692, !693, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fs_next", scope: !688, file: !250, line: 462, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fs_fd", scope: !688, file: !250, line: 463, baseType: !33, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "fs_lock", scope: !688, file: !250, line: 465, baseType: !694, size: 96, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "rmutex_t", file: !347, line: 55, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rmutex_s", file: !347, line: 48, size: 96, elements: !696)
!696 = !{!697, !699, !700}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !695, file: !347, line: 50, baseType: !698, size: 16)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "mutex_t", file: !347, line: 46, baseType: !566)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "holder", scope: !695, file: !347, line: 51, baseType: !181, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !695, file: !347, line: 52, baseType: !274, size: 16, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fs_bufstart", scope: !688, file: !250, line: 466, baseType: !355, size: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fs_bufend", scope: !688, file: !250, line: 467, baseType: !355, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "fs_bufpos", scope: !688, file: !250, line: 468, baseType: !355, size: 32, offset: 224)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fs_bufread", scope: !688, file: !250, line: 469, baseType: !355, size: 32, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fs_buffer", scope: !688, file: !250, line: 471, baseType: !360, size: 512, offset: 288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fs_oflags", scope: !688, file: !250, line: 474, baseType: !274, size: 16, offset: 800)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !688, file: !250, line: 475, baseType: !42, size: 8, offset: 816)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fs_nungotten", scope: !688, file: !250, line: 477, baseType: !42, size: 8, offset: 824)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ungotten", scope: !688, file: !250, line: 478, baseType: !367, size: 16, offset: 832)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sl_head", scope: !683, file: !250, line: 486, baseType: !691, size: 32, offset: 2624)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sl_tail", scope: !683, file: !250, line: 487, baseType: !691, size: 32, offset: 2656)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !551, file: !117, line: 552, baseType: !181, size: 32, offset: 96)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !551, file: !117, line: 553, baseType: !42, size: 8, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority", scope: !551, file: !117, line: 554, baseType: !42, size: 8, offset: 136)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !551, file: !117, line: 556, baseType: !376, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !551, file: !117, line: 557, baseType: !717, size: 32, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_t", file: !117, line: 256, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "entry_u", file: !117, line: 250, size: 32, elements: !719)
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pthread", scope: !718, file: !117, line: 252, baseType: !385, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !718, file: !117, line: 253, baseType: !131, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "task_state", scope: !551, file: !117, line: 559, baseType: !42, size: 8, offset: 224)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !551, file: !117, line: 574, baseType: !274, size: 16, offset: 240)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lockcount", scope: !551, file: !117, line: 575, baseType: !194, size: 16, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "errcode", scope: !551, file: !117, line: 582, baseType: !194, size: 16, offset: 272)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "timeslice", scope: !551, file: !117, line: 585, baseType: !262, size: 32, offset: 288)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "waitdog", scope: !551, file: !117, line: 592, baseType: !728, size: 128, offset: 320)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdog_s", file: !399, line: 66, size: 128, elements: !729)
!729 = !{!730, !732, !733, !734}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !728, file: !399, line: 68, baseType: !731, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !728, file: !399, line: 69, baseType: !404, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !728, file: !399, line: 73, baseType: !410, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !728, file: !399, line: 74, baseType: !408, size: 32, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "adj_stack_size", scope: !551, file: !117, line: 596, baseType: !25, size: 32, offset: 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "stack_alloc_ptr", scope: !551, file: !117, line: 599, baseType: !130, size: 32, offset: 480)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "stack_base_ptr", scope: !551, file: !117, line: 601, baseType: !130, size: 32, offset: 512)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "waitsem", scope: !551, file: !117, line: 613, baseType: !739, size: 32, offset: 544)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "sigprocmask", scope: !551, file: !117, line: 617, baseType: !418, size: 32, offset: 576)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "sigwaitmask", scope: !551, file: !117, line: 618, baseType: !418, size: 32, offset: 608)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "sigpendactionq", scope: !551, file: !117, line: 619, baseType: !606, size: 64, offset: 640)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "sigpostedq", scope: !551, file: !117, line: 620, baseType: !606, size: 64, offset: 704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sigunbinfo", scope: !551, file: !117, line: 621, baseType: !745, size: 64, offset: 768)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !419, line: 377, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "siginfo", file: !419, line: 361, size: 64, elements: !747)
!747 = !{!748, !749, !750, !751}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !746, file: !419, line: 363, baseType: !42, size: 8)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !746, file: !419, line: 364, baseType: !42, size: 8, offset: 8)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !746, file: !419, line: 365, baseType: !42, size: 8, offset: 16)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "si_value", scope: !746, file: !419, line: 366, baseType: !752, size: 32, offset: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !419, line: 334, size: 32, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !752, file: !419, line: 336, baseType: !33, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !752, file: !419, line: 337, baseType: !130, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "msgwaitq", scope: !551, file: !117, line: 626, baseType: !757, size: 32, offset: 832)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "mqueue_inode_s", file: !117, line: 626, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mhead", scope: !551, file: !117, line: 632, baseType: !760, size: 32, offset: 864)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_s", file: !386, line: 291, size: 128, elements: !762)
!762 = !{!763, !764, !765, !766}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flink", scope: !761, file: !386, line: 296, baseType: !760, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !761, file: !386, line: 301, baseType: !566, size: 16, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !761, file: !386, line: 302, baseType: !181, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !761, file: !386, line: 304, baseType: !42, size: 8, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "xcp", scope: !551, file: !117, line: 656, baseType: !768, size: 96, offset: 896)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xcptcontext", file: !499, line: 239, size: 96, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sigdeliver", scope: !768, file: !499, line: 245, baseType: !130, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "saved_regs", scope: !768, file: !499, line: 251, baseType: !32, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !768, file: !499, line: 268, baseType: !32, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !551, file: !117, line: 659, baseType: !505, size: 256, offset: 992)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "dq_entry_t", file: !140, line: 98, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dq_entry_s", file: !140, line: 93, size: 64, elements: !777)
!777 = !{!778, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flink", scope: !776, file: !140, line: 95, baseType: !779, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "blink", scope: !776, file: !140, line: 96, baseType: !779, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "dq_queue_t", file: !140, line: 112, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dq_queue_s", file: !140, line: 107, size: 64, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !783, file: !140, line: 109, baseType: !774, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !783, file: !140, line: 110, baseType: !774, size: 32, offset: 32)
!787 = !{!544}
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 72, elements: !164)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "g_sigpendingsignal", scope: !791, file: !792, line: 61, type: !846, isLocal: false, isDefinition: true)
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !793, retainedTypes: !800, globals: !843, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "signal/sig_initialize.c", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/sched", checksumkind: CSK_MD5, checksum: "c9b98fcddf9f1984d45d0f61b7924725")
!793 = !{!794}
!794 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sigalloc_e", file: !795, line: 55, baseType: !7, size: 32, elements: !796)
!795 = !DIFile(filename: "signal/signal.h", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/sched", checksumkind: CSK_MD5, checksum: "b81f1f215145a35b8ae884bf2a56f905")
!796 = !{!797, !798, !799}
!797 = !DIEnumerator(name: "SIG_ALLOC_FIXED", value: 0)
!798 = !DIEnumerator(name: "SIG_ALLOC_DYN", value: 1)
!799 = !DIEnumerator(name: "SIG_ALLOC_IRQ", value: 2)
!800 = !{!801, !130, !829, !835}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigq_t", file: !795, line: 102, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigq_s", file: !795, line: 90, size: 192, elements: !804)
!804 = !{!805, !807, !826, !827, !828}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flink", scope: !803, file: !795, line: 92, baseType: !806, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !803, file: !795, line: 96, baseType: !808, size: 32, offset: 32)
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !803, file: !795, line: 93, size: 32, elements: !809)
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "sighandler", scope: !808, file: !795, line: 95, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !33, !814, !130}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !419, line: 377, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "siginfo", file: !419, line: 361, size: 64, elements: !817)
!817 = !{!818, !819, !820, !821}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !816, file: !419, line: 363, baseType: !42, size: 8)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !816, file: !419, line: 364, baseType: !42, size: 8, offset: 8)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !816, file: !419, line: 365, baseType: !42, size: 8, offset: 16)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "si_value", scope: !816, file: !419, line: 366, baseType: !822, size: 32, offset: 32)
!822 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !419, line: 334, size: 32, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !822, file: !419, line: 336, baseType: !33, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !822, file: !419, line: 337, baseType: !130, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !803, file: !795, line: 97, baseType: !418, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !803, file: !795, line: 99, baseType: !815, size: 64, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !803, file: !795, line: 100, baseType: !42, size: 8, offset: 160)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "sq_entry_t", file: !140, line: 91, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sq_entry_s", file: !140, line: 87, size: 32, elements: !832)
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "flink", scope: !831, file: !140, line: 89, baseType: !834, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigpendq_t", file: !795, line: 84, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpendq", file: !795, line: 78, size: 128, elements: !838)
!838 = !{!839, !841, !842}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "flink", scope: !837, file: !795, line: 80, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !837, file: !795, line: 81, baseType: !815, size: 64, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !837, file: !795, line: 82, baseType: !42, size: 8, offset: 96)
!843 = !{!844, !851, !853, !789, !855, !857, !859, !861, !863}
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "g_sigfreeaction", scope: !791, file: !792, line: 43, type: !846, isLocal: false, isDefinition: true)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "sq_queue_t", file: !140, line: 105, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sq_queue_s", file: !140, line: 100, size: 64, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !847, file: !140, line: 102, baseType: !829, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !847, file: !140, line: 103, baseType: !829, size: 32, offset: 32)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "g_sigpendingaction", scope: !791, file: !792, line: 49, type: !846, isLocal: false, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "g_sigpendingirqaction", scope: !791, file: !792, line: 55, type: !846, isLocal: false, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "g_sigpendingirqsignal", scope: !791, file: !792, line: 68, type: !846, isLocal: false, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "g_sigpendingactionalloc", scope: !791, file: !792, line: 78, type: !801, isLocal: true, isDefinition: true)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "g_sigpendingirqactionalloc", scope: !791, file: !792, line: 84, type: !801, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "g_sigpendingsignalalloc", scope: !791, file: !792, line: 90, type: !835, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "g_sigpendingirqsignalalloc", scope: !791, file: !792, line: 96, type: !835, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "devnull_fops", scope: !867, file: !868, line: 52, type: !871, isLocal: true, isDefinition: true)
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !78, retainedTypes: !869, globals: !870, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "misc/dev_null.c", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/drivers", checksumkind: CSK_MD5, checksum: "7fe344ffde1ebf93bdb8c062291aa545")
!869 = !{!130}
!870 = !{!865}
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_operations", file: !250, line: 190, size: 256, elements: !873)
!873 = !{!874, !900, !901, !905, !909, !913, !917, !935}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !872, file: !250, line: 194, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = !DISubroutineType(types: !877)
!877 = !{!33, !878}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !250, line: 401, size: 128, elements: !880)
!880 = !{!881, !882, !883, !899}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "f_oflags", scope: !879, file: !250, line: 403, baseType: !33, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "f_pos", scope: !879, file: !250, line: 404, baseType: !261, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "f_inode", scope: !879, file: !250, line: 405, baseType: !884, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !250, line: 374, size: 224, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !897, !898}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "i_parent", scope: !885, file: !250, line: 376, baseType: !884, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "i_peer", scope: !885, file: !250, line: 377, baseType: !884, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "i_child", scope: !885, file: !250, line: 378, baseType: !884, size: 32, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "i_crefs", scope: !885, file: !250, line: 379, baseType: !194, size: 16, offset: 96)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !885, file: !250, line: 380, baseType: !274, size: 16, offset: 112)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !885, file: !250, line: 381, baseType: !893, size: 32, offset: 128)
!893 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "inode_ops_u", file: !250, line: 356, size: 32, elements: !894)
!894 = !{!895}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i_ops", scope: !893, file: !250, line: 358, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_private", scope: !885, file: !250, line: 390, baseType: !130, size: 32, offset: 160)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i_name", scope: !885, file: !250, line: 391, baseType: !332, size: 8, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "f_priv", scope: !879, file: !250, line: 406, baseType: !130, size: 32, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !872, file: !250, line: 201, baseType: !875, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !872, file: !250, line: 202, baseType: !902, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DISubroutineType(types: !904)
!904 = !{!294, !878, !136, !25}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !872, file: !250, line: 203, baseType: !906, size: 32, offset: 96)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(types: !908)
!908 = !{!294, !878, !300, !25}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !872, file: !250, line: 205, baseType: !910, size: 32, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DISubroutineType(types: !912)
!912 = !{!261, !878, !261, !33}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl", scope: !872, file: !250, line: 206, baseType: !914, size: 32, offset: 160)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DISubroutineType(types: !916)
!916 = !{!33, !878, !33, !22}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !872, file: !250, line: 210, baseType: !918, size: 32, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DISubroutineType(types: !920)
!920 = !{!33, !878, !921, !98}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !316, line: 109, size: 192, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !934}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !922, file: !316, line: 113, baseType: !33, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !922, file: !316, line: 114, baseType: !320, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !922, file: !316, line: 115, baseType: !320, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !922, file: !316, line: 119, baseType: !130, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !922, file: !316, line: 120, baseType: !929, size: 32, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !189, line: 117, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sem_s", file: !189, line: 98, size: 16, elements: !932)
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "semcount", scope: !931, file: !189, line: 100, baseType: !193, size: 16)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !922, file: !316, line: 121, baseType: !130, size: 32, offset: 160)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !872, file: !250, line: 212, baseType: !936, size: 32, offset: 224)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DISubroutineType(types: !938)
!938 = !{!33, !884}
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "g_consoleops", scope: !941, file: !942, line: 50, type: !944, isLocal: true, isDefinition: true)
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !869, globals: !943, splitDebugInlining: false, nameTableKind: None)
!942 = !DIFile(filename: "syslog/syslog_console.c", directory: "/home/mjshen/RTOSExploration/nuttxspace/nuttx/drivers", checksumkind: CSK_MD5, checksum: "11433cf6ecc00d2f8295b73c713899ce")
!943 = !{!939}
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_operations", file: !250, line: 190, size: 256, elements: !946)
!946 = !{!947, !973, !974, !978, !982, !986, !990, !994}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !945, file: !250, line: 194, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DISubroutineType(types: !950)
!950 = !{!33, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !250, line: 401, size: 128, elements: !953)
!953 = !{!954, !955, !956, !972}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "f_oflags", scope: !952, file: !250, line: 403, baseType: !33, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "f_pos", scope: !952, file: !250, line: 404, baseType: !261, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "f_inode", scope: !952, file: !250, line: 405, baseType: !957, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !250, line: 374, size: 224, elements: !959)
!959 = !{!960, !961, !962, !963, !964, !965, !970, !971}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "i_parent", scope: !958, file: !250, line: 376, baseType: !957, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "i_peer", scope: !958, file: !250, line: 377, baseType: !957, size: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "i_child", scope: !958, file: !250, line: 378, baseType: !957, size: 32, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "i_crefs", scope: !958, file: !250, line: 379, baseType: !194, size: 16, offset: 96)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !958, file: !250, line: 380, baseType: !274, size: 16, offset: 112)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !958, file: !250, line: 381, baseType: !966, size: 32, offset: 128)
!966 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "inode_ops_u", file: !250, line: 356, size: 32, elements: !967)
!967 = !{!968}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "i_ops", scope: !966, file: !250, line: 358, baseType: !969, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "i_private", scope: !958, file: !250, line: 390, baseType: !130, size: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "i_name", scope: !958, file: !250, line: 391, baseType: !332, size: 8, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "f_priv", scope: !952, file: !250, line: 406, baseType: !130, size: 32, offset: 96)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !945, file: !250, line: 201, baseType: !948, size: 32, offset: 32)
