; ModuleID = 'build/96b_nitrogen/drivers/ipm/ipm_mcux/remote/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 51, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2496, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 39)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1248, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !111, file: !154, line: 27, type: !183, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !125, globals: !151, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote")
!113 = !{!114, !30}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !115, line: 27, baseType: !32, size: 32, elements: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!118 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!119 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!120 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!121 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!122 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!123 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!124 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!125 = !{!102, !126, !103, !24, !130, !146, !148, !149}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !129)
!129 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !132, line: 54, size: 96, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !141, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !131, file: !132, line: 55, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !136, line: 30, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !131, file: !132, line: 60, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !114}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !131, file: !132, line: 65, baseType: !142, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !150)
!150 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!151 = !{!109, !152, !158, !160, !173, !175}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !111, file: !154, line: 44, type: !155, isLocal: true, isDefinition: true)
!154 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !111, file: !154, line: 49, type: !155, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !111, file: !154, line: 36, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 128, elements: !171)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !164)
!164 = !{!165, !166, !169, !170}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !115, line: 115, baseType: !114, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !163, file: !115, line: 141, baseType: !167, size: 8, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !163, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !163, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!171 = !{!172}
!172 = !DISubrange(count: 1)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !111, file: !154, line: 40, type: !162, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !111, file: !154, line: 28, type: !177, isLocal: true, isDefinition: true)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !179)
!179 = !{!180, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !178, file: !136, line: 36, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !178, file: !136, line: 37, baseType: !181, size: 32, offset: 32)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 32, elements: !171)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !185, line: 22, baseType: !186)
!185 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!186 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!187 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!188 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !191, file: !222, line: 50, type: !209, isLocal: true, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !193, globals: !219, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote")
!193 = !{!194, !126, !196, !103, !102, !148, !149, !198, !146, !209, !210}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !195)
!195 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !197, line: 214, baseType: !32)
!197 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !200, line: 45, size: 64, elements: !201)
!200 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !{!202, !208}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !199, file: !200, line: 46, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !204, file: !136, line: 30, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !199, file: !200, line: 48, baseType: !148, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !200, line: 38, size: 64, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !211, file: !200, line: 39, baseType: !203, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !211, file: !200, line: 41, baseType: !215, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !200, line: 35, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !209}
!219 = !{!220, !224, !232, !189, !234, !244}
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "latency_lock", scope: !191, file: !222, line: 44, type: !223, isLocal: true, isDefinition: true)
!222 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !191, file: !222, line: 46, type: !226, isLocal: true, isDefinition: true)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !228)
!228 = !{!229, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !227, file: !136, line: 36, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !227, file: !136, line: 37, baseType: !230, size: 32, offset: 32)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "latency_subs", scope: !191, file: !222, line: 52, type: !226, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !191, file: !222, line: 39, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, elements: !242)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 35, size: 96, elements: !238)
!238 = !{!239, !240, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !237, file: !222, line: 36, baseType: !114, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !237, file: !222, line: 37, baseType: !167, size: 8, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !237, file: !222, line: 38, baseType: !184, size: 32, offset: 64)
!242 = !{!243}
!243 = !DISubrange(count: 0)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !191, file: !222, line: 48, type: !209, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !248, file: !255, line: 47, type: !269, isLocal: true, isDefinition: true)
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !250, retainedTypes: !251, globals: !252, splitDebugInlining: false, nameTableKind: None)
!249 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote")
!250 = !{!114}
!251 = !{!196, !103}
!252 = !{!253, !246, !265}
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "cpus_states", scope: !248, file: !255, line: 50, type: !256, isLocal: true, isDefinition: true)
!255 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 32, elements: !171)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !259, file: !115, line: 115, baseType: !114, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !259, file: !115, line: 141, baseType: !167, size: 8, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !259, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !259, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !248, file: !255, line: 55, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 8, elements: !171)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, elements: !242)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "static_regions", scope: !272, file: !279, line: 62, type: !412, isLocal: true, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !274, globals: !275, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote")
!274 = !{!196, !103, !148, !102}
!275 = !{!276, !270}
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !278, file: !279, line: 198, type: !400, isLocal: true, isDefinition: true)
!278 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !279, file: !279, line: 175, type: !280, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !272, retainedNodes: !397)
!279 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!280 = !DISubroutineType(types: !281)
!281 = !{null, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !284, line: 245, size: 1024, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !353, !366, !367, !368, !369, !375, !392}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !283, file: !284, line: 247, baseType: !287, size: 384)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !284, line: 57, size: 384, elements: !288)
!288 = !{!289, !317, !325, !326, !327, !340, !341, !342}
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !284, line: 60, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !284, line: 60, size: 64, elements: !291)
!291 = !{!292, !308}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !290, file: !284, line: 61, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !294, line: 49, baseType: !295)
!294 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !294, line: 37, size: 64, elements: !296)
!296 = !{!297, !303}
!297 = !DIDerivedType(tag: DW_TAG_member, scope: !295, file: !294, line: 38, baseType: !298, size: 32)
!298 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !294, line: 38, size: 32, elements: !299)
!299 = !{!300, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !298, file: !294, line: 39, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !294, line: 40, baseType: !301, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, scope: !295, file: !294, line: 42, baseType: !304, size: 32, offset: 32)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !294, line: 42, size: 32, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !304, file: !294, line: 43, baseType: !301, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !304, file: !294, line: 44, baseType: !301, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !290, file: !284, line: 62, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !310, line: 49, size: 64, elements: !311)
!310 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !309, file: !310, line: 50, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !315)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!315 = !{!316}
!316 = !DISubrange(count: 2)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !287, file: !284, line: 68, baseType: !318, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !320, line: 233, baseType: !321)
!320 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 231, size: 64, elements: !322)
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !321, file: !320, line: 232, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !294, line: 48, baseType: !295)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !287, file: !284, line: 71, baseType: !167, size: 8, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !287, file: !284, line: 74, baseType: !167, size: 8, offset: 104)
!327 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !284, line: 90, baseType: !328, size: 16, offset: 112)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !284, line: 90, size: 16, elements: !329)
!329 = !{!330, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, scope: !328, file: !284, line: 91, baseType: !331, size: 16)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !284, line: 91, size: 16, elements: !332)
!332 = !{!333, !336}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !331, file: !284, line: 96, baseType: !334, size: 8)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !335)
!335 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !331, file: !284, line: 97, baseType: !167, size: 8, offset: 8)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !328, file: !284, line: 100, baseType: !338, size: 16)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !339)
!339 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !287, file: !284, line: 107, baseType: !148, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !287, file: !284, line: 127, baseType: !102, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !287, file: !284, line: 131, baseType: !343, size: 192, offset: 192)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !320, line: 244, size: 192, elements: !344)
!344 = !{!345, !346, !352}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !343, file: !320, line: 245, baseType: !293, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !343, file: !320, line: 246, baseType: !347, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !320, line: 242, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !343, file: !320, line: 249, baseType: !128, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !283, file: !284, line: 250, baseType: !354, size: 288, offset: 384)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !355, line: 25, size: 288, elements: !356)
!355 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !354, file: !355, line: 26, baseType: !148, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !354, file: !355, line: 27, baseType: !148, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !354, file: !355, line: 28, baseType: !148, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !354, file: !355, line: 29, baseType: !148, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !354, file: !355, line: 30, baseType: !148, size: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !354, file: !355, line: 31, baseType: !148, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !354, file: !355, line: 32, baseType: !148, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !354, file: !355, line: 33, baseType: !148, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !354, file: !355, line: 34, baseType: !148, size: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !283, file: !284, line: 253, baseType: !102, size: 32, offset: 672)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !283, file: !284, line: 256, baseType: !319, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !283, file: !284, line: 294, baseType: !103, size: 32, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !283, file: !284, line: 300, baseType: !370, size: 96, offset: 800)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !284, line: 149, size: 96, elements: !371)
!371 = !{!372, !373, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !370, file: !284, line: 153, baseType: !22, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !370, file: !284, line: 162, baseType: !196, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !370, file: !284, line: 168, baseType: !196, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !283, file: !284, line: 325, baseType: !376, size: 32, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !378, line: 5073, size: 160, elements: !379)
!378 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = !{!380, !389, !390}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !377, file: !378, line: 5074, baseType: !381, size: 96)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !382, line: 56, size: 96, elements: !383)
!382 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!383 = !{!384, !387, !388}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !381, file: !382, line: 57, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !382, line: 57, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !381, file: !382, line: 58, baseType: !102, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !381, file: !382, line: 59, baseType: !196, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !377, file: !378, line: 5075, baseType: !319, size: 64, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !377, file: !378, line: 5076, baseType: !391, offset: 160)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !283, file: !284, line: 343, baseType: !393, size: 64, offset: 928)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !355, line: 60, size: 64, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !393, file: !355, line: 63, baseType: !148, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !393, file: !355, line: 66, baseType: !148, size: 32, offset: 32)
!397 = !{!398, !399}
!398 = !DILocalVariable(name: "thread", arg: 1, scope: !278, file: !279, line: 175, type: !282)
!399 = !DILocalVariable(name: "region_num", scope: !278, file: !279, line: 200, type: !167)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, elements: !242)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !402, line: 52, size: 96, elements: !403)
!402 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !{!404, !405, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !401, file: !402, line: 53, baseType: !22, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !401, file: !402, line: 54, baseType: !196, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !401, file: !402, line: 55, baseType: !407, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !408, line: 151, baseType: !409)
!408 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 149, size: 32, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !409, file: !408, line: 150, baseType: !148, size: 32)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 96, elements: !171)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !416, file: !452, line: 39, type: !167, isLocal: true, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !418, globals: !451, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote")
!418 = !{!419, !102, !103, !437, !167}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !421, line: 1226, baseType: !422)
!421 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 1213, size: 352, elements: !423)
!423 = !{!424, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !422, file: !421, line: 1215, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !148)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !422, file: !421, line: 1216, baseType: !426, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !422, file: !421, line: 1217, baseType: !426, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !422, file: !421, line: 1218, baseType: !426, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !422, file: !421, line: 1219, baseType: !426, size: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !422, file: !421, line: 1220, baseType: !426, size: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !422, file: !421, line: 1221, baseType: !426, size: 32, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !422, file: !421, line: 1222, baseType: !426, size: 32, offset: 224)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !422, file: !421, line: 1223, baseType: !426, size: 32, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !422, file: !421, line: 1224, baseType: !426, size: 32, offset: 288)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !422, file: !421, line: 1225, baseType: !426, size: 32, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !440, line: 27, size: 96, elements: !441)
!440 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !{!442, !443, !446}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !439, file: !440, line: 29, baseType: !148, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !439, file: !440, line: 31, baseType: !444, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !439, file: !440, line: 37, baseType: !447, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !408, line: 146, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !408, line: 141, size: 32, elements: !449)
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !448, file: !408, line: 143, baseType: !148, size: 32)
!451 = !{!414}
!452 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !455, file: !460, line: 13, type: !477, isLocal: true, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !457, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote")
!457 = !{!458, !453}
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "mpu_config", scope: !455, file: !460, line: 37, type: !461, isLocal: false, isDefinition: true)
!460 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !440, line: 41, size: 64, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !462, file: !440, line: 43, baseType: !148, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !462, file: !440, line: 45, baseType: !466, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !440, line: 27, size: 96, elements: !469)
!469 = !{!470, !471, !472}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !468, file: !440, line: 29, baseType: !148, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !468, file: !440, line: 31, baseType: !444, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !468, file: !440, line: 37, baseType: !473, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !408, line: 146, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !408, line: 141, size: 32, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !474, file: !408, line: 143, baseType: !148, size: 32)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 192, elements: !315)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !480, file: !640, line: 93, type: !641, isLocal: true, isDefinition: true, align: 32)
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !482, globals: !635, splitDebugInlining: false, nameTableKind: None)
!481 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote")
!482 = !{!483, !167, !102, !103, !557, !148, !558, !594, !605}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !485, line: 882, baseType: !486)
!485 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 850, size: 19456, elements: !487)
!487 = !{!488, !492, !493, !494, !498, !499, !501, !502, !503, !507, !508, !509, !513, !514, !518, !519, !523, !524, !528, !529, !530, !531, !532, !533, !537, !538, !542, !543, !547}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !486, file: !485, line: 851, baseType: !489, size: 960)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 960, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 30)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !486, file: !485, line: 852, baseType: !426, size: 32, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !486, file: !485, line: 853, baseType: !426, size: 32, offset: 992)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !486, file: !485, line: 854, baseType: !495, size: 1088, offset: 1024)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1088, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 34)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !486, file: !485, line: 855, baseType: !426, size: 32, offset: 2112)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !486, file: !485, line: 856, baseType: !500, size: 64, offset: 2144)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 64, elements: !315)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !486, file: !485, line: 857, baseType: !426, size: 32, offset: 2208)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !486, file: !485, line: 858, baseType: !426, size: 32, offset: 2240)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !486, file: !485, line: 859, baseType: !504, size: 3904, offset: 2272)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 3904, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 122)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !486, file: !485, line: 860, baseType: !426, size: 32, offset: 6176)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !486, file: !485, line: 861, baseType: !426, size: 32, offset: 6208)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !486, file: !485, line: 862, baseType: !510, size: 1952, offset: 6240)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1952, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 61)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !486, file: !485, line: 863, baseType: !426, size: 32, offset: 8192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !486, file: !485, line: 864, baseType: !515, size: 288, offset: 8224)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 288, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 9)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !486, file: !485, line: 865, baseType: !425, size: 32, offset: 8512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !486, file: !485, line: 866, baseType: !520, size: 1696, offset: 8544)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1696, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 53)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !486, file: !485, line: 867, baseType: !426, size: 32, offset: 10240)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !486, file: !485, line: 868, baseType: !525, size: 96, offset: 10272)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 96, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 3)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !486, file: !485, line: 869, baseType: !426, size: 32, offset: 10368)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !486, file: !485, line: 870, baseType: !500, size: 64, offset: 10400)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !486, file: !485, line: 871, baseType: !426, size: 32, offset: 10464)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !486, file: !485, line: 872, baseType: !426, size: 32, offset: 10496)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !486, file: !485, line: 873, baseType: !426, size: 32, offset: 10528)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !486, file: !485, line: 875, baseType: !534, size: 352, offset: 10560)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 352, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 11)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !486, file: !485, line: 876, baseType: !426, size: 32, offset: 10912)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !486, file: !485, line: 878, baseType: !539, size: 256, offset: 10944)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 256, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 8)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !486, file: !485, line: 879, baseType: !426, size: 32, offset: 11200)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !486, file: !485, line: 880, baseType: !544, size: 7200, offset: 11232)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 7200, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 225)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !486, file: !485, line: 881, baseType: !548, size: 1024, offset: 18432)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 1024, elements: !540)
!549 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !485, line: 258, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 252, size: 128, elements: !552)
!552 = !{!553, !554, !555, !556}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !551, file: !485, line: 253, baseType: !426, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !551, file: !485, line: 254, baseType: !426, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !551, file: !485, line: 255, baseType: !426, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !551, file: !485, line: 257, baseType: !425, size: 32, offset: 96)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !421, line: 468, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 445, size: 1120, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !568, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !587, !591, !593}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !560, file: !421, line: 447, baseType: !425, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !560, file: !421, line: 448, baseType: !426, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !560, file: !421, line: 449, baseType: !426, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !560, file: !421, line: 450, baseType: !426, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !560, file: !421, line: 451, baseType: !426, size: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !560, file: !421, line: 452, baseType: !426, size: 32, offset: 160)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !560, file: !421, line: 453, baseType: !569, size: 96, offset: 192)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 96, elements: !571)
!570 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !167)
!571 = !{!572}
!572 = !DISubrange(count: 12)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !560, file: !421, line: 454, baseType: !426, size: 32, offset: 288)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !560, file: !421, line: 455, baseType: !426, size: 32, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !560, file: !421, line: 456, baseType: !426, size: 32, offset: 352)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !560, file: !421, line: 457, baseType: !426, size: 32, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !560, file: !421, line: 458, baseType: !426, size: 32, offset: 416)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !560, file: !421, line: 459, baseType: !426, size: 32, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !560, file: !421, line: 460, baseType: !426, size: 32, offset: 480)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !560, file: !421, line: 461, baseType: !500, size: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !560, file: !421, line: 462, baseType: !425, size: 32, offset: 576)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !560, file: !421, line: 463, baseType: !425, size: 32, offset: 608)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !560, file: !421, line: 464, baseType: !584, size: 128, offset: 640)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 128, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 4)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !560, file: !421, line: 465, baseType: !588, size: 160, offset: 768)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 160, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 5)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !560, file: !421, line: 466, baseType: !592, size: 160, offset: 928)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 160, elements: !589)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !560, file: !421, line: 467, baseType: !426, size: 32, offset: 1088)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !596, file: !595, line: 167, baseType: !604)
!595 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!596 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !595, file: !595, line: 134, type: !597, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !480, retainedNodes: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !148}
!599 = !{!600, !601, !603}
!600 = !DILocalVariable(name: "time_us", arg: 1, scope: !596, file: !595, line: 134, type: !148)
!601 = !DILocalVariable(name: "delay_cycles", scope: !596, file: !595, line: 168, type: !602)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!603 = !DILocalVariable(name: "cycles", scope: !596, file: !595, line: 171, type: !148)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !485, line: 2140, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 2119, size: 10880, elements: !608)
!608 = !{!609, !613, !614, !618, !619, !624, !625, !626, !627, !631, !632, !633, !634}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !607, file: !485, line: 2120, baseType: !610, size: 8192)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 8192, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !607, file: !485, line: 2121, baseType: !425, size: 32, offset: 8192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !607, file: !485, line: 2122, baseType: !615, size: 2048, offset: 8224)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 2048, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !607, file: !485, line: 2123, baseType: !426, size: 32, offset: 10272)
!619 = !DIDerivedType(tag: DW_TAG_member, scope: !607, file: !485, line: 2125, baseType: !620, size: 32, offset: 10304)
!620 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !607, file: !485, line: 2125, size: 32, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !620, file: !485, line: 2126, baseType: !426, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !620, file: !485, line: 2127, baseType: !426, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !607, file: !485, line: 2130, baseType: !426, size: 32, offset: 10336)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !607, file: !485, line: 2131, baseType: !426, size: 32, offset: 10368)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !607, file: !485, line: 2133, baseType: !426, size: 32, offset: 10400)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !607, file: !485, line: 2135, baseType: !628, size: 320, offset: 10432)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 320, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 10)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !607, file: !485, line: 2136, baseType: !426, size: 32, offset: 10752)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !607, file: !485, line: 2137, baseType: !425, size: 32, offset: 10784)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !607, file: !485, line: 2138, baseType: !426, size: 32, offset: 10816)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !607, file: !485, line: 2139, baseType: !426, size: 32, offset: 10848)
!635 = !{!478, !636}
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !596, file: !595, line: 161, type: !638, isLocal: true, isDefinition: true, align: 128)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 48, elements: !526)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!640 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !643, line: 51, size: 64, elements: !644)
!643 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!644 = !{!645, !652}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !642, file: !643, line: 60, baseType: !646, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DISubroutineType(types: !648)
!648 = !{!103, !649}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !643, line: 48, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !642, file: !643, line: 65, baseType: !649, size: 32, offset: 32)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "__device_dts_ord_34", scope: !655, file: !880, line: 733, type: !984, isLocal: false, isDefinition: true, align: 32)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !657, retainedTypes: !790, globals: !876, splitDebugInlining: false, nameTableKind: None)
!656 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_nitrogen/drivers/ipm/ipm_mcux/remote")
!657 = !{!658, !664, !30, !669, !674, !681, !687, !693, !702, !706, !755, !762, !781}
!658 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !659, line: 23, baseType: !32, size: 32, elements: !660)
!659 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!660 = !{!661, !662, !663}
!661 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!662 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!663 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!664 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !659, line: 48, baseType: !32, size: 32, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!667 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!668 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!669 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !670, line: 167, baseType: !32, size: 32, elements: !671)
!670 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!671 = !{!672, !673}
!672 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!673 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !670, line: 107, baseType: !32, size: 32, elements: !675)
!675 = !{!676, !677, !678, !679, !680}
!676 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!677 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!678 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!679 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!680 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!681 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !670, line: 208, baseType: !32, size: 32, elements: !682)
!682 = !{!683, !684, !685, !686}
!683 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!684 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!685 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!686 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!687 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !670, line: 261, baseType: !32, size: 32, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!690 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!691 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!692 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!693 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !670, line: 237, baseType: !32, size: 32, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701}
!695 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!696 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!697 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!698 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!699 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!700 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!701 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!702 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !670, line: 152, baseType: !32, size: 32, elements: !703)
!703 = !{!704, !705}
!704 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!705 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !485, line: 71, baseType: !103, size: 32, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!708 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!709 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!710 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!711 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!712 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!713 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!714 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!715 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!716 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!717 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!718 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!719 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!720 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!721 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!722 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!723 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!724 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!725 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!726 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!727 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!728 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!729 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!730 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!731 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!732 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!733 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!734 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!735 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!736 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!737 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!738 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!739 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!740 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!741 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!742 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!743 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!744 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!745 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!746 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!747 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!748 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!749 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!750 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!751 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!752 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!753 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!754 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!755 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !756, line: 44, baseType: !32, size: 32, elements: !757)
!756 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!757 = !{!758, !759, !760, !761}
!758 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!759 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!760 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!761 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!762 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !763, line: 54, baseType: !32, size: 32, elements: !764)
!763 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!765 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!766 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!767 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!768 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!769 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!770 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!771 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!772 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!773 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!774 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!775 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!776 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!777 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!778 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!779 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!780 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !782, line: 53, baseType: !32, size: 32, elements: !783)
!782 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!783 = !{!784, !785, !786, !787, !788, !789}
!784 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!785 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!786 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!787 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!788 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!789 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!790 = !{!658, !102, !103, !791, !839, !840, !841, !842, !126, !148, !149, !843, !557, !844, !209, !845, !875, !196}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !485, line: 837, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 804, size: 11008, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !806, !807, !808, !809, !810, !811, !815, !816, !817, !821, !822, !823, !824, !825, !826, !827, !831, !832, !836, !837, !838}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !793, file: !485, line: 805, baseType: !426, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !793, file: !485, line: 806, baseType: !426, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !793, file: !485, line: 807, baseType: !426, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !793, file: !485, line: 808, baseType: !426, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !793, file: !485, line: 809, baseType: !426, size: 32, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !793, file: !485, line: 810, baseType: !426, size: 32, offset: 160)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !793, file: !485, line: 811, baseType: !426, size: 32, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !793, file: !485, line: 812, baseType: !803, size: 1824, offset: 224)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1824, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 57)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !793, file: !485, line: 813, baseType: !426, size: 32, offset: 2048)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !793, file: !485, line: 814, baseType: !426, size: 32, offset: 2080)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !793, file: !485, line: 815, baseType: !425, size: 32, offset: 2112)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !793, file: !485, line: 816, baseType: !426, size: 32, offset: 2144)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !793, file: !485, line: 817, baseType: !426, size: 32, offset: 2176)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !793, file: !485, line: 818, baseType: !812, size: 3968, offset: 2208)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 3968, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 124)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !793, file: !485, line: 819, baseType: !426, size: 32, offset: 6176)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !793, file: !485, line: 820, baseType: !426, size: 32, offset: 6208)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !793, file: !485, line: 821, baseType: !818, size: 2016, offset: 6240)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 2016, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 63)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !793, file: !485, line: 822, baseType: !425, size: 32, offset: 8256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !793, file: !485, line: 824, baseType: !425, size: 32, offset: 8288)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !793, file: !485, line: 825, baseType: !425, size: 32, offset: 8320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !793, file: !485, line: 826, baseType: !425, size: 32, offset: 8352)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !793, file: !485, line: 828, baseType: !425, size: 32, offset: 8384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !793, file: !485, line: 829, baseType: !425, size: 32, offset: 8416)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !793, file: !485, line: 831, baseType: !828, size: 1984, offset: 8448)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1984, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 62)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !793, file: !485, line: 832, baseType: !426, size: 32, offset: 10432)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !793, file: !485, line: 833, baseType: !833, size: 224, offset: 10464)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 224, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 7)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !793, file: !485, line: 834, baseType: !426, size: 32, offset: 10688)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !793, file: !485, line: 835, baseType: !539, size: 256, offset: 10720)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !793, file: !485, line: 836, baseType: !426, size: 32, offset: 10976)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !670, line: 146, baseType: !674)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !670, line: 164, baseType: !702)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!843 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !421, line: 426, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 411, size: 28704, elements: !848)
!848 = !{!849, !851, !855, !856, !857, !858, !859, !860, !861, !862, !866, !870, !874}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !847, file: !421, line: 413, baseType: !850, size: 256)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 256, elements: !540)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !847, file: !421, line: 414, baseType: !852, size: 768, offset: 256)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 768, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 24)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !847, file: !421, line: 415, baseType: !850, size: 256, offset: 1024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !847, file: !421, line: 416, baseType: !852, size: 768, offset: 1280)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !847, file: !421, line: 417, baseType: !850, size: 256, offset: 2048)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !847, file: !421, line: 418, baseType: !852, size: 768, offset: 2304)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !847, file: !421, line: 419, baseType: !850, size: 256, offset: 3072)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !847, file: !421, line: 420, baseType: !852, size: 768, offset: 3328)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !847, file: !421, line: 421, baseType: !850, size: 256, offset: 4096)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !847, file: !421, line: 422, baseType: !863, size: 1792, offset: 4352)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 1792, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 56)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !847, file: !421, line: 423, baseType: !867, size: 1920, offset: 6144)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 1920, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 240)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !847, file: !421, line: 424, baseType: !871, size: 20608, offset: 8064)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 20608, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 644)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !847, file: !421, line: 425, baseType: !426, size: 32, offset: 28672)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !756, line: 56, baseType: !102)
!876 = !{!877, !927, !968, !653, !974, !1000, !1002, !1019, !1021, !1031, !1034, !1049, !1052, !1090, !1104}
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "on", scope: !879, file: !880, line: 549, type: !184, isLocal: true, isDefinition: true)
!879 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !880, file: !880, line: 547, type: !881, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !655, retainedNodes: !883)
!880 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!881 = !DISubroutineType(types: !882)
!882 = !{null, !664}
!883 = !{!884, !885, !888}
!884 = !DILocalVariable(name: "start_mode", arg: 1, scope: !879, file: !880, line: 547, type: !664)
!885 = !DILocalVariable(name: "err", scope: !886, file: !880, line: 553, type: !103)
!886 = distinct !DILexicalBlock(scope: !887, file: !880, line: 552, column: 31)
!887 = distinct !DILexicalBlock(scope: !879, file: !880, line: 552, column: 6)
!888 = !DILocalVariable(name: "mgr", scope: !886, file: !880, line: 554, type: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !891, line: 154, size: 224, elements: !892)
!891 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!892 = !{!893, !905, !906, !922, !924, !925, !926}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !890, file: !891, line: 158, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !896)
!896 = !{!897, !904}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !895, file: !136, line: 36, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !901)
!901 = !{!902}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !900, file: !136, line: 30, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !895, file: !136, line: 37, baseType: !898, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !890, file: !891, line: 163, baseType: !894, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !890, file: !891, line: 166, baseType: !907, size: 32, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !891, line: 133, size: 96, elements: !910)
!910 = !{!911, !920, !921}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !909, file: !891, line: 135, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !891, line: 129, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !889, !916}
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !891, line: 101, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !889, !103}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !909, file: !891, line: 138, baseType: !912, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !909, file: !891, line: 143, baseType: !912, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !890, file: !891, line: 169, baseType: !923, offset: 160)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !890, file: !891, line: 172, baseType: !103, size: 32, offset: 160)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !890, file: !891, line: 175, baseType: !338, size: 16, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !890, file: !891, line: 178, baseType: !338, size: 16, offset: 208)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "cli", scope: !879, file: !880, line: 550, type: !929, isLocal: true, isDefinition: true)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !891, line: 273, size: 128, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !929, file: !891, line: 280, baseType: !899, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !929, file: !891, line: 283, baseType: !933, size: 96, offset: 32)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !934, line: 138, size: 96, elements: !935)
!934 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!935 = !{!936, !965, !966}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !933, file: !934, line: 149, baseType: !937, size: 32)
!937 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !934, line: 139, size: 32, elements: !938)
!938 = !{!939, !960}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !937, file: !934, line: 145, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !378, line: 5397, size: 128, elements: !942)
!942 = !{!943, !958, !959}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !941, file: !378, line: 5399, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !294, line: 48, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !294, line: 37, size: 64, elements: !946)
!946 = !{!947, !953}
!947 = !DIDerivedType(tag: DW_TAG_member, scope: !945, file: !294, line: 38, baseType: !948, size: 32)
!948 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !945, file: !294, line: 38, size: 32, elements: !949)
!949 = !{!950, !952}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !948, file: !294, line: 39, baseType: !951, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !948, file: !294, line: 40, baseType: !951, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, scope: !945, file: !294, line: 42, baseType: !954, size: 32, offset: 32)
!954 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !945, file: !294, line: 42, size: 32, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !954, file: !294, line: 43, baseType: !951, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !954, file: !294, line: 44, baseType: !951, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !941, file: !378, line: 5405, baseType: !32, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !941, file: !378, line: 5408, baseType: !103, size: 32, offset: 96)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !937, file: !934, line: 148, baseType: !961, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !934, line: 98, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DISubroutineType(types: !964)
!964 = !{null, null}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !933, file: !934, line: 165, baseType: !426, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !933, file: !934, line: 174, baseType: !967, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_34", scope: !655, file: !880, line: 733, type: !970, isLocal: false, isDefinition: true, align: 16)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 80, elements: !589)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !973, line: 43, baseType: !194)
!973 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_34", scope: !655, file: !880, line: 733, type: !976, isLocal: true, isDefinition: true, align: 32)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !643, line: 51, size: 64, elements: !978)
!978 = !{!979, !999}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !977, file: !643, line: 60, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DISubroutineType(types: !982)
!982 = !{!103, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !973, line: 378, size: 192, elements: !986)
!986 = !{!987, !988, !989, !990, !996, !997}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !985, file: !973, line: 380, baseType: !444, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !985, file: !973, line: 382, baseType: !13, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !985, file: !973, line: 384, baseType: !13, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !985, file: !973, line: 386, baseType: !991, size: 32, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !973, line: 351, size: 16, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !992, file: !973, line: 359, baseType: !167, size: 8)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !992, file: !973, line: 364, baseType: !843, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !985, file: !973, line: 388, baseType: !102, size: 32, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !985, file: !973, line: 396, baseType: !998, size: 32, offset: 160)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !977, file: !643, line: 65, baseType: !983, size: 32, offset: 32)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !655, file: !880, line: 79, type: !184, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "data", scope: !655, file: !880, line: 702, type: !1004, isLocal: true, isDefinition: true)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !880, line: 69, size: 640, elements: !1005)
!1005 = !{!1006, !1008}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1004, file: !880, line: 70, baseType: !1007, size: 448)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 448, elements: !315)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1004, file: !880, line: 71, baseType: !1009, size: 192, offset: 448)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 192, elements: !315)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !880, line: 52, size: 96, elements: !1011)
!1011 = !{!1012, !1017, !1018}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1010, file: !880, line: 53, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !756, line: 72, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, !983, !875, !102}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1010, file: !880, line: 54, baseType: !102, size: 32, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1010, file: !880, line: 55, baseType: !148, size: 32, offset: 64)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_34", scope: !655, file: !880, line: 733, type: !992, isLocal: true, isDefinition: true, align: 8)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "d", scope: !1023, file: !880, line: 476, type: !1029, isLocal: true, isDefinition: true)
!1023 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !880, file: !880, line: 474, type: !881, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !655, retainedNodes: !1024)
!1024 = !{!1025, !1026, !1027, !1028}
!1025 = !DILocalVariable(name: "mode", arg: 1, scope: !1023, file: !880, line: 474, type: !664)
!1026 = !DILocalVariable(name: "type", scope: !1023, file: !880, line: 486, type: !839)
!1027 = !DILocalVariable(name: "isr_mode", scope: !1023, file: !880, line: 500, type: !843)
!1028 = !DILocalVariable(name: "key", scope: !1023, file: !880, line: 501, type: !103)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !670, line: 177, baseType: !669)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "target_type", scope: !1023, file: !880, line: 477, type: !1033, isLocal: true, isDefinition: true)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "config", scope: !655, file: !880, line: 704, type: !1036, isLocal: true, isDefinition: true)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !880, line: 74, size: 128, elements: !1038)
!1038 = !{!1039}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1037, file: !880, line: 76, baseType: !1040, size: 128)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 128, elements: !315)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !880, line: 61, size: 64, elements: !1042)
!1042 = !{!1043, !1048}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1041, file: !880, line: 62, baseType: !1044, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !880, line: 58, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{null}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1041, file: !880, line: 63, baseType: !1044, size: 32, offset: 32)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "once", scope: !1051, file: !880, line: 190, type: !843, isLocal: true, isDefinition: true)
!1051 = distinct !DISubprogram(name: "anomaly_132_workaround", scope: !880, file: !880, line: 187, type: !1046, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !655, retainedNodes: !157)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !655, file: !880, line: 695, type: !1054, isLocal: true, isDefinition: true)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !756, line: 100, size: 224, elements: !1056)
!1056 = !{!1057, !1062, !1063, !1068, !1074, !1079, !1085}
