; ModuleID = 'build/96b_wistrio/accel_polling/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct.sensor_value }
%struct.sensor_value = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "channels", scope: !27, file: !290, line: 22, type: !295, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !200, globals: !287, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/sensor/accel_polling/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!29 = !{!30, !95, !115, !130}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_channel", file: !31, line: 53, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/drivers/sensor.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!34 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_X", value: 0)
!35 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Y", value: 1)
!36 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Z", value: 2)
!37 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_XYZ", value: 3)
!38 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_X", value: 4)
!39 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Y", value: 5)
!40 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Z", value: 6)
!41 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_XYZ", value: 7)
!42 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_X", value: 8)
!43 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Y", value: 9)
!44 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Z", value: 10)
!45 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_XYZ", value: 11)
!46 = !DIEnumerator(name: "SENSOR_CHAN_DIE_TEMP", value: 12)
!47 = !DIEnumerator(name: "SENSOR_CHAN_AMBIENT_TEMP", value: 13)
!48 = !DIEnumerator(name: "SENSOR_CHAN_PRESS", value: 14)
!49 = !DIEnumerator(name: "SENSOR_CHAN_PROX", value: 15)
!50 = !DIEnumerator(name: "SENSOR_CHAN_HUMIDITY", value: 16)
!51 = !DIEnumerator(name: "SENSOR_CHAN_LIGHT", value: 17)
!52 = !DIEnumerator(name: "SENSOR_CHAN_IR", value: 18)
!53 = !DIEnumerator(name: "SENSOR_CHAN_RED", value: 19)
!54 = !DIEnumerator(name: "SENSOR_CHAN_GREEN", value: 20)
!55 = !DIEnumerator(name: "SENSOR_CHAN_BLUE", value: 21)
!56 = !DIEnumerator(name: "SENSOR_CHAN_ALTITUDE", value: 22)
!57 = !DIEnumerator(name: "SENSOR_CHAN_PM_1_0", value: 23)
!58 = !DIEnumerator(name: "SENSOR_CHAN_PM_2_5", value: 24)
!59 = !DIEnumerator(name: "SENSOR_CHAN_PM_10", value: 25)
!60 = !DIEnumerator(name: "SENSOR_CHAN_DISTANCE", value: 26)
!61 = !DIEnumerator(name: "SENSOR_CHAN_CO2", value: 27)
!62 = !DIEnumerator(name: "SENSOR_CHAN_VOC", value: 28)
!63 = !DIEnumerator(name: "SENSOR_CHAN_GAS_RES", value: 29)
!64 = !DIEnumerator(name: "SENSOR_CHAN_VOLTAGE", value: 30)
!65 = !DIEnumerator(name: "SENSOR_CHAN_CURRENT", value: 31)
!66 = !DIEnumerator(name: "SENSOR_CHAN_POWER", value: 32)
!67 = !DIEnumerator(name: "SENSOR_CHAN_RESISTANCE", value: 33)
!68 = !DIEnumerator(name: "SENSOR_CHAN_ROTATION", value: 34)
!69 = !DIEnumerator(name: "SENSOR_CHAN_POS_DX", value: 35)
!70 = !DIEnumerator(name: "SENSOR_CHAN_POS_DY", value: 36)
!71 = !DIEnumerator(name: "SENSOR_CHAN_POS_DZ", value: 37)
!72 = !DIEnumerator(name: "SENSOR_CHAN_RPM", value: 38)
!73 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_VOLTAGE", value: 39)
!74 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_CURRENT", value: 40)
!75 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STDBY_CURRENT", value: 41)
!76 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_MAX_LOAD_CURRENT", value: 42)
!77 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TEMP", value: 43)
!78 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_CHARGE", value: 44)
!79 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_CHARGE_CAPACITY", value: 45)
!80 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_REMAINING_CHARGE_CAPACITY", value: 46)
!81 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_NOM_AVAIL_CAPACITY", value: 47)
!82 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_AVAIL_CAPACITY", value: 48)
!83 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_POWER", value: 49)
!84 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_HEALTH", value: 50)
!85 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_EMPTY", value: 51)
!86 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_FULL", value: 52)
!87 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_CYCLE_COUNT", value: 53)
!88 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIGN_VOLTAGE", value: 54)
!89 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_VOLTAGE", value: 55)
!90 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_CHARGING_CURRENT", value: 56)
!91 = !DIEnumerator(name: "SENSOR_CHAN_ALL", value: 57)
!92 = !DIEnumerator(name: "SENSOR_CHAN_COMMON_COUNT", value: 58)
!93 = !DIEnumerator(name: "SENSOR_CHAN_PRIV_START", value: 58)
!94 = !DIEnumerator(name: "SENSOR_CHAN_MAX", value: 32767)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_attribute", file: !31, line: 274, baseType: !32, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!97 = !DIEnumerator(name: "SENSOR_ATTR_SAMPLING_FREQUENCY", value: 0)
!98 = !DIEnumerator(name: "SENSOR_ATTR_LOWER_THRESH", value: 1)
!99 = !DIEnumerator(name: "SENSOR_ATTR_UPPER_THRESH", value: 2)
!100 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_TH", value: 3)
!101 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_DUR", value: 4)
!102 = !DIEnumerator(name: "SENSOR_ATTR_HYSTERESIS", value: 5)
!103 = !DIEnumerator(name: "SENSOR_ATTR_OVERSAMPLING", value: 6)
!104 = !DIEnumerator(name: "SENSOR_ATTR_FULL_SCALE", value: 7)
!105 = !DIEnumerator(name: "SENSOR_ATTR_OFFSET", value: 8)
!106 = !DIEnumerator(name: "SENSOR_ATTR_CALIB_TARGET", value: 9)
!107 = !DIEnumerator(name: "SENSOR_ATTR_CONFIGURATION", value: 10)
!108 = !DIEnumerator(name: "SENSOR_ATTR_CALIBRATION", value: 11)
!109 = !DIEnumerator(name: "SENSOR_ATTR_FEATURE_MASK", value: 12)
!110 = !DIEnumerator(name: "SENSOR_ATTR_ALERT", value: 13)
!111 = !DIEnumerator(name: "SENSOR_ATTR_FF_DUR", value: 14)
!112 = !DIEnumerator(name: "SENSOR_ATTR_COMMON_COUNT", value: 15)
!113 = !DIEnumerator(name: "SENSOR_ATTR_PRIV_START", value: 15)
!114 = !DIEnumerator(name: "SENSOR_ATTR_MAX", value: 32767)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_trigger_type", file: !31, line: 203, baseType: !32, size: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!117 = !DIEnumerator(name: "SENSOR_TRIG_TIMER", value: 0)
!118 = !DIEnumerator(name: "SENSOR_TRIG_DATA_READY", value: 1)
!119 = !DIEnumerator(name: "SENSOR_TRIG_DELTA", value: 2)
!120 = !DIEnumerator(name: "SENSOR_TRIG_NEAR_FAR", value: 3)
!121 = !DIEnumerator(name: "SENSOR_TRIG_THRESHOLD", value: 4)
!122 = !DIEnumerator(name: "SENSOR_TRIG_TAP", value: 5)
!123 = !DIEnumerator(name: "SENSOR_TRIG_DOUBLE_TAP", value: 6)
!124 = !DIEnumerator(name: "SENSOR_TRIG_FREEFALL", value: 7)
!125 = !DIEnumerator(name: "SENSOR_TRIG_MOTION", value: 8)
!126 = !DIEnumerator(name: "SENSOR_TRIG_STATIONARY", value: 9)
!127 = !DIEnumerator(name: "SENSOR_TRIG_COMMON_COUNT", value: 10)
!128 = !DIEnumerator(name: "SENSOR_TRIG_PRIV_START", value: 10)
!129 = !DIEnumerator(name: "SENSOR_TRIG_MAX", value: 32767)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !131, line: 27, baseType: !32, size: 32, elements: !132)
!131 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199}
!133 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!134 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!135 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!136 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!137 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!138 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!139 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!140 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!141 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!142 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!143 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!144 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!145 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!146 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!147 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!148 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!149 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!150 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!151 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!152 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!153 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!154 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!155 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!156 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!157 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!158 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!159 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!160 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!161 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!162 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!163 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!164 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!165 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!166 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!167 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!168 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!169 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!170 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!171 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!172 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!173 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!174 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!175 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!176 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!177 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!178 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!179 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!180 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!181 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!182 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!183 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!184 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!185 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!186 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!187 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!188 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!189 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!190 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!191 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!192 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!193 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!194 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!195 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!196 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!197 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!198 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!199 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!200 = !{!201, !203, !204, !234, !279, !280, !284, !285}
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !202, line: 214, baseType: !32)
!202 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!203 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_driver_api", file: !31, line: 397, size: 160, elements: !207)
!207 = !{!208, !248, !254, !269, !274}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "attr_set", scope: !206, file: !31, line: 398, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_set_t", file: !31, line: 354, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{!203, !213, !30, !95, !241}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !216, line: 378, size: 192, elements: !217)
!216 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!217 = !{!218, !222, !223, !224, !233, !235}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !216, line: 380, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !215, file: !216, line: 382, baseType: !13, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !215, file: !216, line: 384, baseType: !13, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !215, file: !216, line: 386, baseType: !225, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !216, line: 351, size: 16, elements: !227)
!227 = !{!228, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !226, file: !216, line: 359, baseType: !229, size: 8)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !230)
!230 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !226, file: !216, line: 364, baseType: !232, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!232 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !216, line: 388, baseType: !234, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !215, file: !216, line: 396, baseType: !236, size: 32, offset: 160)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !216, line: 43, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !240)
!240 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_value", file: !31, line: 43, size: 64, elements: !244)
!244 = !{!245, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !243, file: !31, line: 45, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !203)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !243, file: !31, line: 47, baseType: !246, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "attr_get", scope: !206, file: !31, line: 399, baseType: !249, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_get_t", file: !31, line: 365, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{!203, !213, !30, !95, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "trigger_set", scope: !206, file: !31, line: 400, baseType: !255, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_set_t", file: !31, line: 376, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DISubroutineType(types: !258)
!258 = !{!203, !213, !259, !265}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_trigger", file: !31, line: 264, size: 64, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !31, line: 266, baseType: !115, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !261, file: !31, line: 268, baseType: !30, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_handler_t", file: !31, line: 345, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !213, !259}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fetch", scope: !206, file: !31, line: 401, baseType: !270, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_sample_fetch_t", file: !31, line: 385, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DISubroutineType(types: !273)
!273 = !{!203, !213, !30}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "channel_get", scope: !206, file: !31, line: 402, baseType: !275, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_channel_get_t", file: !31, line: 393, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{!203, !213, !30, !253}
!279 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !281, line: 46, baseType: !282)
!281 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !283)
!283 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !286)
!286 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!287 = !{!288, !25}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "sensors", scope: !27, file: !290, line: 20, type: !291, isLocal: true, isDefinition: true)
!290 = !DIFile(filename: "zephyr/samples/sensor/accel_polling/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 32, elements: !293)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!293 = !{!294}
!294 = !DISubrange(count: 1)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 96, elements: !297)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!297 = !{!298}
!298 = !DISubrange(count: 3)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "_char_out", scope: !301, file: !306, line: 54, type: !307, isLocal: false, isDefinition: true)
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !304, globals: !305, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!303 = !{!130}
!304 = !{!234, !203}
!305 = !{!299}
!306 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DISubroutineType(types: !309)
!309 = !{!203, !203}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !312, file: !342, line: 60, type: !343, isLocal: true, isDefinition: true, align: 32)
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !314, globals: !341, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!314 = !{!315, !335}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !317, line: 386, baseType: !318)
!317 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 370, size: 448, elements: !319)
!319 = !{!320, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !318, file: !317, line: 372, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !284)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !318, file: !317, line: 373, baseType: !321, size: 32, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !318, file: !317, line: 374, baseType: !321, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !318, file: !317, line: 375, baseType: !321, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !318, file: !317, line: 376, baseType: !321, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !318, file: !317, line: 377, baseType: !321, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !318, file: !317, line: 378, baseType: !321, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !318, file: !317, line: 379, baseType: !321, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !318, file: !317, line: 380, baseType: !321, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !318, file: !317, line: 381, baseType: !321, size: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !318, file: !317, line: 382, baseType: !321, size: 32, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !318, file: !317, line: 383, baseType: !321, size: 32, offset: 352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !318, file: !317, line: 384, baseType: !321, size: 32, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !318, file: !317, line: 385, baseType: !321, size: 32, offset: 416)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !317, line: 364, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 360, size: 64, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !337, file: !317, line: 362, baseType: !321, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !337, file: !317, line: 363, baseType: !321, size: 32, offset: 32)
!341 = !{!310}
!342 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !345, line: 51, size: 64, elements: !346)
!345 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = !{!347, !366}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !344, file: !345, line: 60, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DISubroutineType(types: !350)
!350 = !{!203, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !216, line: 378, size: 192, elements: !354)
!354 = !{!355, !356, !357, !358, !364, !365}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !353, file: !216, line: 380, baseType: !219, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !353, file: !216, line: 382, baseType: !13, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !353, file: !216, line: 384, baseType: !13, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !353, file: !216, line: 386, baseType: !359, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !216, line: 351, size: 16, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !360, file: !216, line: 359, baseType: !229, size: 8)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !360, file: !216, line: 364, baseType: !232, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !353, file: !216, line: 388, baseType: !234, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !353, file: !216, line: 396, baseType: !236, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !344, file: !345, line: 65, baseType: !351, size: 32, offset: 32)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !369, file: !372, line: 71, type: !373, isLocal: true, isDefinition: true, align: 32)
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !371, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!371 = !{!367}
!372 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !345, line: 51, size: 64, elements: !375)
!375 = !{!376, !395}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !374, file: !345, line: 60, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DISubroutineType(types: !379)
!379 = !{!203, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !216, line: 378, size: 192, elements: !383)
!383 = !{!384, !385, !386, !387, !393, !394}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !216, line: 380, baseType: !219, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !382, file: !216, line: 382, baseType: !13, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !382, file: !216, line: 384, baseType: !13, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !382, file: !216, line: 386, baseType: !388, size: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !216, line: 351, size: 16, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !389, file: !216, line: 359, baseType: !229, size: 8)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !389, file: !216, line: 364, baseType: !232, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !382, file: !216, line: 388, baseType: !234, size: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !382, file: !216, line: 396, baseType: !236, size: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !374, file: !345, line: 65, baseType: !380, size: 32, offset: 32)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "static_regions", scope: !398, file: !405, line: 62, type: !542, isLocal: true, isDefinition: true)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !400, globals: !401, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!400 = !{!201, !203, !284, !234}
!401 = !{!402, !396}
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !404, file: !405, line: 198, type: !530, isLocal: true, isDefinition: true)
!404 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !405, file: !405, line: 175, type: !406, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !398, retainedNodes: !525)
!405 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = !DISubroutineType(types: !407)
!407 = !{null, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !410, line: 245, size: 1024, elements: !411)
!410 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!411 = !{!412, !479, !492, !493, !494, !495, !501, !520}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !409, file: !410, line: 247, baseType: !413, size: 384)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !410, line: 57, size: 384, elements: !414)
!414 = !{!415, !443, !451, !452, !453, !466, !467, !468}
!415 = !DIDerivedType(tag: DW_TAG_member, scope: !413, file: !410, line: 60, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !413, file: !410, line: 60, size: 64, elements: !417)
!417 = !{!418, !434}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !416, file: !410, line: 61, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !420, line: 49, baseType: !421)
!420 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !420, line: 37, size: 64, elements: !422)
!422 = !{!423, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, scope: !421, file: !420, line: 38, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !420, line: 38, size: 32, elements: !425)
!425 = !{!426, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !424, file: !420, line: 39, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !420, line: 40, baseType: !427, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, scope: !421, file: !420, line: 42, baseType: !430, size: 32, offset: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !420, line: 42, size: 32, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !430, file: !420, line: 43, baseType: !427, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !430, file: !420, line: 44, baseType: !427, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !416, file: !410, line: 62, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !436, line: 49, size: 64, elements: !437)
!436 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !435, file: !436, line: 50, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 64, elements: !441)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!441 = !{!442}
!442 = !DISubrange(count: 2)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !413, file: !410, line: 68, baseType: !444, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !446, line: 233, baseType: !447)
!446 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 231, size: 64, elements: !448)
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !447, file: !446, line: 232, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !420, line: 48, baseType: !421)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !413, file: !410, line: 71, baseType: !229, size: 8, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !413, file: !410, line: 74, baseType: !229, size: 8, offset: 104)
!453 = !DIDerivedType(tag: DW_TAG_member, scope: !413, file: !410, line: 90, baseType: !454, size: 16, offset: 112)
!454 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !413, file: !410, line: 90, size: 16, elements: !455)
!455 = !{!456, !463}
!456 = !DIDerivedType(tag: DW_TAG_member, scope: !454, file: !410, line: 91, baseType: !457, size: 16)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !454, file: !410, line: 91, size: 16, elements: !458)
!458 = !{!459, !462}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !457, file: !410, line: 96, baseType: !460, size: 8)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !461)
!461 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !457, file: !410, line: 97, baseType: !229, size: 8, offset: 8)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !454, file: !410, line: 100, baseType: !464, size: 16)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !465)
!465 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !413, file: !410, line: 107, baseType: !284, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !413, file: !410, line: 127, baseType: !234, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !413, file: !410, line: 131, baseType: !469, size: 192, offset: 192)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !446, line: 244, size: 192, elements: !470)
!470 = !{!471, !472, !478}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !469, file: !446, line: 245, baseType: !419, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !469, file: !446, line: 246, baseType: !473, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !446, line: 242, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !469, file: !446, line: 249, baseType: !282, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !409, file: !410, line: 250, baseType: !480, size: 288, offset: 384)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !481, line: 25, size: 288, elements: !482)
!481 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !480, file: !481, line: 26, baseType: !284, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !480, file: !481, line: 27, baseType: !284, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !480, file: !481, line: 28, baseType: !284, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !480, file: !481, line: 29, baseType: !284, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !480, file: !481, line: 30, baseType: !284, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !480, file: !481, line: 31, baseType: !284, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !480, file: !481, line: 32, baseType: !284, size: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !480, file: !481, line: 33, baseType: !284, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !480, file: !481, line: 34, baseType: !284, size: 32, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !409, file: !410, line: 253, baseType: !234, size: 32, offset: 672)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !409, file: !410, line: 256, baseType: !445, size: 64, offset: 704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !409, file: !410, line: 294, baseType: !203, size: 32, offset: 768)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !409, file: !410, line: 300, baseType: !496, size: 96, offset: 800)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !410, line: 149, size: 96, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !496, file: !410, line: 153, baseType: !22, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !496, file: !410, line: 162, baseType: !201, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !496, file: !410, line: 168, baseType: !201, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !409, file: !410, line: 325, baseType: !502, size: 32, offset: 896)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !504, line: 5073, size: 160, elements: !505)
!504 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!505 = !{!506, !515, !516}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !503, file: !504, line: 5074, baseType: !507, size: 96)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !508, line: 56, size: 96, elements: !509)
!508 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!509 = !{!510, !513, !514}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !507, file: !508, line: 57, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !508, line: 57, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !507, file: !508, line: 58, baseType: !234, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !507, file: !508, line: 59, baseType: !201, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !503, file: !504, line: 5075, baseType: !445, size: 64, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !503, file: !504, line: 5076, baseType: !517, offset: 160)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !518, line: 43, elements: !519)
!518 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!519 = !{}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !409, file: !410, line: 343, baseType: !521, size: 64, offset: 928)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !481, line: 60, size: 64, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !521, file: !481, line: 63, baseType: !284, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !521, file: !481, line: 66, baseType: !284, size: 32, offset: 32)
!525 = !{!526, !527, !528, !529}
!526 = !DILocalVariable(name: "thread", arg: 1, scope: !404, file: !405, line: 175, type: !408)
!527 = !DILocalVariable(name: "region_num", scope: !404, file: !405, line: 200, type: !229)
!528 = !DILocalVariable(name: "guard_start", scope: !404, file: !405, line: 265, type: !22)
!529 = !DILocalVariable(name: "guard_size", scope: !404, file: !405, line: 266, type: !201)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 96, elements: !293)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !532, line: 52, size: 96, elements: !533)
!532 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!533 = !{!534, !535, !536}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !531, file: !532, line: 53, baseType: !22, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !531, file: !532, line: 54, baseType: !201, size: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !531, file: !532, line: 55, baseType: !537, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !538, line: 151, baseType: !539)
!538 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 149, size: 32, elements: !540)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !539, file: !538, line: 150, baseType: !284, size: 32)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 96, elements: !293)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !546, file: !579, line: 39, type: !229, isLocal: true, isDefinition: true)
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !548, globals: !578, splitDebugInlining: false, nameTableKind: None)
!547 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!548 = !{!549, !234, !203, !566, !229}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !551, line: 1168, baseType: !552)
!551 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !551, line: 1155, size: 352, elements: !553)
!553 = !{!554, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !552, file: !551, line: 1157, baseType: !555, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !552, file: !551, line: 1158, baseType: !321, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !552, file: !551, line: 1159, baseType: !321, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !552, file: !551, line: 1160, baseType: !321, size: 32, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !552, file: !551, line: 1161, baseType: !321, size: 32, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !552, file: !551, line: 1162, baseType: !321, size: 32, offset: 160)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !552, file: !551, line: 1163, baseType: !321, size: 32, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !552, file: !551, line: 1164, baseType: !321, size: 32, offset: 224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !552, file: !551, line: 1165, baseType: !321, size: 32, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !552, file: !551, line: 1166, baseType: !321, size: 32, offset: 288)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !552, file: !551, line: 1167, baseType: !321, size: 32, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !569, line: 27, size: 96, elements: !570)
!569 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = !{!571, !572, !573}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !568, file: !569, line: 29, baseType: !284, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !568, file: !569, line: 31, baseType: !219, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !568, file: !569, line: 37, baseType: !574, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !538, line: 146, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !538, line: 141, size: 32, elements: !576)
!576 = !{!577}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !575, file: !538, line: 143, baseType: !284, size: 32)
!578 = !{!544}
!579 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !582, file: !589, line: 21, type: !307, isLocal: true, isDefinition: true)
!582 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !584, globals: !588, splitDebugInlining: false, nameTableKind: None)
!583 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!584 = !{!585, !203, !234}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !587, line: 22, baseType: !203)
!587 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!588 = !{!580}
!589 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !592, file: !597, line: 13, type: !614, isLocal: true, isDefinition: true)
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !594, splitDebugInlining: false, nameTableKind: None)
!593 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!594 = !{!595, !590}
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "mpu_config", scope: !592, file: !597, line: 37, type: !598, isLocal: false, isDefinition: true)
!597 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !569, line: 41, size: 64, elements: !600)
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !599, file: !569, line: 43, baseType: !284, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !599, file: !569, line: 45, baseType: !603, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !569, line: 27, size: 96, elements: !606)
!606 = !{!607, !608, !609}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !605, file: !569, line: 29, baseType: !284, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !569, line: 31, baseType: !219, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !605, file: !569, line: 37, baseType: !610, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !538, line: 146, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !538, line: 141, size: 32, elements: !612)
!612 = !{!613}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !611, file: !538, line: 143, baseType: !284, size: 32)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 192, elements: !441)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !617, file: !714, line: 36, type: !715, isLocal: true, isDefinition: true, align: 32)
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !619, retainedTypes: !631, globals: !713, splitDebugInlining: false, nameTableKind: None)
!618 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!619 = !{!620, !626}
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !621, line: 506, baseType: !32, size: 32, elements: !622)
!621 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!622 = !{!623, !624, !625}
!623 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!624 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!625 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!626 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !621, line: 512, baseType: !32, size: 32, elements: !627)
!627 = !{!628, !629, !630}
!628 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!629 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!630 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!631 = !{!632, !702, !707, !667, !626, !620, !712, !234}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !621, line: 523, size: 288, elements: !635)
!635 = !{!636, !657, !663, !668, !672, !673, !674, !678, !698}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !634, file: !621, line: 524, baseType: !637, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DISubroutineType(types: !639)
!639 = !{!203, !640, !655, !656}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !216, line: 378, size: 192, elements: !643)
!643 = !{!644, !645, !646, !647, !653, !654}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !642, file: !216, line: 380, baseType: !219, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !642, file: !216, line: 382, baseType: !13, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !642, file: !216, line: 384, baseType: !13, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !642, file: !216, line: 386, baseType: !648, size: 32, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !216, line: 351, size: 16, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !649, file: !216, line: 359, baseType: !229, size: 8)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !649, file: !216, line: 364, baseType: !232, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !642, file: !216, line: 388, baseType: !234, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !642, file: !216, line: 396, baseType: !236, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !621, line: 237, baseType: !229)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !621, line: 257, baseType: !284)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !634, file: !621, line: 530, baseType: !658, size: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DISubroutineType(types: !660)
!660 = !{!203, !640, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !621, line: 229, baseType: !284)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !634, file: !621, line: 532, baseType: !664, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = !DISubroutineType(types: !666)
!666 = !{!203, !640, !667, !662}
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !621, line: 216, baseType: !284)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !634, file: !621, line: 535, baseType: !669, size: 32, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = !DISubroutineType(types: !671)
!671 = !{!203, !640, !667}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !634, file: !621, line: 537, baseType: !669, size: 32, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !634, file: !621, line: 539, baseType: !669, size: 32, offset: 160)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !634, file: !621, line: 541, baseType: !675, size: 32, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 32)
!676 = !DISubroutineType(types: !677)
!677 = !{!203, !640, !655, !620, !626}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !634, file: !621, line: 544, baseType: !679, size: 32, offset: 224)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DISubroutineType(types: !681)
!681 = !{!203, !640, !682, !232}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !621, line: 478, size: 96, elements: !684)
!684 = !{!685, !692, !697}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !683, file: !621, line: 482, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !687, line: 33, baseType: !688)
!687 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !687, line: 29, size: 32, elements: !689)
!689 = !{!690}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !688, file: !687, line: 30, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !683, file: !621, line: 485, baseType: !693, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !621, line: 464, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !640, !682, !667}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !683, file: !621, line: 493, baseType: !667, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !634, file: !621, line: 547, baseType: !699, size: 32, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DISubroutineType(types: !701)
!701 = !{!284, !640}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !621, line: 428, size: 32, elements: !705)
!705 = !{!706}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !704, file: !621, line: 434, baseType: !667, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !621, line: 441, size: 32, elements: !710)
!710 = !{!711}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !709, file: !621, line: 447, baseType: !667, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!713 = !{!615}
!714 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !345, line: 51, size: 64, elements: !717)
!717 = !{!718, !722}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !716, file: !345, line: 60, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DISubroutineType(types: !721)
!721 = !{!203, !640}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !716, file: !345, line: 65, baseType: !640, size: 32, offset: 32)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !725, file: !797, line: 48, type: !872, isLocal: true, isDefinition: true)
!725 = distinct !DICompileUnit(language: DW_LANG_C99, file: !726, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !727, retainedTypes: !783, globals: !794, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!727 = !{!130, !728}
!728 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !317, line: 69, baseType: !203, size: 32, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782}
!730 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!731 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!732 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!733 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!734 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!735 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!736 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!737 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!738 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!739 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!740 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!741 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!742 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!743 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!744 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!745 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!746 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!747 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!748 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!749 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!750 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!751 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!752 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!753 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!754 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!755 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!756 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!757 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!758 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!759 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!760 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!761 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!762 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!763 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!764 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!765 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!766 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!767 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!768 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!769 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!770 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!771 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!772 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!773 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!774 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!775 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!776 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!777 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!778 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!779 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!780 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!781 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!782 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!783 = !{!201, !203, !234, !784}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !317, line: 270, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 262, size: 192, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !786, file: !317, line: 264, baseType: !321, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !786, file: !317, line: 265, baseType: !321, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !786, file: !317, line: 266, baseType: !321, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !786, file: !317, line: 267, baseType: !321, size: 32, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !786, file: !317, line: 268, baseType: !321, size: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !786, file: !317, line: 269, baseType: !321, size: 32, offset: 160)
!794 = !{!795, !801, !817, !828, !845, !723, !847, !860, !862, !864, !866, !868, !870}
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !725, file: !797, line: 424, type: !798, isLocal: false, isDefinition: true, align: 16)
!797 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 64, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 4)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !725, file: !797, line: 424, type: !803, isLocal: false, isDefinition: true, align: 32)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !216, line: 378, size: 192, elements: !805)
!805 = !{!806, !807, !808, !809, !815, !816}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !804, file: !216, line: 380, baseType: !219, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !804, file: !216, line: 382, baseType: !13, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !804, file: !216, line: 384, baseType: !13, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !804, file: !216, line: 386, baseType: !810, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !216, line: 351, size: 16, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !811, file: !216, line: 359, baseType: !229, size: 8)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !811, file: !216, line: 364, baseType: !232, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !804, file: !216, line: 388, baseType: !234, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !804, file: !216, line: 396, baseType: !236, size: 32, offset: 160)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !725, file: !797, line: 424, type: !819, isLocal: true, isDefinition: true, align: 32)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !345, line: 51, size: 64, elements: !821)
!821 = !{!822, !827}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !820, file: !345, line: 60, baseType: !823, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{!203, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !820, file: !345, line: 65, baseType: !826, size: 32, offset: 32)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "exti_data", scope: !725, file: !797, line: 423, type: !830, isLocal: true, isDefinition: true)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !797, line: 107, size: 1024, elements: !831)
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !830, file: !797, line: 109, baseType: !833, size: 1024)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 1024, elements: !843)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !797, line: 101, size: 64, elements: !835)
!835 = !{!836, !842}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !834, file: !797, line: 102, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !838, line: 63, baseType: !839)
!838 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !203, !234}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !834, file: !797, line: 103, baseType: !234, size: 32, offset: 32)
!843 = !{!844}
!844 = !DISubrange(count: 16)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !725, file: !797, line: 424, type: !811, isLocal: true, isDefinition: true, align: 8)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !849, file: !797, line: 493, type: !854, isLocal: true, isDefinition: true, align: 32)
!849 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !797, file: !797, line: 460, type: !850, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !725, retainedNodes: !852)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !826}
!852 = !{!853}
!853 = !DILocalVariable(name: "dev", arg: 1, scope: !849, file: !797, line: 460, type: !826)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !855)
!855 = !{!856, !857, !858, !859}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !854, file: !10, line: 55, baseType: !246, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !854, file: !10, line: 57, baseType: !246, size: 32, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !854, file: !10, line: 59, baseType: !234, size: 32, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !854, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !849, file: !797, line: 497, type: !854, isLocal: true, isDefinition: true, align: 32)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !849, file: !797, line: 507, type: !854, isLocal: true, isDefinition: true, align: 32)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !849, file: !797, line: 512, type: !854, isLocal: true, isDefinition: true, align: 32)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !849, file: !797, line: 516, type: !854, isLocal: true, isDefinition: true, align: 32)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !849, file: !797, line: 523, type: !854, isLocal: true, isDefinition: true, align: 32)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !849, file: !797, line: 527, type: !854, isLocal: true, isDefinition: true, align: 32)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !873, size: 512, elements: !843)
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !317, line: 127, baseType: !728)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !877, file: !882, line: 22, type: !909, isLocal: false, isDefinition: true, align: 16)
!877 = distinct !DICompileUnit(language: DW_LANG_C99, file: !878, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !879, splitDebugInlining: false, nameTableKind: None)
!878 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!879 = !{!880, !875, !886, !888, !890, !892, !894, !896, !898, !900, !902, !907}
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !877, file: !882, line: 17, type: !883, isLocal: false, isDefinition: true, align: 16)
!882 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 192, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 12)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !877, file: !882, line: 29, type: !798, isLocal: false, isDefinition: true, align: 16)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !877, file: !882, line: 36, type: !798, isLocal: false, isDefinition: true, align: 16)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !877, file: !882, line: 43, type: !798, isLocal: false, isDefinition: true, align: 16)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !877, file: !882, line: 50, type: !798, isLocal: false, isDefinition: true, align: 16)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !877, file: !882, line: 57, type: !798, isLocal: false, isDefinition: true, align: 16)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !877, file: !882, line: 64, type: !798, isLocal: false, isDefinition: true, align: 16)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !877, file: !882, line: 71, type: !798, isLocal: false, isDefinition: true, align: 16)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !877, file: !882, line: 78, type: !798, isLocal: false, isDefinition: true, align: 16)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_51", scope: !877, file: !882, line: 87, type: !904, isLocal: false, isDefinition: true, align: 16)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 80, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 5)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_52", scope: !877, file: !882, line: 94, type: !798, isLocal: false, isDefinition: true, align: 16)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 48, elements: !297)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !912, file: !956, line: 398, type: !989, isLocal: true, isDefinition: true)
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !914, retainedTypes: !927, globals: !953, splitDebugInlining: false, nameTableKind: None)
!913 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!914 = !{!915, !130, !920}
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !916, line: 190, baseType: !32, size: 32, elements: !917)
!916 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!917 = !{!918, !919}
!918 = !DIEnumerator(name: "SUCCESS", value: 0)
!919 = !DIEnumerator(name: "ERROR", value: 1)
!920 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !921, line: 44, baseType: !32, size: 32, elements: !922)
!921 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!922 = !{!923, !924, !925, !926}
!923 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!924 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!925 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!926 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!927 = !{!234, !203, !284, !928, !946, !952}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !317, line: 386, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 370, size: 448, elements: !931)
!931 = !{!932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !930, file: !317, line: 372, baseType: !321, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !930, file: !317, line: 373, baseType: !321, size: 32, offset: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !930, file: !317, line: 374, baseType: !321, size: 32, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !930, file: !317, line: 375, baseType: !321, size: 32, offset: 96)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !930, file: !317, line: 376, baseType: !321, size: 32, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !930, file: !317, line: 377, baseType: !321, size: 32, offset: 160)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !930, file: !317, line: 378, baseType: !321, size: 32, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !930, file: !317, line: 379, baseType: !321, size: 32, offset: 224)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !930, file: !317, line: 380, baseType: !321, size: 32, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !930, file: !317, line: 381, baseType: !321, size: 32, offset: 288)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !930, file: !317, line: 382, baseType: !321, size: 32, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !930, file: !317, line: 383, baseType: !321, size: 32, offset: 352)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !930, file: !317, line: 384, baseType: !321, size: 32, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !930, file: !317, line: 385, baseType: !321, size: 32, offset: 416)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !948, line: 343, size: 64, elements: !949)
!948 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !947, file: !948, line: 344, baseType: !284, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !947, file: !948, line: 345, baseType: !284, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!953 = !{!954, !960, !976, !987, !910}
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !912, file: !956, line: 752, type: !957, isLocal: false, isDefinition: true, align: 16)
!956 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 512, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 32)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !912, file: !956, line: 752, type: !962, isLocal: false, isDefinition: true, align: 32)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !216, line: 378, size: 192, elements: !964)
!964 = !{!965, !966, !967, !968, !974, !975}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !963, file: !216, line: 380, baseType: !219, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !963, file: !216, line: 382, baseType: !13, size: 32, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !963, file: !216, line: 384, baseType: !13, size: 32, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !963, file: !216, line: 386, baseType: !969, size: 32, offset: 96)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !216, line: 351, size: 16, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !970, file: !216, line: 359, baseType: !229, size: 8)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !970, file: !216, line: 364, baseType: !232, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !963, file: !216, line: 388, baseType: !234, size: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !963, file: !216, line: 396, baseType: !236, size: 32, offset: 160)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !912, file: !956, line: 752, type: !978, isLocal: true, isDefinition: true, align: 32)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !345, line: 51, size: 64, elements: !980)
!980 = !{!981, !986}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !979, file: !345, line: 60, baseType: !982, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{!203, !985}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !979, file: !345, line: 65, baseType: !985, size: 32, offset: 32)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !912, file: !956, line: 752, type: !970, isLocal: true, isDefinition: true, align: 8)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !921, line: 100, size: 224, elements: !990)
!990 = !{!991, !997, !998, !1007, !1012, !1017, !1023}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !989, file: !921, line: 101, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !921, line: 76, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DISubroutineType(types: !995)
!995 = !{!203, !985, !996}
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !921, line: 56, baseType: !234)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !989, file: !921, line: 102, baseType: !992, size: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !989, file: !921, line: 103, baseType: !999, size: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !921, line: 83, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!203, !985, !996, !1003, !234}
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !921, line: 72, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null, !985, !996, !234}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !989, file: !921, line: 104, baseType: !1008, size: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !921, line: 79, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!203, !985, !996, !952}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !989, file: !921, line: 105, baseType: !1013, size: 32, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !921, line: 88, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!920, !985, !996}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !989, file: !921, line: 106, baseType: !1018, size: 32, offset: 160)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !921, line: 92, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!203, !985, !996, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !921, line: 64, baseType: !234)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !989, file: !921, line: 107, baseType: !1024, size: 32, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !921, line: 96, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!203, !985, !996, !234}
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !1030, file: !1087, line: 603, type: !1089, isLocal: true, isDefinition: true, align: 32)
!1030 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1031, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !1032, globals: !1084, splitDebugInlining: false, nameTableKind: None)
!1031 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/accel_polling")
!1032 = !{!234, !203, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !1036, line: 336, size: 160, elements: !1037)
!1036 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1037 = !{!1038, !1058, !1062, !1066, !1079}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !1035, file: !1036, line: 365, baseType: !1039, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!203, !1042, !1057}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !216, line: 378, size: 192, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1055, !1056}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1044, file: !216, line: 380, baseType: !219, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1044, file: !216, line: 382, baseType: !13, size: 32, offset: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1044, file: !216, line: 384, baseType: !13, size: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1044, file: !216, line: 386, baseType: !1050, size: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 32)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !216, line: 351, size: 16, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1051, file: !216, line: 359, baseType: !229, size: 8)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1051, file: !216, line: 364, baseType: !232, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1044, file: !216, line: 388, baseType: !234, size: 32, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1044, file: !216, line: 396, baseType: !236, size: 32, offset: 160)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !1035, file: !1036, line: 366, baseType: !1059, size: 32, offset: 32)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 32)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{null, !1042, !230}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !1035, file: !1036, line: 374, baseType: !1063, size: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 32)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!203, !1042}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1035, file: !1036, line: 377, baseType: !1067, size: 32, offset: 96)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 32)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!203, !1042, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 32)
!1071 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !1036, line: 122, size: 64, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1072, file: !1036, line: 123, baseType: !284, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1072, file: !1036, line: 124, baseType: !229, size: 8, offset: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1072, file: !1036, line: 125, baseType: !229, size: 8, offset: 40)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !1072, file: !1036, line: 126, baseType: !229, size: 8, offset: 48)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !1072, file: !1036, line: 127, baseType: !229, size: 8, offset: 56)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !1035, file: !1036, line: 379, baseType: !1080, size: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 32)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!203, !1042, !1083}
