; ModuleID = 'build/96b_carbon/basic/blinky/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.gpio_driver_data }
%struct.gpio_driver_data = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.gpio_driver_data }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %struct.gpio_driver_data, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 97, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5440, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 85)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2720, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 258, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f401xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 249, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 251, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 252, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 253, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 254, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 255, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 256, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 257, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "static_regions", scope: !197, file: !206, line: 62, type: !347, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !199, globals: !202, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!199 = !{!200, !103, !121, !102}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 214, baseType: !32)
!201 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !195}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !205, file: !206, line: 198, type: !333, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !206, file: !206, line: 175, type: !207, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !328)
!206 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !211, line: 245, size: 1024, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !282, !295, !296, !297, !298, !304, !323}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !210, file: !211, line: 247, baseType: !214, size: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !211, line: 57, size: 384, elements: !215)
!215 = !{!216, !244, !252, !253, !254, !267, !268, !269}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 60, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 60, size: 64, elements: !218)
!218 = !{!219, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !217, file: !211, line: 61, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !221, line: 49, baseType: !222)
!221 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !221, line: 37, size: 64, elements: !223)
!223 = !{!224, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 38, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 38, size: 32, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !221, line: 39, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !221, line: 40, baseType: !228, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 42, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 42, size: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !221, line: 43, baseType: !228, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !221, line: 44, baseType: !228, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !217, file: !211, line: 62, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !237, line: 49, size: 64, elements: !238)
!237 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !236, file: !237, line: 50, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !214, file: !211, line: 68, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !221, line: 48, baseType: !222)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !214, file: !211, line: 71, baseType: !154, size: 8, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !214, file: !211, line: 74, baseType: !154, size: 8, offset: 104)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 90, baseType: !255, size: 16, offset: 112)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 90, size: 16, elements: !256)
!256 = !{!257, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !211, line: 91, baseType: !258, size: 16)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !211, line: 91, size: 16, elements: !259)
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !258, file: !211, line: 96, baseType: !261, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !262)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !258, file: !211, line: 97, baseType: !154, size: 8, offset: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !255, file: !211, line: 100, baseType: !265, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !266)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !214, file: !211, line: 107, baseType: !121, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !214, file: !211, line: 127, baseType: !102, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !214, file: !211, line: 131, baseType: !270, size: 192, offset: 192)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !271)
!271 = !{!272, !273, !279}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !270, file: !247, line: 245, baseType: !220, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !270, file: !247, line: 246, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !270, file: !247, line: 249, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !281)
!281 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !210, file: !211, line: 250, baseType: !283, size: 288, offset: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !284, line: 25, size: 288, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !283, file: !284, line: 26, baseType: !121, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !283, file: !284, line: 27, baseType: !121, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !283, file: !284, line: 28, baseType: !121, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !283, file: !284, line: 29, baseType: !121, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !283, file: !284, line: 30, baseType: !121, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !283, file: !284, line: 31, baseType: !121, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !283, file: !284, line: 32, baseType: !121, size: 32, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !283, file: !284, line: 33, baseType: !121, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !283, file: !284, line: 34, baseType: !121, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !210, file: !211, line: 253, baseType: !102, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !210, file: !211, line: 256, baseType: !246, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !210, file: !211, line: 294, baseType: !103, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !210, file: !211, line: 300, baseType: !299, size: 96, offset: 800)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !211, line: 149, size: 96, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !299, file: !211, line: 153, baseType: !22, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !211, line: 162, baseType: !200, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !299, file: !211, line: 168, baseType: !200, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !210, file: !211, line: 325, baseType: !305, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !307, line: 5073, size: 160, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 5074, baseType: !310, size: 96)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !311, line: 56, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !310, file: !311, line: 57, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !311, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !310, file: !311, line: 58, baseType: !102, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !310, file: !311, line: 59, baseType: !200, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !306, file: !307, line: 5075, baseType: !246, size: 64, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !307, line: 5076, baseType: !320, offset: 160)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !321, line: 43, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !210, file: !211, line: 343, baseType: !324, size: 64, offset: 928)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !284, line: 60, size: 64, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !324, file: !284, line: 63, baseType: !121, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !324, file: !284, line: 66, baseType: !121, size: 32, offset: 32)
!328 = !{!329, !330, !331, !332}
!329 = !DILocalVariable(name: "thread", arg: 1, scope: !205, file: !206, line: 175, type: !209)
!330 = !DILocalVariable(name: "region_num", scope: !205, file: !206, line: 200, type: !154)
!331 = !DILocalVariable(name: "guard_start", scope: !205, file: !206, line: 265, type: !22)
!332 = !DILocalVariable(name: "guard_size", scope: !205, file: !206, line: 266, type: !200)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 96, elements: !345)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !335, line: 52, size: 96, elements: !336)
!335 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !334, file: !335, line: 53, baseType: !22, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !334, file: !335, line: 54, baseType: !200, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !334, file: !335, line: 55, baseType: !340, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !341, line: 151, baseType: !342)
!341 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 149, size: 32, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !342, file: !341, line: 150, baseType: !121, size: 32)
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 96, elements: !345)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !351, file: !384, line: 39, type: !154, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !353, globals: !383, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!353 = !{!354, !102, !103, !371, !154}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !356, line: 1226, baseType: !357)
!356 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 1213, size: 352, elements: !358)
!358 = !{!359, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !357, file: !356, line: 1215, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !357, file: !356, line: 1216, baseType: !120, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !357, file: !356, line: 1217, baseType: !120, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !357, file: !356, line: 1218, baseType: !120, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !357, file: !356, line: 1219, baseType: !120, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !357, file: !356, line: 1220, baseType: !120, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !357, file: !356, line: 1221, baseType: !120, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !357, file: !356, line: 1222, baseType: !120, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !357, file: !356, line: 1223, baseType: !120, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !357, file: !356, line: 1224, baseType: !120, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !357, file: !356, line: 1225, baseType: !120, size: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !373, file: !374, line: 29, baseType: !121, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !373, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !373, file: !374, line: 37, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !380, file: !341, line: 143, baseType: !121, size: 32)
!383 = !{!349}
!384 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !387, file: !394, line: 21, type: !106, isLocal: true, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !389, globals: !393, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!389 = !{!390, !103, !102}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !392, line: 22, baseType: !103)
!392 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!385}
!394 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !397, file: !402, line: 13, type: !419, isLocal: true, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !399, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!399 = !{!400, !395}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "mpu_config", scope: !397, file: !402, line: 37, type: !403, isLocal: false, isDefinition: true)
!402 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !374, line: 41, size: 64, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !404, file: !374, line: 43, baseType: !121, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !404, file: !374, line: 45, baseType: !408, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !410, file: !374, line: 29, baseType: !121, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !410, file: !374, line: 37, baseType: !415, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !416, file: !341, line: 143, baseType: !121, size: 32)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 192, elements: !242)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !422, file: !505, line: 72, type: !589, isLocal: true, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !424, retainedTypes: !491, globals: !502, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!424 = !{!30, !425}
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490}
!427 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!428 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!429 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!430 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!431 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!432 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!433 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!434 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!435 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!436 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!437 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!438 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!439 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!440 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!441 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!442 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!443 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!444 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!445 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!446 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!447 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!448 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!449 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!450 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!451 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!452 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!453 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!454 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!455 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!456 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!457 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!458 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!459 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!460 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!461 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!462 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!463 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!464 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!465 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!466 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!467 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!468 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!469 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!470 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!471 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!472 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!473 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!474 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!475 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!476 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!477 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!478 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!479 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!480 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!481 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!482 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!483 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!484 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!485 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!486 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!487 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!488 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!489 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!490 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!491 = !{!200, !103, !102, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 243, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 235, size: 192, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !501}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !494, file: !116, line: 237, baseType: !120, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !494, file: !116, line: 238, baseType: !120, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !494, file: !116, line: 239, baseType: !120, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !494, file: !116, line: 240, baseType: !120, size: 32, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !494, file: !116, line: 241, baseType: !120, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !494, file: !116, line: 242, baseType: !120, size: 32, offset: 160)
!502 = !{!503, !509, !525, !536, !553, !420, !555, !569, !571, !573, !575, !577, !579, !581, !583, !585, !587}
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !422, file: !505, line: 424, type: !506, isLocal: false, isDefinition: true, align: 16)
!505 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 4)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !422, file: !505, line: 424, type: !511, isLocal: false, isDefinition: true, align: 32)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !513)
!513 = !{!514, !515, !516, !517, !523, !524}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !512, file: !141, line: 380, baseType: !144, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !512, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !512, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !512, file: !141, line: 386, baseType: !518, size: 32, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !519, file: !141, line: 359, baseType: !154, size: 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !519, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !512, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !512, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !422, file: !505, line: 424, type: !527, isLocal: true, isDefinition: true, align: 32)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !529)
!529 = !{!530, !535}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !528, file: !132, line: 60, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = !DISubroutineType(types: !533)
!533 = !{!103, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !528, file: !132, line: 65, baseType: !534, size: 32, offset: 32)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "exti_data", scope: !422, file: !505, line: 423, type: !538, isLocal: true, isDefinition: true)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !505, line: 107, size: 1472, elements: !539)
!539 = !{!540}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !538, file: !505, line: 109, baseType: !541, size: 1472)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 1472, elements: !551)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !505, line: 101, size: 64, elements: !543)
!543 = !{!544, !550}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !542, file: !505, line: 102, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !546, line: 63, baseType: !547)
!546 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !103, !102}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !542, file: !505, line: 103, baseType: !102, size: 32, offset: 32)
!551 = !{!552}
!552 = !DISubrange(count: 23)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_39", scope: !422, file: !505, line: 424, type: !519, isLocal: true, isDefinition: true, align: 8)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !557, file: !505, line: 493, type: !562, isLocal: true, isDefinition: true, align: 32)
!557 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !505, file: !505, line: 460, type: !558, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !422, retainedNodes: !560)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !534}
!560 = !{!561}
!561 = !DILocalVariable(name: "dev", arg: 1, scope: !557, file: !505, line: 460, type: !534)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !563)
!563 = !{!564, !566, !567, !568}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !562, file: !10, line: 55, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !562, file: !10, line: 57, baseType: !565, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !562, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !562, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !557, file: !505, line: 497, type: !562, isLocal: true, isDefinition: true, align: 32)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !557, file: !505, line: 507, type: !562, isLocal: true, isDefinition: true, align: 32)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !557, file: !505, line: 512, type: !562, isLocal: true, isDefinition: true, align: 32)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !557, file: !505, line: 516, type: !562, isLocal: true, isDefinition: true, align: 32)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !557, file: !505, line: 523, type: !562, isLocal: true, isDefinition: true, align: 32)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !557, file: !505, line: 527, type: !562, isLocal: true, isDefinition: true, align: 32)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !557, file: !505, line: 581, type: !562, isLocal: true, isDefinition: true, align: 32)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !557, file: !505, line: 586, type: !562, isLocal: true, isDefinition: true, align: 32)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !557, file: !505, line: 591, type: !562, isLocal: true, isDefinition: true, align: 32)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !557, file: !505, line: 595, type: !562, isLocal: true, isDefinition: true, align: 32)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 736, elements: !551)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 133, baseType: !425)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !594, file: !599, line: 24, type: !625, isLocal: false, isDefinition: true, align: 16)
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !596, splitDebugInlining: false, nameTableKind: None)
!595 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!596 = !{!597, !592, !603, !605, !607, !609, !611, !613, !615, !617, !619, !621, !623}
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !594, file: !599, line: 19, type: !600, isLocal: false, isDefinition: true, align: 16)
!599 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 224, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 14)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !594, file: !599, line: 31, type: !506, isLocal: false, isDefinition: true, align: 16)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !594, file: !599, line: 38, type: !506, isLocal: false, isDefinition: true, align: 16)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !594, file: !599, line: 45, type: !506, isLocal: false, isDefinition: true, align: 16)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !594, file: !599, line: 52, type: !506, isLocal: false, isDefinition: true, align: 16)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !594, file: !599, line: 59, type: !506, isLocal: false, isDefinition: true, align: 16)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !594, file: !599, line: 66, type: !506, isLocal: false, isDefinition: true, align: 16)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_20", scope: !594, file: !599, line: 73, type: !506, isLocal: false, isDefinition: true, align: 16)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !594, file: !599, line: 80, type: !506, isLocal: false, isDefinition: true, align: 16)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_50", scope: !594, file: !599, line: 87, type: !506, isLocal: false, isDefinition: true, align: 16)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_44", scope: !594, file: !599, line: 94, type: !506, isLocal: false, isDefinition: true, align: 16)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_47", scope: !594, file: !599, line: 101, type: !506, isLocal: false, isDefinition: true, align: 16)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 3)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !630, file: !694, line: 398, type: !727, isLocal: true, isDefinition: true)
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !632, retainedTypes: !645, globals: !691, splitDebugInlining: false, nameTableKind: None)
!631 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!632 = !{!633, !30, !638}
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !634, line: 197, baseType: !32, size: 32, elements: !635)
!634 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!635 = !{!636, !637}
!636 = !DIEnumerator(name: "SUCCESS", value: 0)
!637 = !DIEnumerator(name: "ERROR", value: 1)
!638 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !639, line: 44, baseType: !32, size: 32, elements: !640)
!639 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!640 = !{!641, !642, !643, !644}
!641 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!642 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!643 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!644 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!645 = !{!102, !103, !121, !646, !684, !690}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 369, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 335, size: 1152, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !683}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !648, file: !116, line: 337, baseType: !120, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !648, file: !116, line: 338, baseType: !120, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !648, file: !116, line: 339, baseType: !120, size: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !648, file: !116, line: 340, baseType: !120, size: 32, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !648, file: !116, line: 341, baseType: !120, size: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !648, file: !116, line: 342, baseType: !120, size: 32, offset: 160)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !648, file: !116, line: 343, baseType: !120, size: 32, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !648, file: !116, line: 344, baseType: !121, size: 32, offset: 224)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !648, file: !116, line: 345, baseType: !120, size: 32, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !648, file: !116, line: 346, baseType: !120, size: 32, offset: 288)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !648, file: !116, line: 347, baseType: !661, size: 64, offset: 320)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !242)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !648, file: !116, line: 348, baseType: !120, size: 32, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !648, file: !116, line: 349, baseType: !120, size: 32, offset: 416)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !648, file: !116, line: 350, baseType: !120, size: 32, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !648, file: !116, line: 351, baseType: !121, size: 32, offset: 480)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !648, file: !116, line: 352, baseType: !120, size: 32, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !648, file: !116, line: 353, baseType: !120, size: 32, offset: 544)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !648, file: !116, line: 354, baseType: !661, size: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !648, file: !116, line: 355, baseType: !120, size: 32, offset: 640)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !648, file: !116, line: 356, baseType: !120, size: 32, offset: 672)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !648, file: !116, line: 357, baseType: !120, size: 32, offset: 704)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !648, file: !116, line: 358, baseType: !121, size: 32, offset: 736)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !648, file: !116, line: 359, baseType: !120, size: 32, offset: 768)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !648, file: !116, line: 360, baseType: !120, size: 32, offset: 800)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !648, file: !116, line: 361, baseType: !661, size: 64, offset: 832)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !648, file: !116, line: 362, baseType: !120, size: 32, offset: 896)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !648, file: !116, line: 363, baseType: !120, size: 32, offset: 928)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !648, file: !116, line: 364, baseType: !661, size: 64, offset: 960)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !648, file: !116, line: 365, baseType: !120, size: 32, offset: 1024)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !648, file: !116, line: 366, baseType: !120, size: 32, offset: 1056)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !648, file: !116, line: 367, baseType: !682, size: 32, offset: 1088)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 32, elements: !345)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !648, file: !116, line: 368, baseType: !120, size: 32, offset: 1120)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !686, line: 343, size: 64, elements: !687)
!686 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !685, file: !686, line: 344, baseType: !121, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !685, file: !686, line: 345, baseType: !121, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!691 = !{!692, !698, !714, !725, !628}
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !630, file: !694, line: 752, type: !695, isLocal: false, isDefinition: true, align: 16)
!694 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 640, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 40)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !630, file: !694, line: 752, type: !700, isLocal: false, isDefinition: true, align: 32)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !702)
!702 = !{!703, !704, !705, !706, !712, !713}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !701, file: !141, line: 380, baseType: !144, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !701, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !701, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !701, file: !141, line: 386, baseType: !707, size: 32, offset: 96)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !708, file: !141, line: 359, baseType: !154, size: 8)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !708, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !701, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !701, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !630, file: !694, line: 752, type: !716, isLocal: true, isDefinition: true, align: 32)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !718)
!718 = !{!719, !724}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !717, file: !132, line: 60, baseType: !720, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!721 = !DISubroutineType(types: !722)
!722 = !{!103, !723}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !717, file: !132, line: 65, baseType: !723, size: 32, offset: 32)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !630, file: !694, line: 752, type: !708, isLocal: true, isDefinition: true, align: 8)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !639, line: 100, size: 224, elements: !728)
!728 = !{!729, !735, !736, !745, !750, !755, !761}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !727, file: !639, line: 101, baseType: !730, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !639, line: 76, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 32)
!732 = !DISubroutineType(types: !733)
!733 = !{!103, !723, !734}
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !639, line: 56, baseType: !102)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !727, file: !639, line: 102, baseType: !730, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !727, file: !639, line: 103, baseType: !737, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !639, line: 83, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DISubroutineType(types: !740)
!740 = !{!103, !723, !734, !741, !102}
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !639, line: 72, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !723, !734, !102}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !727, file: !639, line: 104, baseType: !746, size: 32, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !639, line: 79, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DISubroutineType(types: !749)
!749 = !{!103, !723, !734, !690}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !727, file: !639, line: 105, baseType: !751, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !639, line: 88, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DISubroutineType(types: !754)
!754 = !{!638, !723, !734}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !727, file: !639, line: 106, baseType: !756, size: 32, offset: 160)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !639, line: 92, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DISubroutineType(types: !759)
!759 = !{!103, !723, !734, !760}
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !639, line: 64, baseType: !102)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !727, file: !639, line: 107, baseType: !762, size: 32, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !639, line: 96, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DISubroutineType(types: !765)
!765 = !{!103, !723, !734, !102}
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !768, file: !825, line: 603, type: !827, isLocal: true, isDefinition: true, align: 32)
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !770, globals: !822, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!770 = !{!102, !103, !771}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !774, line: 336, size: 160, elements: !775)
!774 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!775 = !{!776, !796, !800, !804, !817}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !773, file: !774, line: 365, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DISubroutineType(types: !779)
!779 = !{!103, !780, !795}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !783)
!783 = !{!784, !785, !786, !787, !793, !794}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !782, file: !141, line: 380, baseType: !144, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !782, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !782, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !782, file: !141, line: 386, baseType: !788, size: 32, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !789, file: !141, line: 359, baseType: !154, size: 8)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !789, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !782, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !782, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !773, file: !774, line: 366, baseType: !797, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !780, !155}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !773, file: !774, line: 374, baseType: !801, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DISubroutineType(types: !803)
!803 = !{!103, !780}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !773, file: !774, line: 377, baseType: !805, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{!103, !780, !808}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !774, line: 122, size: 64, elements: !811)
!811 = !{!812, !813, !814, !815, !816}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !810, file: !774, line: 123, baseType: !121, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !810, file: !774, line: 124, baseType: !154, size: 8, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !810, file: !774, line: 125, baseType: !154, size: 8, offset: 40)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !810, file: !774, line: 126, baseType: !154, size: 8, offset: 48)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !810, file: !774, line: 127, baseType: !154, size: 8, offset: 56)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !773, file: !774, line: 379, baseType: !818, size: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DISubroutineType(types: !820)
!820 = !{!103, !780, !821}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!822 = !{!766, !823}
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !768, file: !825, line: 38, type: !826, isLocal: true, isDefinition: true)
!825 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !828, file: !132, line: 60, baseType: !801, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !828, file: !132, line: 65, baseType: !780, size: 32, offset: 32)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !834, file: !1004, line: 762, type: !1116, isLocal: true, isDefinition: true)
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !836, retainedTypes: !854, globals: !1001, splitDebugInlining: false, nameTableKind: None)
!835 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_carbon/basic/blinky")
!836 = !{!30, !837, !843, !848, !638}
!837 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !838, line: 506, baseType: !32, size: 32, elements: !839)
!838 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!839 = !{!840, !841, !842}
!840 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!841 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!842 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !838, line: 512, baseType: !32, size: 32, elements: !844)
!844 = !{!845, !846, !847}
!845 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!846 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!847 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !546, line: 43, baseType: !32, size: 32, elements: !849)
!849 = !{!850, !851, !852, !853}
!850 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!851 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!852 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!853 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!854 = !{!102, !103, !855, !925, !930, !890, !843, !837, !935, !936, !121, !950, !905, !960, !961, !962}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !838, line: 523, size: 288, elements: !858)
!858 = !{!859, !880, !886, !891, !895, !896, !897, !901, !921}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !857, file: !838, line: 524, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{!103, !863, !878, !879}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !866)
!866 = !{!867, !868, !869, !870, !876, !877}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !865, file: !141, line: 380, baseType: !144, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !865, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !865, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !865, file: !141, line: 386, baseType: !871, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !872, file: !141, line: 359, baseType: !154, size: 8)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !872, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !865, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !865, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !838, line: 237, baseType: !154)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !838, line: 257, baseType: !121)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !857, file: !838, line: 530, baseType: !881, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DISubroutineType(types: !883)
!883 = !{!103, !863, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !838, line: 229, baseType: !121)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !857, file: !838, line: 532, baseType: !887, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DISubroutineType(types: !889)
!889 = !{!103, !863, !890, !885}
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !838, line: 216, baseType: !121)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !857, file: !838, line: 535, baseType: !892, size: 32, offset: 96)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DISubroutineType(types: !894)
!894 = !{!103, !863, !890}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !857, file: !838, line: 537, baseType: !892, size: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !857, file: !838, line: 539, baseType: !892, size: 32, offset: 160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !857, file: !838, line: 541, baseType: !898, size: 32, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DISubroutineType(types: !900)
!900 = !{!103, !863, !878, !837, !843}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !857, file: !838, line: 544, baseType: !902, size: 32, offset: 224)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DISubroutineType(types: !904)
!904 = !{!103, !863, !905, !157}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !838, line: 478, size: 96, elements: !907)
!907 = !{!908, !915, !920}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !906, file: !838, line: 482, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !910, line: 33, baseType: !911)
!910 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !910, line: 29, size: 32, elements: !912)
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !911, file: !910, line: 30, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !906, file: !838, line: 485, baseType: !916, size: 32, offset: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !838, line: 464, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !863, !905, !890}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !906, file: !838, line: 493, baseType: !890, size: 32, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !857, file: !838, line: 547, baseType: !922, size: 32, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DISubroutineType(types: !924)
!924 = !{!121, !863}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !838, line: 428, size: 32, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !927, file: !838, line: 434, baseType: !890, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !838, line: 441, size: 32, elements: !933)
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !932, file: !838, line: 447, baseType: !890, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 275, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 264, size: 320, elements: !939)
!939 = !{!940, !941, !942, !943, !944, !945, !946, !947, !948}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !938, file: !116, line: 266, baseType: !120, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !938, file: !116, line: 267, baseType: !120, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !938, file: !116, line: 268, baseType: !120, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !938, file: !116, line: 269, baseType: !120, size: 32, offset: 96)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !938, file: !116, line: 270, baseType: !120, size: 32, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !938, file: !116, line: 271, baseType: !120, size: 32, offset: 160)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !938, file: !116, line: 272, baseType: !120, size: 32, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !938, file: !116, line: 273, baseType: !120, size: 32, offset: 224)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !938, file: !116, line: 274, baseType: !949, size: 64, offset: 256)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !242)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 288, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 281, size: 288, elements: !953)
!953 = !{!954, !955, !956, !958, !959}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !952, file: !116, line: 283, baseType: !120, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !952, file: !116, line: 284, baseType: !120, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !952, file: !116, line: 285, baseType: !957, size: 128, offset: 64)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !507)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !952, file: !116, line: 286, baseType: !661, size: 64, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !952, file: !116, line: 287, baseType: !120, size: 32, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !639, line: 100, size: 224, elements: !965)
!965 = !{!966, !971, !972, !981, !986, !991, !996}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !964, file: !639, line: 101, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !639, line: 76, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = !DISubroutineType(types: !970)
!970 = !{!103, !863, !734}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !964, file: !639, line: 102, baseType: !967, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !964, file: !639, line: 103, baseType: !973, size: 32, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !639, line: 83, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!975 = !DISubroutineType(types: !976)
!976 = !{!103, !863, !734, !977, !102}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !639, line: 72, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !863, !734, !102}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !964, file: !639, line: 104, baseType: !982, size: 32, offset: 96)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !639, line: 79, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = !DISubroutineType(types: !985)
!985 = !{!103, !863, !734, !690}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !964, file: !639, line: 105, baseType: !987, size: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !639, line: 88, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!989 = !DISubroutineType(types: !990)
!990 = !{!638, !863, !734}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !964, file: !639, line: 106, baseType: !992, size: 32, offset: 160)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !639, line: 92, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DISubroutineType(types: !995)
!995 = !{!103, !863, !734, !760}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !964, file: !639, line: 107, baseType: !997, size: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !639, line: 96, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!103, !863, !734, !102}
!1001 = !{!1002, !1008, !1010, !1020, !1022, !1024, !1026, !1031, !1033, !1035, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1064, !1066, !1068, !1082, !1084, !1086, !1088, !1090, !1092, !1094, !1096, !1098, !1100, !1102, !1104, !1106, !1108, !1110, !832, !1112, !1114, !1127, !1129, !1131, !1133, !1135, !1137}
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !834, file: !1004, line: 762, type: !1005, isLocal: false, isDefinition: true, align: 16)
!1004 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 112, elements: !1006)
!1006 = !{!1007}
!1007 = !DISubrange(count: 7)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !834, file: !1004, line: 762, type: !864, isLocal: false, isDefinition: true, align: 32)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !834, file: !1004, line: 762, type: !1012, isLocal: true, isDefinition: true, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !1014)
!1014 = !{!1015, !1019}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1013, file: !132, line: 60, baseType: !1016, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!103, !863}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1013, file: !132, line: 65, baseType: !863, size: 32, offset: 32)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_20", scope: !834, file: !1004, line: 766, type: !1005, isLocal: false, isDefinition: true, align: 16)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(name: "__device_dts_ord_20", scope: !834, file: !1004, line: 766, type: !864, isLocal: false, isDefinition: true, align: 32)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_20", scope: !834, file: !1004, line: 766, type: !1012, isLocal: true, isDefinition: true, align: 32)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !834, file: !1004, line: 770, type: !1028, isLocal: false, isDefinition: true, align: 16)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 80, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 5)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "__device_dts_ord_72", scope: !834, file: !1004, line: 770, type: !864, isLocal: false, isDefinition: true, align: 32)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_72", scope: !834, file: !1004, line: 770, type: !1012, isLocal: true, isDefinition: true, align: 32)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !834, file: !1004, line: 774, type: !1037, isLocal: false, isDefinition: true, align: 16)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 96, elements: !1038)
!1038 = !{!1039}
!1039 = !DISubrange(count: 6)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !834, file: !1004, line: 774, type: !864, isLocal: false, isDefinition: true, align: 32)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !834, file: !1004, line: 774, type: !1012, isLocal: true, isDefinition: true, align: 32)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !834, file: !1004, line: 778, type: !1028, isLocal: false, isDefinition: true, align: 16)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
