; ModuleID = 'build/actinius_icarus/sys_heap/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, i32, i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "heap", scope: !27, file: !107, line: 13, type: !112, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "heap_mem", scope: !27, file: !107, line: 12, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !110)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !{!115, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !112, file: !113, line: 57, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !113, line: 57, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !112, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !112, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 214, baseType: !32)
!121 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !127, line: 54, type: !128, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!126 = !{!122}
!127 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!103, !103}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "state", scope: !133, file: !134, line: 227, type: !163, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "rand32", scope: !134, file: !134, line: 225, type: !135, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !138, retainedNodes: !162)
!134 = !DIFile(filename: "zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !148, globals: !161, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!140 = !{!30, !141}
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !142, line: 54, baseType: !32, size: 32, elements: !143)
!142 = !DIFile(filename: "zephyr/lib/os/heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!145 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!146 = !DIEnumerator(name: "FREE_PREV", value: 2)
!147 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!148 = !{!102, !103, !149, !150, !137, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !142, line: 58, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 58, size: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !155, file: !142, line: 58, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !{!131}
!162 = !{}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !164)
!164 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !167, file: !222, line: 65, type: !223, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !169, globals: !217, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!169 = !{!102, !103, !170, !137, !181}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !172, file: !171, line: 167, baseType: !180)
!171 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !171, file: !171, line: 134, type: !173, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !175)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !137}
!175 = !{!176, !177, !179}
!176 = !DILocalVariable(name: "time_us", arg: 1, scope: !172, file: !171, line: 134, type: !137)
!177 = !DILocalVariable(name: "delay_cycles", scope: !172, file: !171, line: 168, type: !178)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!179 = !DILocalVariable(name: "cycles", scope: !172, file: !171, line: 171, type: !137)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !183, line: 1928, baseType: !184)
!183 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 1909, size: 11360, elements: !185)
!185 = !{!186, !190, !191, !192, !193, !197, !198, !199, !200, !204, !205, !207, !208, !209, !210, !211, !215, !216}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !184, file: !183, line: 1910, baseType: !187, size: 8192)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 8192, elements: !110)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !184, file: !183, line: 1911, baseType: !188, size: 32, offset: 8192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !184, file: !183, line: 1912, baseType: !188, size: 32, offset: 8224)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !184, file: !183, line: 1913, baseType: !188, size: 32, offset: 8256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !184, file: !183, line: 1914, baseType: !194, size: 1984, offset: 8288)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 1984, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 62)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !184, file: !183, line: 1915, baseType: !189, size: 32, offset: 10272)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !184, file: !183, line: 1916, baseType: !188, size: 32, offset: 10304)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !184, file: !183, line: 1917, baseType: !189, size: 32, offset: 10336)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !184, file: !183, line: 1918, baseType: !201, size: 96, offset: 10368)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 96, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 3)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !184, file: !183, line: 1919, baseType: !189, size: 32, offset: 10464)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !184, file: !183, line: 1920, baseType: !206, size: 256, offset: 10496)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 256, elements: !159)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !184, file: !183, line: 1921, baseType: !189, size: 32, offset: 10752)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !184, file: !183, line: 1922, baseType: !188, size: 32, offset: 10784)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !184, file: !183, line: 1923, baseType: !189, size: 32, offset: 10816)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !184, file: !183, line: 1924, baseType: !189, size: 32, offset: 10848)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !184, file: !183, line: 1925, baseType: !212, size: 416, offset: 10880)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 416, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 13)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !184, file: !183, line: 1926, baseType: !189, size: 32, offset: 11296)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !184, file: !183, line: 1927, baseType: !189, size: 32, offset: 11328)
!217 = !{!165, !218}
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !172, file: !171, line: 161, type: !220, isLocal: true, isDefinition: true, align: 128)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 48, elements: !202)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!222 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !225, line: 51, size: 64, elements: !226)
!225 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !{!227, !234}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !224, file: !225, line: 60, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DISubroutineType(types: !230)
!230 = !{!103, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !225, line: 48, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !224, file: !225, line: 65, baseType: !231, size: 32, offset: 32)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !237, file: !276, line: 27, type: !304, isLocal: true, isDefinition: true)
!237 = distinct !DICompileUnit(language: DW_LANG_C99, file: !238, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !239, retainedTypes: !251, globals: !273, splitDebugInlining: false, nameTableKind: None)
!238 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!239 = !{!240, !30}
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !241, line: 27, baseType: !32, size: 32, elements: !242)
!241 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250}
!243 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!244 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!245 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!246 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!247 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!248 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!249 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!250 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!251 = !{!102, !252, !103, !24, !256, !272, !137, !163}
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !253, line: 46, baseType: !254)
!253 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !255)
!255 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !258, line: 54, size: 96, elements: !259)
!258 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !{!260, !267, !271}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !257, file: !258, line: 55, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !263)
!262 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !262, line: 30, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !257, file: !258, line: 60, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !240}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !257, file: !258, line: 65, baseType: !268, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!273 = !{!235, !274, !279, !281, !294, !296}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !237, file: !276, line: 44, type: !277, isLocal: true, isDefinition: true)
!276 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !162)
!278 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !237, file: !276, line: 49, type: !277, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !237, file: !276, line: 36, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 128, elements: !292)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !241, line: 114, size: 128, elements: !285)
!285 = !{!286, !287, !290, !291}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !284, file: !241, line: 115, baseType: !240, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !284, file: !241, line: 141, baseType: !288, size: 8, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !289)
!289 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !284, file: !241, line: 149, baseType: !137, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !284, file: !241, line: 156, baseType: !137, size: 32, offset: 96)
!292 = !{!293}
!293 = !DISubrange(count: 1)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !237, file: !276, line: 40, type: !283, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !237, file: !276, line: 28, type: !298, isLocal: true, isDefinition: true)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !262, line: 40, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !262, line: 35, size: 64, elements: !300)
!300 = !{!301, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !299, file: !262, line: 36, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !299, file: !262, line: 37, baseType: !302, size: 32, offset: 32)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 32, elements: !292)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !306, line: 22, baseType: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!308 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!309 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !312, file: !341, line: 50, type: !328, isLocal: true, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !239, retainedTypes: !314, globals: !338, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!314 = !{!315, !252, !120, !103, !102, !137, !163, !317, !272, !328, !329}
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !316)
!316 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !319, line: 45, size: 64, elements: !320)
!319 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = !{!321, !327}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !318, file: !319, line: 46, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !324)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !262, line: 30, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !318, file: !319, line: 48, baseType: !137, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !319, line: 38, size: 64, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !330, file: !319, line: 39, baseType: !322, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !330, file: !319, line: 41, baseType: !334, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !319, line: 35, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !328}
!338 = !{!339, !343, !351, !310, !353, !363}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "latency_lock", scope: !312, file: !341, line: 44, type: !342, isLocal: true, isDefinition: true)
!341 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !162)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !312, file: !341, line: 46, type: !345, isLocal: true, isDefinition: true)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !262, line: 40, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !262, line: 35, size: 64, elements: !347)
!347 = !{!348, !350}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !346, file: !262, line: 36, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !346, file: !262, line: 37, baseType: !349, size: 32, offset: 32)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "latency_subs", scope: !312, file: !341, line: 52, type: !345, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !312, file: !341, line: 39, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, elements: !361)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 35, size: 96, elements: !357)
!357 = !{!358, !359, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !356, file: !341, line: 36, baseType: !240, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !356, file: !341, line: 37, baseType: !288, size: 8, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !356, file: !341, line: 38, baseType: !305, size: 32, offset: 64)
!361 = !{!362}
!362 = !DISubrange(count: 0)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !312, file: !341, line: 48, type: !328, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !367, file: !374, line: 47, type: !388, isLocal: true, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !370, globals: !371, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!369 = !{!240}
!370 = !{!120, !103}
!371 = !{!372, !365, !384}
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "cpus_states", scope: !367, file: !374, line: 50, type: !375, isLocal: true, isDefinition: true)
!374 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 32, elements: !292)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !241, line: 114, size: 128, elements: !379)
!379 = !{!380, !381, !382, !383}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !378, file: !241, line: 115, baseType: !240, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !378, file: !241, line: 141, baseType: !288, size: 8, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !378, file: !241, line: 149, baseType: !137, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !378, file: !241, line: 156, baseType: !137, size: 32, offset: 96)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !367, file: !374, line: 55, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 8, elements: !292)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, elements: !361)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "static_regions", scope: !391, file: !398, line: 62, type: !527, isLocal: true, isDefinition: true)
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !393, globals: !394, splitDebugInlining: false, nameTableKind: None)
!392 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!393 = !{!120, !103, !137, !102}
!394 = !{!395, !389}
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !397, file: !398, line: 198, type: !514, isLocal: true, isDefinition: true)
!397 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !398, file: !398, line: 175, type: !399, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !391, retainedNodes: !511)
!398 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!399 = !DISubroutineType(types: !400)
!400 = !{null, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !403, line: 245, size: 1024, elements: !404)
!403 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !{!405, !470, !483, !484, !485, !486, !492, !506}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !402, file: !403, line: 247, baseType: !406, size: 384)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !403, line: 57, size: 384, elements: !407)
!407 = !{!408, !436, !444, !445, !446, !457, !458, !459}
!408 = !DIDerivedType(tag: DW_TAG_member, scope: !406, file: !403, line: 60, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !406, file: !403, line: 60, size: 64, elements: !410)
!410 = !{!411, !427}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !409, file: !403, line: 61, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !413, line: 49, baseType: !414)
!413 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !413, line: 37, size: 64, elements: !415)
!415 = !{!416, !422}
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !413, line: 38, baseType: !417, size: 32)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !413, line: 38, size: 32, elements: !418)
!418 = !{!419, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !417, file: !413, line: 39, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !413, line: 40, baseType: !420, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !413, line: 42, baseType: !423, size: 32, offset: 32)
!423 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !413, line: 42, size: 32, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !423, file: !413, line: 43, baseType: !420, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !423, file: !413, line: 44, baseType: !420, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !409, file: !403, line: 62, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !429, line: 49, size: 64, elements: !430)
!429 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !428, file: !429, line: 50, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 64, elements: !434)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!434 = !{!435}
!435 = !DISubrange(count: 2)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !406, file: !403, line: 68, baseType: !437, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !439, line: 233, baseType: !440)
!439 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 231, size: 64, elements: !441)
!441 = !{!442}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !440, file: !439, line: 232, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !413, line: 48, baseType: !414)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !406, file: !403, line: 71, baseType: !288, size: 8, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !406, file: !403, line: 74, baseType: !288, size: 8, offset: 104)
!446 = !DIDerivedType(tag: DW_TAG_member, scope: !406, file: !403, line: 90, baseType: !447, size: 16, offset: 112)
!447 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !406, file: !403, line: 90, size: 16, elements: !448)
!448 = !{!449, !456}
!449 = !DIDerivedType(tag: DW_TAG_member, scope: !447, file: !403, line: 91, baseType: !450, size: 16)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !447, file: !403, line: 91, size: 16, elements: !451)
!451 = !{!452, !455}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !450, file: !403, line: 96, baseType: !453, size: 8)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !454)
!454 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !450, file: !403, line: 97, baseType: !288, size: 8, offset: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !447, file: !403, line: 100, baseType: !151, size: 16)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !406, file: !403, line: 107, baseType: !137, size: 32, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !406, file: !403, line: 127, baseType: !102, size: 32, offset: 160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !406, file: !403, line: 131, baseType: !460, size: 192, offset: 192)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !439, line: 244, size: 192, elements: !461)
!461 = !{!462, !463, !469}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !460, file: !439, line: 245, baseType: !412, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !460, file: !439, line: 246, baseType: !464, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !439, line: 242, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !460, file: !439, line: 249, baseType: !254, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !402, file: !403, line: 250, baseType: !471, size: 288, offset: 384)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !472, line: 25, size: 288, elements: !473)
!472 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !471, file: !472, line: 26, baseType: !137, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !471, file: !472, line: 27, baseType: !137, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !471, file: !472, line: 28, baseType: !137, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !471, file: !472, line: 29, baseType: !137, size: 32, offset: 96)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !471, file: !472, line: 30, baseType: !137, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !471, file: !472, line: 31, baseType: !137, size: 32, offset: 160)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !471, file: !472, line: 32, baseType: !137, size: 32, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !471, file: !472, line: 33, baseType: !137, size: 32, offset: 224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !471, file: !472, line: 34, baseType: !137, size: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !402, file: !403, line: 253, baseType: !102, size: 32, offset: 672)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !402, file: !403, line: 256, baseType: !438, size: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !402, file: !403, line: 294, baseType: !103, size: 32, offset: 768)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !402, file: !403, line: 300, baseType: !487, size: 96, offset: 800)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !403, line: 149, size: 96, elements: !488)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !487, file: !403, line: 153, baseType: !22, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !487, file: !403, line: 162, baseType: !120, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !487, file: !403, line: 168, baseType: !120, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !402, file: !403, line: 325, baseType: !493, size: 32, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !495, line: 5073, size: 160, elements: !496)
!495 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = !{!497, !503, !504}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !494, file: !495, line: 5074, baseType: !498, size: 96)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !498, file: !113, line: 57, baseType: !116, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !498, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !498, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !494, file: !495, line: 5075, baseType: !438, size: 64, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !494, file: !495, line: 5076, baseType: !505, offset: 160)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !162)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !402, file: !403, line: 343, baseType: !507, size: 64, offset: 928)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !472, line: 60, size: 64, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !507, file: !472, line: 63, baseType: !137, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !507, file: !472, line: 66, baseType: !137, size: 32, offset: 32)
!511 = !{!512, !513}
!512 = !DILocalVariable(name: "thread", arg: 1, scope: !397, file: !398, line: 175, type: !401)
!513 = !DILocalVariable(name: "region_num", scope: !397, file: !398, line: 200, type: !288)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, elements: !361)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !516, line: 52, size: 96, elements: !517)
!516 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !515, file: !516, line: 53, baseType: !22, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !515, file: !516, line: 54, baseType: !120, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !515, file: !516, line: 55, baseType: !521, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !522, line: 304, baseType: !523)
!522 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 301, size: 32, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !523, file: !522, line: 302, baseType: !151, size: 16)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !523, file: !522, line: 303, baseType: !151, size: 16, offset: 16)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 96, elements: !292)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !531, file: !587, line: 39, type: !288, isLocal: true, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !533, globals: !578, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!533 = !{!534, !102, !103, !562}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !536, line: 1495, baseType: !537)
!536 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 1474, size: 448, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !552}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !537, file: !536, line: 1476, baseType: !188, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !537, file: !536, line: 1477, baseType: !189, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !537, file: !536, line: 1478, baseType: !189, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !537, file: !536, line: 1479, baseType: !189, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !537, file: !536, line: 1480, baseType: !189, size: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !537, file: !536, line: 1481, baseType: !189, size: 32, offset: 160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !537, file: !536, line: 1482, baseType: !189, size: 32, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !537, file: !536, line: 1483, baseType: !189, size: 32, offset: 224)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !537, file: !536, line: 1484, baseType: !189, size: 32, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !537, file: !536, line: 1485, baseType: !189, size: 32, offset: 288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !537, file: !536, line: 1486, baseType: !189, size: 32, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !537, file: !536, line: 1487, baseType: !551, size: 32, offset: 352)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 32, elements: !292)
!552 = !DIDerivedType(tag: DW_TAG_member, scope: !537, file: !536, line: 1488, baseType: !553, size: 64, offset: 384)
!553 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !537, file: !536, line: 1488, size: 64, elements: !554)
!554 = !{!555, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !553, file: !536, line: 1489, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 64, elements: !434)
!557 = !DIDerivedType(tag: DW_TAG_member, scope: !553, file: !536, line: 1490, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !553, file: !536, line: 1490, size: 64, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !558, file: !536, line: 1491, baseType: !189, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !558, file: !536, line: 1492, baseType: !189, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !565, line: 27, size: 128, elements: !566)
!565 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!566 = !{!567, !568, !571}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !564, file: !565, line: 29, baseType: !137, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !564, file: !565, line: 31, baseType: !569, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !564, file: !565, line: 37, baseType: !572, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !522, line: 298, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !522, line: 289, size: 64, elements: !574)
!574 = !{!575, !576, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !573, file: !522, line: 291, baseType: !288, size: 5, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !573, file: !522, line: 293, baseType: !288, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !573, file: !522, line: 295, baseType: !137, size: 32, offset: 32)
!578 = !{!529, !579}
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !531, file: !581, line: 31, type: !582, isLocal: true, isDefinition: true)
!581 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 160, elements: !292)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !581, line: 21, size: 160, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !583, file: !581, line: 22, baseType: !103, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !583, file: !581, line: 23, baseType: !564, size: 128, offset: 32)
!587 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !590, file: !597, line: 21, type: !128, isLocal: true, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !592, globals: !596, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!592 = !{!593, !103, !102}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !595, line: 22, baseType: !103)
!595 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!596 = !{!588}
!597 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !600, file: !605, line: 13, type: !624, isLocal: true, isDefinition: true)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !602, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!602 = !{!603, !598}
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "mpu_config", scope: !600, file: !605, line: 37, type: !606, isLocal: false, isDefinition: true)
!605 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !565, line: 41, size: 64, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !607, file: !565, line: 43, baseType: !137, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !607, file: !565, line: 45, baseType: !611, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !565, line: 27, size: 128, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !613, file: !565, line: 29, baseType: !137, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !613, file: !565, line: 31, baseType: !569, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !613, file: !565, line: 37, baseType: !618, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !522, line: 298, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !522, line: 289, size: 64, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !619, file: !522, line: 291, baseType: !288, size: 5, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !619, file: !522, line: 293, baseType: !288, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !619, file: !522, line: 295, baseType: !137, size: 32, offset: 32)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 256, elements: !434)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "__device_dts_ord_65", scope: !627, file: !832, line: 733, type: !938, isLocal: false, isDefinition: true, align: 32)
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !629, retainedTypes: !747, globals: !828, splitDebugInlining: false, nameTableKind: None)
!628 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/sys_heap")
!629 = !{!630, !636, !30, !641, !646, !650, !654, !658, !664, !668, !712, !719, !738}
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !631, line: 23, baseType: !32, size: 32, elements: !632)
!631 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!632 = !{!633, !634, !635}
!633 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!634 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!635 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !631, line: 48, baseType: !32, size: 32, elements: !637)
!637 = !{!638, !639, !640}
!638 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!639 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!640 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !642, line: 167, baseType: !32, size: 32, elements: !643)
!642 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!643 = !{!644, !645}
!644 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!645 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!646 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !642, line: 107, baseType: !32, size: 32, elements: !647)
!647 = !{!648, !649}
!648 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!649 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!650 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !642, line: 208, baseType: !32, size: 32, elements: !651)
!651 = !{!652, !653}
!652 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!653 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !642, line: 261, baseType: !32, size: 32, elements: !655)
!655 = !{!656, !657}
!656 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!657 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!658 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !642, line: 237, baseType: !32, size: 32, elements: !659)
!659 = !{!660, !661, !662, !663}
!660 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!661 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!662 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!663 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!664 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !642, line: 152, baseType: !32, size: 32, elements: !665)
!665 = !{!666, !667}
!666 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!667 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!668 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 71, baseType: !103, size: 32, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!670 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!671 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!672 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!673 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!674 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!675 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!676 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!677 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!678 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!679 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!680 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!681 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!682 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!683 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!684 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!685 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!686 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!687 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!688 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!689 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!690 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!691 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!692 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!693 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!694 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!695 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!696 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!697 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!698 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!699 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!700 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!701 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!702 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!703 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!704 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!705 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!706 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!707 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!708 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!709 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!710 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!711 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !713, line: 44, baseType: !32, size: 32, elements: !714)
!713 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!714 = !{!715, !716, !717, !718}
!715 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!716 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!717 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!718 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 54, baseType: !32, size: 32, elements: !721)
!720 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!722 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!723 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!724 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!725 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!726 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!727 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!728 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!729 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!730 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!731 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!732 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!733 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!734 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!735 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!736 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!737 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !739, line: 53, baseType: !32, size: 32, elements: !740)
!739 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!740 = !{!741, !742, !743, !744, !745, !746}
!741 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!742 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!743 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!744 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!745 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!746 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!747 = !{!630, !102, !103, !748, !790, !791, !792, !793, !252, !137, !163, !794, !795, !796, !328, !797, !827, !120}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !183, line: 923, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 883, size: 10464, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !760, !761, !762, !763, !764, !765, !766, !767, !771, !772, !773, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !750, file: !183, line: 884, baseType: !189, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !750, file: !183, line: 885, baseType: !189, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !750, file: !183, line: 886, baseType: !189, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !750, file: !183, line: 887, baseType: !189, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !750, file: !183, line: 888, baseType: !757, size: 896, offset: 128)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 896, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 28)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !750, file: !183, line: 889, baseType: !189, size: 32, offset: 1024)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !750, file: !183, line: 890, baseType: !189, size: 32, offset: 1056)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !750, file: !183, line: 891, baseType: !189, size: 32, offset: 1088)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !750, file: !183, line: 892, baseType: !189, size: 32, offset: 1120)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !750, file: !183, line: 893, baseType: !757, size: 896, offset: 1152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !750, file: !183, line: 894, baseType: !189, size: 32, offset: 2048)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !750, file: !183, line: 895, baseType: !189, size: 32, offset: 2080)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !750, file: !183, line: 896, baseType: !768, size: 960, offset: 2112)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 960, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 30)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !750, file: !183, line: 897, baseType: !189, size: 32, offset: 3072)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !750, file: !183, line: 898, baseType: !189, size: 32, offset: 3104)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !750, file: !183, line: 899, baseType: !774, size: 3008, offset: 3136)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 3008, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 94)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !750, file: !183, line: 900, baseType: !189, size: 32, offset: 6144)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !750, file: !183, line: 901, baseType: !189, size: 32, offset: 6176)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !750, file: !183, line: 902, baseType: !189, size: 32, offset: 6208)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !750, file: !183, line: 903, baseType: !188, size: 32, offset: 6240)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !750, file: !183, line: 904, baseType: !194, size: 1984, offset: 6272)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !750, file: !183, line: 905, baseType: !188, size: 32, offset: 8256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !750, file: !183, line: 907, baseType: !188, size: 32, offset: 8288)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !750, file: !183, line: 910, baseType: !188, size: 32, offset: 8320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !750, file: !183, line: 911, baseType: !188, size: 32, offset: 8352)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !750, file: !183, line: 913, baseType: !188, size: 32, offset: 8384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !750, file: !183, line: 917, baseType: !188, size: 32, offset: 8416)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !750, file: !183, line: 919, baseType: !194, size: 1984, offset: 8448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !750, file: !183, line: 920, baseType: !189, size: 32, offset: 10432)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !642, line: 146, baseType: !646)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !642, line: 164, baseType: !664)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!794 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !536, line: 485, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 468, size: 28704, elements: !800)
!800 = !{!801, !805, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !822, !826}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !799, file: !536, line: 470, baseType: !802, size: 512)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 512, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 16)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !799, file: !536, line: 471, baseType: !806, size: 512, offset: 512)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 512, elements: !803)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !799, file: !536, line: 472, baseType: !802, size: 512, offset: 1024)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !799, file: !536, line: 473, baseType: !806, size: 512, offset: 1536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !799, file: !536, line: 474, baseType: !802, size: 512, offset: 2048)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !799, file: !536, line: 475, baseType: !806, size: 512, offset: 2560)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !799, file: !536, line: 476, baseType: !802, size: 512, offset: 3072)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !799, file: !536, line: 477, baseType: !806, size: 512, offset: 3584)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !799, file: !536, line: 478, baseType: !802, size: 512, offset: 4096)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !799, file: !536, line: 479, baseType: !806, size: 512, offset: 4608)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !799, file: !536, line: 480, baseType: !802, size: 512, offset: 5120)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !799, file: !536, line: 481, baseType: !806, size: 512, offset: 5632)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !799, file: !536, line: 482, baseType: !818, size: 3968, offset: 6144)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 3968, elements: !820)
!819 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !288)
!820 = !{!821}
!821 = !DISubrange(count: 496)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !799, file: !536, line: 483, baseType: !823, size: 18560, offset: 10112)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 18560, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 580)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !799, file: !536, line: 484, baseType: !189, size: 32, offset: 28672)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !713, line: 56, baseType: !102)
!828 = !{!829, !879, !920, !625, !928, !954, !956, !973, !975, !985, !988, !1003, !1040, !1054}
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "on", scope: !831, file: !832, line: 549, type: !305, isLocal: true, isDefinition: true)
!831 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !832, file: !832, line: 547, type: !833, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !627, retainedNodes: !835)
!832 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = !DISubroutineType(types: !834)
!834 = !{null, !636}
!835 = !{!836, !837, !840}
!836 = !DILocalVariable(name: "start_mode", arg: 1, scope: !831, file: !832, line: 547, type: !636)
!837 = !DILocalVariable(name: "err", scope: !838, file: !832, line: 553, type: !103)
!838 = distinct !DILexicalBlock(scope: !839, file: !832, line: 552, column: 31)
!839 = distinct !DILexicalBlock(scope: !831, file: !832, line: 552, column: 6)
!840 = !DILocalVariable(name: "mgr", scope: !838, file: !832, line: 554, type: !841)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !843, line: 154, size: 224, elements: !844)
!843 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!844 = !{!845, !857, !858, !874, !876, !877, !878}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !842, file: !843, line: 158, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !262, line: 40, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !262, line: 35, size: 64, elements: !848)
!848 = !{!849, !856}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !847, file: !262, line: 36, baseType: !850, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !262, line: 33, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !262, line: 29, size: 32, elements: !853)
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !852, file: !262, line: 30, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !847, file: !262, line: 37, baseType: !850, size: 32, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !842, file: !843, line: 163, baseType: !846, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !842, file: !843, line: 166, baseType: !859, size: 32, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !843, line: 133, size: 96, elements: !862)
!862 = !{!863, !872, !873}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !861, file: !843, line: 135, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !843, line: 129, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !841, !868}
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !843, line: 101, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !841, !103}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !861, file: !843, line: 138, baseType: !864, size: 32, offset: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !861, file: !843, line: 143, baseType: !864, size: 32, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !842, file: !843, line: 169, baseType: !875, offset: 160)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !162)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !842, file: !843, line: 172, baseType: !103, size: 32, offset: 160)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !842, file: !843, line: 175, baseType: !151, size: 16, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !842, file: !843, line: 178, baseType: !151, size: 16, offset: 208)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "cli", scope: !831, file: !832, line: 550, type: !881, isLocal: true, isDefinition: true)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !843, line: 273, size: 128, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !881, file: !843, line: 280, baseType: !851, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !881, file: !843, line: 283, baseType: !885, size: 96, offset: 32)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !886, line: 138, size: 96, elements: !887)
!886 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!887 = !{!888, !917, !918}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !885, file: !886, line: 149, baseType: !889, size: 32)
!889 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !886, line: 139, size: 32, elements: !890)
!890 = !{!891, !912}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !889, file: !886, line: 145, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !495, line: 5397, size: 128, elements: !894)
!894 = !{!895, !910, !911}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !893, file: !495, line: 5399, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !413, line: 48, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !413, line: 37, size: 64, elements: !898)
!898 = !{!899, !905}
!899 = !DIDerivedType(tag: DW_TAG_member, scope: !897, file: !413, line: 38, baseType: !900, size: 32)
!900 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !897, file: !413, line: 38, size: 32, elements: !901)
!901 = !{!902, !904}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !900, file: !413, line: 39, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !900, file: !413, line: 40, baseType: !903, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, scope: !897, file: !413, line: 42, baseType: !906, size: 32, offset: 32)
!906 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !897, file: !413, line: 42, size: 32, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !906, file: !413, line: 43, baseType: !903, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !906, file: !413, line: 44, baseType: !903, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !893, file: !495, line: 5405, baseType: !32, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !893, file: !495, line: 5408, baseType: !103, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !889, file: !886, line: 148, baseType: !913, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !886, line: 98, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DISubroutineType(types: !916)
!916 = !{null, null}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !885, file: !886, line: 165, baseType: !189, size: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !885, file: !886, line: 174, baseType: !919, size: 32, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_65", scope: !627, file: !832, line: 733, type: !922, isLocal: false, isDefinition: true, align: 16)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 80, elements: !926)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !925, line: 43, baseType: !315)
!925 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!926 = !{!927}
!927 = !DISubrange(count: 5)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_65", scope: !627, file: !832, line: 733, type: !930, isLocal: true, isDefinition: true, align: 32)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !225, line: 51, size: 64, elements: !932)
!932 = !{!933, !953}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !931, file: !225, line: 60, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DISubroutineType(types: !936)
!936 = !{!103, !937}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !925, line: 378, size: 192, elements: !940)
!940 = !{!941, !942, !943, !944, !950, !951}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !939, file: !925, line: 380, baseType: !569, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !939, file: !925, line: 382, baseType: !13, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !939, file: !925, line: 384, baseType: !13, size: 32, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !939, file: !925, line: 386, baseType: !945, size: 32, offset: 96)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !925, line: 351, size: 16, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !946, file: !925, line: 359, baseType: !288, size: 8)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !946, file: !925, line: 364, baseType: !794, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !939, file: !925, line: 388, baseType: !102, size: 32, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !939, file: !925, line: 396, baseType: !952, size: 32, offset: 160)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !931, file: !225, line: 65, baseType: !937, size: 32, offset: 32)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !627, file: !832, line: 79, type: !305, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "data", scope: !627, file: !832, line: 702, type: !958, isLocal: true, isDefinition: true)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !832, line: 69, size: 640, elements: !959)
!959 = !{!960, !962}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !958, file: !832, line: 70, baseType: !961, size: 448)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 448, elements: !434)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !958, file: !832, line: 71, baseType: !963, size: 192, offset: 448)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 192, elements: !434)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !832, line: 52, size: 96, elements: !965)
!965 = !{!966, !971, !972}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !964, file: !832, line: 53, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !713, line: 72, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !937, !827, !102}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !964, file: !832, line: 54, baseType: !102, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !964, file: !832, line: 55, baseType: !137, size: 32, offset: 64)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_65", scope: !627, file: !832, line: 733, type: !946, isLocal: true, isDefinition: true, align: 8)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "d", scope: !977, file: !832, line: 476, type: !983, isLocal: true, isDefinition: true)
!977 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !832, file: !832, line: 474, type: !833, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !627, retainedNodes: !978)
!978 = !{!979, !980, !981, !982}
!979 = !DILocalVariable(name: "mode", arg: 1, scope: !977, file: !832, line: 474, type: !636)
!980 = !DILocalVariable(name: "type", scope: !977, file: !832, line: 486, type: !790)
!981 = !DILocalVariable(name: "isr_mode", scope: !977, file: !832, line: 500, type: !794)
!982 = !DILocalVariable(name: "key", scope: !977, file: !832, line: 501, type: !103)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !642, line: 177, baseType: !641)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "target_type", scope: !977, file: !832, line: 477, type: !987, isLocal: true, isDefinition: true)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "config", scope: !627, file: !832, line: 704, type: !990, isLocal: true, isDefinition: true)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !832, line: 74, size: 128, elements: !992)
!992 = !{!993}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !991, file: !832, line: 76, baseType: !994, size: 128)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 128, elements: !434)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !832, line: 61, size: 64, elements: !996)
!996 = !{!997, !1002}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !995, file: !832, line: 62, baseType: !998, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !832, line: 58, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{null}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !995, file: !832, line: 63, baseType: !998, size: 32, offset: 32)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !627, file: !832, line: 695, type: !1005, isLocal: true, isDefinition: true)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !713, line: 100, size: 224, elements: !1007)
!1007 = !{!1008, !1013, !1014, !1019, !1024, !1029, !1035}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1006, file: !713, line: 101, baseType: !1009, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !713, line: 76, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!103, !937, !827}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1006, file: !713, line: 102, baseType: !1009, size: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1006, file: !713, line: 103, baseType: !1015, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !713, line: 83, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!103, !937, !827, !967, !102}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1006, file: !713, line: 104, baseType: !1020, size: 32, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !713, line: 79, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!103, !937, !827, !149}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1006, file: !713, line: 105, baseType: !1025, size: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !713, line: 88, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 32)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!712, !937, !827}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !1006, file: !713, line: 106, baseType: !1030, size: 32, offset: 160)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !713, line: 92, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!103, !937, !827, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !713, line: 64, baseType: !102)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1006, file: !713, line: 107, baseType: !1036, size: 32, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !713, line: 96, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 32)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!103, !937, !827, !102}
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "transitions", scope: !1042, file: !832, line: 655, type: !860, isLocal: true, isDefinition: true)
!1042 = distinct !DISubprogram(name: "clk_init", scope: !832, file: !832, line: 651, type: !935, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !627, retainedNodes: !1043)
!1043 = !{!1044, !1045, !1047, !1048, !1050}
!1044 = !DILocalVariable(name: "dev", arg: 1, scope: !1042, file: !832, line: 651, type: !937)
!1045 = !DILocalVariable(name: "nrfx_err", scope: !1042, file: !832, line: 653, type: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !720, line: 72, baseType: !719)
!1047 = !DILocalVariable(name: "err", scope: !1042, file: !832, line: 654, type: !103)
!1048 = !DILocalVariable(name: "i", scope: !1049, file: !832, line: 678, type: !630)
!1049 = distinct !DILexicalBlock(scope: !1042, file: !832, line: 678, column: 2)
!1050 = !DILocalVariable(name: "subdata", scope: !1051, file: !832, line: 680, type: !1053)
