; ModuleID = 'build/96b_nitrogen/simple/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.k_condvar = type { %struct._wait_q_t }
%struct.z_thread_stack_element = type { i8 }
%struct.log_source_const_data = type { i8*, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 51, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2496, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 39)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1248, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "mutex", scope: !27, file: !116, line: 18, type: !262, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/condition_variables/simple/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !110, !111}
!102 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !102)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !141, !152, !260}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "condvar", scope: !27, file: !116, line: 19, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/kernel/condition_variables/simple/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !118, line: 2828, size: 64, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2829, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "tstacks", scope: !27, file: !116, line: 14, type: !143, isLocal: false, isDefinition: true, align: 512)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 174080, elements: !149)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !145, line: 47, size: 8, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !145, line: 48, baseType: !148, size: 8)
!148 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = !{!150, !151}
!150 = !DISubrange(count: 20)
!151 = !DISubrange(count: 1088)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "t", scope: !27, file: !116, line: 16, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 25600, elements: !259)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1280, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !207, !220, !221, !222, !226, !227, !235, !254}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !155, file: !156, line: 247, baseType: !159, size: 384)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 384, elements: !160)
!160 = !{!161, !175, !177, !180, !181, !194, !195, !196}
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 60, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 60, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !162, file: !156, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !162, file: !156, line: 62, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 50, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !159, file: !156, line: 68, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !159, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !159, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 90, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 90, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !156, line: 91, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !156, line: 91, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !156, line: 96, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !156, line: 100, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !159, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !159, file: !156, line: 127, baseType: !107, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !156, line: 131, baseType: !197, size: 192, offset: 192)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !198)
!198 = !{!199, !200, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !197, file: !122, line: 245, baseType: !165, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !197, file: !122, line: 246, baseType: !201, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !197, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !155, file: !156, line: 250, baseType: !208, size: 288, offset: 384)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !209, line: 25, size: 288, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !208, file: !209, line: 26, baseType: !110, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !208, file: !209, line: 27, baseType: !110, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !208, file: !209, line: 28, baseType: !110, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !208, file: !209, line: 29, baseType: !110, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !208, file: !209, line: 30, baseType: !110, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !208, file: !209, line: 31, baseType: !110, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !208, file: !209, line: 32, baseType: !110, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !208, file: !209, line: 33, baseType: !110, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !208, file: !209, line: 34, baseType: !110, size: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !155, file: !156, line: 253, baseType: !107, size: 32, offset: 672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !155, file: !156, line: 256, baseType: !121, size: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 279, baseType: !223, size: 256, offset: 768)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 256, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !155, file: !156, line: 294, baseType: !109, size: 32, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !155, file: !156, line: 300, baseType: !228, size: 96, offset: 1056)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !229)
!229 = !{!230, !231, !234}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !228, file: !156, line: 153, baseType: !22, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !228, file: !156, line: 162, baseType: !232, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !233, line: 214, baseType: !32)
!233 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !228, file: !156, line: 168, baseType: !232, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !155, file: !156, line: 325, baseType: !236, size: 32, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !238)
!238 = !{!239, !248, !249}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !237, file: !118, line: 5074, baseType: !240, size: 96)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !241, line: 56, size: 96, elements: !242)
!241 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!242 = !{!243, !246, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !240, file: !241, line: 57, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !241, line: 57, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !240, file: !241, line: 58, baseType: !107, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !240, file: !241, line: 59, baseType: !232, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !237, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !237, file: !118, line: 5076, baseType: !250, size: 32, offset: 160)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, size: 32, elements: !252)
!251 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !250, file: !251, line: 52, baseType: !22, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !155, file: !156, line: 343, baseType: !255, size: 64, offset: 1184)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !209, line: 60, size: 64, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !255, file: !209, line: 63, baseType: !110, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !255, file: !209, line: 66, baseType: !110, size: 32, offset: 32)
!259 = !{!150}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "done", scope: !27, file: !116, line: 21, type: !109, isLocal: true, isDefinition: true)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !118, line: 2720, size: 160, elements: !263)
!263 = !{!264, !265, !267, !268}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !262, file: !118, line: 2722, baseType: !121, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !262, file: !118, line: 2724, baseType: !266, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !262, file: !118, line: 2727, baseType: !110, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !262, file: !118, line: 2730, baseType: !109, size: 32, offset: 128)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !271, file: !288, line: 18, type: !289, isLocal: false, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !273, globals: !287, splitDebugInlining: false, nameTableKind: None)
!272 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!273 = !{!22, !107, !24, !274, !276, !278, !232, !109, !281, !282, !283, !284, !285, !286, !192, !279}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!287 = !{!269}
!288 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !292)
!291 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 17, baseType: !279, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !290, file: !291, line: 18, baseType: !178, size: 8, offset: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "_char_out", scope: !297, file: !301, line: 54, type: !302, isLocal: false, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !299, globals: !300, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!299 = !{!107, !109}
!300 = !{!295}
!301 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{!109, !109}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !307, file: !341, line: 22, type: !373, isLocal: false, isDefinition: true)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !309, retainedTypes: !321, globals: !338, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!309 = !{!310, !30}
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !311, line: 27, baseType: !32, size: 32, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320}
!313 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!314 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!315 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!316 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!317 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!318 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!319 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!320 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!321 = !{!107, !103, !109, !24, !322, !285, !110, !111}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !324, line: 54, size: 96, elements: !325)
!324 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!325 = !{!326, !333, !337}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !323, file: !324, line: 55, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !328, line: 33, baseType: !329)
!328 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !328, line: 29, size: 32, elements: !330)
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !329, file: !328, line: 30, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !323, file: !324, line: 60, baseType: !334, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !310}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !323, file: !324, line: 65, baseType: !334, size: 32, offset: 64)
!338 = !{!305, !339, !347, !352, !354, !363, !365}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !307, file: !341, line: 27, type: !342, isLocal: true, isDefinition: true)
!341 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 32, elements: !345)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !344, line: 22, baseType: !102)
!344 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !307, file: !341, line: 44, type: !349, isLocal: true, isDefinition: true)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, size: 32, elements: !350)
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !349, file: !251, line: 52, baseType: !22, size: 32)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !307, file: !341, line: 49, type: !349, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !307, file: !341, line: 36, type: !356, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 128, elements: !345)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !311, line: 114, size: 128, elements: !358)
!358 = !{!359, !360, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !357, file: !311, line: 115, baseType: !310, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !357, file: !311, line: 141, baseType: !178, size: 8, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !357, file: !311, line: 149, baseType: !110, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !357, file: !311, line: 156, baseType: !110, size: 32, offset: 96)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !307, file: !341, line: 40, type: !356, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !307, file: !341, line: 28, type: !367, isLocal: true, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !328, line: 40, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !328, line: 35, size: 64, elements: !369)
!369 = !{!370, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !368, file: !328, line: 36, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !368, file: !328, line: 37, baseType: !371, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !374, file: !291, line: 17, baseType: !279, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !374, file: !291, line: 18, baseType: !178, size: 8, offset: 32)
!378 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!379 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !382, file: !411, line: 50, type: !398, isLocal: true, isDefinition: true)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !309, retainedTypes: !384, globals: !408, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!384 = !{!385, !103, !232, !109, !107, !110, !111, !387, !285, !398, !399}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !386)
!386 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !389, line: 45, size: 64, elements: !390)
!389 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = !{!391, !397}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !388, file: !389, line: 46, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !328, line: 33, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !328, line: 29, size: 32, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !393, file: !328, line: 30, baseType: !396, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !388, file: !389, line: 48, baseType: !110, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !389, line: 38, size: 64, elements: !401)
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !400, file: !389, line: 39, baseType: !392, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !400, file: !389, line: 41, baseType: !404, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !389, line: 35, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !398}
!408 = !{!409, !415, !423, !380, !425, !435}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "latency_lock", scope: !382, file: !411, line: 44, type: !412, isLocal: true, isDefinition: true)
!411 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, size: 32, elements: !413)
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !412, file: !251, line: 52, baseType: !22, size: 32)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !382, file: !411, line: 46, type: !417, isLocal: true, isDefinition: true)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !328, line: 40, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !328, line: 35, size: 64, elements: !419)
!419 = !{!420, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !418, file: !328, line: 36, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !418, file: !328, line: 37, baseType: !421, size: 32, offset: 32)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "latency_subs", scope: !382, file: !411, line: 52, type: !417, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !382, file: !411, line: 39, type: !427, isLocal: true, isDefinition: true)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, elements: !433)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 35, size: 96, elements: !429)
!429 = !{!430, !431, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !428, file: !411, line: 36, baseType: !310, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !428, file: !411, line: 37, baseType: !178, size: 8, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !428, file: !411, line: 38, baseType: !343, size: 32, offset: 64)
!433 = !{!434}
!434 = !DISubrange(count: 0)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !382, file: !411, line: 48, type: !398, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !439, file: !446, line: 47, type: !460, isLocal: true, isDefinition: true)
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !441, retainedTypes: !442, globals: !443, splitDebugInlining: false, nameTableKind: None)
!440 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!441 = !{!310}
!442 = !{!232, !109}
!443 = !{!444, !437, !456}
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "cpus_states", scope: !439, file: !446, line: 50, type: !447, isLocal: true, isDefinition: true)
!446 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 32, elements: !345)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !311, line: 114, size: 128, elements: !451)
!451 = !{!452, !453, !454, !455}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !450, file: !311, line: 115, baseType: !310, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !450, file: !311, line: 141, baseType: !178, size: 8, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !450, file: !311, line: 149, baseType: !110, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !450, file: !311, line: 156, baseType: !110, size: 32, offset: 96)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !439, file: !446, line: 55, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 8, elements: !345)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, elements: !433)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !463, file: !470, line: 17, type: !597, isLocal: false, isDefinition: true)
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !465, globals: !466, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!465 = !{!232, !109, !110, !107}
!466 = !{!461, !467, !593}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !469, file: !470, line: 198, type: !581, isLocal: true, isDefinition: true)
!469 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !470, file: !470, line: 175, type: !471, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !463, retainedNodes: !576)
!470 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!471 = !DISubroutineType(types: !472)
!472 = !{null, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1280, elements: !475)
!475 = !{!476, !534, !546, !547, !548, !549, !550, !556, !571}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !474, file: !156, line: 247, baseType: !477, size: 384)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 384, elements: !478)
!478 = !{!479, !503, !510, !511, !512, !521, !522, !523}
!479 = !DIDerivedType(tag: DW_TAG_member, scope: !477, file: !156, line: 60, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !477, file: !156, line: 60, size: 64, elements: !481)
!481 = !{!482, !497}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !480, file: !156, line: 61, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !485)
!485 = !{!486, !492}
!486 = !DIDerivedType(tag: DW_TAG_member, scope: !484, file: !127, line: 38, baseType: !487, size: 32)
!487 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !484, file: !127, line: 38, size: 32, elements: !488)
!488 = !{!489, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !487, file: !127, line: 39, baseType: !490, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !487, file: !127, line: 40, baseType: !490, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, scope: !484, file: !127, line: 42, baseType: !493, size: 32, offset: 32)
!493 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !484, file: !127, line: 42, size: 32, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !493, file: !127, line: 43, baseType: !490, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !493, file: !127, line: 44, baseType: !490, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !480, file: !156, line: 62, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !498, file: !168, line: 50, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 64, elements: !173)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !477, file: !156, line: 68, baseType: !504, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !507)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !506, file: !122, line: 232, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !484)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !477, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !477, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!512 = !DIDerivedType(tag: DW_TAG_member, scope: !477, file: !156, line: 90, baseType: !513, size: 16, offset: 112)
!513 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !477, file: !156, line: 90, size: 16, elements: !514)
!514 = !{!515, !520}
!515 = !DIDerivedType(tag: DW_TAG_member, scope: !513, file: !156, line: 91, baseType: !516, size: 16)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !513, file: !156, line: 91, size: 16, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !516, file: !156, line: 96, baseType: !188, size: 8)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !516, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !513, file: !156, line: 100, baseType: !192, size: 16)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !477, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !477, file: !156, line: 127, baseType: !107, size: 32, offset: 160)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !477, file: !156, line: 131, baseType: !524, size: 192, offset: 192)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !525)
!525 = !{!526, !527, !533}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !524, file: !122, line: 245, baseType: !483, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !524, file: !122, line: 246, baseType: !528, size: 32, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !524, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !474, file: !156, line: 250, baseType: !535, size: 288, offset: 384)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !209, line: 25, size: 288, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !535, file: !209, line: 26, baseType: !110, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !535, file: !209, line: 27, baseType: !110, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !535, file: !209, line: 28, baseType: !110, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !535, file: !209, line: 29, baseType: !110, size: 32, offset: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !535, file: !209, line: 30, baseType: !110, size: 32, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !535, file: !209, line: 31, baseType: !110, size: 32, offset: 160)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !535, file: !209, line: 32, baseType: !110, size: 32, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !535, file: !209, line: 33, baseType: !110, size: 32, offset: 224)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !535, file: !209, line: 34, baseType: !110, size: 32, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !474, file: !156, line: 253, baseType: !107, size: 32, offset: 672)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !474, file: !156, line: 256, baseType: !505, size: 64, offset: 704)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !474, file: !156, line: 279, baseType: !223, size: 256, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !474, file: !156, line: 294, baseType: !109, size: 32, offset: 1024)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !474, file: !156, line: 300, baseType: !551, size: 96, offset: 1056)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !552)
!552 = !{!553, !554, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !551, file: !156, line: 153, baseType: !22, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !551, file: !156, line: 162, baseType: !232, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !551, file: !156, line: 168, baseType: !232, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !474, file: !156, line: 325, baseType: !557, size: 32, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !559)
!559 = !{!560, !566, !567}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !558, file: !118, line: 5074, baseType: !561, size: 96)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !241, line: 56, size: 96, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !561, file: !241, line: 57, baseType: !244, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !561, file: !241, line: 58, baseType: !107, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !561, file: !241, line: 59, baseType: !232, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !558, file: !118, line: 5075, baseType: !505, size: 64, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !558, file: !118, line: 5076, baseType: !568, size: 32, offset: 160)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, size: 32, elements: !569)
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !568, file: !251, line: 52, baseType: !22, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !474, file: !156, line: 343, baseType: !572, size: 64, offset: 1184)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !209, line: 60, size: 64, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !572, file: !209, line: 63, baseType: !110, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !572, file: !209, line: 66, baseType: !110, size: 32, offset: 32)
!576 = !{!577, !578, !579, !580}
!577 = !DILocalVariable(name: "thread", arg: 1, scope: !469, file: !470, line: 175, type: !473)
!578 = !DILocalVariable(name: "region_num", scope: !469, file: !470, line: 200, type: !178)
!579 = !DILocalVariable(name: "guard_start", scope: !469, file: !470, line: 265, type: !22)
!580 = !DILocalVariable(name: "guard_size", scope: !469, file: !470, line: 266, type: !232)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 96, elements: !345)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !583, line: 52, size: 96, elements: !584)
!583 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!584 = !{!585, !586, !587}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !582, file: !583, line: 53, baseType: !22, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !582, file: !583, line: 54, baseType: !232, size: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !582, file: !583, line: 55, baseType: !588, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !589, line: 151, baseType: !590)
!589 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !589, line: 149, size: 32, elements: !591)
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !590, file: !589, line: 150, baseType: !110, size: 32)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "static_regions", scope: !463, file: !470, line: 62, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 96, elements: !345)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !598, file: !291, line: 17, baseType: !279, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !598, file: !291, line: 18, baseType: !178, size: 8, offset: 32)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !604, file: !638, line: 39, type: !178, isLocal: true, isDefinition: true)
!604 = distinct !DICompileUnit(language: DW_LANG_C99, file: !605, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !606, globals: !637, splitDebugInlining: false, nameTableKind: None)
!605 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!606 = !{!607, !107, !109, !625, !178}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !609, line: 1226, baseType: !610)
!609 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !609, line: 1213, size: 352, elements: !611)
!611 = !{!612, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !610, file: !609, line: 1215, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !610, file: !609, line: 1216, baseType: !614, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !610, file: !609, line: 1217, baseType: !614, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !610, file: !609, line: 1218, baseType: !614, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !610, file: !609, line: 1219, baseType: !614, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !610, file: !609, line: 1220, baseType: !614, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !610, file: !609, line: 1221, baseType: !614, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !610, file: !609, line: 1222, baseType: !614, size: 32, offset: 224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !610, file: !609, line: 1223, baseType: !614, size: 32, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !610, file: !609, line: 1224, baseType: !614, size: 32, offset: 288)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !610, file: !609, line: 1225, baseType: !614, size: 32, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !628, line: 27, size: 96, elements: !629)
!628 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!629 = !{!630, !631, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !627, file: !628, line: 29, baseType: !110, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !627, file: !628, line: 31, baseType: !279, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !627, file: !628, line: 37, baseType: !633, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !589, line: 146, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !589, line: 141, size: 32, elements: !635)
!635 = !{!636}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !634, file: !589, line: 143, baseType: !110, size: 32)
!637 = !{!602}
!638 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !641, file: !648, line: 21, type: !302, isLocal: true, isDefinition: true)
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !643, globals: !647, splitDebugInlining: false, nameTableKind: None)
!642 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!643 = !{!644, !109, !107}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !646, line: 22, baseType: !109)
!646 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!647 = !{!639}
!648 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !651, file: !656, line: 13, type: !673, isLocal: true, isDefinition: true)
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !653, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!653 = !{!654, !649}
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "mpu_config", scope: !651, file: !656, line: 37, type: !657, isLocal: false, isDefinition: true)
!656 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !628, line: 41, size: 64, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !658, file: !628, line: 43, baseType: !110, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !658, file: !628, line: 45, baseType: !662, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !628, line: 27, size: 96, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !664, file: !628, line: 29, baseType: !110, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !664, file: !628, line: 31, baseType: !279, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !664, file: !628, line: 37, baseType: !669, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !589, line: 146, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !589, line: 141, size: 32, elements: !671)
!671 = !{!672}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !670, file: !589, line: 143, baseType: !110, size: 32)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 192, elements: !173)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !676, file: !834, line: 48, type: !851, isLocal: false, isDefinition: true)
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !678, globals: !831, splitDebugInlining: false, nameTableKind: None)
!677 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!678 = !{!679, !178, !107, !109, !753, !110, !754, !790, !801}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !681, line: 882, baseType: !682)
!681 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 850, size: 19456, elements: !683)
!683 = !{!684, !688, !689, !690, !694, !695, !697, !698, !699, !703, !704, !705, !709, !710, !714, !715, !719, !720, !724, !725, !726, !727, !728, !729, !733, !734, !738, !739, !743}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !682, file: !681, line: 851, baseType: !685, size: 960)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 960, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 30)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !682, file: !681, line: 852, baseType: !614, size: 32, offset: 960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !682, file: !681, line: 853, baseType: !614, size: 32, offset: 992)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !682, file: !681, line: 854, baseType: !691, size: 1088, offset: 1024)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 1088, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 34)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !682, file: !681, line: 855, baseType: !614, size: 32, offset: 2112)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !682, file: !681, line: 856, baseType: !696, size: 64, offset: 2144)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 64, elements: !173)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !682, file: !681, line: 857, baseType: !614, size: 32, offset: 2208)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !682, file: !681, line: 858, baseType: !614, size: 32, offset: 2240)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !682, file: !681, line: 859, baseType: !700, size: 3904, offset: 2272)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 3904, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 122)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !682, file: !681, line: 860, baseType: !614, size: 32, offset: 6176)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !682, file: !681, line: 861, baseType: !614, size: 32, offset: 6208)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !682, file: !681, line: 862, baseType: !706, size: 1952, offset: 6240)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 1952, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 61)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !682, file: !681, line: 863, baseType: !614, size: 32, offset: 8192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !682, file: !681, line: 864, baseType: !711, size: 288, offset: 8224)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 288, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 9)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !682, file: !681, line: 865, baseType: !613, size: 32, offset: 8512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !682, file: !681, line: 866, baseType: !716, size: 1696, offset: 8544)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 1696, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 53)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !682, file: !681, line: 867, baseType: !614, size: 32, offset: 10240)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !682, file: !681, line: 868, baseType: !721, size: 96, offset: 10272)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 96, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 3)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !682, file: !681, line: 869, baseType: !614, size: 32, offset: 10368)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !682, file: !681, line: 870, baseType: !696, size: 64, offset: 10400)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !682, file: !681, line: 871, baseType: !614, size: 32, offset: 10464)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !682, file: !681, line: 872, baseType: !614, size: 32, offset: 10496)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !682, file: !681, line: 873, baseType: !614, size: 32, offset: 10528)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !682, file: !681, line: 875, baseType: !730, size: 352, offset: 10560)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 352, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 11)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !682, file: !681, line: 876, baseType: !614, size: 32, offset: 10912)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !682, file: !681, line: 878, baseType: !735, size: 256, offset: 10944)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 256, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 8)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !682, file: !681, line: 879, baseType: !614, size: 32, offset: 11200)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !682, file: !681, line: 880, baseType: !740, size: 7200, offset: 11232)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 7200, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 225)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !682, file: !681, line: 881, baseType: !744, size: 1024, offset: 18432)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 1024, elements: !736)
!745 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !681, line: 258, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 252, size: 128, elements: !748)
!748 = !{!749, !750, !751, !752}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !747, file: !681, line: 253, baseType: !614, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !747, file: !681, line: 254, baseType: !614, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !747, file: !681, line: 255, baseType: !614, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !747, file: !681, line: 257, baseType: !613, size: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !609, line: 468, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !609, line: 445, size: 1120, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !783, !787, !789}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !756, file: !609, line: 447, baseType: !613, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !756, file: !609, line: 448, baseType: !614, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !756, file: !609, line: 449, baseType: !614, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !756, file: !609, line: 450, baseType: !614, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !756, file: !609, line: 451, baseType: !614, size: 32, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !756, file: !609, line: 452, baseType: !614, size: 32, offset: 160)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !756, file: !609, line: 453, baseType: !765, size: 96, offset: 192)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 96, elements: !767)
!766 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !178)
!767 = !{!768}
!768 = !DISubrange(count: 12)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !756, file: !609, line: 454, baseType: !614, size: 32, offset: 288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !756, file: !609, line: 455, baseType: !614, size: 32, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !756, file: !609, line: 456, baseType: !614, size: 32, offset: 352)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !756, file: !609, line: 457, baseType: !614, size: 32, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !756, file: !609, line: 458, baseType: !614, size: 32, offset: 416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !756, file: !609, line: 459, baseType: !614, size: 32, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !756, file: !609, line: 460, baseType: !614, size: 32, offset: 480)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !756, file: !609, line: 461, baseType: !696, size: 64, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !756, file: !609, line: 462, baseType: !613, size: 32, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !756, file: !609, line: 463, baseType: !613, size: 32, offset: 608)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !756, file: !609, line: 464, baseType: !780, size: 128, offset: 640)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 128, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 4)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !756, file: !609, line: 465, baseType: !784, size: 160, offset: 768)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 160, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 5)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !756, file: !609, line: 466, baseType: !788, size: 160, offset: 928)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 160, elements: !785)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !756, file: !609, line: 467, baseType: !614, size: 32, offset: 1088)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !792, file: !791, line: 167, baseType: !800)
!791 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!792 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !791, file: !791, line: 134, type: !793, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !676, retainedNodes: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !110}
!795 = !{!796, !797, !799}
!796 = !DILocalVariable(name: "time_us", arg: 1, scope: !792, file: !791, line: 134, type: !110)
!797 = !DILocalVariable(name: "delay_cycles", scope: !792, file: !791, line: 168, type: !798)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!799 = !DILocalVariable(name: "cycles", scope: !792, file: !791, line: 171, type: !110)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !681, line: 2140, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 2119, size: 10880, elements: !804)
!804 = !{!805, !809, !810, !814, !815, !820, !821, !822, !823, !827, !828, !829, !830}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !803, file: !681, line: 2120, baseType: !806, size: 8192)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 8192, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !803, file: !681, line: 2121, baseType: !613, size: 32, offset: 8192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !803, file: !681, line: 2122, baseType: !811, size: 2048, offset: 8224)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 2048, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !803, file: !681, line: 2123, baseType: !614, size: 32, offset: 10272)
!815 = !DIDerivedType(tag: DW_TAG_member, scope: !803, file: !681, line: 2125, baseType: !816, size: 32, offset: 10304)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !803, file: !681, line: 2125, size: 32, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !816, file: !681, line: 2126, baseType: !614, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !816, file: !681, line: 2127, baseType: !614, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !803, file: !681, line: 2130, baseType: !614, size: 32, offset: 10336)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !803, file: !681, line: 2131, baseType: !614, size: 32, offset: 10368)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !803, file: !681, line: 2133, baseType: !614, size: 32, offset: 10400)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !803, file: !681, line: 2135, baseType: !824, size: 320, offset: 10432)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 320, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 10)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !803, file: !681, line: 2136, baseType: !614, size: 32, offset: 10752)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !803, file: !681, line: 2137, baseType: !613, size: 32, offset: 10784)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !803, file: !681, line: 2138, baseType: !614, size: 32, offset: 10816)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !803, file: !681, line: 2139, baseType: !614, size: 32, offset: 10848)
!831 = !{!674, !832, !847}
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !676, file: !834, line: 93, type: !835, isLocal: true, isDefinition: true, align: 32)
!834 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !837, line: 51, size: 64, elements: !838)
!837 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!838 = !{!839, !846}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !836, file: !837, line: 60, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DISubroutineType(types: !842)
!842 = !{!109, !843}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !845)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !837, line: 48, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !836, file: !837, line: 65, baseType: !843, size: 32, offset: 32)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !792, file: !791, line: 161, type: !849, isLocal: true, isDefinition: true, align: 128)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 48, elements: !722)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !852, file: !291, line: 17, baseType: !279, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !852, file: !291, line: 18, baseType: !178, size: 8, offset: 32)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !858, file: !1082, line: 18, type: !1320, isLocal: false, isDefinition: true)
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !860, retainedTypes: !993, globals: !1078, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/simple")
!860 = !{!861, !867, !30, !872, !877, !884, !890, !896, !905, !909, !958, !965, !984}
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !862, line: 23, baseType: !32, size: 32, elements: !863)
!862 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!863 = !{!864, !865, !866}
!864 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!865 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!866 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !862, line: 48, baseType: !32, size: 32, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!870 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!871 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !873, line: 167, baseType: !32, size: 32, elements: !874)
!873 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!874 = !{!875, !876}
!875 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!876 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !873, line: 107, baseType: !32, size: 32, elements: !878)
!878 = !{!879, !880, !881, !882, !883}
!879 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!880 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!881 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!882 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!883 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !873, line: 208, baseType: !32, size: 32, elements: !885)
!885 = !{!886, !887, !888, !889}
!886 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!887 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!888 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!889 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!890 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !873, line: 261, baseType: !32, size: 32, elements: !891)
!891 = !{!892, !893, !894, !895}
!892 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!893 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!894 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!895 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !873, line: 237, baseType: !32, size: 32, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904}
!898 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!899 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!900 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!901 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!902 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!903 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!904 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !873, line: 152, baseType: !32, size: 32, elements: !906)
!906 = !{!907, !908}
!907 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!908 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !681, line: 71, baseType: !109, size: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957}
!911 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!912 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!913 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!914 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!915 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!916 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!917 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!918 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!919 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!920 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!921 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!922 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!923 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!924 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!925 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!926 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!927 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!928 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!929 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!930 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!931 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!932 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!933 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!934 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!935 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!936 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!937 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!938 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!939 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!940 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!941 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!942 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!943 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!944 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!945 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!946 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!947 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!948 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!949 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!950 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!951 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!952 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!953 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!954 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!955 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!956 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!957 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!958 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !959, line: 44, baseType: !32, size: 32, elements: !960)
!959 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!960 = !{!961, !962, !963, !964}
!961 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!962 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!963 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!964 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!965 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !966, line: 54, baseType: !32, size: 32, elements: !967)
!966 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!967 = !{!968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983}
!968 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!969 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!970 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!971 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!972 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!973 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!974 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!975 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!976 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!977 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!978 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!979 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!980 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!981 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!982 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!983 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!984 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !985, line: 53, baseType: !32, size: 32, elements: !986)
!985 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!986 = !{!987, !988, !989, !990, !991, !992}
!987 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!988 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!989 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!990 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!991 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!992 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!993 = !{!861, !107, !109, !994, !1042, !1043, !1044, !1045, !103, !110, !111, !1046, !753, !286, !398, !1047, !1077, !232}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !681, line: 837, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 804, size: 11008, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1009, !1010, !1011, !1012, !1013, !1014, !1018, !1019, !1020, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1034, !1035, !1039, !1040, !1041}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !996, file: !681, line: 805, baseType: !614, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !996, file: !681, line: 806, baseType: !614, size: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !996, file: !681, line: 807, baseType: !614, size: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !996, file: !681, line: 808, baseType: !614, size: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !996, file: !681, line: 809, baseType: !614, size: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !996, file: !681, line: 810, baseType: !614, size: 32, offset: 160)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !996, file: !681, line: 811, baseType: !614, size: 32, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !996, file: !681, line: 812, baseType: !1006, size: 1824, offset: 224)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 1824, elements: !1007)
!1007 = !{!1008}
!1008 = !DISubrange(count: 57)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !996, file: !681, line: 813, baseType: !614, size: 32, offset: 2048)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !996, file: !681, line: 814, baseType: !614, size: 32, offset: 2080)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !996, file: !681, line: 815, baseType: !613, size: 32, offset: 2112)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !996, file: !681, line: 816, baseType: !614, size: 32, offset: 2144)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !996, file: !681, line: 817, baseType: !614, size: 32, offset: 2176)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !996, file: !681, line: 818, baseType: !1015, size: 3968, offset: 2208)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 3968, elements: !1016)
!1016 = !{!1017}
!1017 = !DISubrange(count: 124)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !996, file: !681, line: 819, baseType: !614, size: 32, offset: 6176)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !996, file: !681, line: 820, baseType: !614, size: 32, offset: 6208)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !996, file: !681, line: 821, baseType: !1021, size: 2016, offset: 6240)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 2016, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 63)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !996, file: !681, line: 822, baseType: !613, size: 32, offset: 8256)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !996, file: !681, line: 824, baseType: !613, size: 32, offset: 8288)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !996, file: !681, line: 825, baseType: !613, size: 32, offset: 8320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !996, file: !681, line: 826, baseType: !613, size: 32, offset: 8352)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !996, file: !681, line: 828, baseType: !613, size: 32, offset: 8384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !996, file: !681, line: 829, baseType: !613, size: 32, offset: 8416)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !996, file: !681, line: 831, baseType: !1031, size: 1984, offset: 8448)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 1984, elements: !1032)
!1032 = !{!1033}
!1033 = !DISubrange(count: 62)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !996, file: !681, line: 832, baseType: !614, size: 32, offset: 10432)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !996, file: !681, line: 833, baseType: !1036, size: 224, offset: 10464)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 224, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 7)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !996, file: !681, line: 834, baseType: !614, size: 32, offset: 10688)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !996, file: !681, line: 835, baseType: !735, size: 256, offset: 10720)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !996, file: !681, line: 836, baseType: !614, size: 32, offset: 10976)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !873, line: 146, baseType: !877)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !873, line: 164, baseType: !905)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1046 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !609, line: 426, baseType: !1049)
