; ModuleID = './examples/blinky.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct.GPIO_InitTypeDef = type { i32, i32, i32, i32 }
%struct.GPIO_TypeDef = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.RCC_OscInitTypeDef = type { i32, i32, i32, i32, i32, i32, i32, %struct.RCC_PLLInitTypeDef }
%struct.RCC_PLLInitTypeDef = type { i32, i32, i32 }
%struct.RCC_ClkInitTypeDef = type { i32, i32, i32, i32, i32 }

@AHBPrescTable = dso_local local_unnamed_addr constant [16 x i8] c"\00\00\00\00\00\00\00\00\01\02\03\04\06\07\08\09", align 1, !dbg !0
@__const.HAL_RCC_GetSysClockFreq.aPLLMULFactorTable = private unnamed_addr constant [16 x i8] c"\02\03\04\05\06\07\08\09\0A\0B\0C\0D\0E\0F\10\10", align 1
@__const.HAL_RCC_GetSysClockFreq.aPredivFactorTable = private unnamed_addr constant [2 x i8] c"\01\02", align 1
@APBPrescTable = dso_local local_unnamed_addr constant [8 x i8] c"\00\00\00\00\01\02\03\04", align 1, !dbg !79
@uwTickPrio = dso_local local_unnamed_addr global i32 16, align 4, !dbg !88
@uwTickFreq = dso_local local_unnamed_addr global i32 1, align 4, !dbg !206
@SystemCoreClock = dso_local local_unnamed_addr global i32 16000000, align 4, !dbg !77
@uwTick = dso_local global i32 0, align 4, !dbg !209

; Function Attrs: mustprogress noinline norecurse noreturn nounwind

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "AHBPrescTable", scope: !2, file: !3, line: 124, type: !85, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !76, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Source/Templates/system_stm32f1xx.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "2e873de3002e5d783190a46ff1c7da2d")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 151, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xx.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dc4ed8bdf8589b30d30d93eb6ee6ca27")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "RESET", value: 0)
!10 = !DIEnumerator(name: "SET", value: 1)
!11 = !{!12, !32, !19}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !14, line: 438, baseType: !15)
!14 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f103xb.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "d2562af6d7239ab46ca8ba238a43c848")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 424, size: 320, elements: !16)
!16 = !{!17, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !15, file: !14, line: 426, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !20, line: 48, baseType: !21)
!20 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ab914e287601b2385e57880e6599aa6b")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !22, line: 79, baseType: !7)
!22 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f7024d0682a918b41f94e8be9cd90461")
!23 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !15, file: !14, line: 427, baseType: !18, size: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !15, file: !14, line: 428, baseType: !18, size: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !15, file: !14, line: 429, baseType: !18, size: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !15, file: !14, line: 430, baseType: !18, size: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !15, file: !14, line: 431, baseType: !18, size: 32, offset: 160)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !15, file: !14, line: 432, baseType: !18, size: 32, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !15, file: !14, line: 433, baseType: !18, size: 32, offset: 224)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !15, file: !14, line: 434, baseType: !18, size: 32, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !15, file: !14, line: 435, baseType: !18, size: 32, offset: 288)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !34, line: 397, baseType: !35)
!34 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 374, size: 1120, elements: !36)
!36 = !{!37, !39, !40, !41, !42, !43, !44, !52, !53, !54, !55, !56, !57, !58, !59, !63, !64, !65, !69, !73, !75}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !35, file: !34, line: 376, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !35, file: !34, line: 377, baseType: !18, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !35, file: !34, line: 378, baseType: !18, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !35, file: !34, line: 379, baseType: !18, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !35, file: !34, line: 380, baseType: !18, size: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !35, file: !34, line: 381, baseType: !18, size: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !35, file: !34, line: 382, baseType: !45, size: 96, offset: 192)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 96, elements: !50)
!46 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !20, line: 24, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !22, line: 43, baseType: !49)
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !{!51}
!51 = !DISubrange(count: 12)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !35, file: !34, line: 383, baseType: !18, size: 32, offset: 288)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !35, file: !34, line: 384, baseType: !18, size: 32, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !35, file: !34, line: 385, baseType: !18, size: 32, offset: 352)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !35, file: !34, line: 386, baseType: !18, size: 32, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !35, file: !34, line: 387, baseType: !18, size: 32, offset: 416)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !35, file: !34, line: 388, baseType: !18, size: 32, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !35, file: !34, line: 389, baseType: !18, size: 32, offset: 480)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !35, file: !34, line: 390, baseType: !60, size: 64, offset: 512)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 2)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !35, file: !34, line: 391, baseType: !38, size: 32, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !35, file: !34, line: 392, baseType: !38, size: 32, offset: 608)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !35, file: !34, line: 393, baseType: !66, size: 128, offset: 640)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 128, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 4)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !35, file: !34, line: 394, baseType: !70, size: 160, offset: 768)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 5)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !35, file: !34, line: 395, baseType: !74, size: 160, offset: 928)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, elements: !71)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !35, file: !34, line: 396, baseType: !18, size: 32, offset: 1088)
!76 = !{!77, !0, !79}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !2, file: !3, line: 123, type: !19, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "APBPrescTable", scope: !2, file: !3, line: 125, type: !81, isLocal: false, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 64, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!83 = !{!84}
!84 = !DISubrange(count: 8)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 128, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 16)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "uwTickPrio", scope: !90, file: !91, line: 80, type: !19, isLocal: false, isDefinition: true)
!90 = distinct !DICompileUnit(language: DW_LANG_C99, file: !91, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !92, retainedTypes: !162, globals: !205, splitDebugInlining: false, nameTableKind: None)
!91 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "1a5fa7b79e9e470cf817b81d791a6ccb")
!92 = !{!93, !100, !107}
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !94, line: 49, baseType: !7, size: 32, elements: !95)
!94 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5eab64b252ccd159497a11d87d26bc0b")
!95 = !{!96, !97, !98, !99}
!96 = !DIEnumerator(name: "HAL_TICK_FREQ_10HZ", value: 100)
!97 = !DIEnumerator(name: "HAL_TICK_FREQ_100HZ", value: 10)
!98 = !DIEnumerator(name: "HAL_TICK_FREQ_1KHZ", value: 1)
!99 = !DIEnumerator(name: "HAL_TICK_FREQ_DEFAULT", value: 1)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 41, baseType: !7, size: 32, elements: !102)
!101 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_def.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "4d6e0bbb91efacee14a68a416f506def")
!102 = !{!103, !104, !105, !106}
!103 = !DIEnumerator(name: "HAL_OK", value: 0)
!104 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!105 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!106 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 69, baseType: !108, size: 32, elements: !109)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!110 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!111 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!112 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!113 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!114 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!115 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!116 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!117 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!118 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!119 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!120 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!121 = !DIEnumerator(name: "TAMPER_IRQn", value: 2)
!122 = !DIEnumerator(name: "RTC_IRQn", value: 3)
!123 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!124 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!125 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!126 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!127 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!128 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!129 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!130 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!131 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!132 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!133 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!134 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!135 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!136 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!137 = !DIEnumerator(name: "ADC1_2_IRQn", value: 18)
!138 = !DIEnumerator(name: "USB_HP_CAN1_TX_IRQn", value: 19)
!139 = !DIEnumerator(name: "USB_LP_CAN1_RX0_IRQn", value: 20)
!140 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!141 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!142 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!143 = !DIEnumerator(name: "TIM1_BRK_IRQn", value: 24)
!144 = !DIEnumerator(name: "TIM1_UP_IRQn", value: 25)
!145 = !DIEnumerator(name: "TIM1_TRG_COM_IRQn", value: 26)
!146 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!147 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!148 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!149 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!150 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!151 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!152 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!153 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!154 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!155 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!156 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!157 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!158 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!159 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!160 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!161 = !DIEnumerator(name: "USBWakeUp_IRQn", value: 42)
!162 = !{!163, !19, !176, !190, !198, !204}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !14, line: 336, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 325, size: 288, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !165, file: !14, line: 327, baseType: !18, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !165, file: !14, line: 328, baseType: !18, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !165, file: !14, line: 329, baseType: !18, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !165, file: !14, line: 330, baseType: !18, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !165, file: !14, line: 331, baseType: !18, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !165, file: !14, line: 332, baseType: !18, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !165, file: !14, line: 333, baseType: !18, size: 32, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !165, file: !14, line: 334, baseType: !18, size: 32, offset: 224)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !165, file: !14, line: 335, baseType: !18, size: 32, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !14, line: 438, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 424, size: 320, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !178, file: !14, line: 426, baseType: !18, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !178, file: !14, line: 427, baseType: !18, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !178, file: !14, line: 428, baseType: !18, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !178, file: !14, line: 429, baseType: !18, size: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !178, file: !14, line: 430, baseType: !18, size: 32, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !178, file: !14, line: 431, baseType: !18, size: 32, offset: 160)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !178, file: !14, line: 432, baseType: !18, size: 32, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !178, file: !14, line: 433, baseType: !18, size: 32, offset: 224)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !178, file: !14, line: 434, baseType: !18, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !178, file: !14, line: 435, baseType: !18, size: 32, offset: 288)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !34, line: 700, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 694, size: 128, elements: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !192, file: !34, line: 696, baseType: !18, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !192, file: !34, line: 697, baseType: !18, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !192, file: !34, line: 698, baseType: !18, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !192, file: !34, line: 699, baseType: !38, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBGMCU_TypeDef", file: !14, line: 285, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 281, size: 64, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "IDCODE", scope: !200, file: !14, line: 283, baseType: !18, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !200, file: !14, line: 284, baseType: !18, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!205 = !{!88, !206, !209}
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "uwTickFreq", scope: !90, file: !91, line: 81, type: !208, isLocal: false, isDefinition: true)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_TickFreqTypeDef", file: !94, line: 55, baseType: !93)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "uwTick", scope: !90, file: !91, line: 79, type: !18, isLocal: false, isDefinition: true)
!211 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !212, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !225, splitDebugInlining: false, nameTableKind: None)
!212 = !DIFile(filename: "../examples/stm32f1/blinky.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "0382420e594ee783b4913c04fba1600a")
!213 = !{!214, !220}
!214 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 41, baseType: !7, size: 32, elements: !215, identifier: "_ZTS17HAL_StatusTypeDef")
!215 = !{!216, !217, !218, !219}
!216 = !DIEnumerator(name: "HAL_OK", value: 0, isUnsigned: true)
!217 = !DIEnumerator(name: "HAL_ERROR", value: 1, isUnsigned: true)
!218 = !DIEnumerator(name: "HAL_BUSY", value: 2, isUnsigned: true)
!219 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3, isUnsigned: true)
!220 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !221, line: 65, baseType: !7, size: 32, elements: !222, identifier: "_ZTS13GPIO_PinState")
!221 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "b5ff32b0624c591654a3e02ee400cffe")
!222 = !{!223, !224}
!223 = !DIEnumerator(name: "GPIO_PIN_RESET", value: 0, isUnsigned: true)
!224 = !DIEnumerator(name: "GPIO_PIN_SET", value: 1, isUnsigned: true)
!225 = !{!226, !240, !243}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !14, line: 438, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 424, size: 320, flags: DIFlagTypePassByValue, elements: !229, identifier: "_ZTS11RCC_TypeDef")
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !228, file: !14, line: 426, baseType: !18, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !228, file: !14, line: 427, baseType: !18, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !228, file: !14, line: 428, baseType: !18, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !228, file: !14, line: 429, baseType: !18, size: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !228, file: !14, line: 430, baseType: !18, size: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !228, file: !14, line: 431, baseType: !18, size: 32, offset: 160)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !228, file: !14, line: 432, baseType: !18, size: 32, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !228, file: !14, line: 433, baseType: !18, size: 32, offset: 224)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !228, file: !14, line: 434, baseType: !18, size: 32, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !228, file: !14, line: 435, baseType: !18, size: 32, offset: 288)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !14, line: 367, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 358, size: 224, flags: DIFlagFwdDecl, identifier: "_ZTS12GPIO_TypeDef")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !20, line: 36, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !22, line: 57, baseType: !245)
!245 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !248, retainedTypes: !253, splitDebugInlining: false, nameTableKind: None)
!247 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "de98d9c05272efa2ca465428751dd1b5")
!248 = !{!249, !100}
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !221, line: 65, baseType: !7, size: 32, elements: !250)
!250 = !{!251, !252}
!251 = !DIEnumerator(name: "GPIO_PIN_RESET", value: 0)
!252 = !DIEnumerator(name: "GPIO_PIN_SET", value: 1)
!253 = !{!19, !243, !254, !268, !278, !289}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !14, line: 438, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 424, size: 320, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !256, file: !14, line: 426, baseType: !18, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !256, file: !14, line: 427, baseType: !18, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !256, file: !14, line: 428, baseType: !18, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !256, file: !14, line: 429, baseType: !18, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !256, file: !14, line: 430, baseType: !18, size: 32, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !256, file: !14, line: 431, baseType: !18, size: 32, offset: 160)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !256, file: !14, line: 432, baseType: !18, size: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !256, file: !14, line: 433, baseType: !18, size: 32, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !256, file: !14, line: 434, baseType: !18, size: 32, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !256, file: !14, line: 435, baseType: !18, size: 32, offset: 288)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFIO_TypeDef", file: !14, line: 380, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 373, size: 256, elements: !271)
!271 = !{!272, !273, !274, !276, !277}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "EVCR", scope: !270, file: !14, line: 375, baseType: !18, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR", scope: !270, file: !14, line: 376, baseType: !18, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !270, file: !14, line: 377, baseType: !275, size: 128, offset: 64)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, elements: !67)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !270, file: !14, line: 378, baseType: !19, size: 32, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR2", scope: !270, file: !14, line: 379, baseType: !18, size: 32, offset: 224)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !14, line: 367, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 358, size: 224, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "CRL", scope: !280, file: !14, line: 360, baseType: !18, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "CRH", scope: !280, file: !14, line: 361, baseType: !18, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !280, file: !14, line: 362, baseType: !18, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !280, file: !14, line: 363, baseType: !18, size: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !280, file: !14, line: 364, baseType: !18, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !280, file: !14, line: 365, baseType: !18, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !280, file: !14, line: 366, baseType: !18, size: 32, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !14, line: 319, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 311, size: 192, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !291, file: !14, line: 313, baseType: !18, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !291, file: !14, line: 314, baseType: !18, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !291, file: !14, line: 315, baseType: !18, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !291, file: !14, line: 316, baseType: !18, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !291, file: !14, line: 317, baseType: !18, size: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !291, file: !14, line: 318, baseType: !18, size: 32, offset: 160)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !301, retainedTypes: !306, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_rcc.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "bf5d5e021854d33cea3d58ed6b9d5087")
!301 = !{!100, !5, !302}
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 157, baseType: !7, size: 32, elements: !303)
!303 = !{!304, !305}
!304 = !DIEnumerator(name: "DISABLE", value: 0)
!305 = !DIEnumerator(name: "ENABLE", value: 1)
!306 = !{!307, !19, !321, !47, !322, !323, !329, !243, !342, !353}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !14, line: 438, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 424, size: 320, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !309, file: !14, line: 426, baseType: !18, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !309, file: !14, line: 427, baseType: !18, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !309, file: !14, line: 428, baseType: !18, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !309, file: !14, line: 429, baseType: !18, size: 32, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !309, file: !14, line: 430, baseType: !18, size: 32, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !309, file: !14, line: 431, baseType: !18, size: 32, offset: 160)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !309, file: !14, line: 432, baseType: !18, size: 32, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !309, file: !14, line: 433, baseType: !18, size: 32, offset: 224)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !309, file: !14, line: 434, baseType: !18, size: 32, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !309, file: !14, line: 435, baseType: !18, size: 32, offset: 288)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !14, line: 418, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 414, size: 64, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !325, file: !14, line: 416, baseType: !18, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !325, file: !14, line: 417, baseType: !18, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !14, line: 336, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 325, size: 288, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !331, file: !14, line: 327, baseType: !18, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !331, file: !14, line: 328, baseType: !18, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !331, file: !14, line: 329, baseType: !18, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !331, file: !14, line: 330, baseType: !18, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !331, file: !14, line: 331, baseType: !18, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !331, file: !14, line: 332, baseType: !18, size: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !331, file: !14, line: 333, baseType: !18, size: 32, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !331, file: !14, line: 334, baseType: !18, size: 32, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !331, file: !14, line: 335, baseType: !18, size: 32, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !14, line: 367, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 358, size: 224, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351, !352}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "CRL", scope: !344, file: !14, line: 360, baseType: !18, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "CRH", scope: !344, file: !14, line: 361, baseType: !18, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !344, file: !14, line: 362, baseType: !18, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !344, file: !14, line: 363, baseType: !18, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !344, file: !14, line: 364, baseType: !18, size: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !344, file: !14, line: 365, baseType: !18, size: 32, offset: 160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !344, file: !14, line: 366, baseType: !18, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !356, retainedTypes: !357, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_cortex.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "83cb8d6817603f64d73dca2a0b01efa1")
!356 = !{!107}
!357 = !{!358, !19, !366, !391, !47, !393}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !34, line: 700, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 694, size: 128, elements: !361)
!361 = !{!362, !363, !364, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !360, file: !34, line: 696, baseType: !18, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !360, file: !34, line: 697, baseType: !18, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !360, file: !34, line: 698, baseType: !18, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !360, file: !34, line: 699, baseType: !38, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !34, line: 397, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 374, size: 1120, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !368, file: !34, line: 376, baseType: !38, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !368, file: !34, line: 377, baseType: !18, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !368, file: !34, line: 378, baseType: !18, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !368, file: !34, line: 379, baseType: !18, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !368, file: !34, line: 380, baseType: !18, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !368, file: !34, line: 381, baseType: !18, size: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !368, file: !34, line: 382, baseType: !45, size: 96, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !368, file: !34, line: 383, baseType: !18, size: 32, offset: 288)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !368, file: !34, line: 384, baseType: !18, size: 32, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !368, file: !34, line: 385, baseType: !18, size: 32, offset: 352)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !368, file: !34, line: 386, baseType: !18, size: 32, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !368, file: !34, line: 387, baseType: !18, size: 32, offset: 416)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !368, file: !34, line: 388, baseType: !18, size: 32, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !368, file: !34, line: 389, baseType: !18, size: 32, offset: 480)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !368, file: !34, line: 390, baseType: !60, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !368, file: !34, line: 391, baseType: !38, size: 32, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !368, file: !34, line: 392, baseType: !38, size: 32, offset: 608)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !368, file: !34, line: 393, baseType: !66, size: 128, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !368, file: !34, line: 394, baseType: !70, size: 160, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !368, file: !34, line: 395, baseType: !74, size: 160, offset: 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !368, file: !34, line: 396, baseType: !18, size: 32, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !20, line: 44, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !22, line: 77, baseType: !108)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !34, line: 355, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 340, size: 28704, elements: !396)
!396 = !{!397, !399, !403, !404, !405, !406, !407, !408, !409, !410, !414, !418, !422}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !395, file: !34, line: 342, baseType: !398, size: 256)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 256, elements: !83)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !395, file: !34, line: 343, baseType: !400, size: 768, offset: 256)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 768, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 24)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !395, file: !34, line: 344, baseType: !398, size: 256, offset: 1024)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !395, file: !34, line: 345, baseType: !400, size: 768, offset: 1280)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !395, file: !34, line: 346, baseType: !398, size: 256, offset: 2048)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !395, file: !34, line: 347, baseType: !400, size: 768, offset: 2304)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !395, file: !34, line: 348, baseType: !398, size: 256, offset: 3072)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !395, file: !34, line: 349, baseType: !400, size: 768, offset: 3328)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !395, file: !34, line: 350, baseType: !398, size: 256, offset: 4096)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !395, file: !34, line: 351, baseType: !411, size: 1792, offset: 4352)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1792, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 56)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !395, file: !34, line: 352, baseType: !415, size: 1920, offset: 6144)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 1920, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 240)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !395, file: !34, line: 353, baseType: !419, size: 20608, offset: 8064)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 20608, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 644)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !395, file: !34, line: 354, baseType: !18, size: 32, offset: 28672)
!423 = !{!"Ubuntu clang version 14.0.6"}
!424 = !{i32 7, !"Dwarf Version", i32 5}
!425 = !{i32 2, !"Debug Info Version", i32 3}
!426 = !{i32 1, !"wchar_size", i32 4}
!427 = !{i32 1, !"min_enum_size", i32 4}
!428 = !{i32 1, !"branch-target-enforcement", i32 0}
!429 = !{i32 1, !"sign-return-address", i32 0}
!430 = !{i32 1, !"sign-return-address-all", i32 0}
!431 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!432 = !{i32 7, !"frame-pointer", i32 2}
!433 = distinct !DISubprogram(name: "main", scope: !212, file: !212, line: 12, type: !434, scopeLine: 13, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !211, retainedNodes: !439)
!434 = !DISubroutineType(types: !435)
!435 = !{!108, !108, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!439 = !{!440, !441, !442, !444}
!440 = !DILocalVariable(name: "argc", arg: 1, scope: !433, file: !212, line: 12, type: !108)
!441 = !DILocalVariable(name: "argv", arg: 2, scope: !433, file: !212, line: 12, type: !436)
!442 = !DILocalVariable(name: "tmpreg", scope: !443, file: !212, line: 20, type: !18)
!443 = distinct !DILexicalBlock(scope: !433, file: !212, line: 20, column: 5)
!444 = !DILocalVariable(name: "GPIO_InitStruct", scope: !433, file: !212, line: 26, type: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_InitTypeDef", file: !221, line: 60, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 47, size: 128, flags: DIFlagTypePassByValue, elements: !447, identifier: "_ZTS16GPIO_InitTypeDef")
!447 = !{!448, !449, !450, !451}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Pin", scope: !446, file: !221, line: 49, baseType: !19, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !446, file: !221, line: 52, baseType: !19, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Pull", scope: !446, file: !221, line: 55, baseType: !19, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Speed", scope: !446, file: !221, line: 58, baseType: !19, size: 32, offset: 96)
!452 = !DILocation(line: 0, scope: !433)
!453 = !DILocation(line: 14, column: 5, scope: !433)
!454 = !DILocation(line: 17, column: 5, scope: !433)
!455 = !DILocation(line: 20, column: 5, scope: !443)
!456 = !{!457, !458, i64 24}
!457 = !{!"_ZTS11RCC_TypeDef", !458, i64 0, !458, i64 4, !458, i64 8, !458, i64 12, !458, i64 16, !458, i64 20, !458, i64 24, !458, i64 28, !458, i64 32, !458, i64 36}
!458 = !{!"int", !459, i64 0}
!459 = !{!"omnipotent char", !460, i64 0}
!460 = !{!"Simple C++ TBAA"}
!461 = !{!458, !458, i64 0}
!462 = !DILocation(line: 20, column: 5, scope: !433)
!463 = !DILocation(line: 23, column: 5, scope: !433)
!464 = !DILocation(line: 26, column: 5, scope: !433)
!465 = !DILocation(line: 26, column: 22, scope: !433)
!466 = !DILocation(line: 27, column: 21, scope: !433)
!467 = !DILocation(line: 27, column: 25, scope: !433)
!468 = !{!469, !458, i64 0}
!469 = !{!"_ZTS16GPIO_InitTypeDef", !458, i64 0, !458, i64 4, !458, i64 8, !458, i64 12}
!470 = !DILocation(line: 28, column: 21, scope: !433)
!471 = !DILocation(line: 28, column: 26, scope: !433)
!472 = !{!469, !458, i64 4}
!473 = !DILocation(line: 29, column: 21, scope: !433)
!474 = !DILocation(line: 29, column: 26, scope: !433)
!475 = !{!469, !458, i64 8}
!476 = !DILocation(line: 30, column: 21, scope: !433)
!477 = !DILocation(line: 30, column: 27, scope: !433)
!478 = !{!469, !458, i64 12}
!479 = !DILocation(line: 31, column: 5, scope: !433)
!480 = !DILocation(line: 33, column: 5, scope: !433)
!481 = !DILocation(line: 34, column: 9, scope: !482)
!482 = distinct !DILexicalBlock(scope: !433, file: !212, line: 33, column: 15)
!483 = !DILocation(line: 35, column: 9, scope: !482)
!484 = distinct !{!484, !480, !485, !486, !487}
!485 = !DILocation(line: 36, column: 5, scope: !433)
!486 = !{!"llvm.loop.mustprogress"}
!487 = !{!"llvm.loop.unroll.disable"}
!488 = distinct !DISubprogram(name: "SystemClock_Config", linkageName: "_ZL18SystemClock_Configv", scope: !212, file: !212, line: 39, type: !489, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !211, retainedNodes: !491)
!489 = !DISubroutineType(types: !490)
!490 = !{null}
!491 = !{!492, !512}
!492 = !DILocalVariable(name: "RCC_OscInitStruct", scope: !488, file: !212, line: 41, type: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_OscInitTypeDef", file: !494, line: 261, baseType: !495)
!494 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_rcc_ex.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "49bf7e29630a7d603739687645591a41")
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 228, size: 320, flags: DIFlagTypePassByValue, elements: !496, identifier: "_ZTS18RCC_OscInitTypeDef")
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "OscillatorType", scope: !495, file: !494, line: 230, baseType: !19, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "HSEState", scope: !495, file: !494, line: 238, baseType: !19, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "HSEPredivValue", scope: !495, file: !494, line: 241, baseType: !19, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "LSEState", scope: !495, file: !494, line: 244, baseType: !19, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "HSIState", scope: !495, file: !494, line: 247, baseType: !19, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "HSICalibrationValue", scope: !495, file: !494, line: 250, baseType: !19, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "LSIState", scope: !495, file: !494, line: 253, baseType: !19, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "PLL", scope: !495, file: !494, line: 256, baseType: !505, size: 96, offset: 224)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_PLLInitTypeDef", file: !506, line: 59, baseType: !507)
!506 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_rcc.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "3e0cb02f236e8f5a4c479e8d7b418957")
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 49, size: 96, flags: DIFlagTypePassByValue, elements: !508, identifier: "_ZTS18RCC_PLLInitTypeDef")
!508 = !{!509, !510, !511}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "PLLState", scope: !507, file: !506, line: 51, baseType: !19, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSource", scope: !507, file: !506, line: 54, baseType: !19, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "PLLMUL", scope: !507, file: !506, line: 57, baseType: !19, size: 32, offset: 64)
!512 = !DILocalVariable(name: "RCC_ClkInitStruct", scope: !488, file: !212, line: 42, type: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_ClkInitTypeDef", file: !506, line: 80, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 64, size: 160, flags: DIFlagTypePassByValue, elements: !515, identifier: "_ZTS18RCC_ClkInitTypeDef")
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ClockType", scope: !514, file: !506, line: 66, baseType: !19, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCLKSource", scope: !514, file: !506, line: 69, baseType: !19, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "AHBCLKDivider", scope: !514, file: !506, line: 72, baseType: !19, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "APB1CLKDivider", scope: !514, file: !506, line: 75, baseType: !19, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "APB2CLKDivider", scope: !514, file: !506, line: 78, baseType: !19, size: 32, offset: 128)
!521 = !DILocation(line: 41, column: 5, scope: !488)
!522 = !DILocation(line: 41, column: 24, scope: !488)
!523 = !DILocation(line: 42, column: 5, scope: !488)
!524 = !DILocation(line: 42, column: 24, scope: !488)
!525 = !DILocation(line: 46, column: 23, scope: !488)
!526 = !DILocation(line: 46, column: 38, scope: !488)
!527 = !{!528, !458, i64 0}
!528 = !{!"_ZTS18RCC_OscInitTypeDef", !458, i64 0, !458, i64 4, !458, i64 8, !458, i64 12, !458, i64 16, !458, i64 20, !458, i64 24, !529, i64 28}
!529 = !{!"_ZTS18RCC_PLLInitTypeDef", !458, i64 0, !458, i64 4, !458, i64 8}
!530 = !DILocation(line: 47, column: 23, scope: !488)
!531 = !DILocation(line: 47, column: 32, scope: !488)
!532 = !{!528, !458, i64 16}
!533 = !DILocation(line: 48, column: 23, scope: !488)
!534 = !DILocation(line: 48, column: 43, scope: !488)
!535 = !{!528, !458, i64 20}
!536 = !DILocation(line: 49, column: 27, scope: !488)
!537 = !DILocation(line: 49, column: 36, scope: !488)
!538 = !{!528, !458, i64 28}
!539 = !DILocation(line: 50, column: 27, scope: !488)
!540 = !DILocation(line: 50, column: 37, scope: !488)
!541 = !{!528, !458, i64 32}
!542 = !DILocation(line: 51, column: 27, scope: !488)
!543 = !DILocation(line: 51, column: 34, scope: !488)
!544 = !{!528, !458, i64 36}
!545 = !DILocation(line: 52, column: 5, scope: !488)
!546 = !DILocation(line: 56, column: 23, scope: !488)
!547 = !DILocation(line: 57, column: 9, scope: !488)
!548 = !{!549, !458, i64 0}
!549 = !{!"_ZTS18RCC_ClkInitTypeDef", !458, i64 0, !458, i64 4, !458, i64 8, !458, i64 12, !458, i64 16}
!550 = !DILocation(line: 58, column: 23, scope: !488)
!551 = !DILocation(line: 58, column: 36, scope: !488)
!552 = !{!549, !458, i64 4}
!553 = !DILocation(line: 59, column: 23, scope: !488)
!554 = !DILocation(line: 59, column: 37, scope: !488)
!555 = !{!549, !458, i64 8}
!556 = !DILocation(line: 60, column: 23, scope: !488)
!557 = !DILocation(line: 60, column: 38, scope: !488)
!558 = !{!549, !458, i64 12}
!559 = !DILocation(line: 61, column: 23, scope: !488)
!560 = !DILocation(line: 61, column: 38, scope: !488)
!561 = !{!549, !458, i64 16}
!562 = !DILocation(line: 63, column: 5, scope: !488)
!563 = !DILocation(line: 64, column: 1, scope: !488)
!564 = distinct !DISubprogram(name: "SysTick_Handler", scope: !212, file: !212, line: 68, type: !489, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !211, retainedNodes: !565)
!565 = !{}
!566 = !DILocation(line: 70, column: 5, scope: !564)
!567 = !DILocation(line: 71, column: 1, scope: !564)
!568 = distinct !DISubprogram(name: "SystemInit", scope: !3, file: !3, line: 157, type: !489, scopeLine: 158, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !565)
!569 = !DILocation(line: 161, column: 11, scope: !568)
!570 = !{!571, !572, i64 0}
!571 = !{!"", !572, i64 0, !572, i64 4, !572, i64 8, !572, i64 12, !572, i64 16, !572, i64 20, !572, i64 24, !572, i64 28, !572, i64 32, !572, i64 36}
!572 = !{!"int", !573, i64 0}
!573 = !{!"omnipotent char", !574, i64 0}
!574 = !{!"Simple C/C++ TBAA"}
!575 = !DILocation(line: 165, column: 13, scope: !568)
!576 = !{!571, !572, i64 4}
!577 = !DILocation(line: 171, column: 11, scope: !568)
!578 = !DILocation(line: 174, column: 11, scope: !568)
!579 = !DILocation(line: 177, column: 13, scope: !568)
!580 = !DILocation(line: 196, column: 12, scope: !568)
!581 = !{!571, !572, i64 8}
!582 = !DILocation(line: 208, column: 13, scope: !568)
!583 = !{!584, !572, i64 8}
!584 = !{!"", !572, i64 0, !572, i64 4, !572, i64 8, !572, i64 12, !572, i64 16, !572, i64 20, !573, i64 24, !572, i64 36, !572, i64 40, !572, i64 44, !572, i64 48, !572, i64 52, !572, i64 56, !572, i64 60, !573, i64 64, !572, i64 72, !572, i64 76, !573, i64 80, !573, i64 96, !573, i64 116, !572, i64 136}
!585 = !DILocation(line: 210, column: 1, scope: !568)
!586 = distinct !DISubprogram(name: "SystemCoreClockUpdate", scope: !3, file: !3, line: 247, type: !489, scopeLine: 248, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !587)
!587 = !{!588, !589, !590}
!588 = !DILocalVariable(name: "tmp", scope: !586, file: !3, line: 249, type: !19)
!589 = !DILocalVariable(name: "pllmull", scope: !586, file: !3, line: 249, type: !19)
!590 = !DILocalVariable(name: "pllsource", scope: !586, file: !3, line: 249, type: !19)
!591 = !DILocation(line: 0, scope: !586)
!592 = !DILocation(line: 260, column: 14, scope: !586)
!593 = !DILocation(line: 260, column: 19, scope: !586)
!594 = !DILocation(line: 262, column: 3, scope: !586)
!595 = !DILocation(line: 273, column: 22, scope: !596)
!596 = distinct !DILexicalBlock(scope: !586, file: !3, line: 263, column: 3)
!597 = !DILocation(line: 274, column: 24, scope: !596)
!598 = !DILocation(line: 274, column: 29, scope: !596)
!599 = !DILocation(line: 277, column: 27, scope: !596)
!600 = !DILocation(line: 277, column: 35, scope: !596)
!601 = !DILocation(line: 279, column: 21, scope: !602)
!602 = distinct !DILexicalBlock(scope: !596, file: !3, line: 279, column: 11)
!603 = !DILocation(line: 279, column: 11, scope: !596)
!604 = !DILocation(line: 282, column: 45, scope: !605)
!605 = distinct !DILexicalBlock(scope: !602, file: !3, line: 280, column: 7)
!606 = !DILocation(line: 283, column: 7, scope: !605)
!607 = !DILocation(line: 292, column: 19, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !3, line: 292, column: 13)
!609 = distinct !DILexicalBlock(scope: !602, file: !3, line: 285, column: 7)
!610 = !DILocation(line: 292, column: 24, scope: !608)
!611 = !DILocation(line: 292, column: 45, scope: !608)
!612 = !DILocation(line: 292, column: 13, scope: !609)
!613 = !DILocation(line: 294, column: 47, scope: !614)
!614 = distinct !DILexicalBlock(scope: !608, file: !3, line: 293, column: 9)
!615 = !DILocation(line: 295, column: 9, scope: !614)
!616 = !DILocation(line: 298, column: 39, scope: !617)
!617 = distinct !DILexicalBlock(scope: !608, file: !3, line: 297, column: 9)
!618 = !DILocation(line: 0, scope: !596)
!619 = !{!572, !572, i64 0}
!620 = !DILocation(line: 350, column: 30, scope: !586)
!621 = !DILocation(line: 350, column: 52, scope: !586)
!622 = !DILocation(line: 350, column: 9, scope: !586)
!623 = !{!573, !573, i64 0}
!624 = !DILocation(line: 352, column: 19, scope: !586)
!625 = !DILocation(line: 353, column: 1, scope: !586)
!626 = distinct !DISubprogram(name: "HAL_GPIO_Init", scope: !247, file: !247, line: 178, type: !627, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !246, retainedNodes: !637)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !278, !629}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_InitTypeDef", file: !221, line: 60, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 47, size: 128, elements: !632)
!632 = !{!633, !634, !635, !636}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Pin", scope: !631, file: !221, line: 49, baseType: !19, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !631, file: !221, line: 52, baseType: !19, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Pull", scope: !631, file: !221, line: 55, baseType: !19, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Speed", scope: !631, file: !221, line: 58, baseType: !19, size: 32, offset: 96)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!638 = !DILocalVariable(name: "GPIOx", arg: 1, scope: !626, file: !247, line: 178, type: !278)
!639 = !DILocalVariable(name: "GPIO_Init", arg: 2, scope: !626, file: !247, line: 178, type: !629)
!640 = !DILocalVariable(name: "position", scope: !626, file: !247, line: 180, type: !19)
!641 = !DILocalVariable(name: "ioposition", scope: !626, file: !247, line: 181, type: !19)
!642 = !DILocalVariable(name: "iocurrent", scope: !626, file: !247, line: 182, type: !19)
!643 = !DILocalVariable(name: "temp", scope: !626, file: !247, line: 183, type: !19)
!644 = !DILocalVariable(name: "config", scope: !626, file: !247, line: 184, type: !19)
!645 = !DILocalVariable(name: "configregister", scope: !626, file: !247, line: 185, type: !322)
!646 = !DILocalVariable(name: "registeroffset", scope: !626, file: !247, line: 186, type: !19)
!647 = !DILocalVariable(name: "tmpreg", scope: !648, file: !247, line: 291, type: !18)
!648 = distinct !DILexicalBlock(scope: !649, file: !247, line: 291, column: 9)
!649 = distinct !DILexicalBlock(scope: !650, file: !247, line: 289, column: 7)
!650 = distinct !DILexicalBlock(scope: !651, file: !247, line: 288, column: 11)
!651 = distinct !DILexicalBlock(scope: !652, file: !247, line: 203, column: 5)
!652 = distinct !DILexicalBlock(scope: !653, file: !247, line: 202, column: 9)
!653 = distinct !DILexicalBlock(scope: !626, file: !247, line: 195, column: 3)
!654 = !DILocation(line: 0, scope: !626)
!655 = !DILocation(line: 194, column: 23, scope: !626)
!656 = !{!657, !572, i64 0}
!657 = !{!"", !572, i64 0, !572, i64 4, !572, i64 8, !572, i64 12}
!658 = !DILocation(line: 194, column: 41, scope: !626)
!659 = !DILocation(line: 194, column: 3, scope: !626)
!660 = !DILocation(line: 197, column: 26, scope: !653)
!661 = !DILocation(line: 200, column: 44, scope: !653)
!662 = !DILocation(line: 202, column: 19, scope: !652)
!663 = !DILocation(line: 202, column: 9, scope: !653)
!664 = !DILocation(line: 208, column: 26, scope: !651)
!665 = !{!657, !572, i64 4}
!666 = !DILocation(line: 208, column: 7, scope: !651)
!667 = !DILocation(line: 214, column: 31, scope: !668)
!668 = distinct !DILexicalBlock(scope: !651, file: !247, line: 209, column: 7)
!669 = !{!657, !572, i64 12}
!670 = !DILocation(line: 215, column: 11, scope: !668)
!671 = !DILocation(line: 221, column: 31, scope: !668)
!672 = !DILocation(line: 221, column: 37, scope: !668)
!673 = !DILocation(line: 222, column: 11, scope: !668)
!674 = !DILocation(line: 228, column: 31, scope: !668)
!675 = !DILocation(line: 228, column: 37, scope: !668)
!676 = !DILocation(line: 229, column: 11, scope: !668)
!677 = !DILocation(line: 235, column: 31, scope: !668)
!678 = !DILocation(line: 235, column: 37, scope: !668)
!679 = !DILocation(line: 236, column: 11, scope: !668)
!680 = !DILocation(line: 248, column: 26, scope: !681)
!681 = distinct !DILexicalBlock(scope: !668, file: !247, line: 248, column: 15)
!682 = !{!657, !572, i64 8}
!683 = !DILocation(line: 248, column: 15, scope: !668)
!684 = !DILocation(line: 257, column: 25, scope: !685)
!685 = distinct !DILexicalBlock(scope: !686, file: !247, line: 253, column: 11)
!686 = distinct !DILexicalBlock(scope: !681, file: !247, line: 252, column: 20)
!687 = !{!688, !572, i64 16}
!688 = !{!"", !572, i64 0, !572, i64 4, !572, i64 8, !572, i64 12, !572, i64 16, !572, i64 20, !572, i64 24}
!689 = !DILocation(line: 258, column: 11, scope: !685)
!690 = !DILocation(line: 264, column: 24, scope: !691)
!691 = distinct !DILexicalBlock(scope: !686, file: !247, line: 260, column: 11)
!692 = !{!688, !572, i64 20}
!693 = !DILocation(line: 271, column: 11, scope: !668)
!694 = !DILocation(line: 280, column: 35, scope: !651)
!695 = !DILocation(line: 280, column: 24, scope: !651)
!696 = !DILocation(line: 281, column: 24, scope: !651)
!697 = !DILocation(line: 284, column: 7, scope: !651)
!698 = !DILocation(line: 288, column: 23, scope: !650)
!699 = !DILocation(line: 288, column: 28, scope: !650)
!700 = !DILocation(line: 288, column: 41, scope: !650)
!701 = !DILocation(line: 288, column: 11, scope: !651)
!702 = !DILocation(line: 291, column: 9, scope: !648)
!703 = !{!571, !572, i64 24}
!704 = !DILocation(line: 291, column: 9, scope: !649)
!705 = !DILocation(line: 292, column: 38, scope: !649)
!706 = !DILocation(line: 292, column: 16, scope: !649)
!707 = !DILocation(line: 293, column: 9, scope: !649)
!708 = !DILocation(line: 294, column: 9, scope: !649)
!709 = !DILocation(line: 295, column: 38, scope: !649)
!710 = !DILocation(line: 299, column: 25, scope: !711)
!711 = distinct !DILexicalBlock(scope: !649, file: !247, line: 299, column: 13)
!712 = !DILocation(line: 299, column: 30, scope: !711)
!713 = !DILocation(line: 299, column: 46, scope: !711)
!714 = !DILocation(line: 299, column: 13, scope: !649)
!715 = !DILocation(line: 301, column: 11, scope: !716)
!716 = distinct !DILexicalBlock(scope: !711, file: !247, line: 300, column: 9)
!717 = !{!718, !572, i64 0}
!718 = !{!"", !572, i64 0, !572, i64 4, !572, i64 8, !572, i64 12, !572, i64 16, !572, i64 20}
!719 = !DILocation(line: 302, column: 9, scope: !716)
!720 = !DILocation(line: 305, column: 11, scope: !721)
!721 = distinct !DILexicalBlock(scope: !711, file: !247, line: 304, column: 9)
!722 = !DILocation(line: 0, scope: !711)
!723 = !DILocation(line: 309, column: 30, scope: !724)
!724 = distinct !DILexicalBlock(scope: !649, file: !247, line: 309, column: 13)
!725 = !DILocation(line: 309, column: 47, scope: !724)
!726 = !DILocation(line: 309, column: 13, scope: !649)
!727 = !DILocation(line: 311, column: 11, scope: !728)
!728 = distinct !DILexicalBlock(scope: !724, file: !247, line: 310, column: 9)
!729 = !{!718, !572, i64 4}
!730 = !DILocation(line: 312, column: 9, scope: !728)
!731 = !DILocation(line: 315, column: 11, scope: !732)
!732 = distinct !DILexicalBlock(scope: !724, file: !247, line: 314, column: 9)
!733 = !DILocation(line: 0, scope: !724)
!734 = !DILocation(line: 319, column: 30, scope: !735)
!735 = distinct !DILexicalBlock(scope: !649, file: !247, line: 319, column: 13)
!736 = !DILocation(line: 319, column: 45, scope: !735)
!737 = !DILocation(line: 319, column: 13, scope: !649)
!738 = !DILocation(line: 321, column: 11, scope: !739)
!739 = distinct !DILexicalBlock(scope: !735, file: !247, line: 320, column: 9)
!740 = !{!718, !572, i64 8}
!741 = !DILocation(line: 322, column: 9, scope: !739)
!742 = !DILocation(line: 325, column: 11, scope: !743)
!743 = distinct !DILexicalBlock(scope: !735, file: !247, line: 324, column: 9)
!744 = !DILocation(line: 0, scope: !735)
!745 = !DILocation(line: 329, column: 30, scope: !746)
!746 = distinct !DILexicalBlock(scope: !649, file: !247, line: 329, column: 13)
!747 = !DILocation(line: 329, column: 46, scope: !746)
!748 = !DILocation(line: 329, column: 13, scope: !649)
!749 = !DILocation(line: 331, column: 11, scope: !750)
!750 = distinct !DILexicalBlock(scope: !746, file: !247, line: 330, column: 9)
!751 = !{!718, !572, i64 12}
!752 = !DILocation(line: 332, column: 9, scope: !750)
!753 = !DILocation(line: 335, column: 11, scope: !754)
!754 = distinct !DILexicalBlock(scope: !746, file: !247, line: 334, column: 9)
!755 = !DILocation(line: 0, scope: !746)
!756 = !DILocation(line: 340, column: 10, scope: !653)
!757 = !DILocation(line: 184, column: 12, scope: !626)
!758 = !DILocation(line: 194, column: 28, scope: !626)
!759 = distinct !{!759, !659, !760, !486, !487}
!760 = !DILocation(line: 341, column: 3, scope: !626)
!761 = !DILocation(line: 342, column: 1, scope: !626)
!762 = distinct !DISubprogram(name: "HAL_GPIO_DeInit", scope: !247, file: !247, line: 351, type: !763, scopeLine: 352, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !246, retainedNodes: !765)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !278, !19}
!765 = !{!766, !767, !768, !769, !770, !771, !772}
!766 = !DILocalVariable(name: "GPIOx", arg: 1, scope: !762, file: !247, line: 351, type: !278)
!767 = !DILocalVariable(name: "GPIO_Pin", arg: 2, scope: !762, file: !247, line: 351, type: !19)
!768 = !DILocalVariable(name: "position", scope: !762, file: !247, line: 353, type: !19)
!769 = !DILocalVariable(name: "iocurrent", scope: !762, file: !247, line: 354, type: !19)
!770 = !DILocalVariable(name: "tmp", scope: !762, file: !247, line: 355, type: !19)
!771 = !DILocalVariable(name: "configregister", scope: !762, file: !247, line: 356, type: !322)
!772 = !DILocalVariable(name: "registeroffset", scope: !762, file: !247, line: 357, type: !19)
!773 = !DILocation(line: 0, scope: !762)
!774 = !DILocation(line: 364, column: 33, scope: !762)
!775 = !DILocation(line: 364, column: 3, scope: !762)
!776 = !DILocation(line: 367, column: 35, scope: !777)
!777 = distinct !DILexicalBlock(scope: !762, file: !247, line: 365, column: 3)
!778 = !DILocation(line: 367, column: 28, scope: !777)
!779 = !DILocation(line: 369, column: 9, scope: !780)
!780 = distinct !DILexicalBlock(scope: !777, file: !247, line: 369, column: 9)
!781 = !DILocation(line: 369, column: 9, scope: !777)
!782 = !DILocation(line: 374, column: 35, scope: !783)
!783 = distinct !DILexicalBlock(scope: !780, file: !247, line: 370, column: 5)
!784 = !DILocation(line: 374, column: 13, scope: !783)
!785 = !DILocation(line: 375, column: 28, scope: !783)
!786 = !DILocation(line: 375, column: 21, scope: !783)
!787 = !DILocation(line: 375, column: 11, scope: !783)
!788 = !DILocation(line: 376, column: 19, scope: !789)
!789 = distinct !DILexicalBlock(scope: !783, file: !247, line: 376, column: 11)
!790 = !DILocation(line: 376, column: 41, scope: !789)
!791 = !DILocation(line: 376, column: 15, scope: !789)
!792 = !DILocation(line: 376, column: 11, scope: !783)
!793 = !DILocation(line: 379, column: 9, scope: !794)
!794 = distinct !DILexicalBlock(scope: !789, file: !247, line: 377, column: 7)
!795 = !DILocation(line: 382, column: 9, scope: !794)
!796 = !DILocation(line: 383, column: 9, scope: !794)
!797 = !DILocation(line: 386, column: 9, scope: !794)
!798 = !DILocation(line: 387, column: 9, scope: !794)
!799 = !DILocation(line: 388, column: 7, scope: !794)
!800 = !DILocation(line: 392, column: 35, scope: !783)
!801 = !DILocation(line: 392, column: 24, scope: !783)
!802 = !DILocation(line: 393, column: 24, scope: !783)
!803 = !DILocation(line: 396, column: 7, scope: !783)
!804 = !DILocation(line: 399, column: 7, scope: !783)
!805 = !{!688, !572, i64 12}
!806 = !DILocation(line: 400, column: 5, scope: !783)
!807 = !DILocation(line: 402, column: 13, scope: !777)
!808 = !DILocation(line: 364, column: 20, scope: !762)
!809 = distinct !{!809, !775, !810, !486, !487}
!810 = !DILocation(line: 403, column: 3, scope: !762)
!811 = !DILocation(line: 404, column: 1, scope: !762)
!812 = distinct !DISubprogram(name: "HAL_GPIO_ReadPin", scope: !247, file: !247, line: 431, type: !813, scopeLine: 432, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !246, retainedNodes: !816)
!813 = !DISubroutineType(types: !814)
!814 = !{!815, !278, !243}
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PinState", file: !221, line: 69, baseType: !249)
!816 = !{!817, !818, !819}
!817 = !DILocalVariable(name: "GPIOx", arg: 1, scope: !812, file: !247, line: 431, type: !278)
!818 = !DILocalVariable(name: "GPIO_Pin", arg: 2, scope: !812, file: !247, line: 431, type: !243)
!819 = !DILocalVariable(name: "bitstatus", scope: !812, file: !247, line: 433, type: !815)
!820 = !DILocation(line: 0, scope: !812)
!821 = !DILocation(line: 438, column: 15, scope: !822)
!822 = distinct !DILexicalBlock(scope: !812, file: !247, line: 438, column: 7)
!823 = !{!688, !572, i64 8}
!824 = !DILocation(line: 438, column: 21, scope: !822)
!825 = !DILocation(line: 438, column: 19, scope: !822)
!826 = !DILocation(line: 438, column: 31, scope: !822)
!827 = !DILocation(line: 446, column: 3, scope: !812)
!828 = distinct !DISubprogram(name: "HAL_GPIO_WritePin", scope: !247, file: !247, line: 465, type: !829, scopeLine: 466, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !246, retainedNodes: !831)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !278, !243, !815}
!831 = !{!832, !833, !834}
!832 = !DILocalVariable(name: "GPIOx", arg: 1, scope: !828, file: !247, line: 465, type: !278)
!833 = !DILocalVariable(name: "GPIO_Pin", arg: 2, scope: !828, file: !247, line: 465, type: !243)
!834 = !DILocalVariable(name: "PinState", arg: 3, scope: !828, file: !247, line: 465, type: !815)
!835 = !DILocation(line: 0, scope: !828)
!836 = !DILocation(line: 471, column: 16, scope: !837)
!837 = distinct !DILexicalBlock(scope: !828, file: !247, line: 471, column: 7)
!838 = !DILocation(line: 0, scope: !837)
!839 = !DILocation(line: 471, column: 7, scope: !828)
!840 = !DILocation(line: 479, column: 1, scope: !828)
!841 = distinct !DISubprogram(name: "HAL_GPIO_TogglePin", scope: !247, file: !247, line: 487, type: !842, scopeLine: 488, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !246, retainedNodes: !844)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !278, !243}
!844 = !{!845, !846}
!845 = !DILocalVariable(name: "GPIOx", arg: 1, scope: !841, file: !247, line: 487, type: !278)
!846 = !DILocalVariable(name: "GPIO_Pin", arg: 2, scope: !841, file: !247, line: 487, type: !243)
!847 = !DILocation(line: 0, scope: !841)
!848 = !DILocation(line: 492, column: 15, scope: !849)
!849 = distinct !DILexicalBlock(scope: !841, file: !247, line: 492, column: 7)
!850 = !DILocation(line: 492, column: 21, scope: !849)
!851 = !DILocation(line: 492, column: 19, scope: !849)
!852 = !DILocation(line: 492, column: 31, scope: !849)
!853 = !DILocation(line: 492, column: 7, scope: !841)
!854 = !DILocation(line: 0, scope: !849)
!855 = !DILocation(line: 500, column: 1, scope: !841)
!856 = distinct !DISubprogram(name: "HAL_GPIO_LockPin", scope: !247, file: !247, line: 512, type: !857, scopeLine: 513, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !246, retainedNodes: !860)
!857 = !DISubroutineType(types: !858)
!858 = !{!859, !278, !243}
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_StatusTypeDef", file: !101, line: 47, baseType: !100)
!860 = !{!861, !862, !863}
!861 = !DILocalVariable(name: "GPIOx", arg: 1, scope: !856, file: !247, line: 512, type: !278)
!862 = !DILocalVariable(name: "GPIO_Pin", arg: 2, scope: !856, file: !247, line: 512, type: !243)
!863 = !DILocalVariable(name: "tmp", scope: !856, file: !247, line: 514, type: !18)
!864 = !DILocation(line: 0, scope: !856)
!865 = !DILocation(line: 514, column: 3, scope: !856)
!866 = !DILocation(line: 514, column: 17, scope: !856)
!867 = !DILocation(line: 521, column: 3, scope: !856)
!868 = !DILocation(line: 523, column: 17, scope: !856)
!869 = !DILocation(line: 523, column: 10, scope: !856)
!870 = !DILocation(line: 523, column: 15, scope: !856)
!871 = !{!688, !572, i64 24}
!872 = !DILocation(line: 525, column: 15, scope: !856)
!873 = !DILocation(line: 527, column: 17, scope: !856)
!874 = !DILocation(line: 527, column: 15, scope: !856)
!875 = !DILocation(line: 529, column: 16, scope: !856)
!876 = !DILocation(line: 529, column: 7, scope: !856)
!877 = !DILocation(line: 532, column: 25, scope: !878)
!878 = distinct !DILexicalBlock(scope: !856, file: !247, line: 532, column: 7)
!879 = !DILocation(line: 0, scope: !878)
!880 = !DILocation(line: 540, column: 1, scope: !856)
!881 = distinct !DISubprogram(name: "HAL_GPIO_EXTI_IRQHandler", scope: !247, file: !247, line: 547, type: !882, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !246, retainedNodes: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !243}
!884 = !{!885}
!885 = !DILocalVariable(name: "GPIO_Pin", arg: 1, scope: !881, file: !247, line: 547, type: !243)
!886 = !DILocation(line: 0, scope: !881)
!887 = !DILocation(line: 550, column: 7, scope: !888)
!888 = distinct !DILexicalBlock(scope: !881, file: !247, line: 550, column: 7)
!889 = !{!718, !572, i64 20}
!890 = !DILocation(line: 550, column: 40, scope: !888)
!891 = !DILocation(line: 550, column: 7, scope: !881)
!892 = !DILocation(line: 552, column: 5, scope: !893)
!893 = distinct !DILexicalBlock(scope: !888, file: !247, line: 551, column: 3)
!894 = !DILocation(line: 553, column: 5, scope: !893)
!895 = !DILocation(line: 554, column: 3, scope: !893)
!896 = !DILocation(line: 555, column: 1, scope: !881)
!897 = distinct !DISubprogram(name: "HAL_GPIO_EXTI_Callback", scope: !247, file: !247, line: 562, type: !882, scopeLine: 563, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !246, retainedNodes: !898)
!898 = !{!899}
!899 = !DILocalVariable(name: "GPIO_Pin", arg: 1, scope: !897, file: !247, line: 562, type: !243)
!900 = !DILocation(line: 0, scope: !897)
!901 = !DILocation(line: 569, column: 1, scope: !897)
!902 = distinct !DISubprogram(name: "HAL_RCC_DeInit", scope: !300, file: !300, line: 202, type: !903, scopeLine: 203, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !299, retainedNodes: !905)
!903 = !DISubroutineType(types: !904)
!904 = !{!859}
!905 = !{!906}
!906 = !DILocalVariable(name: "tickstart", scope: !902, file: !300, line: 204, type: !19)
!907 = !DILocation(line: 207, column: 15, scope: !902)
!908 = !DILocation(line: 0, scope: !902)
!909 = !DILocation(line: 210, column: 3, scope: !902)
!910 = !DILocation(line: 213, column: 3, scope: !902)
!911 = !DILocation(line: 213, column: 10, scope: !902)
!912 = !DILocation(line: 213, column: 43, scope: !902)
!913 = !DILocation(line: 215, column: 10, scope: !914)
!914 = distinct !DILexicalBlock(scope: !915, file: !300, line: 215, column: 9)
!915 = distinct !DILexicalBlock(scope: !902, file: !300, line: 214, column: 3)
!916 = !DILocation(line: 215, column: 24, scope: !914)
!917 = !DILocation(line: 215, column: 37, scope: !914)
!918 = !DILocation(line: 215, column: 9, scope: !915)
!919 = distinct !{!919, !910, !920, !486, !487}
!920 = !DILocation(line: 219, column: 3, scope: !902)
!921 = !DILocation(line: 222, column: 3, scope: !902)
!922 = !DILocation(line: 225, column: 15, scope: !902)
!923 = !DILocation(line: 228, column: 3, scope: !902)
!924 = !DILocation(line: 231, column: 3, scope: !902)
!925 = !DILocation(line: 231, column: 10, scope: !902)
!926 = !DILocation(line: 231, column: 44, scope: !902)
!927 = !DILocation(line: 233, column: 10, scope: !928)
!928 = distinct !DILexicalBlock(scope: !929, file: !300, line: 233, column: 9)
!929 = distinct !DILexicalBlock(scope: !902, file: !300, line: 232, column: 3)
!930 = !DILocation(line: 233, column: 24, scope: !928)
!931 = !DILocation(line: 233, column: 37, scope: !928)
!932 = !DILocation(line: 233, column: 9, scope: !929)
!933 = distinct !{!933, !924, !934, !486, !487}
!934 = !DILocation(line: 237, column: 3, scope: !902)
!935 = !DILocation(line: 240, column: 19, scope: !902)
!936 = !DILocation(line: 243, column: 20, scope: !937)
!937 = distinct !DILexicalBlock(scope: !902, file: !300, line: 243, column: 7)
!938 = !DILocation(line: 243, column: 7, scope: !937)
!939 = !DILocation(line: 243, column: 32, scope: !937)
!940 = !DILocation(line: 243, column: 7, scope: !902)
!941 = !DILocation(line: 249, column: 15, scope: !902)
!942 = !DILocation(line: 252, column: 3, scope: !902)
!943 = !DILocation(line: 255, column: 3, scope: !902)
!944 = !DILocation(line: 255, column: 10, scope: !902)
!945 = !DILocation(line: 255, column: 43, scope: !902)
!946 = !DILocation(line: 257, column: 10, scope: !947)
!947 = distinct !DILexicalBlock(scope: !948, file: !300, line: 257, column: 9)
!948 = distinct !DILexicalBlock(scope: !902, file: !300, line: 256, column: 3)
!949 = !DILocation(line: 257, column: 24, scope: !947)
!950 = !DILocation(line: 257, column: 37, scope: !947)
!951 = !DILocation(line: 257, column: 9, scope: !948)
!952 = distinct !{!952, !943, !953, !486, !487}
!953 = !DILocation(line: 261, column: 3, scope: !902)
!954 = !DILocation(line: 264, column: 3, scope: !902)
!955 = !DILocation(line: 267, column: 15, scope: !902)
!956 = !DILocation(line: 270, column: 3, scope: !902)
!957 = !DILocation(line: 273, column: 3, scope: !902)
!958 = !DILocation(line: 273, column: 10, scope: !902)
!959 = !DILocation(line: 273, column: 43, scope: !902)
!960 = !DILocation(line: 275, column: 10, scope: !961)
!961 = distinct !DILexicalBlock(scope: !962, file: !300, line: 275, column: 9)
!962 = distinct !DILexicalBlock(scope: !902, file: !300, line: 274, column: 3)
!963 = !DILocation(line: 275, column: 24, scope: !961)
!964 = !DILocation(line: 275, column: 37, scope: !961)
!965 = !DILocation(line: 275, column: 9, scope: !962)
!966 = distinct !{!966, !957, !967, !486, !487}
!967 = !DILocation(line: 279, column: 3, scope: !902)
!968 = !DILocation(line: 282, column: 3, scope: !902)
!969 = !DILocation(line: 324, column: 3, scope: !902)
!970 = !{!571, !572, i64 36}
!971 = !DILocation(line: 327, column: 3, scope: !902)
!972 = !DILocation(line: 329, column: 3, scope: !902)
!973 = !DILocation(line: 330, column: 1, scope: !902)
!974 = distinct !DISubprogram(name: "HAL_RCC_OscConfig", scope: !300, file: !300, line: 347, type: !975, scopeLine: 348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !299, retainedNodes: !995)
!975 = !DISubroutineType(types: !976)
!976 = !{!859, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_OscInitTypeDef", file: !494, line: 261, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 228, size: 320, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !986, !987, !988}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "OscillatorType", scope: !979, file: !494, line: 230, baseType: !19, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "HSEState", scope: !979, file: !494, line: 238, baseType: !19, size: 32, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "HSEPredivValue", scope: !979, file: !494, line: 241, baseType: !19, size: 32, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "LSEState", scope: !979, file: !494, line: 244, baseType: !19, size: 32, offset: 96)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "HSIState", scope: !979, file: !494, line: 247, baseType: !19, size: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "HSICalibrationValue", scope: !979, file: !494, line: 250, baseType: !19, size: 32, offset: 160)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "LSIState", scope: !979, file: !494, line: 253, baseType: !19, size: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "PLL", scope: !979, file: !494, line: 256, baseType: !989, size: 96, offset: 224)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_PLLInitTypeDef", file: !506, line: 59, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 49, size: 96, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "PLLState", scope: !990, file: !506, line: 51, baseType: !19, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSource", scope: !990, file: !506, line: 54, baseType: !19, size: 32, offset: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "PLLMUL", scope: !990, file: !506, line: 57, baseType: !19, size: 32, offset: 64)
!995 = !{!996, !997, !998, !999, !1003}
!996 = !DILocalVariable(name: "RCC_OscInitStruct", arg: 1, scope: !974, file: !300, line: 347, type: !977)
!997 = !DILocalVariable(name: "tickstart", scope: !974, file: !300, line: 349, type: !19)
!998 = !DILocalVariable(name: "pll_config", scope: !974, file: !300, line: 350, type: !19)
!999 = !DILocalVariable(name: "pwrclkchanged", scope: !1000, file: !300, line: 526, type: !1002)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !300, line: 525, column: 3)
!1001 = distinct !DILexicalBlock(scope: !974, file: !300, line: 524, column: 7)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "FlagStatus", file: !6, line: 155, baseType: !5)
!1003 = !DILocalVariable(name: "tmpreg", scope: !1004, file: !300, line: 535, type: !18)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !300, line: 535, column: 7)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !300, line: 534, column: 5)
!1006 = distinct !DILexicalBlock(scope: !1000, file: !300, line: 533, column: 9)
!1007 = !DILocation(line: 0, scope: !974)
!1008 = !DILocation(line: 353, column: 25, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !974, file: !300, line: 353, column: 7)
!1010 = !DILocation(line: 353, column: 7, scope: !974)
!1011 = !DILocation(line: 362, column: 28, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !974, file: !300, line: 362, column: 7)
!1013 = !{!1014, !572, i64 0}
!1014 = !{!"", !572, i64 0, !572, i64 4, !572, i64 8, !572, i64 12, !572, i64 16, !572, i64 20, !572, i64 24, !1015, i64 28}
!1015 = !{!"", !572, i64 0, !572, i64 4, !572, i64 8}
!1016 = !DILocation(line: 362, column: 44, scope: !1012)
!1017 = !DILocation(line: 362, column: 70, scope: !1012)
!1018 = !DILocation(line: 362, column: 7, scope: !974)
!1019 = !DILocation(line: 368, column: 10, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !300, line: 368, column: 9)
!1021 = distinct !DILexicalBlock(scope: !1012, file: !300, line: 363, column: 3)
!1022 = !DILocation(line: 368, column: 40, scope: !1020)
!1023 = !DILocation(line: 369, column: 9, scope: !1020)
!1024 = !DILocation(line: 369, column: 14, scope: !1020)
!1025 = !DILocation(line: 369, column: 44, scope: !1020)
!1026 = !DILocation(line: 369, column: 79, scope: !1020)
!1027 = !DILocation(line: 369, column: 83, scope: !1020)
!1028 = !DILocation(line: 369, column: 113, scope: !1020)
!1029 = !DILocation(line: 368, column: 9, scope: !1021)
!1030 = !DILocation(line: 371, column: 12, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !300, line: 371, column: 11)
!1032 = distinct !DILexicalBlock(scope: !1020, file: !300, line: 370, column: 5)
!1033 = !DILocation(line: 371, column: 48, scope: !1031)
!1034 = !DILocation(line: 371, column: 58, scope: !1031)
!1035 = !DILocation(line: 371, column: 81, scope: !1031)
!1036 = !{!1014, !572, i64 4}
!1037 = !DILocation(line: 371, column: 90, scope: !1031)
!1038 = !DILocation(line: 371, column: 11, scope: !1032)
!1039 = !DILocation(line: 379, column: 7, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !300, line: 379, column: 7)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !300, line: 379, column: 7)
!1042 = distinct !DILexicalBlock(scope: !1020, file: !300, line: 377, column: 5)
!1043 = !DILocation(line: 379, column: 7, scope: !1041)
!1044 = !DILocation(line: 379, column: 7, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1040, file: !300, line: 379, column: 7)
!1046 = !DILocation(line: 379, column: 7, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !300, line: 379, column: 7)
!1048 = distinct !DILexicalBlock(scope: !1040, file: !300, line: 379, column: 7)
!1049 = !DILocation(line: 379, column: 7, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !300, line: 379, column: 7)
!1051 = distinct !DILexicalBlock(scope: !1048, file: !300, line: 379, column: 7)
!1052 = !DILocation(line: 379, column: 7, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1051, file: !300, line: 379, column: 7)
!1054 = !DILocation(line: 0, scope: !1040)
!1055 = !DILocation(line: 383, column: 39, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1042, file: !300, line: 383, column: 11)
!1057 = !DILocation(line: 0, scope: !1056)
!1058 = !DILocation(line: 383, column: 11, scope: !1042)
!1059 = !DILocation(line: 389, column: 16, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1056, file: !300, line: 384, column: 7)
!1061 = !DILocation(line: 389, column: 52, scope: !1060)
!1062 = !DILocation(line: 389, column: 9, scope: !1060)
!1063 = !DILocation(line: 391, column: 16, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !300, line: 391, column: 15)
!1065 = distinct !DILexicalBlock(scope: !1060, file: !300, line: 390, column: 9)
!1066 = !DILocation(line: 391, column: 30, scope: !1064)
!1067 = !DILocation(line: 391, column: 43, scope: !1064)
!1068 = !DILocation(line: 391, column: 15, scope: !1065)
!1069 = distinct !{!1069, !1062, !1070, !486, !487}
!1070 = !DILocation(line: 395, column: 9, scope: !1060)
!1071 = !DILocation(line: 403, column: 16, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1056, file: !300, line: 398, column: 7)
!1073 = !DILocation(line: 403, column: 52, scope: !1072)
!1074 = !DILocation(line: 403, column: 9, scope: !1072)
!1075 = !DILocation(line: 405, column: 16, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !300, line: 405, column: 15)
!1077 = distinct !DILexicalBlock(scope: !1072, file: !300, line: 404, column: 9)
!1078 = !DILocation(line: 405, column: 30, scope: !1076)
!1079 = !DILocation(line: 405, column: 43, scope: !1076)
!1080 = !DILocation(line: 405, column: 15, scope: !1077)
!1081 = distinct !{!1081, !1074, !1082, !486, !487}
!1082 = !DILocation(line: 409, column: 9, scope: !1072)
!1083 = !DILocation(line: 414, column: 28, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !974, file: !300, line: 414, column: 7)
!1085 = !DILocation(line: 414, column: 44, scope: !1084)
!1086 = !DILocation(line: 414, column: 70, scope: !1084)
!1087 = !DILocation(line: 414, column: 7, scope: !974)
!1088 = !DILocation(line: 421, column: 10, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !300, line: 421, column: 9)
!1090 = distinct !DILexicalBlock(scope: !1084, file: !300, line: 415, column: 3)
!1091 = !DILocation(line: 421, column: 40, scope: !1089)
!1092 = !DILocation(line: 422, column: 9, scope: !1089)
!1093 = !DILocation(line: 422, column: 14, scope: !1089)
!1094 = !DILocation(line: 422, column: 44, scope: !1089)
!1095 = !DILocation(line: 422, column: 79, scope: !1089)
!1096 = !DILocation(line: 422, column: 83, scope: !1089)
!1097 = !DILocation(line: 422, column: 113, scope: !1089)
!1098 = !DILocation(line: 421, column: 9, scope: !1090)
!1099 = !DILocation(line: 425, column: 12, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !300, line: 425, column: 11)
!1101 = distinct !DILexicalBlock(scope: !1089, file: !300, line: 423, column: 5)
!1102 = !DILocation(line: 425, column: 48, scope: !1100)
!1103 = !DILocation(line: 425, column: 58, scope: !1100)
!1104 = !DILocation(line: 425, column: 81, scope: !1100)
!1105 = !{!1014, !572, i64 16}
!1106 = !DILocation(line: 425, column: 90, scope: !1100)
!1107 = !DILocation(line: 425, column: 11, scope: !1101)
!1108 = !DILocation(line: 439, column: 30, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !300, line: 439, column: 11)
!1110 = distinct !DILexicalBlock(scope: !1089, file: !300, line: 437, column: 5)
!1111 = !DILocation(line: 439, column: 39, scope: !1109)
!1112 = !DILocation(line: 439, column: 11, scope: !1110)
!1113 = !DILocation(line: 442, column: 9, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1109, file: !300, line: 440, column: 7)
!1115 = !DILocation(line: 445, column: 21, scope: !1114)
!1116 = !DILocation(line: 448, column: 9, scope: !1114)
!1117 = !DILocation(line: 448, column: 16, scope: !1114)
!1118 = !DILocation(line: 448, column: 52, scope: !1114)
!1119 = !DILocation(line: 450, column: 16, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !300, line: 450, column: 15)
!1121 = distinct !DILexicalBlock(scope: !1114, file: !300, line: 449, column: 9)
!1122 = !DILocation(line: 450, column: 30, scope: !1120)
!1123 = !DILocation(line: 450, column: 43, scope: !1120)
!1124 = !DILocation(line: 450, column: 15, scope: !1121)
!1125 = distinct !{!1125, !1116, !1126, !486, !487}
!1126 = !DILocation(line: 454, column: 9, scope: !1114)
!1127 = !DILocation(line: 462, column: 9, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1109, file: !300, line: 460, column: 7)
!1129 = !DILocation(line: 465, column: 21, scope: !1128)
!1130 = !DILocation(line: 468, column: 9, scope: !1128)
!1131 = !DILocation(line: 468, column: 16, scope: !1128)
!1132 = !DILocation(line: 468, column: 52, scope: !1128)
!1133 = !DILocation(line: 470, column: 16, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !300, line: 470, column: 15)
!1135 = distinct !DILexicalBlock(scope: !1128, file: !300, line: 469, column: 9)
!1136 = !DILocation(line: 470, column: 30, scope: !1134)
!1137 = !DILocation(line: 470, column: 43, scope: !1134)
!1138 = !DILocation(line: 470, column: 15, scope: !1135)
!1139 = distinct !{!1139, !1130, !1140, !486, !487}
!1140 = !DILocation(line: 474, column: 9, scope: !1128)
!1141 = !DILocation(line: 0, scope: !1089)
!1142 = !{!1014, !572, i64 20}
!1143 = !DILocation(line: 479, column: 28, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !974, file: !300, line: 479, column: 7)
!1145 = !DILocation(line: 479, column: 44, scope: !1144)
!1146 = !DILocation(line: 479, column: 70, scope: !1144)
!1147 = !DILocation(line: 479, column: 7, scope: !974)
!1148 = !DILocation(line: 485, column: 28, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1150, file: !300, line: 485, column: 9)
!1150 = distinct !DILexicalBlock(scope: !1144, file: !300, line: 480, column: 3)
!1151 = !{!1014, !572, i64 24}
!1152 = !DILocation(line: 485, column: 37, scope: !1149)
!1153 = !DILocation(line: 485, column: 9, scope: !1150)
!1154 = !DILocation(line: 488, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1149, file: !300, line: 486, column: 5)
!1156 = !DILocation(line: 491, column: 19, scope: !1155)
!1157 = !DILocation(line: 494, column: 7, scope: !1155)
!1158 = !DILocation(line: 494, column: 14, scope: !1155)
!1159 = !DILocation(line: 494, column: 50, scope: !1155)
!1160 = !DILocation(line: 496, column: 14, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !300, line: 496, column: 13)
!1162 = distinct !DILexicalBlock(scope: !1155, file: !300, line: 495, column: 7)
!1163 = !DILocation(line: 496, column: 28, scope: !1161)
!1164 = !DILocation(line: 496, column: 41, scope: !1161)
!1165 = !DILocation(line: 496, column: 13, scope: !1162)
!1166 = distinct !{!1166, !1157, !1167, !486, !487}
!1167 = !DILocation(line: 500, column: 7, scope: !1155)
!1168 = !DILocation(line: 503, column: 7, scope: !1155)
!1169 = !DILocation(line: 504, column: 5, scope: !1155)
!1170 = !DILocation(line: 508, column: 7, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1149, file: !300, line: 506, column: 5)
!1172 = !DILocation(line: 511, column: 19, scope: !1171)
!1173 = !DILocation(line: 514, column: 7, scope: !1171)
!1174 = !DILocation(line: 514, column: 14, scope: !1171)
!1175 = !DILocation(line: 514, column: 50, scope: !1171)
!1176 = !DILocation(line: 516, column: 14, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !300, line: 516, column: 13)
!1178 = distinct !DILexicalBlock(scope: !1171, file: !300, line: 515, column: 7)
!1179 = !DILocation(line: 516, column: 28, scope: !1177)
!1180 = !DILocation(line: 516, column: 41, scope: !1177)
!1181 = !DILocation(line: 516, column: 13, scope: !1178)
!1182 = distinct !{!1182, !1173, !1183, !486, !487}
!1183 = !DILocation(line: 520, column: 7, scope: !1171)
!1184 = !DILocation(line: 524, column: 28, scope: !1001)
!1185 = !DILocation(line: 524, column: 44, scope: !1001)
!1186 = !DILocation(line: 524, column: 70, scope: !1001)
!1187 = !DILocation(line: 524, column: 7, scope: !974)
!1188 = !DILocation(line: 0, scope: !1000)
!1189 = !DILocation(line: 533, column: 9, scope: !1006)
!1190 = !{!571, !572, i64 28}
!1191 = !DILocation(line: 533, column: 9, scope: !1000)
!1192 = !DILocation(line: 535, column: 7, scope: !1004)
!1193 = !DILocation(line: 535, column: 7, scope: !1005)
!1194 = !DILocation(line: 537, column: 5, scope: !1005)
!1195 = !DILocation(line: 539, column: 9, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1000, file: !300, line: 539, column: 9)
!1197 = !{!1198, !572, i64 0}
!1198 = !{!"", !572, i64 0, !572, i64 4}
!1199 = !DILocation(line: 539, column: 9, scope: !1000)
!1200 = !DILocation(line: 542, column: 7, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1196, file: !300, line: 540, column: 5)
!1202 = !DILocation(line: 545, column: 19, scope: !1201)
!1203 = !DILocation(line: 547, column: 7, scope: !1201)
!1204 = !DILocation(line: 547, column: 14, scope: !1201)
!1205 = !DILocation(line: 549, column: 14, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1207, file: !300, line: 549, column: 13)
!1207 = distinct !DILexicalBlock(scope: !1201, file: !300, line: 548, column: 7)
!1208 = !DILocation(line: 549, column: 28, scope: !1206)
!1209 = !DILocation(line: 549, column: 41, scope: !1206)
!1210 = !DILocation(line: 549, column: 13, scope: !1207)
!1211 = distinct !{!1211, !1203, !1212, !486, !487}
!1212 = !DILocation(line: 553, column: 7, scope: !1201)
!1213 = !DILocation(line: 557, column: 5, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1215, file: !300, line: 557, column: 5)
!1215 = distinct !DILexicalBlock(scope: !1000, file: !300, line: 557, column: 5)
!1216 = !{!1014, !572, i64 12}
!1217 = !DILocation(line: 557, column: 5, scope: !1215)
!1218 = !DILocation(line: 557, column: 5, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1214, file: !300, line: 557, column: 5)
!1220 = !{!571, !572, i64 32}
!1221 = !DILocation(line: 557, column: 5, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1223, file: !300, line: 557, column: 5)
!1223 = distinct !DILexicalBlock(scope: !1214, file: !300, line: 557, column: 5)
!1224 = !DILocation(line: 557, column: 5, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1226, file: !300, line: 557, column: 5)
!1226 = distinct !DILexicalBlock(scope: !1223, file: !300, line: 557, column: 5)
!1227 = !DILocation(line: 557, column: 5, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1226, file: !300, line: 557, column: 5)
!1229 = !DILocation(line: 0, scope: !1214)
!1230 = !DILocation(line: 559, column: 37, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1000, file: !300, line: 559, column: 9)
!1232 = !DILocation(line: 0, scope: !1231)
!1233 = !DILocation(line: 559, column: 9, scope: !1000)
!1234 = !DILocation(line: 565, column: 14, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1231, file: !300, line: 560, column: 5)
!1236 = !DILocation(line: 565, column: 50, scope: !1235)
!1237 = !DILocation(line: 565, column: 7, scope: !1235)
!1238 = !DILocation(line: 567, column: 14, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1240, file: !300, line: 567, column: 13)
!1240 = distinct !DILexicalBlock(scope: !1235, file: !300, line: 566, column: 7)
!1241 = !DILocation(line: 567, column: 28, scope: !1239)
!1242 = !DILocation(line: 567, column: 41, scope: !1239)
!1243 = !DILocation(line: 567, column: 13, scope: !1240)
!1244 = distinct !{!1244, !1237, !1245, !486, !487}
!1245 = !DILocation(line: 571, column: 7, scope: !1235)
!1246 = !DILocation(line: 579, column: 14, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1231, file: !300, line: 574, column: 5)
!1248 = !DILocation(line: 579, column: 50, scope: !1247)
!1249 = !DILocation(line: 579, column: 7, scope: !1247)
!1250 = !DILocation(line: 581, column: 14, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1252, file: !300, line: 581, column: 13)
!1252 = distinct !DILexicalBlock(scope: !1247, file: !300, line: 580, column: 7)
!1253 = !DILocation(line: 581, column: 28, scope: !1251)
!1254 = !DILocation(line: 581, column: 41, scope: !1251)
!1255 = !DILocation(line: 581, column: 13, scope: !1252)
!1256 = distinct !{!1256, !1249, !1257, !486, !487}
!1257 = !DILocation(line: 585, column: 7, scope: !1247)
!1258 = !DILocation(line: 589, column: 9, scope: !1000)
!1259 = !DILocation(line: 591, column: 7, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1261, file: !300, line: 590, column: 5)
!1261 = distinct !DILexicalBlock(scope: !1000, file: !300, line: 589, column: 9)
!1262 = !DILocation(line: 592, column: 5, scope: !1260)
