; ModuleID = './examples/dualport_stm32.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%"class.Cicada::Stm32Uart" = type { %"class.Cicada::BufferedSerial", i8, %struct.__UART_HandleTypeDef, %struct.USART_TypeDef*, i16, i16, i32 }
%"class.Cicada::BufferedSerial" = type { %"class.Cicada::IBufferedSerial", %"class.Cicada::LineCircularBuffer", %"class.Cicada::LineCircularBuffer" }
%"class.Cicada::IBufferedSerial" = type { %"class.Cicada::ICommDevice", %"class.Cicada::ICommDevice" }
%"class.Cicada::ICommDevice" = type { i32 (...)** }
%"class.Cicada::LineCircularBuffer" = type { %"class.Cicada::CircularBuffer.base", i16, [2 x i8] }
%"class.Cicada::CircularBuffer.base" = type <{ i32 (...)**, [4 x i8], i64, i64, i64, i64, i8* }>
%struct.__UART_HandleTypeDef = type { %struct.USART_TypeDef*, %struct.USART_TypeDef, i8*, i16, i16, i8*, i16, i16, %struct.__DMA_HandleTypeDef*, %struct.__DMA_HandleTypeDef*, i32, i32, i32, i32 }
%struct.USART_TypeDef = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.__DMA_HandleTypeDef = type { %struct.DMA_Channel_TypeDef*, %struct.USART_TypeDef, i32, i32, i8*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, i32, %struct.DMA_TypeDef*, i32 }
%struct.DMA_Channel_TypeDef = type { i32, i32, i32, i32 }
%struct.DMA_TypeDef = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "instance", scope: !2, file: !3, line: 121, type: !203, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "USART1_IRQHandler", scope: !3, file: !3, line: 119, type: !4, scopeLine: 120, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !202)
!3 = !DIFile(filename: "../examples/stm32f1/dualport_stm32.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "9aa0201d7a0ff6942362ea67abd47171")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !16, globals: !198, imports: !232, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8}
!8 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 41, baseType: !10, size: 32, elements: !11, identifier: "_ZTS17HAL_StatusTypeDef")
!9 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_def.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "4d6e0bbb91efacee14a68a416f506def")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15}
!12 = !DIEnumerator(name: "HAL_OK", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "HAL_ERROR", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "HAL_BUSY", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3, isUnsigned: true)
!16 = !{!17, !34, !37, !40, !43, !45, !46, !49}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "USART_TypeDef", file: !19, line: 516, baseType: !20)
!19 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f103xb.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "d2562af6d7239ab46ca8ba238a43c848")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 507, size: 224, flags: DIFlagTypePassByValue, elements: !21, identifier: "_ZTS13USART_TypeDef")
!21 = !{!22, !28, !29, !30, !31, !32, !33}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !20, file: !19, line: 509, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 48, baseType: !26)
!25 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ab914e287601b2385e57880e6599aa6b")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !27, line: 79, baseType: !10)
!27 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f7024d0682a918b41f94e8be9cd90461")
!28 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !20, file: !19, line: 510, baseType: !23, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !20, file: !19, line: 511, baseType: !23, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !20, file: !19, line: 512, baseType: !23, size: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !20, file: !19, line: 513, baseType: !23, size: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "CR3", scope: !20, file: !19, line: 514, baseType: !23, size: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "GTPR", scope: !20, file: !19, line: 515, baseType: !23, size: 32, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !19, line: 367, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 358, size: 224, flags: DIFlagFwdDecl, identifier: "_ZTS12GPIO_TypeDef")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !25, line: 36, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !27, line: 57, baseType: !39)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !25, line: 24, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !27, line: 43, baseType: !42)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!46 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SerialTask", file: !3, line: 16, size: 224, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !47, vtableHolder: !49, identifier: "_ZTS10SerialTask")
!47 = !{!48, !93, !190, !191, !195}
!48 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !46, baseType: !49, flags: DIFlagPublic, extraData: i32 0)
!49 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Task", scope: !51, file: !50, line: 193, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !52, vtableHolder: !49, identifier: "_ZTSN6Cicada4TaskE")
!50 = !DIFile(filename: "../cicada/task.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "c2aeaca9a01dbc0caa84f135ef9fda2b")
!51 = !DINamespace(name: "Cicada", scope: null)
!52 = !{!53, !59, !60, !61, !63, !64, !68, !71, !76, !77, !80, !83, !84, !85, !86, !89}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Task", scope: !50, file: !50, baseType: !54, size: 32, flags: DIFlagArtificial)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !56, size: 32)
!56 = !DISubroutineType(types: !57)
!57 = !{!58}
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_delay", scope: !49, file: !50, line: 283, baseType: !37, size: 16, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_timeout", scope: !49, file: !50, line: 284, baseType: !24, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_isTimeoutRunning", scope: !49, file: !50, line: 285, baseType: !62, size: 8, offset: 96)
!62 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_lastRun", scope: !49, file: !50, line: 286, baseType: !24, size: 32, offset: 128)
!64 = !DISubprogram(name: "Task", scope: !49, file: !50, line: 196, type: !65, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !37}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!68 = !DISubprogram(name: "~Task", scope: !49, file: !50, line: 198, type: !69, scopeLine: 198, containingType: !49, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !67}
!71 = !DISubprogram(name: "delay", linkageName: "_ZNK6Cicada4Task5delayEv", scope: !49, file: !50, line: 203, type: !72, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!72 = !DISubroutineType(types: !73)
!73 = !{!37, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!76 = !DISubprogram(name: "setDelay", linkageName: "_ZN6Cicada4Task8setDelayEt", scope: !49, file: !50, line: 212, type: !65, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!77 = !DISubprogram(name: "lastRun", linkageName: "_ZN6Cicada4Task7lastRunEv", scope: !49, file: !50, line: 222, type: !78, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!78 = !DISubroutineType(types: !79)
!79 = !{!24, !67}
!80 = !DISubprogram(name: "setLastRun", linkageName: "_ZN6Cicada4Task10setLastRunEj", scope: !49, file: !50, line: 230, type: !81, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !67, !24}
!83 = !DISubprogram(name: "run", linkageName: "_ZN6Cicada4Task3runEv", scope: !49, file: !50, line: 245, type: !69, scopeLine: 245, containingType: !49, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!84 = !DISubprogram(name: "startTimeout", linkageName: "_ZN6Cicada4Task12startTimeoutEv", scope: !49, file: !50, line: 251, type: !69, scopeLine: 251, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubprogram(name: "resetTimeout", linkageName: "_ZN6Cicada4Task12resetTimeoutEv", scope: !49, file: !50, line: 262, type: !69, scopeLine: 262, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!86 = !DISubprogram(name: "isTimeout", linkageName: "_ZN6Cicada4Task9isTimeoutEj", scope: !49, file: !50, line: 272, type: !87, scopeLine: 272, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!87 = !DISubroutineType(types: !88)
!88 = !{!62, !67, !24}
!89 = !DISubprogram(name: "Task", scope: !49, file: !50, line: 281, type: !90, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !67, !92}
!92 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !75, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "m_serial", scope: !46, file: !3, line: 55, baseType: !94, size: 32, offset: 160)
!94 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !95, size: 32)
!95 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "IBufferedSerial", scope: !51, file: !96, line: 39, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !97, vtableHolder: !99, identifier: "_ZTSN6Cicada15IBufferedSerialE")
!96 = !DIFile(filename: "../cicada/ibufferedserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "0e5db7c0b86651abb573e233dc791166")
!97 = !{!98, !127, !160, !164, !167, !170, !173, !176, !179, !184, !185, !186, !189}
!98 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !95, baseType: !99, flags: DIFlagPublic, extraData: i32 0)
!99 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ICommDevice", scope: !51, file: !100, line: 43, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !101, vtableHolder: !99, identifier: "_ZTSN6Cicada11ICommDeviceE")
!100 = !DIFile(filename: "../cicada/icommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "e83d2959922f5020d303a6315b56c6e9")
!101 = !{!102, !103, !107, !117, !118, !121, !124}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ICommDevice", scope: !100, file: !100, baseType: !54, size: 32, flags: DIFlagArtificial)
!103 = !DISubprogram(name: "~ICommDevice", scope: !99, file: !100, line: 46, type: !104, scopeLine: 46, containingType: !99, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!107 = !DISubprogram(name: "bytesAvailable", linkageName: "_ZNK6Cicada11ICommDevice14bytesAvailableEv", scope: !99, file: !100, line: 52, type: !108, scopeLine: 52, containingType: !99, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!108 = !DISubroutineType(types: !109)
!109 = !{!110, !115}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "Size", scope: !51, file: !111, line: 32, baseType: !112)
!111 = !DIFile(filename: "../cicada/types.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "6dfa4c2c933d4c520c13fa7638528c51")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !25, line: 60, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !27, line: 105, baseType: !114)
!114 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!117 = !DISubprogram(name: "spaceAvailable", linkageName: "_ZNK6Cicada11ICommDevice14spaceAvailableEv", scope: !99, file: !100, line: 60, type: !108, scopeLine: 60, containingType: !99, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!118 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada11ICommDevice20writeBufferProcessedEv", scope: !99, file: !100, line: 71, type: !119, scopeLine: 71, containingType: !99, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!119 = !DISubroutineType(types: !120)
!120 = !{!62, !115}
!121 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada11ICommDevice4readEPhy", scope: !99, file: !100, line: 85, type: !122, scopeLine: 85, containingType: !99, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!122 = !DISubroutineType(types: !123)
!123 = !{!110, !106, !45, !110}
!124 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada11ICommDevice5writeEPKhy", scope: !99, file: !100, line: 98, type: !125, scopeLine: 98, containingType: !99, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!125 = !DISubroutineType(types: !126)
!126 = !{!110, !106, !43, !110}
!127 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !95, baseType: !128, offset: 32, flags: DIFlagPublic, extraData: i32 0)
!128 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ISerial", scope: !51, file: !129, line: 37, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !130, vtableHolder: !128, identifier: "_ZTSN6Cicada7ISerialE")
!129 = !DIFile(filename: "../cicada/iserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "e3dc53a2acd15a8e90c357a32168f40f")
!130 = !{!131, !132, !136, !139, !140, !143, !144, !152, !156, !159}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ISerial", scope: !129, file: !129, baseType: !54, size: 32, flags: DIFlagArtificial)
!132 = !DISubprogram(name: "~ISerial", scope: !128, file: !129, line: 40, type: !133, scopeLine: 40, containingType: !128, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!136 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada7ISerial4openEv", scope: !128, file: !129, line: 46, type: !137, scopeLine: 46, containingType: !128, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!137 = !DISubroutineType(types: !138)
!138 = !{!62, !135}
!139 = !DISubprogram(name: "isOpen", linkageName: "_ZN6Cicada7ISerial6isOpenEv", scope: !128, file: !129, line: 52, type: !137, scopeLine: 52, containingType: !128, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!140 = !DISubprogram(name: "setSerialConfig", linkageName: "_ZN6Cicada7ISerial15setSerialConfigEjh", scope: !128, file: !129, line: 60, type: !141, scopeLine: 60, containingType: !128, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!141 = !DISubroutineType(types: !142)
!142 = !{!62, !135, !24, !40}
!143 = !DISubprogram(name: "close", linkageName: "_ZN6Cicada7ISerial5closeEv", scope: !128, file: !129, line: 65, type: !133, scopeLine: 65, containingType: !128, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!144 = !DISubprogram(name: "portName", linkageName: "_ZNK6Cicada7ISerial8portNameEv", scope: !128, file: !129, line: 71, type: !145, scopeLine: 71, containingType: !128, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!145 = !DISubroutineType(types: !146)
!146 = !{!147, !150}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!152 = !DISubprogram(name: "rawRead", linkageName: "_ZN6Cicada7ISerial7rawReadERh", scope: !128, file: !129, line: 80, type: !153, scopeLine: 80, containingType: !128, virtualIndex: 7, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!153 = !DISubroutineType(types: !154)
!154 = !{!62, !135, !155}
!155 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !40, size: 32)
!156 = !DISubprogram(name: "rawWrite", linkageName: "_ZN6Cicada7ISerial8rawWriteEh", scope: !128, file: !129, line: 87, type: !157, scopeLine: 87, containingType: !128, virtualIndex: 8, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!157 = !DISubroutineType(types: !158)
!158 = !{!62, !135, !40}
!159 = !DISubprogram(name: "startTransmit", linkageName: "_ZN6Cicada7ISerial13startTransmitEv", scope: !128, file: !129, line: 93, type: !133, scopeLine: 93, containingType: !128, virtualIndex: 9, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!160 = !DISubprogram(name: "~IBufferedSerial", scope: !95, file: !96, line: 42, type: !161, scopeLine: 42, containingType: !95, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!164 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada15IBufferedSerial4readEPhy", scope: !95, file: !96, line: 44, type: !165, scopeLine: 44, containingType: !95, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!165 = !DISubroutineType(types: !166)
!166 = !{!110, !163, !45, !110}
!167 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEPKhy", scope: !95, file: !96, line: 45, type: !168, scopeLine: 45, containingType: !95, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!168 = !DISubroutineType(types: !169)
!169 = !{!110, !163, !43, !110}
!170 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada15IBufferedSerial4readEv", scope: !95, file: !96, line: 51, type: !171, scopeLine: 51, containingType: !95, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!171 = !DISubroutineType(types: !172)
!172 = !{!40, !163}
!173 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEPKh", scope: !95, file: !96, line: 62, type: !174, scopeLine: 62, containingType: !95, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{!110, !163, !43}
!176 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEh", scope: !95, file: !96, line: 68, type: !177, scopeLine: 68, containingType: !95, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !163, !40}
!179 = !DISubprogram(name: "canReadLine", linkageName: "_ZNK6Cicada15IBufferedSerial11canReadLineEv", scope: !95, file: !96, line: 73, type: !180, scopeLine: 73, containingType: !95, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!180 = !DISubroutineType(types: !181)
!181 = !{!62, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!184 = !DISubprogram(name: "readLine", linkageName: "_ZN6Cicada15IBufferedSerial8readLineEPhy", scope: !95, file: !96, line: 85, type: !165, scopeLine: 85, containingType: !95, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!185 = !DISubprogram(name: "flushReceiveBuffers", linkageName: "_ZN6Cicada15IBufferedSerial19flushReceiveBuffersEv", scope: !95, file: !96, line: 90, type: !161, scopeLine: 90, containingType: !95, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!186 = !DISubprogram(name: "readBufferSize", linkageName: "_ZN6Cicada15IBufferedSerial14readBufferSizeEv", scope: !95, file: !96, line: 95, type: !187, scopeLine: 95, containingType: !95, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!187 = !DISubroutineType(types: !188)
!188 = !{!110, !163}
!189 = !DISubprogram(name: "writeBufferSize", linkageName: "_ZN6Cicada15IBufferedSerial15writeBufferSizeEv", scope: !95, file: !96, line: 96, type: !187, scopeLine: 96, containingType: !95, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "m_i", scope: !46, file: !3, line: 56, baseType: !58, size: 32, offset: 192)
!191 = !DISubprogram(name: "SerialTask", scope: !46, file: !3, line: 19, type: !192, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194, !94}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!195 = !DISubprogram(name: "run", linkageName: "_ZN10SerialTask3runEv", scope: !46, file: !3, line: 21, type: !196, scopeLine: 21, containingType: !46, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !194}
!198 = !{!0, !199, !206, !213}
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "instance", scope: !201, file: !3, line: 127, type: !203, isLocal: true, isDefinition: true)
!201 = distinct !DISubprogram(name: "USART2_IRQHandler", scope: !3, file: !3, line: 125, type: !4, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !202)
!202 = !{}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !51, file: !205, line: 51, size: 1536, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada9Stm32UartE")
!205 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "f1205a68111afe9a0868ac35ca31b4e6")
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "serial", scope: !208, file: !3, line: 133, type: !203, isLocal: true, isDefinition: true)
!208 = distinct !DISubprogram(name: "_putchar", scope: !3, file: !3, line: 131, type: !209, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !211)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !149}
!211 = !{!212}
!212 = !DILocalVariable(name: "c", arg: 1, scope: !208, file: !3, line: 131, type: !149)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "entrypoint", scope: !215, file: !3, line: 23, type: !40, isLocal: false, isDefinition: true)
!215 = distinct !DISubprogram(name: "run", linkageName: "_ZN10SerialTask3runEv", scope: !46, file: !3, line: 21, type: !196, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, declaration: !195, retainedNodes: !216)
!216 = !{!217, !219, !225, !226, !231}
!217 = !DILocalVariable(name: "this", arg: 1, scope: !215, type: !218, flags: DIFlagArtificial | DIFlagObjectPointer)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!219 = !DILocalVariable(name: "send_str", scope: !220, file: !3, line: 27, type: !147)
!220 = distinct !DILexicalBlock(scope: !221, file: !3, line: 26, column: 13)
!221 = distinct !DILexicalBlock(scope: !222, file: !3, line: 25, column: 41)
!222 = distinct !DILexicalBlock(scope: !223, file: !3, line: 25, column: 9)
!223 = distinct !DILexicalBlock(scope: !224, file: !3, line: 25, column: 9)
!224 = distinct !DILexicalBlock(scope: !215, file: !3, line: 23, column: 9)
!225 = !DILocalVariable(name: "bytesWritten", scope: !220, file: !3, line: 29, type: !58)
!226 = !DILocalVariable(name: "buf", scope: !227, file: !3, line: 37, type: !228)
!227 = distinct !DILexicalBlock(scope: !221, file: !3, line: 36, column: 13)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 256, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 32)
!231 = !DILocalVariable(name: "bytesReceived", scope: !227, file: !3, line: 38, type: !58)
!232 = !{!233, !239, !243, !246, !250, !253, !255, !257, !259, !262, !265, !268, !271, !274, !277, !278, !279, !280, !281, !283, !285, !287, !289, !292, !295, !298, !301, !304, !307, !320, !324, !328, !330, !334, !339, !343, !345, !347, !351, !355, !359, !363, !367, !369, !371, !373, !377, !381, !385, !387, !389}
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !235, file: !238, line: 47)
!234 = !DINamespace(name: "std", scope: null)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !25, line: 20, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !27, line: 41, baseType: !237)
!237 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!238 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstdint", directory: "/home/mjshen/RTOSExploration")
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !240, file: !238, line: 48)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !25, line: 32, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !27, line: 55, baseType: !242)
!242 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !244, file: !238, line: 49)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !25, line: 44, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !27, line: 77, baseType: !58)
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !247, file: !238, line: 50)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !25, line: 56, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !27, line: 103, baseType: !249)
!249 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !251, file: !238, line: 52)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !252, line: 51, baseType: !237)
!252 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "a169a1d650067906a9e00519a9405ebb")
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !254, file: !238, line: 53)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !252, line: 61, baseType: !242)
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !256, file: !238, line: 54)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !252, line: 71, baseType: !58)
!257 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !258, file: !238, line: 55)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !252, line: 81, baseType: !249)
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !260, file: !238, line: 57)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !252, line: 21, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !27, line: 134, baseType: !237)
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !263, file: !238, line: 58)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !252, line: 27, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !27, line: 160, baseType: !242)
!265 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !266, file: !238, line: 59)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !252, line: 33, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !27, line: 182, baseType: !58)
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !269, file: !238, line: 60)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !252, line: 39, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !27, line: 200, baseType: !249)
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !272, file: !238, line: 62)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !25, line: 67, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !27, line: 214, baseType: !249)
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !275, file: !238, line: 63)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !25, line: 77, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !27, line: 230, baseType: !58)
!277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !40, file: !238, line: 65)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !37, file: !238, line: 66)
!279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !24, file: !238, line: 67)
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !112, file: !238, line: 68)
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !282, file: !238, line: 70)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !252, line: 52, baseType: !42)
!283 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !284, file: !238, line: 71)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !252, line: 62, baseType: !39)
!285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !286, file: !238, line: 72)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !252, line: 72, baseType: !10)
!287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !288, file: !238, line: 73)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !252, line: 82, baseType: !114)
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !290, file: !238, line: 75)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !252, line: 22, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !27, line: 136, baseType: !42)
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !293, file: !238, line: 76)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !252, line: 28, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !27, line: 162, baseType: !39)
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !296, file: !238, line: 77)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !252, line: 34, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !27, line: 184, baseType: !10)
!298 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !299, file: !238, line: 78)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !252, line: 40, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !27, line: 202, baseType: !114)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !302, file: !238, line: 80)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !25, line: 72, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !27, line: 222, baseType: !114)
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !305, file: !238, line: 81)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !25, line: 82, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !27, line: 232, baseType: !10)
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !308, file: !319, line: 77)
!308 = !DISubprogram(name: "memchr", scope: !309, file: !309, line: 29, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!309 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/string.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "00b3471f69c722645cab66876c511e27")
!310 = !DISubroutineType(types: !311)
!311 = !{!312, !313, !58, !315}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !316, line: 40, baseType: !317)
!316 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/strings.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "dceb1b71cd72987b246237af8552faba")
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !318, line: 131, baseType: !10)
!318 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "b45aad52ebaa1042158f2766af29f8e2")
!319 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstring", directory: "/home/mjshen/RTOSExploration")
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !321, file: !319, line: 78)
!321 = !DISubprogram(name: "memcmp", scope: !309, file: !309, line: 30, type: !322, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DISubroutineType(types: !323)
!323 = !{!58, !313, !313, !315}
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !325, file: !319, line: 79)
!325 = !DISubprogram(name: "memcpy", scope: !309, file: !309, line: 31, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DISubroutineType(types: !327)
!327 = !{!312, !312, !313, !315}
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !329, file: !319, line: 80)
!329 = !DISubprogram(name: "memmove", scope: !309, file: !309, line: 32, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !331, file: !319, line: 81)
!331 = !DISubprogram(name: "memset", scope: !309, file: !309, line: 33, type: !332, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!332 = !DISubroutineType(types: !333)
!333 = !{!312, !312, !58, !315}
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !335, file: !319, line: 82)
!335 = !DISubprogram(name: "strcat", scope: !309, file: !309, line: 34, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!336 = !DISubroutineType(types: !337)
!337 = !{!338, !338, !147}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !340, file: !319, line: 83)
!340 = !DISubprogram(name: "strcmp", scope: !309, file: !309, line: 36, type: !341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!341 = !DISubroutineType(types: !342)
!342 = !{!58, !147, !147}
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !344, file: !319, line: 84)
!344 = !DISubprogram(name: "strcoll", scope: !309, file: !309, line: 37, type: !341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !346, file: !319, line: 85)
!346 = !DISubprogram(name: "strcpy", scope: !309, file: !309, line: 38, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !348, file: !319, line: 86)
!348 = !DISubprogram(name: "strcspn", scope: !309, file: !309, line: 39, type: !349, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!349 = !DISubroutineType(types: !350)
!350 = !{!315, !147, !147}
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !352, file: !319, line: 87)
!352 = !DISubprogram(name: "strerror", scope: !309, file: !309, line: 40, type: !353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!353 = !DISubroutineType(types: !354)
!354 = !{!338, !58}
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !356, file: !319, line: 88)
!356 = !DISubprogram(name: "strlen", scope: !309, file: !309, line: 41, type: !357, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!357 = !DISubroutineType(types: !358)
!358 = !{!315, !147}
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !360, file: !319, line: 89)
!360 = !DISubprogram(name: "strncat", scope: !309, file: !309, line: 42, type: !361, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!361 = !DISubroutineType(types: !362)
!362 = !{!338, !338, !147, !315}
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !364, file: !319, line: 90)
!364 = !DISubprogram(name: "strncmp", scope: !309, file: !309, line: 43, type: !365, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!365 = !DISubroutineType(types: !366)
!366 = !{!58, !147, !147, !315}
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !368, file: !319, line: 91)
!368 = !DISubprogram(name: "strncpy", scope: !309, file: !309, line: 44, type: !361, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !370, file: !319, line: 92)
!370 = !DISubprogram(name: "strspn", scope: !309, file: !309, line: 47, type: !349, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !372, file: !319, line: 93)
!372 = !DISubprogram(name: "strtok", scope: !309, file: !309, line: 50, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !374, file: !319, line: 94)
!374 = !DISubprogram(name: "strxfrm", scope: !309, file: !309, line: 52, type: !375, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!375 = !DISubroutineType(types: !376)
!376 = !{!315, !338, !147, !315}
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !378, file: !319, line: 95)
!378 = !DISubprogram(name: "strchr", scope: !309, file: !309, line: 35, type: !379, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!379 = !DISubroutineType(types: !380)
!380 = !{!338, !147, !58}
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !382, file: !319, line: 96)
!382 = !DISubprogram(name: "strpbrk", scope: !309, file: !309, line: 45, type: !383, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!383 = !DISubroutineType(types: !384)
!384 = !{!338, !147, !147}
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !386, file: !319, line: 97)
!386 = !DISubprogram(name: "strrchr", scope: !309, file: !309, line: 46, type: !379, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !234, entity: !388, file: !319, line: 98)
!388 = !DISubprogram(name: "strstr", scope: !309, file: !309, line: 48, type: !383, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!389 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !6, entity: !51, file: !3, line: 12)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "pow10", scope: !392, file: !393, line: 311, type: !446, isLocal: true, isDefinition: true)
!392 = distinct !DISubprogram(name: "_ftoa", scope: !393, file: !393, line: 299, type: !394, scopeLine: 300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !403, retainedNodes: !416)
!393 = !DIFile(filename: "../dep/printf/src/printf.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "7383fa86adf0d25d8eda174a9b330d6a")
!394 = !DISubroutineType(types: !395)
!395 = !{!396, !398, !338, !396, !396, !402, !10, !10, !10}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !397, line: 46, baseType: !10)
!397 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_type", file: !393, line: 97, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !149, !312, !396, !396}
!402 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !404, globals: !415, splitDebugInlining: false, nameTableKind: None)
!404 = !{!396, !338, !305, !10, !58, !114, !405, !149, !242, !42, !39, !402, !406}
!405 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_wrap_type", file: !393, line: 104, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 101, size: 64, elements: !409)
!409 = !{!410, !414}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fct", scope: !408, file: !393, line: 102, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !149, !312}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !408, file: !393, line: 103, baseType: !312, size: 32, offset: 32)
!415 = !{!390}
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !427, !428, !429, !430, !432, !434, !435, !436, !437, !440, !444}
!417 = !DILocalVariable(name: "out", arg: 1, scope: !392, file: !393, line: 299, type: !398)
!418 = !DILocalVariable(name: "buffer", arg: 2, scope: !392, file: !393, line: 299, type: !338)
!419 = !DILocalVariable(name: "idx", arg: 3, scope: !392, file: !393, line: 299, type: !396)
!420 = !DILocalVariable(name: "maxlen", arg: 4, scope: !392, file: !393, line: 299, type: !396)
!421 = !DILocalVariable(name: "value", arg: 5, scope: !392, file: !393, line: 299, type: !402)
!422 = !DILocalVariable(name: "prec", arg: 6, scope: !392, file: !393, line: 299, type: !10)
!423 = !DILocalVariable(name: "width", arg: 7, scope: !392, file: !393, line: 299, type: !10)
!424 = !DILocalVariable(name: "flags", arg: 8, scope: !392, file: !393, line: 299, type: !10)
!425 = !DILocalVariable(name: "start_idx", scope: !392, file: !393, line: 301, type: !426)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!427 = !DILocalVariable(name: "buf", scope: !392, file: !393, line: 303, type: !228)
!428 = !DILocalVariable(name: "len", scope: !392, file: !393, line: 304, type: !396)
!429 = !DILocalVariable(name: "diff", scope: !392, file: !393, line: 305, type: !402)
!430 = !DILocalVariable(name: "thres_max", scope: !392, file: !393, line: 308, type: !431)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!432 = !DILocalVariable(name: "negative", scope: !392, file: !393, line: 322, type: !433)
!433 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!434 = !DILocalVariable(name: "whole", scope: !392, file: !393, line: 338, type: !58)
!435 = !DILocalVariable(name: "tmp", scope: !392, file: !393, line: 339, type: !402)
!436 = !DILocalVariable(name: "frac", scope: !392, file: !393, line: 340, type: !405)
!437 = !DILocalVariable(name: "count", scope: !438, file: !393, line: 373, type: !10)
!438 = distinct !DILexicalBlock(scope: !439, file: !393, line: 372, column: 8)
!439 = distinct !DILexicalBlock(scope: !392, file: !393, line: 364, column: 7)
!440 = !DILocalVariable(name: "i", scope: !441, file: !393, line: 424, type: !396)
!441 = distinct !DILexicalBlock(scope: !442, file: !393, line: 424, column: 5)
!442 = distinct !DILexicalBlock(scope: !443, file: !393, line: 423, column: 58)
!443 = distinct !DILexicalBlock(scope: !392, file: !393, line: 423, column: 7)
!444 = !DILocalVariable(name: "i", scope: !445, file: !393, line: 430, type: !396)
!445 = distinct !DILexicalBlock(scope: !392, file: !393, line: 430, column: 3)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 640, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 10)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "AHBPrescTable", scope: !451, file: !452, line: 124, type: !523, isLocal: false, isDefinition: true)
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !453, retainedTypes: !459, globals: !515, splitDebugInlining: false, nameTableKind: None)
!452 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Source/Templates/system_stm32f1xx.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "2e873de3002e5d783190a46ff1c7da2d")
!453 = !{!454}
!454 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !455, line: 151, baseType: !10, size: 32, elements: !456)
!455 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xx.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dc4ed8bdf8589b30d30d93eb6ee6ca27")
!456 = !{!457, !458}
!457 = !DIEnumerator(name: "RESET", value: 0)
!458 = !DIEnumerator(name: "SET", value: 1)
!459 = !{!460, !474, !24}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !472, !473}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !462, file: !19, line: 426, baseType: !23, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !462, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !462, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !462, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !462, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !462, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !462, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !462, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !462, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !462, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !476, line: 397, baseType: !477)
!476 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 374, size: 1120, elements: !478)
!478 = !{!479, !481, !482, !483, !484, !485, !486, !491, !492, !493, !494, !495, !496, !497, !498, !502, !503, !504, !508, !512, !514}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !477, file: !476, line: 376, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !477, file: !476, line: 377, baseType: !23, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !477, file: !476, line: 378, baseType: !23, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !477, file: !476, line: 379, baseType: !23, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !477, file: !476, line: 380, baseType: !23, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !477, file: !476, line: 381, baseType: !23, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !477, file: !476, line: 382, baseType: !487, size: 96, offset: 192)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 96, elements: !489)
!488 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !40)
!489 = !{!490}
!490 = !DISubrange(count: 12)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !477, file: !476, line: 383, baseType: !23, size: 32, offset: 288)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !477, file: !476, line: 384, baseType: !23, size: 32, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !477, file: !476, line: 385, baseType: !23, size: 32, offset: 352)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !477, file: !476, line: 386, baseType: !23, size: 32, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !477, file: !476, line: 387, baseType: !23, size: 32, offset: 416)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !477, file: !476, line: 388, baseType: !23, size: 32, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !477, file: !476, line: 389, baseType: !23, size: 32, offset: 480)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !477, file: !476, line: 390, baseType: !499, size: 64, offset: 512)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 64, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 2)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !477, file: !476, line: 391, baseType: !480, size: 32, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !477, file: !476, line: 392, baseType: !480, size: 32, offset: 608)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !477, file: !476, line: 393, baseType: !505, size: 128, offset: 640)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 128, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 4)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !477, file: !476, line: 394, baseType: !509, size: 160, offset: 768)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 160, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 5)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !477, file: !476, line: 395, baseType: !513, size: 160, offset: 928)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !510)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !477, file: !476, line: 396, baseType: !23, size: 32, offset: 1088)
!515 = !{!516, !449, !518}
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !451, file: !452, line: 123, type: !24, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "APBPrescTable", scope: !451, file: !452, line: 125, type: !520, isLocal: false, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 8)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 16)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "uwTickPrio", scope: !528, file: !529, line: 80, type: !24, isLocal: false, isDefinition: true)
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !530, retainedTypes: !598, globals: !641, splitDebugInlining: false, nameTableKind: None)
!529 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "1a5fa7b79e9e470cf817b81d791a6ccb")
!530 = !{!531, !538, !544}
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !532, line: 49, baseType: !10, size: 32, elements: !533)
!532 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5eab64b252ccd159497a11d87d26bc0b")
!533 = !{!534, !535, !536, !537}
!534 = !DIEnumerator(name: "HAL_TICK_FREQ_10HZ", value: 100)
!535 = !DIEnumerator(name: "HAL_TICK_FREQ_100HZ", value: 10)
!536 = !DIEnumerator(name: "HAL_TICK_FREQ_1KHZ", value: 1)
!537 = !DIEnumerator(name: "HAL_TICK_FREQ_DEFAULT", value: 1)
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 41, baseType: !10, size: 32, elements: !539)
!539 = !{!540, !541, !542, !543}
!540 = !DIEnumerator(name: "HAL_OK", value: 0)
!541 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!542 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!543 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!544 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 69, baseType: !58, size: 32, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!546 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!547 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!548 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!549 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!550 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!551 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!552 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!553 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!554 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!555 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!556 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!557 = !DIEnumerator(name: "TAMPER_IRQn", value: 2)
!558 = !DIEnumerator(name: "RTC_IRQn", value: 3)
!559 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!560 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!561 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!562 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!563 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!564 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!565 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!566 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!567 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!568 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!569 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!570 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!571 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!572 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!573 = !DIEnumerator(name: "ADC1_2_IRQn", value: 18)
!574 = !DIEnumerator(name: "USB_HP_CAN1_TX_IRQn", value: 19)
!575 = !DIEnumerator(name: "USB_LP_CAN1_RX0_IRQn", value: 20)
!576 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!577 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!578 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!579 = !DIEnumerator(name: "TIM1_BRK_IRQn", value: 24)
!580 = !DIEnumerator(name: "TIM1_UP_IRQn", value: 25)
!581 = !DIEnumerator(name: "TIM1_TRG_COM_IRQn", value: 26)
!582 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!583 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!584 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!585 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!586 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!587 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!588 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!589 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!590 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!591 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!592 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!593 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!594 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!595 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!596 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!597 = !DIEnumerator(name: "USBWakeUp_IRQn", value: 42)
!598 = !{!599, !24, !612, !626, !634, !640}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !19, line: 336, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 325, size: 288, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !601, file: !19, line: 327, baseType: !23, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !601, file: !19, line: 328, baseType: !23, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !601, file: !19, line: 329, baseType: !23, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !601, file: !19, line: 330, baseType: !23, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !601, file: !19, line: 331, baseType: !23, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !601, file: !19, line: 332, baseType: !23, size: 32, offset: 160)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !601, file: !19, line: 333, baseType: !23, size: 32, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !601, file: !19, line: 334, baseType: !23, size: 32, offset: 224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !601, file: !19, line: 335, baseType: !23, size: 32, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !614, file: !19, line: 426, baseType: !23, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !614, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !614, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !614, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !614, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !614, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !614, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !614, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !614, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !614, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !476, line: 700, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 694, size: 128, elements: !629)
!629 = !{!630, !631, !632, !633}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !628, file: !476, line: 696, baseType: !23, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !628, file: !476, line: 697, baseType: !23, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !628, file: !476, line: 698, baseType: !23, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !628, file: !476, line: 699, baseType: !480, size: 32, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBGMCU_TypeDef", file: !19, line: 285, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 281, size: 64, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "IDCODE", scope: !636, file: !19, line: 283, baseType: !23, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !636, file: !19, line: 284, baseType: !23, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!641 = !{!526, !642, !645}
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "uwTickFreq", scope: !528, file: !529, line: 81, type: !644, isLocal: false, isDefinition: true)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_TickFreqTypeDef", file: !532, line: 55, baseType: !531)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "uwTick", scope: !528, file: !529, line: 79, type: !23, isLocal: false, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "instance", linkageName: "_ZN6Cicada9Stm32Uart8instanceE", scope: !649, file: !650, line: 32, type: !754, isLocal: false, isDefinition: true, declaration: !753)
!649 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !650, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !651, retainedTypes: !668, globals: !847, imports: !848, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "3cfb26aba75e1df83974cb6e4fff6457")
!651 = !{!652, !8, !653, !657}
!652 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 69, baseType: !58, size: 32, elements: !545, identifier: "_ZTS9IRQn_Type")
!653 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 52, baseType: !10, size: 32, elements: !654, identifier: "_ZTS15HAL_LockTypeDef")
!654 = !{!655, !656}
!655 = !DIEnumerator(name: "HAL_UNLOCKED", value: 0, isUnsigned: true)
!656 = !DIEnumerator(name: "HAL_LOCKED", value: 1, isUnsigned: true)
!657 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !658, line: 117, baseType: !10, size: 32, elements: !659, identifier: "_ZTS21HAL_UART_StateTypeDef")
!658 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "74469f61b271b78e5ff5784cb5eb97d1")
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667}
!660 = !DIEnumerator(name: "HAL_UART_STATE_RESET", value: 0, isUnsigned: true)
!661 = !DIEnumerator(name: "HAL_UART_STATE_READY", value: 32, isUnsigned: true)
!662 = !DIEnumerator(name: "HAL_UART_STATE_BUSY", value: 36, isUnsigned: true)
!663 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX", value: 33, isUnsigned: true)
!664 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_RX", value: 34, isUnsigned: true)
!665 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX_RX", value: 35, isUnsigned: true)
!666 = !DIEnumerator(name: "HAL_UART_STATE_TIMEOUT", value: 160, isUnsigned: true)
!667 = !DIEnumerator(name: "HAL_UART_STATE_ERROR", value: 224, isUnsigned: true)
!668 = !{!24, !17, !669, !679, !34, !40, !37, !244, !693, !723, !748}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFIO_TypeDef", file: !19, line: 380, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 373, size: 256, flags: DIFlagTypePassByValue, elements: !672, identifier: "_ZTS12AFIO_TypeDef")
!672 = !{!673, !674, !675, !677, !678}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "EVCR", scope: !671, file: !19, line: 375, baseType: !23, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR", scope: !671, file: !19, line: 376, baseType: !23, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !671, file: !19, line: 377, baseType: !676, size: 128, offset: 64)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !506)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !671, file: !19, line: 378, baseType: !24, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR2", scope: !671, file: !19, line: 379, baseType: !23, size: 32, offset: 224)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, flags: DIFlagTypePassByValue, elements: !682, identifier: "_ZTS11RCC_TypeDef")
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !681, file: !19, line: 426, baseType: !23, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !681, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !681, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !681, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !681, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !681, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !681, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !681, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !681, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !681, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !476, line: 355, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 340, size: 28704, flags: DIFlagTypePassByValue, elements: !696, identifier: "_ZTS9NVIC_Type")
!696 = !{!697, !699, !703, !704, !705, !706, !707, !708, !709, !710, !714, !718, !722}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !695, file: !476, line: 342, baseType: !698, size: 256)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 256, elements: !521)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !695, file: !476, line: 343, baseType: !700, size: 768, offset: 256)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 768, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 24)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !695, file: !476, line: 344, baseType: !698, size: 256, offset: 1024)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !695, file: !476, line: 345, baseType: !700, size: 768, offset: 1280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !695, file: !476, line: 346, baseType: !698, size: 256, offset: 2048)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !695, file: !476, line: 347, baseType: !700, size: 768, offset: 2304)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !695, file: !476, line: 348, baseType: !698, size: 256, offset: 3072)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !695, file: !476, line: 349, baseType: !700, size: 768, offset: 3328)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !695, file: !476, line: 350, baseType: !698, size: 256, offset: 4096)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !695, file: !476, line: 351, baseType: !711, size: 1792, offset: 4352)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1792, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 56)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !695, file: !476, line: 352, baseType: !715, size: 1920, offset: 6144)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 1920, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 240)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !695, file: !476, line: 353, baseType: !719, size: 20608, offset: 8064)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 20608, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 644)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !695, file: !476, line: 354, baseType: !23, size: 32, offset: 28672)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !476, line: 397, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 374, size: 1120, flags: DIFlagTypePassByValue, elements: !726, identifier: "_ZTS8SCB_Type")
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !725, file: !476, line: 376, baseType: !480, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !725, file: !476, line: 377, baseType: !23, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !725, file: !476, line: 378, baseType: !23, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !725, file: !476, line: 379, baseType: !23, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !725, file: !476, line: 380, baseType: !23, size: 32, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !725, file: !476, line: 381, baseType: !23, size: 32, offset: 160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !725, file: !476, line: 382, baseType: !487, size: 96, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !725, file: !476, line: 383, baseType: !23, size: 32, offset: 288)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !725, file: !476, line: 384, baseType: !23, size: 32, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !725, file: !476, line: 385, baseType: !23, size: 32, offset: 352)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !725, file: !476, line: 386, baseType: !23, size: 32, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !725, file: !476, line: 387, baseType: !23, size: 32, offset: 416)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !725, file: !476, line: 388, baseType: !23, size: 32, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !725, file: !476, line: 389, baseType: !23, size: 32, offset: 480)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !725, file: !476, line: 390, baseType: !499, size: 64, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !725, file: !476, line: 391, baseType: !480, size: 32, offset: 576)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !725, file: !476, line: 392, baseType: !480, size: 32, offset: 608)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !725, file: !476, line: 393, baseType: !505, size: 128, offset: 640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !725, file: !476, line: 394, baseType: !509, size: 160, offset: 768)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !725, file: !476, line: 395, baseType: !513, size: 160, offset: 928)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !725, file: !476, line: 396, baseType: !23, size: 32, offset: 1088)
!748 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !51, file: !205, line: 51, size: 1536, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !749, vtableHolder: !99)
!749 = !{!750, !753, !756, !757, !793, !794, !795, !796, !798, !802, !805, !808, !811, !814, !817, !818, !821, !822, !827, !830, !831, !832, !835, !836, !840, !844}
!750 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !748, baseType: !751, flags: DIFlagPublic, extraData: i32 0)
!751 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BufferedSerial", scope: !51, file: !752, line: 42, size: 832, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada14BufferedSerialE")
!752 = !DIFile(filename: "../cicada/bufferedserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "b9c9871d742db1af5ee8abb5df52fc59")
!753 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !748, file: !205, line: 120, baseType: !754, flags: DIFlagStaticMember)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 128, elements: !506)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !748, file: !205, line: 122, baseType: !40, size: 8, offset: 832)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_handle", scope: !748, file: !205, line: 123, baseType: !758, size: 576, offset: 864)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_HandleTypeDef", file: !658, line: 189, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__UART_HandleTypeDef", file: !658, line: 141, size: 576, flags: DIFlagTypePassByValue, elements: !760, identifier: "_ZTS20__UART_HandleTypeDef")
!760 = !{!761, !762, !773, !774, !775, !777, !778, !779, !780, !785, !786, !788, !791, !792}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Instance", scope: !759, file: !658, line: 143, baseType: !17, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Init", scope: !759, file: !658, line: 145, baseType: !763, size: 224, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_InitTypeDef", file: !658, line: 76, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !658, line: 47, size: 224, flags: DIFlagTypePassByValue, elements: !765, identifier: "_ZTS16UART_InitTypeDef")
!765 = !{!766, !767, !768, !769, !770, !771, !772}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "BaudRate", scope: !764, file: !658, line: 49, baseType: !24, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "WordLength", scope: !764, file: !658, line: 54, baseType: !24, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "StopBits", scope: !764, file: !658, line: 57, baseType: !24, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Parity", scope: !764, file: !658, line: 60, baseType: !24, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !764, file: !658, line: 67, baseType: !24, size: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "HwFlowCtl", scope: !764, file: !658, line: 70, baseType: !24, size: 32, offset: 160)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "OverSampling", scope: !764, file: !658, line: 73, baseType: !24, size: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pTxBuffPtr", scope: !759, file: !658, line: 147, baseType: !45, size: 32, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferSize", scope: !759, file: !658, line: 149, baseType: !37, size: 16, offset: 288)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferCount", scope: !759, file: !658, line: 151, baseType: !776, size: 16, offset: 304)
!776 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pRxBuffPtr", scope: !759, file: !658, line: 153, baseType: !45, size: 32, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferSize", scope: !759, file: !658, line: 155, baseType: !37, size: 16, offset: 352)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferCount", scope: !759, file: !658, line: 157, baseType: !776, size: 16, offset: 368)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "hdmatx", scope: !759, file: !658, line: 159, baseType: !781, size: 32, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HandleTypeDef", file: !783, line: 137, baseType: !784)
!783 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_dma.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dd8e7645a79a80f8166404bb078b3d4e")
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__DMA_HandleTypeDef", file: !783, line: 111, size: 576, flags: DIFlagFwdDecl, identifier: "_ZTS19__DMA_HandleTypeDef")
!785 = !DIDerivedType(tag: DW_TAG_member, name: "hdmarx", scope: !759, file: !658, line: 161, baseType: !781, size: 32, offset: 416)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !759, file: !658, line: 163, baseType: !787, size: 32, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_LockTypeDef", file: !9, line: 56, baseType: !653)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gState", scope: !759, file: !658, line: 165, baseType: !789, size: 32, offset: 480)
!789 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_UART_StateTypeDef", file: !658, line: 136, baseType: !657)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "RxState", scope: !759, file: !658, line: 169, baseType: !789, size: 32, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorCode", scope: !759, file: !658, line: 172, baseType: !23, size: 32, offset: 544)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_uartPort", scope: !748, file: !205, line: 124, baseType: !34, size: 32, offset: 1440)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_txPin", scope: !748, file: !205, line: 125, baseType: !37, size: 16, offset: 1472)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_rxPin", scope: !748, file: !205, line: 126, baseType: !37, size: 16, offset: 1488)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_uartInterruptInstance", scope: !748, file: !205, line: 127, baseType: !797, size: 32, offset: 1504)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !19, line: 126, baseType: !652)
!798 = !DISubprogram(name: "Stm32Uart", scope: !748, file: !205, line: 66, type: !799, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !801, !338, !338, !110, !17, !34, !37, !37}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!802 = !DISubprogram(name: "Stm32Uart", scope: !748, file: !205, line: 83, type: !803, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !801, !338, !338, !110, !110, !17, !34, !37, !37}
!805 = !DISubprogram(name: "~Stm32Uart", scope: !748, file: !205, line: 86, type: !806, scopeLine: 86, containingType: !748, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !801}
!808 = !DISubprogram(name: "getInstance", linkageName: "_ZN6Cicada9Stm32Uart11getInstanceEP13USART_TypeDef", scope: !748, file: !205, line: 88, type: !809, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!809 = !DISubroutineType(types: !810)
!810 = !{!755, !17}
!811 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEv", scope: !748, file: !205, line: 93, type: !812, scopeLine: 93, containingType: !748, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!812 = !DISubroutineType(types: !813)
!813 = !{!62, !801}
!814 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEh", scope: !748, file: !205, line: 100, type: !815, scopeLine: 100, containingType: !748, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!815 = !DISubroutineType(types: !816)
!816 = !{!62, !801, !40}
!817 = !DISubprogram(name: "isOpen", linkageName: "_ZN6Cicada9Stm32Uart6isOpenEv", scope: !748, file: !205, line: 102, type: !812, scopeLine: 102, containingType: !748, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!818 = !DISubprogram(name: "setSerialConfig", linkageName: "_ZN6Cicada9Stm32Uart15setSerialConfigEjh", scope: !748, file: !205, line: 103, type: !819, scopeLine: 103, containingType: !748, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!819 = !DISubroutineType(types: !820)
!820 = !{!62, !801, !24, !40}
!821 = !DISubprogram(name: "close", linkageName: "_ZN6Cicada9Stm32Uart5closeEv", scope: !748, file: !205, line: 104, type: !806, scopeLine: 104, containingType: !748, virtualIndex: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!822 = !DISubprogram(name: "portName", linkageName: "_ZNK6Cicada9Stm32Uart8portNameEv", scope: !748, file: !205, line: 105, type: !823, scopeLine: 105, containingType: !748, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!823 = !DISubroutineType(types: !824)
!824 = !{!147, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !748)
!827 = !DISubprogram(name: "rawRead", linkageName: "_ZN6Cicada9Stm32Uart7rawReadERh", scope: !748, file: !205, line: 106, type: !828, scopeLine: 106, containingType: !748, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!828 = !DISubroutineType(types: !829)
!829 = !{!62, !801, !155}
!830 = !DISubprogram(name: "rawWrite", linkageName: "_ZN6Cicada9Stm32Uart8rawWriteEh", scope: !748, file: !205, line: 107, type: !815, scopeLine: 107, containingType: !748, virtualIndex: 22, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!831 = !DISubprogram(name: "startTransmit", linkageName: "_ZN6Cicada9Stm32Uart13startTransmitEv", scope: !748, file: !205, line: 108, type: !806, scopeLine: 108, containingType: !748, virtualIndex: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!832 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada9Stm32Uart20writeBufferProcessedEv", scope: !748, file: !205, line: 109, type: !833, scopeLine: 109, containingType: !748, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!833 = !DISubroutineType(types: !834)
!834 = !{!62, !825}
!835 = !DISubprogram(name: "handleInterrupt", linkageName: "_ZN6Cicada9Stm32Uart15handleInterruptEv", scope: !748, file: !205, line: 111, type: !806, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!836 = !DISubprogram(name: "Stm32Uart", scope: !748, file: !205, line: 115, type: !837, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !801, !839}
!839 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !826, size: 32)
!840 = !DISubprogram(name: "operator=", linkageName: "_ZN6Cicada9Stm32UartaSERKS0_", scope: !748, file: !205, line: 116, type: !841, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!841 = !DISubroutineType(types: !842)
!842 = !{!843, !801, !839}
!843 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !748, size: 32)
!844 = !DISubprogram(name: "init", linkageName: "_ZN6Cicada9Stm32Uart4initEP13USART_TypeDef", scope: !748, file: !205, line: 118, type: !845, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !801, !17}
!847 = !{!647}
!848 = !{!233, !239, !243, !246, !250, !253, !255, !257, !259, !262, !265, !268, !271, !274, !277, !278, !279, !280, !281, !283, !285, !287, !289, !292, !295, !298, !301, !304, !849}
!849 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !649, entity: !51, file: !650, line: 28)
!850 = distinct !DICompileUnit(language: DW_LANG_C99, file: !851, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !852, retainedTypes: !857, splitDebugInlining: false, nameTableKind: None)
!851 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_rcc.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "bf5d5e021854d33cea3d58ed6b9d5087")
!852 = !{!538, !454, !853}
!853 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !455, line: 157, baseType: !10, size: 32, elements: !854)
!854 = !{!855, !856}
!855 = !DIEnumerator(name: "DISABLE", value: 0)
!856 = !DIEnumerator(name: "ENABLE", value: 1)
!857 = !{!858, !24, !312, !40, !872, !873, !879, !37, !892, !903}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !860, file: !19, line: 426, baseType: !23, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !860, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !860, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !860, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !860, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !860, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !860, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !860, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !860, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !860, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !19, line: 418, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 414, size: 64, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !875, file: !19, line: 416, baseType: !23, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !875, file: !19, line: 417, baseType: !23, size: 32, offset: 32)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !19, line: 336, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 325, size: 288, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !881, file: !19, line: 327, baseType: !23, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !881, file: !19, line: 328, baseType: !23, size: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !881, file: !19, line: 329, baseType: !23, size: 32, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !881, file: !19, line: 330, baseType: !23, size: 32, offset: 96)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !881, file: !19, line: 331, baseType: !23, size: 32, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !881, file: !19, line: 332, baseType: !23, size: 32, offset: 160)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !881, file: !19, line: 333, baseType: !23, size: 32, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !881, file: !19, line: 334, baseType: !23, size: 32, offset: 224)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !881, file: !19, line: 335, baseType: !23, size: 32, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !19, line: 367, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 358, size: 224, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "CRL", scope: !894, file: !19, line: 360, baseType: !23, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "CRH", scope: !894, file: !19, line: 361, baseType: !23, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !894, file: !19, line: 362, baseType: !23, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !894, file: !19, line: 363, baseType: !23, size: 32, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !894, file: !19, line: 364, baseType: !23, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !894, file: !19, line: 365, baseType: !23, size: 32, offset: 160)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !894, file: !19, line: 366, baseType: !23, size: 32, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !906, retainedTypes: !907, splitDebugInlining: false, nameTableKind: None)
!905 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_cortex.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "83cb8d6817603f64d73dca2a0b01efa1")
!906 = !{!544}
!907 = !{!908, !24, !916, !244, !40, !941}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !476, line: 700, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 694, size: 128, elements: !911)
!911 = !{!912, !913, !914, !915}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !910, file: !476, line: 696, baseType: !23, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !910, file: !476, line: 697, baseType: !23, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !910, file: !476, line: 698, baseType: !23, size: 32, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !910, file: !476, line: 699, baseType: !480, size: 32, offset: 96)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !476, line: 397, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 374, size: 1120, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !918, file: !476, line: 376, baseType: !480, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !918, file: !476, line: 377, baseType: !23, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !918, file: !476, line: 378, baseType: !23, size: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !918, file: !476, line: 379, baseType: !23, size: 32, offset: 96)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !918, file: !476, line: 380, baseType: !23, size: 32, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !918, file: !476, line: 381, baseType: !23, size: 32, offset: 160)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !918, file: !476, line: 382, baseType: !487, size: 96, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !918, file: !476, line: 383, baseType: !23, size: 32, offset: 288)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !918, file: !476, line: 384, baseType: !23, size: 32, offset: 320)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !918, file: !476, line: 385, baseType: !23, size: 32, offset: 352)
