; ModuleID = './examples/dualport_freertos.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct.xSTATIC_TCB = type { i8*, [2 x %struct.xSTATIC_LIST_ITEM], i32, i8*, [16 x i8], i32, i8 }
%struct.xSTATIC_LIST_ITEM = type { i32, [4 x i8*] }
%"class.Cicada::Stm32Uart" = type { %"class.Cicada::BufferedSerial", i8, %struct.__UART_HandleTypeDef, %struct.USART_TypeDef*, i16, i16, i32 }
%"class.Cicada::BufferedSerial" = type { %"class.Cicada::IBufferedSerial", %"class.Cicada::LineCircularBuffer", %"class.Cicada::LineCircularBuffer" }
%"class.Cicada::IBufferedSerial" = type { %"class.Cicada::ICommDevice", %"class.Cicada::ICommDevice" }
%"class.Cicada::ICommDevice" = type { i32 (...)** }
%"class.Cicada::LineCircularBuffer" = type { %"class.Cicada::CircularBuffer.base", i16, [2 x i8] }
%"class.Cicada::CircularBuffer.base" = type <{ i32 (...)**, [4 x i8], i64, i64, i64, i64, i8* }>
%struct.__UART_HandleTypeDef = type { %struct.USART_TypeDef*, %struct.USART_TypeDef, i8*, i16, i16, i8*, i16, i16, %struct.__DMA_HandleTypeDef*, %struct.__DMA_HandleTypeDef*, i32, i32, i32, i32 }
%struct.USART_TypeDef = type { i32, i32, i32, i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xStack", scope: !2, file: !3, line: 18, type: !197, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !46, imports: !117, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../examples/stm32f1/dualport_freertos.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "a0144c24190a5db8717462da8fead24b")
!4 = !{!5}
!5 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 41, baseType: !7, size: 32, elements: !8, identifier: "_ZTS17HAL_StatusTypeDef")
!6 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_def.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "4d6e0bbb91efacee14a68a416f506def")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "HAL_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HAL_ERROR", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "HAL_BUSY", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3, isUnsigned: true)
!13 = !{!14, !31, !34, !37, !42, !43, !39}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "USART_TypeDef", file: !16, line: 516, baseType: !17)
!16 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f103xb.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "d2562af6d7239ab46ca8ba238a43c848")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 507, size: 224, flags: DIFlagTypePassByValue, elements: !18, identifier: "_ZTS13USART_TypeDef")
!18 = !{!19, !25, !26, !27, !28, !29, !30}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !17, file: !16, line: 509, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 48, baseType: !23)
!22 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ab914e287601b2385e57880e6599aa6b")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !24, line: 79, baseType: !7)
!24 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f7024d0682a918b41f94e8be9cd90461")
!25 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !17, file: !16, line: 510, baseType: !20, size: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !17, file: !16, line: 511, baseType: !20, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !17, file: !16, line: 512, baseType: !20, size: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !17, file: !16, line: 513, baseType: !20, size: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "CR3", scope: !17, file: !16, line: 514, baseType: !20, size: 32, offset: 160)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "GTPR", scope: !17, file: !16, line: 515, baseType: !20, size: 32, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !16, line: 367, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 358, size: 224, flags: DIFlagFwdDecl, identifier: "_ZTS12GPIO_TypeDef")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !22, line: 36, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !24, line: 57, baseType: !36)
!36 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 24, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !24, line: 43, baseType: !41)
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "UBaseType_t", file: !44, line: 57, baseType: !45)
!44 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/portable/GCC/ARM_CM3/portmacro.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5fd77bad595782d66ff9acd907773be8")
!45 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!46 = !{!0, !47, !76, !91, !96, !106, !109}
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "xTaskBuffer", scope: !2, file: !3, line: 19, type: !49, isLocal: false, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "StaticTask_t", file: !50, line: 1030, baseType: !51)
!50 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/include/FreeRTOS.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "35901dd1e618d03882fd7fe7e54fee1a")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xSTATIC_TCB", file: !50, line: 984, size: 608, flags: DIFlagTypePassByValue, elements: !52, identifier: "_ZTS11xSTATIC_TCB")
!52 = !{!53, !55, !68, !69, !70, !74, !75}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "pxDummy1", scope: !51, file: !50, line: 986, baseType: !54, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "xDummy3", scope: !51, file: !50, line: 990, baseType: !56, size: 320, offset: 32)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 320, elements: !66)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "StaticListItem_t", file: !50, line: 953, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xSTATIC_LIST_ITEM", file: !50, line: 948, size: 160, flags: DIFlagTypePassByValue, elements: !59, identifier: "_ZTS17xSTATIC_LIST_ITEM")
!59 = !{!60, !62}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "xDummy1", scope: !58, file: !50, line: 950, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "TickType_t", file: !44, line: 63, baseType: !21)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pvDummy2", scope: !58, file: !50, line: 951, baseType: !63, size: 128, offset: 32)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 4)
!66 = !{!67}
!67 = !DISubrange(count: 2)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "uxDummy5", scope: !51, file: !50, line: 991, baseType: !43, size: 32, offset: 352)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pxDummy6", scope: !51, file: !50, line: 992, baseType: !54, size: 32, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ucDummy7", scope: !51, file: !50, line: 993, baseType: !71, size: 128, offset: 416)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ulDummy18", scope: !51, file: !50, line: 1019, baseType: !21, size: 32, offset: 544)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ucDummy19", scope: !51, file: !50, line: 1020, baseType: !39, size: 8, offset: 576)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "xIdleTaskTCB", scope: !78, file: !3, line: 108, type: !49, isLocal: true, isDefinition: true)
!78 = distinct !DISubprogram(name: "vApplicationGetIdleTaskMemory", scope: !3, file: !3, line: 105, type: !79, scopeLine: 107, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !87)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !81, !83, !86}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "StackType_t", file: !44, line: 55, baseType: !21)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!87 = !{!88, !89, !90}
!88 = !DILocalVariable(name: "ppxIdleTaskTCBBuffer", arg: 1, scope: !78, file: !3, line: 105, type: !81)
!89 = !DILocalVariable(name: "ppxIdleTaskStackBuffer", arg: 2, scope: !78, file: !3, line: 106, type: !83)
!90 = !DILocalVariable(name: "pulIdleTaskStackSize", arg: 3, scope: !78, file: !3, line: 106, type: !86)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "uxIdleTaskStack", scope: !78, file: !3, line: 109, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 4096, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 128)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "instance", scope: !98, file: !3, line: 124, type: !102, isLocal: true, isDefinition: true)
!98 = distinct !DISubprogram(name: "USART1_IRQHandler", scope: !3, file: !3, line: 122, type: !99, scopeLine: 123, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !101)
!99 = !DISubroutineType(types: !100)
!100 = !{null}
!101 = !{}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !105, file: !104, line: 51, size: 1536, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada9Stm32UartE")
!104 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "f1205a68111afe9a0868ac35ca31b4e6")
!105 = !DINamespace(name: "Cicada", scope: null)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "instance", scope: !108, file: !3, line: 130, type: !102, isLocal: true, isDefinition: true)
!108 = distinct !DISubprogram(name: "USART2_IRQHandler", scope: !3, file: !3, line: 128, type: !99, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !101)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "serial", scope: !111, file: !3, line: 136, type: !102, isLocal: true, isDefinition: true)
!111 = distinct !DISubprogram(name: "_putchar", scope: !3, file: !3, line: 134, type: !112, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !115)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !114}
!114 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!115 = !{!116}
!116 = !DILocalVariable(name: "c", arg: 1, scope: !111, file: !3, line: 134, type: !114)
!117 = !{!118, !124, !128, !132, !136, !139, !141, !143, !145, !148, !151, !154, !157, !160, !163, !164, !165, !166, !170, !172, !174, !176, !178, !181, !184, !187, !190, !193, !196}
!118 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !120, file: !123, line: 47)
!119 = !DINamespace(name: "std", scope: null)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !22, line: 20, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !24, line: 41, baseType: !122)
!122 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!123 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstdint", directory: "/home/mjshen/RTOSExploration")
!124 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !125, file: !123, line: 48)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !22, line: 32, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !24, line: 55, baseType: !127)
!127 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!128 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !129, file: !123, line: 49)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !22, line: 44, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !24, line: 77, baseType: !131)
!131 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!132 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !133, file: !123, line: 50)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !22, line: 56, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !24, line: 103, baseType: !135)
!135 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!136 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !137, file: !123, line: 52)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !138, line: 51, baseType: !122)
!138 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "a169a1d650067906a9e00519a9405ebb")
!139 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !140, file: !123, line: 53)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !138, line: 61, baseType: !127)
!141 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !142, file: !123, line: 54)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !138, line: 71, baseType: !131)
!143 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !144, file: !123, line: 55)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !138, line: 81, baseType: !135)
!145 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !146, file: !123, line: 57)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !138, line: 21, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !24, line: 134, baseType: !122)
!148 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !149, file: !123, line: 58)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !138, line: 27, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !24, line: 160, baseType: !127)
!151 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !152, file: !123, line: 59)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !138, line: 33, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !24, line: 182, baseType: !131)
!154 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !155, file: !123, line: 60)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !138, line: 39, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !24, line: 200, baseType: !135)
!157 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !158, file: !123, line: 62)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !22, line: 67, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !24, line: 214, baseType: !135)
!160 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !161, file: !123, line: 63)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !22, line: 77, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !24, line: 230, baseType: !131)
!163 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !39, file: !123, line: 65)
!164 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !34, file: !123, line: 66)
!165 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !21, file: !123, line: 67)
!166 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !167, file: !123, line: 68)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 60, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !24, line: 105, baseType: !169)
!169 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!170 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !171, file: !123, line: 70)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !138, line: 52, baseType: !41)
!172 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !173, file: !123, line: 71)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !138, line: 62, baseType: !36)
!174 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !175, file: !123, line: 72)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !138, line: 72, baseType: !7)
!176 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !177, file: !123, line: 73)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !138, line: 82, baseType: !169)
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !179, file: !123, line: 75)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !138, line: 22, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !24, line: 136, baseType: !41)
!181 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !182, file: !123, line: 76)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !138, line: 28, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !24, line: 162, baseType: !36)
!184 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !185, file: !123, line: 77)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !138, line: 34, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !24, line: 184, baseType: !7)
!187 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !188, file: !123, line: 78)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !138, line: 40, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !24, line: 202, baseType: !169)
!190 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !191, file: !123, line: 80)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !22, line: 72, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !24, line: 222, baseType: !169)
!193 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !119, entity: !194, file: !123, line: 81)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !22, line: 82, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !24, line: 232, baseType: !7)
!196 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !105, file: !3, line: 15)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 65536, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 2048)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "pow10", scope: !202, file: !203, line: 311, type: !259, isLocal: true, isDefinition: true)
!202 = distinct !DISubprogram(name: "_ftoa", scope: !203, file: !203, line: 299, type: !204, scopeLine: 300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !214, retainedNodes: !226)
!203 = !DIFile(filename: "../dep/printf/src/printf.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "7383fa86adf0d25d8eda174a9b330d6a")
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !208, !212, !206, !206, !213, !7, !7, !7}
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !207, line: 46, baseType: !7)
!207 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_type", file: !203, line: 97, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !114, !54, !206, !206}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!213 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!214 = distinct !DICompileUnit(language: DW_LANG_C99, file: !203, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !215, globals: !225, splitDebugInlining: false, nameTableKind: None)
!215 = !{!206, !212, !194, !7, !131, !169, !45, !114, !127, !41, !36, !213, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_wrap_type", file: !203, line: 104, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 101, size: 64, elements: !219)
!219 = !{!220, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "fct", scope: !218, file: !203, line: 102, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !114, !54}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !218, file: !203, line: 103, baseType: !54, size: 32, offset: 32)
!225 = !{!200}
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !237, !241, !242, !243, !245, !247, !248, !249, !250, !253, !257}
!227 = !DILocalVariable(name: "out", arg: 1, scope: !202, file: !203, line: 299, type: !208)
!228 = !DILocalVariable(name: "buffer", arg: 2, scope: !202, file: !203, line: 299, type: !212)
!229 = !DILocalVariable(name: "idx", arg: 3, scope: !202, file: !203, line: 299, type: !206)
!230 = !DILocalVariable(name: "maxlen", arg: 4, scope: !202, file: !203, line: 299, type: !206)
!231 = !DILocalVariable(name: "value", arg: 5, scope: !202, file: !203, line: 299, type: !213)
!232 = !DILocalVariable(name: "prec", arg: 6, scope: !202, file: !203, line: 299, type: !7)
!233 = !DILocalVariable(name: "width", arg: 7, scope: !202, file: !203, line: 299, type: !7)
!234 = !DILocalVariable(name: "flags", arg: 8, scope: !202, file: !203, line: 299, type: !7)
!235 = !DILocalVariable(name: "start_idx", scope: !202, file: !203, line: 301, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!237 = !DILocalVariable(name: "buf", scope: !202, file: !203, line: 303, type: !238)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 256, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 32)
!241 = !DILocalVariable(name: "len", scope: !202, file: !203, line: 304, type: !206)
!242 = !DILocalVariable(name: "diff", scope: !202, file: !203, line: 305, type: !213)
!243 = !DILocalVariable(name: "thres_max", scope: !202, file: !203, line: 308, type: !244)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!245 = !DILocalVariable(name: "negative", scope: !202, file: !203, line: 322, type: !246)
!246 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!247 = !DILocalVariable(name: "whole", scope: !202, file: !203, line: 338, type: !131)
!248 = !DILocalVariable(name: "tmp", scope: !202, file: !203, line: 339, type: !213)
!249 = !DILocalVariable(name: "frac", scope: !202, file: !203, line: 340, type: !45)
!250 = !DILocalVariable(name: "count", scope: !251, file: !203, line: 373, type: !7)
!251 = distinct !DILexicalBlock(scope: !252, file: !203, line: 372, column: 8)
!252 = distinct !DILexicalBlock(scope: !202, file: !203, line: 364, column: 7)
!253 = !DILocalVariable(name: "i", scope: !254, file: !203, line: 424, type: !206)
!254 = distinct !DILexicalBlock(scope: !255, file: !203, line: 424, column: 5)
!255 = distinct !DILexicalBlock(scope: !256, file: !203, line: 423, column: 58)
!256 = distinct !DILexicalBlock(scope: !202, file: !203, line: 423, column: 7)
!257 = !DILocalVariable(name: "i", scope: !258, file: !203, line: 430, type: !206)
!258 = distinct !DILexicalBlock(scope: !202, file: !203, line: 430, column: 3)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 640, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 10)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "AHBPrescTable", scope: !264, file: !265, line: 124, type: !332, isLocal: false, isDefinition: true)
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !266, retainedTypes: !272, globals: !324, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Source/Templates/system_stm32f1xx.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "2e873de3002e5d783190a46ff1c7da2d")
!266 = !{!267}
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !268, line: 151, baseType: !7, size: 32, elements: !269)
!268 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xx.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dc4ed8bdf8589b30d30d93eb6ee6ca27")
!269 = !{!270, !271}
!270 = !DIEnumerator(name: "RESET", value: 0)
!271 = !DIEnumerator(name: "SET", value: 1)
!272 = !{!273, !287, !21}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !16, line: 438, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 424, size: 320, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !275, file: !16, line: 426, baseType: !20, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !275, file: !16, line: 427, baseType: !20, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !275, file: !16, line: 428, baseType: !20, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !275, file: !16, line: 429, baseType: !20, size: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !275, file: !16, line: 430, baseType: !20, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !275, file: !16, line: 431, baseType: !20, size: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !275, file: !16, line: 432, baseType: !20, size: 32, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !275, file: !16, line: 433, baseType: !20, size: 32, offset: 224)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !275, file: !16, line: 434, baseType: !20, size: 32, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !275, file: !16, line: 435, baseType: !20, size: 32, offset: 288)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !289, line: 397, baseType: !290)
!289 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 374, size: 1120, elements: !291)
!291 = !{!292, !294, !295, !296, !297, !298, !299, !304, !305, !306, !307, !308, !309, !310, !311, !313, !314, !315, !317, !321, !323}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !290, file: !289, line: 376, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !290, file: !289, line: 377, baseType: !20, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !290, file: !289, line: 378, baseType: !20, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !290, file: !289, line: 379, baseType: !20, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !290, file: !289, line: 380, baseType: !20, size: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !290, file: !289, line: 381, baseType: !20, size: 32, offset: 160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !290, file: !289, line: 382, baseType: !300, size: 96, offset: 192)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 96, elements: !302)
!301 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!302 = !{!303}
!303 = !DISubrange(count: 12)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !290, file: !289, line: 383, baseType: !20, size: 32, offset: 288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !290, file: !289, line: 384, baseType: !20, size: 32, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !290, file: !289, line: 385, baseType: !20, size: 32, offset: 352)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !290, file: !289, line: 386, baseType: !20, size: 32, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !290, file: !289, line: 387, baseType: !20, size: 32, offset: 416)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !290, file: !289, line: 388, baseType: !20, size: 32, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !290, file: !289, line: 389, baseType: !20, size: 32, offset: 480)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !290, file: !289, line: 390, baseType: !312, size: 64, offset: 512)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 64, elements: !66)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !290, file: !289, line: 391, baseType: !293, size: 32, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !290, file: !289, line: 392, baseType: !293, size: 32, offset: 608)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !290, file: !289, line: 393, baseType: !316, size: 128, offset: 640)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 128, elements: !64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !290, file: !289, line: 394, baseType: !318, size: 160, offset: 768)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 160, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 5)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !290, file: !289, line: 395, baseType: !322, size: 160, offset: 928)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, elements: !319)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !290, file: !289, line: 396, baseType: !20, size: 32, offset: 1088)
!324 = !{!325, !262, !327}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !264, file: !265, line: 123, type: !21, isLocal: false, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "APBPrescTable", scope: !264, file: !265, line: 125, type: !329, isLocal: false, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 8)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 128, elements: !72)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "uwTickPrio", scope: !335, file: !336, line: 80, type: !21, isLocal: false, isDefinition: true)
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !337, retainedTypes: !405, globals: !447, splitDebugInlining: false, nameTableKind: None)
!336 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "1a5fa7b79e9e470cf817b81d791a6ccb")
!337 = !{!338, !345, !351}
!338 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !339, line: 49, baseType: !7, size: 32, elements: !340)
!339 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5eab64b252ccd159497a11d87d26bc0b")
!340 = !{!341, !342, !343, !344}
!341 = !DIEnumerator(name: "HAL_TICK_FREQ_10HZ", value: 100)
!342 = !DIEnumerator(name: "HAL_TICK_FREQ_100HZ", value: 10)
!343 = !DIEnumerator(name: "HAL_TICK_FREQ_1KHZ", value: 1)
!344 = !DIEnumerator(name: "HAL_TICK_FREQ_DEFAULT", value: 1)
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 41, baseType: !7, size: 32, elements: !346)
!346 = !{!347, !348, !349, !350}
!347 = !DIEnumerator(name: "HAL_OK", value: 0)
!348 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!349 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!350 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 69, baseType: !131, size: 32, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!353 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!354 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!355 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!356 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!357 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!358 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!359 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!360 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!361 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!362 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!363 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!364 = !DIEnumerator(name: "TAMPER_IRQn", value: 2)
!365 = !DIEnumerator(name: "RTC_IRQn", value: 3)
!366 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!367 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!368 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!369 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!370 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!371 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!372 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!373 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!374 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!375 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!376 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!377 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!378 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!379 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!380 = !DIEnumerator(name: "ADC1_2_IRQn", value: 18)
!381 = !DIEnumerator(name: "USB_HP_CAN1_TX_IRQn", value: 19)
!382 = !DIEnumerator(name: "USB_LP_CAN1_RX0_IRQn", value: 20)
!383 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!384 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!385 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!386 = !DIEnumerator(name: "TIM1_BRK_IRQn", value: 24)
!387 = !DIEnumerator(name: "TIM1_UP_IRQn", value: 25)
!388 = !DIEnumerator(name: "TIM1_TRG_COM_IRQn", value: 26)
!389 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!390 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!391 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!392 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!393 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!394 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!395 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!396 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!397 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!398 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!399 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!400 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!401 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!402 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!403 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!404 = !DIEnumerator(name: "USBWakeUp_IRQn", value: 42)
!405 = !{!406, !21, !419, !433, !441, !86}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !16, line: 336, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 325, size: 288, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !408, file: !16, line: 327, baseType: !20, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !408, file: !16, line: 328, baseType: !20, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !408, file: !16, line: 329, baseType: !20, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !408, file: !16, line: 330, baseType: !20, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !408, file: !16, line: 331, baseType: !20, size: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !408, file: !16, line: 332, baseType: !20, size: 32, offset: 160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !408, file: !16, line: 333, baseType: !20, size: 32, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !408, file: !16, line: 334, baseType: !20, size: 32, offset: 224)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !408, file: !16, line: 335, baseType: !20, size: 32, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !16, line: 438, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 424, size: 320, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !421, file: !16, line: 426, baseType: !20, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !421, file: !16, line: 427, baseType: !20, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !421, file: !16, line: 428, baseType: !20, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !421, file: !16, line: 429, baseType: !20, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !421, file: !16, line: 430, baseType: !20, size: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !421, file: !16, line: 431, baseType: !20, size: 32, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !421, file: !16, line: 432, baseType: !20, size: 32, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !421, file: !16, line: 433, baseType: !20, size: 32, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !421, file: !16, line: 434, baseType: !20, size: 32, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !421, file: !16, line: 435, baseType: !20, size: 32, offset: 288)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !289, line: 700, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 694, size: 128, elements: !436)
!436 = !{!437, !438, !439, !440}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !435, file: !289, line: 696, baseType: !20, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !435, file: !289, line: 697, baseType: !20, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !435, file: !289, line: 698, baseType: !20, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !435, file: !289, line: 699, baseType: !293, size: 32, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBGMCU_TypeDef", file: !16, line: 285, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 281, size: 64, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "IDCODE", scope: !443, file: !16, line: 283, baseType: !20, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !443, file: !16, line: 284, baseType: !20, size: 32, offset: 32)
!447 = !{!333, !448, !451}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "uwTickFreq", scope: !335, file: !336, line: 81, type: !450, isLocal: false, isDefinition: true)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_TickFreqTypeDef", file: !339, line: 55, baseType: !338)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "uwTick", scope: !335, file: !336, line: 79, type: !20, isLocal: false, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "ucMaxSysCallPriority", scope: !455, file: !456, line: 164, type: !39, isLocal: true, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !457, globals: !462, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/portable/GCC/ARM_CM3/port.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "3134ad912cd7b4d155d138db3d2b3f77")
!457 = !{!85, !458, !39, !21, !459, !460, !61}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "BaseType_t", file: !44, line: 56, baseType: !461)
!461 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!462 = !{!463, !453, !468, !470}
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "pcInterruptPriorityRegisters", scope: !455, file: !456, line: 166, type: !465, isLocal: true, isDefinition: true)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "ulMaxPRIGROUPValue", scope: !455, file: !456, line: 165, type: !21, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "uxCriticalNesting", scope: !455, file: !456, line: 133, type: !43, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "pxCurrentTCB", scope: !474, file: !475, line: 348, type: !569, isLocal: false, isDefinition: true)
!474 = distinct !DICompileUnit(language: DW_LANG_C99, file: !475, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !476, retainedTypes: !485, globals: !513, splitDebugInlining: false, nameTableKind: None)
!475 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/tasks.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "4c78d8e6db8748ab90199895767857f2")
!476 = !{!477}
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !478, line: 81, baseType: !7, size: 32, elements: !479)
!478 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/include/task.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "d024d745131a960c5ab0e9fb4124ba87")
!479 = !{!480, !481, !482, !483, !484}
!480 = !DIEnumerator(name: "eNoAction", value: 0)
!481 = !DIEnumerator(name: "eSetBits", value: 1)
!482 = !DIEnumerator(name: "eIncrement", value: 2)
!483 = !DIEnumerator(name: "eSetValueWithOverwrite", value: 3)
!484 = !DIEnumerator(name: "eSetValueWithoutOverwrite", value: 4)
!485 = !{!54, !486, !84, !460, !61, !459, !43, !21, !39, !512}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCB_t", file: !475, line: 343, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "tskTCB", file: !475, line: 339, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tskTaskControlBlock", file: !475, line: 269, size: 608, elements: !490)
!490 = !{!491, !494, !505, !506, !507, !508, !510, !511}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pxTopOfStack", scope: !489, file: !475, line: 271, baseType: !492, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !85)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "xStateListItem", scope: !489, file: !475, line: 277, baseType: !495, size: 160, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !496, line: 149, baseType: !497)
!496 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/include/list.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "da6acc022f4d62328dbc603eb4dcc0f5")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !496, line: 139, size: 160, elements: !498)
!498 = !{!499, !500, !502, !503, !504}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !497, file: !496, line: 142, baseType: !61, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !497, file: !496, line: 143, baseType: !501, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !497, file: !496, line: 144, baseType: !501, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !497, file: !496, line: 145, baseType: !54, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !497, file: !496, line: 146, baseType: !54, size: 32, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "xEventListItem", scope: !489, file: !475, line: 278, baseType: !495, size: 160, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "uxPriority", scope: !489, file: !475, line: 279, baseType: !43, size: 32, offset: 352)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pxStack", scope: !489, file: !475, line: 280, baseType: !84, size: 32, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pcTaskName", scope: !489, file: !475, line: 281, baseType: !509, size: 128, offset: 416)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, elements: !72)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ulNotifiedValue", scope: !489, file: !475, line: 325, baseType: !20, size: 32, offset: 544)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ucNotifyState", scope: !489, file: !475, line: 326, baseType: !301, size: 8, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskHandle_t", file: !478, line: 61, baseType: !54)
!513 = !{!472, !514, !530, !532, !534, !536, !538, !541, !544, !546, !548, !550, !552, !557, !559, !561, !565, !567}
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "xDelayedTaskList1", scope: !474, file: !475, line: 352, type: !516, isLocal: true, isDefinition: true)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "List_t", file: !496, line: 170, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !496, line: 163, size: 160, elements: !518)
!518 = !{!519, !521, !523}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !517, file: !496, line: 166, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !43)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !517, file: !496, line: 167, baseType: !522, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !517, file: !496, line: 168, baseType: !524, size: 96, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !496, line: 158, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !496, line: 151, size: 96, elements: !526)
!526 = !{!527, !528, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !525, file: !496, line: 154, baseType: !61, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !525, file: !496, line: 155, baseType: !501, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !525, file: !496, line: 156, baseType: !501, size: 32, offset: 64)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "xDelayedTaskList2", scope: !474, file: !475, line: 353, type: !516, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "uxTaskNumber", scope: !474, file: !475, line: 379, type: !43, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "uxSchedulerSuspended", scope: !474, file: !475, line: 391, type: !520, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "xIdleTaskHandle", scope: !474, file: !475, line: 381, type: !512, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "xNextTaskUnblockTime", scope: !474, file: !475, line: 380, type: !540, isLocal: true, isDefinition: true)
!540 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "xSchedulerRunning", scope: !474, file: !475, line: 375, type: !543, isLocal: true, isDefinition: true)
!543 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !460)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "xTickCount", scope: !474, file: !475, line: 373, type: !540, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "uxCurrentNumberOfTasks", scope: !474, file: !475, line: 372, type: !520, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "xPendingReadyList", scope: !474, file: !475, line: 356, type: !516, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "uxTopReadyPriority", scope: !474, file: !475, line: 374, type: !520, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "pxReadyTasksLists", scope: !474, file: !475, line: 351, type: !554, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 1120, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 7)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "xYieldPending", scope: !474, file: !475, line: 377, type: !543, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "uxPendedTicks", scope: !474, file: !475, line: 376, type: !520, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "pxDelayedTaskList", scope: !474, file: !475, line: 354, type: !563, isLocal: true, isDefinition: true)
!563 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "pxOverflowDelayedTaskList", scope: !474, file: !475, line: 355, type: !563, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "xNumOfOverflows", scope: !474, file: !475, line: 378, type: !543, isLocal: true, isDefinition: true)
!569 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !486)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "instance", linkageName: "_ZN6Cicada9Stm32Uart8instanceE", scope: !572, file: !573, line: 32, type: !677, isLocal: false, isDefinition: true, declaration: !676)
!572 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !573, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !574, retainedTypes: !591, globals: !803, imports: !804, splitDebugInlining: false, nameTableKind: None)
!573 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "3cfb26aba75e1df83974cb6e4fff6457")
!574 = !{!575, !5, !576, !580}
!575 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 69, baseType: !131, size: 32, elements: !352, identifier: "_ZTS9IRQn_Type")
!576 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 52, baseType: !7, size: 32, elements: !577, identifier: "_ZTS15HAL_LockTypeDef")
!577 = !{!578, !579}
!578 = !DIEnumerator(name: "HAL_UNLOCKED", value: 0, isUnsigned: true)
!579 = !DIEnumerator(name: "HAL_LOCKED", value: 1, isUnsigned: true)
!580 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 117, baseType: !7, size: 32, elements: !582, identifier: "_ZTS21HAL_UART_StateTypeDef")
!581 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "74469f61b271b78e5ff5784cb5eb97d1")
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590}
!583 = !DIEnumerator(name: "HAL_UART_STATE_RESET", value: 0, isUnsigned: true)
!584 = !DIEnumerator(name: "HAL_UART_STATE_READY", value: 32, isUnsigned: true)
!585 = !DIEnumerator(name: "HAL_UART_STATE_BUSY", value: 36, isUnsigned: true)
!586 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX", value: 33, isUnsigned: true)
!587 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_RX", value: 34, isUnsigned: true)
!588 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX_RX", value: 35, isUnsigned: true)
!589 = !DIEnumerator(name: "HAL_UART_STATE_TIMEOUT", value: 160, isUnsigned: true)
!590 = !DIEnumerator(name: "HAL_UART_STATE_ERROR", value: 224, isUnsigned: true)
!591 = !{!21, !14, !592, !602, !31, !39, !34, !129, !616, !646, !671}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFIO_TypeDef", file: !16, line: 380, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 373, size: 256, flags: DIFlagTypePassByValue, elements: !595, identifier: "_ZTS12AFIO_TypeDef")
!595 = !{!596, !597, !598, !600, !601}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "EVCR", scope: !594, file: !16, line: 375, baseType: !20, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR", scope: !594, file: !16, line: 376, baseType: !20, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !594, file: !16, line: 377, baseType: !599, size: 128, offset: 64)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !594, file: !16, line: 378, baseType: !21, size: 32, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR2", scope: !594, file: !16, line: 379, baseType: !20, size: 32, offset: 224)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !16, line: 438, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 424, size: 320, flags: DIFlagTypePassByValue, elements: !605, identifier: "_ZTS11RCC_TypeDef")
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !604, file: !16, line: 426, baseType: !20, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !604, file: !16, line: 427, baseType: !20, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !604, file: !16, line: 428, baseType: !20, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !604, file: !16, line: 429, baseType: !20, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !604, file: !16, line: 430, baseType: !20, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !604, file: !16, line: 431, baseType: !20, size: 32, offset: 160)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !604, file: !16, line: 432, baseType: !20, size: 32, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !604, file: !16, line: 433, baseType: !20, size: 32, offset: 224)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !604, file: !16, line: 434, baseType: !20, size: 32, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !604, file: !16, line: 435, baseType: !20, size: 32, offset: 288)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !289, line: 355, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 340, size: 28704, flags: DIFlagTypePassByValue, elements: !619, identifier: "_ZTS9NVIC_Type")
!619 = !{!620, !622, !626, !627, !628, !629, !630, !631, !632, !633, !637, !641, !645}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !618, file: !289, line: 342, baseType: !621, size: 256)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 256, elements: !330)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !618, file: !289, line: 343, baseType: !623, size: 768, offset: 256)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 768, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 24)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !618, file: !289, line: 344, baseType: !621, size: 256, offset: 1024)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !618, file: !289, line: 345, baseType: !623, size: 768, offset: 1280)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !618, file: !289, line: 346, baseType: !621, size: 256, offset: 2048)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !618, file: !289, line: 347, baseType: !623, size: 768, offset: 2304)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !618, file: !289, line: 348, baseType: !621, size: 256, offset: 3072)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !618, file: !289, line: 349, baseType: !623, size: 768, offset: 3328)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !618, file: !289, line: 350, baseType: !621, size: 256, offset: 4096)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !618, file: !289, line: 351, baseType: !634, size: 1792, offset: 4352)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1792, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 56)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !618, file: !289, line: 352, baseType: !638, size: 1920, offset: 6144)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 1920, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 240)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !618, file: !289, line: 353, baseType: !642, size: 20608, offset: 8064)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 20608, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 644)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !618, file: !289, line: 354, baseType: !20, size: 32, offset: 28672)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !289, line: 397, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 374, size: 1120, flags: DIFlagTypePassByValue, elements: !649, identifier: "_ZTS8SCB_Type")
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !648, file: !289, line: 376, baseType: !293, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !648, file: !289, line: 377, baseType: !20, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !648, file: !289, line: 378, baseType: !20, size: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !648, file: !289, line: 379, baseType: !20, size: 32, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !648, file: !289, line: 380, baseType: !20, size: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !648, file: !289, line: 381, baseType: !20, size: 32, offset: 160)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !648, file: !289, line: 382, baseType: !300, size: 96, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !648, file: !289, line: 383, baseType: !20, size: 32, offset: 288)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !648, file: !289, line: 384, baseType: !20, size: 32, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !648, file: !289, line: 385, baseType: !20, size: 32, offset: 352)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !648, file: !289, line: 386, baseType: !20, size: 32, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !648, file: !289, line: 387, baseType: !20, size: 32, offset: 416)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !648, file: !289, line: 388, baseType: !20, size: 32, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !648, file: !289, line: 389, baseType: !20, size: 32, offset: 480)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !648, file: !289, line: 390, baseType: !312, size: 64, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !648, file: !289, line: 391, baseType: !293, size: 32, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !648, file: !289, line: 392, baseType: !293, size: 32, offset: 608)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !648, file: !289, line: 393, baseType: !316, size: 128, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !648, file: !289, line: 394, baseType: !318, size: 160, offset: 768)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !648, file: !289, line: 395, baseType: !322, size: 160, offset: 928)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !648, file: !289, line: 396, baseType: !20, size: 32, offset: 1088)
!671 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !105, file: !104, line: 51, size: 1536, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !672, vtableHolder: !776)
!672 = !{!673, !676, !679, !680, !716, !717, !718, !719, !721, !727, !730, !733, !736, !740, !743, !744, !747, !748, !755, !759, !760, !761, !764, !765, !769, !773}
!673 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !671, baseType: !674, flags: DIFlagPublic, extraData: i32 0)
!674 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BufferedSerial", scope: !105, file: !675, line: 42, size: 832, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada14BufferedSerialE")
!675 = !DIFile(filename: "../cicada/bufferedserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "b9c9871d742db1af5ee8abb5df52fc59")
!676 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !671, file: !104, line: 120, baseType: !677, flags: DIFlagStaticMember)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 128, elements: !64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !671, file: !104, line: 122, baseType: !39, size: 8, offset: 832)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_handle", scope: !671, file: !104, line: 123, baseType: !681, size: 576, offset: 864)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_HandleTypeDef", file: !581, line: 189, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__UART_HandleTypeDef", file: !581, line: 141, size: 576, flags: DIFlagTypePassByValue, elements: !683, identifier: "_ZTS20__UART_HandleTypeDef")
!683 = !{!684, !685, !696, !697, !698, !700, !701, !702, !703, !708, !709, !711, !714, !715}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Instance", scope: !682, file: !581, line: 143, baseType: !14, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Init", scope: !682, file: !581, line: 145, baseType: !686, size: 224, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_InitTypeDef", file: !581, line: 76, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 47, size: 224, flags: DIFlagTypePassByValue, elements: !688, identifier: "_ZTS16UART_InitTypeDef")
!688 = !{!689, !690, !691, !692, !693, !694, !695}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "BaudRate", scope: !687, file: !581, line: 49, baseType: !21, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "WordLength", scope: !687, file: !581, line: 54, baseType: !21, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "StopBits", scope: !687, file: !581, line: 57, baseType: !21, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Parity", scope: !687, file: !581, line: 60, baseType: !21, size: 32, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !687, file: !581, line: 67, baseType: !21, size: 32, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "HwFlowCtl", scope: !687, file: !581, line: 70, baseType: !21, size: 32, offset: 160)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "OverSampling", scope: !687, file: !581, line: 73, baseType: !21, size: 32, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pTxBuffPtr", scope: !682, file: !581, line: 147, baseType: !42, size: 32, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferSize", scope: !682, file: !581, line: 149, baseType: !34, size: 16, offset: 288)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferCount", scope: !682, file: !581, line: 151, baseType: !699, size: 16, offset: 304)
!699 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !34)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pRxBuffPtr", scope: !682, file: !581, line: 153, baseType: !42, size: 32, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferSize", scope: !682, file: !581, line: 155, baseType: !34, size: 16, offset: 352)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferCount", scope: !682, file: !581, line: 157, baseType: !699, size: 16, offset: 368)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "hdmatx", scope: !682, file: !581, line: 159, baseType: !704, size: 32, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HandleTypeDef", file: !706, line: 137, baseType: !707)
!706 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_dma.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dd8e7645a79a80f8166404bb078b3d4e")
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__DMA_HandleTypeDef", file: !706, line: 111, size: 576, flags: DIFlagFwdDecl, identifier: "_ZTS19__DMA_HandleTypeDef")
!708 = !DIDerivedType(tag: DW_TAG_member, name: "hdmarx", scope: !682, file: !581, line: 161, baseType: !704, size: 32, offset: 416)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !682, file: !581, line: 163, baseType: !710, size: 32, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_LockTypeDef", file: !6, line: 56, baseType: !576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "gState", scope: !682, file: !581, line: 165, baseType: !712, size: 32, offset: 480)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_UART_StateTypeDef", file: !581, line: 136, baseType: !580)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "RxState", scope: !682, file: !581, line: 169, baseType: !712, size: 32, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorCode", scope: !682, file: !581, line: 172, baseType: !20, size: 32, offset: 544)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_uartPort", scope: !671, file: !104, line: 124, baseType: !31, size: 32, offset: 1440)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_txPin", scope: !671, file: !104, line: 125, baseType: !34, size: 16, offset: 1472)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_rxPin", scope: !671, file: !104, line: 126, baseType: !34, size: 16, offset: 1488)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_uartInterruptInstance", scope: !671, file: !104, line: 127, baseType: !720, size: 32, offset: 1504)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !16, line: 126, baseType: !575)
!721 = !DISubprogram(name: "Stm32Uart", scope: !671, file: !104, line: 66, type: !722, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !724, !212, !212, !725, !14, !31, !34, !34}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "Size", scope: !105, file: !726, line: 32, baseType: !167)
!726 = !DIFile(filename: "../cicada/types.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "6dfa4c2c933d4c520c13fa7638528c51")
!727 = !DISubprogram(name: "Stm32Uart", scope: !671, file: !104, line: 83, type: !728, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !724, !212, !212, !725, !725, !14, !31, !34, !34}
!730 = !DISubprogram(name: "~Stm32Uart", scope: !671, file: !104, line: 86, type: !731, scopeLine: 86, containingType: !671, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !724}
!733 = !DISubprogram(name: "getInstance", linkageName: "_ZN6Cicada9Stm32Uart11getInstanceEP13USART_TypeDef", scope: !671, file: !104, line: 88, type: !734, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!734 = !DISubroutineType(types: !735)
!735 = !{!678, !14}
!736 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEv", scope: !671, file: !104, line: 93, type: !737, scopeLine: 93, containingType: !671, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !724}
!739 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!740 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEh", scope: !671, file: !104, line: 100, type: !741, scopeLine: 100, containingType: !671, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!741 = !DISubroutineType(types: !742)
!742 = !{!739, !724, !39}
!743 = !DISubprogram(name: "isOpen", linkageName: "_ZN6Cicada9Stm32Uart6isOpenEv", scope: !671, file: !104, line: 102, type: !737, scopeLine: 102, containingType: !671, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!744 = !DISubprogram(name: "setSerialConfig", linkageName: "_ZN6Cicada9Stm32Uart15setSerialConfigEjh", scope: !671, file: !104, line: 103, type: !745, scopeLine: 103, containingType: !671, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!745 = !DISubroutineType(types: !746)
!746 = !{!739, !724, !21, !39}
!747 = !DISubprogram(name: "close", linkageName: "_ZN6Cicada9Stm32Uart5closeEv", scope: !671, file: !104, line: 104, type: !731, scopeLine: 104, containingType: !671, virtualIndex: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!748 = !DISubprogram(name: "portName", linkageName: "_ZNK6Cicada9Stm32Uart8portNameEv", scope: !671, file: !104, line: 105, type: !749, scopeLine: 105, containingType: !671, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!749 = !DISubroutineType(types: !750)
!750 = !{!751, !753}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !671)
!755 = !DISubprogram(name: "rawRead", linkageName: "_ZN6Cicada9Stm32Uart7rawReadERh", scope: !671, file: !104, line: 106, type: !756, scopeLine: 106, containingType: !671, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!756 = !DISubroutineType(types: !757)
!757 = !{!739, !724, !758}
!758 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !39, size: 32)
!759 = !DISubprogram(name: "rawWrite", linkageName: "_ZN6Cicada9Stm32Uart8rawWriteEh", scope: !671, file: !104, line: 107, type: !741, scopeLine: 107, containingType: !671, virtualIndex: 22, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!760 = !DISubprogram(name: "startTransmit", linkageName: "_ZN6Cicada9Stm32Uart13startTransmitEv", scope: !671, file: !104, line: 108, type: !731, scopeLine: 108, containingType: !671, virtualIndex: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!761 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada9Stm32Uart20writeBufferProcessedEv", scope: !671, file: !104, line: 109, type: !762, scopeLine: 109, containingType: !671, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!762 = !DISubroutineType(types: !763)
!763 = !{!739, !753}
!764 = !DISubprogram(name: "handleInterrupt", linkageName: "_ZN6Cicada9Stm32Uart15handleInterruptEv", scope: !671, file: !104, line: 111, type: !731, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!765 = !DISubprogram(name: "Stm32Uart", scope: !671, file: !104, line: 115, type: !766, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !724, !768}
!768 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !754, size: 32)
!769 = !DISubprogram(name: "operator=", linkageName: "_ZN6Cicada9Stm32UartaSERKS0_", scope: !671, file: !104, line: 116, type: !770, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!770 = !DISubroutineType(types: !771)
!771 = !{!772, !724, !768}
!772 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !671, size: 32)
!773 = !DISubprogram(name: "init", linkageName: "_ZN6Cicada9Stm32Uart4initEP13USART_TypeDef", scope: !671, file: !104, line: 118, type: !774, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !724, !14}
!776 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ICommDevice", scope: !105, file: !777, line: 43, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !778, vtableHolder: !776, identifier: "_ZTSN6Cicada11ICommDeviceE")
!777 = !DIFile(filename: "../cicada/icommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "e83d2959922f5020d303a6315b56c6e9")
!778 = !{!779, !784, !788, !793, !794, !797, !800}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ICommDevice", scope: !777, file: !777, baseType: !780, size: 32, flags: DIFlagArtificial)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{!131}
!784 = !DISubprogram(name: "~ICommDevice", scope: !776, file: !777, line: 46, type: !785, scopeLine: 46, containingType: !776, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !787}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!788 = !DISubprogram(name: "bytesAvailable", linkageName: "_ZNK6Cicada11ICommDevice14bytesAvailableEv", scope: !776, file: !777, line: 52, type: !789, scopeLine: 52, containingType: !776, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!789 = !DISubroutineType(types: !790)
!790 = !{!725, !791}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!793 = !DISubprogram(name: "spaceAvailable", linkageName: "_ZNK6Cicada11ICommDevice14spaceAvailableEv", scope: !776, file: !777, line: 60, type: !789, scopeLine: 60, containingType: !776, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!794 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada11ICommDevice20writeBufferProcessedEv", scope: !776, file: !777, line: 71, type: !795, scopeLine: 71, containingType: !776, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!795 = !DISubroutineType(types: !796)
!796 = !{!739, !791}
!797 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada11ICommDevice4readEPhy", scope: !776, file: !777, line: 85, type: !798, scopeLine: 85, containingType: !776, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!798 = !DISubroutineType(types: !799)
!799 = !{!725, !787, !42, !725}
!800 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada11ICommDevice5writeEPKhy", scope: !776, file: !777, line: 98, type: !801, scopeLine: 98, containingType: !776, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!801 = !DISubroutineType(types: !802)
!802 = !{!725, !787, !37, !725}
!803 = !{!570}
!804 = !{!118, !124, !128, !132, !136, !139, !141, !143, !145, !148, !151, !154, !157, !160, !163, !164, !165, !166, !170, !172, !174, !176, !178, !181, !184, !187, !190, !193, !805}
!805 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !572, entity: !105, file: !573, line: 28)
!806 = distinct !DICompileUnit(language: DW_LANG_C99, file: !807, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !808, retainedTypes: !813, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_rcc.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "bf5d5e021854d33cea3d58ed6b9d5087")
!808 = !{!345, !267, !809}
!809 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !268, line: 157, baseType: !7, size: 32, elements: !810)
!810 = !{!811, !812}
!811 = !DIEnumerator(name: "DISABLE", value: 0)
!812 = !DIEnumerator(name: "ENABLE", value: 1)
!813 = !{!814, !21, !54, !39, !459, !828, !834, !34, !847, !458}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !16, line: 438, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 424, size: 320, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !816, file: !16, line: 426, baseType: !20, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !816, file: !16, line: 427, baseType: !20, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !816, file: !16, line: 428, baseType: !20, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !816, file: !16, line: 429, baseType: !20, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !816, file: !16, line: 430, baseType: !20, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !816, file: !16, line: 431, baseType: !20, size: 32, offset: 160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !816, file: !16, line: 432, baseType: !20, size: 32, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !816, file: !16, line: 433, baseType: !20, size: 32, offset: 224)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !816, file: !16, line: 434, baseType: !20, size: 32, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !816, file: !16, line: 435, baseType: !20, size: 32, offset: 288)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !16, line: 418, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 414, size: 64, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !830, file: !16, line: 416, baseType: !20, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !830, file: !16, line: 417, baseType: !20, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !16, line: 336, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 325, size: 288, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843, !844, !845, !846}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !836, file: !16, line: 327, baseType: !20, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !836, file: !16, line: 328, baseType: !20, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !836, file: !16, line: 329, baseType: !20, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !836, file: !16, line: 330, baseType: !20, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !836, file: !16, line: 331, baseType: !20, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !836, file: !16, line: 332, baseType: !20, size: 32, offset: 160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !836, file: !16, line: 333, baseType: !20, size: 32, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !836, file: !16, line: 334, baseType: !20, size: 32, offset: 224)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !836, file: !16, line: 335, baseType: !20, size: 32, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !16, line: 367, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 358, size: 224, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "CRL", scope: !849, file: !16, line: 360, baseType: !20, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "CRH", scope: !849, file: !16, line: 361, baseType: !20, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !849, file: !16, line: 362, baseType: !20, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !849, file: !16, line: 363, baseType: !20, size: 32, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !849, file: !16, line: 364, baseType: !20, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !849, file: !16, line: 365, baseType: !20, size: 32, offset: 160)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !849, file: !16, line: 366, baseType: !20, size: 32, offset: 192)
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !860, retainedTypes: !861, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_cortex.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "83cb8d6817603f64d73dca2a0b01efa1")
!860 = !{!351}
!861 = !{!862, !21, !870, !129, !39, !895}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !289, line: 700, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 694, size: 128, elements: !865)
!865 = !{!866, !867, !868, !869}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !864, file: !289, line: 696, baseType: !20, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !864, file: !289, line: 697, baseType: !20, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !864, file: !289, line: 698, baseType: !20, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !864, file: !289, line: 699, baseType: !293, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !289, line: 397, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 374, size: 1120, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !872, file: !289, line: 376, baseType: !293, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !872, file: !289, line: 377, baseType: !20, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !872, file: !289, line: 378, baseType: !20, size: 32, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !872, file: !289, line: 379, baseType: !20, size: 32, offset: 96)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !872, file: !289, line: 380, baseType: !20, size: 32, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !872, file: !289, line: 381, baseType: !20, size: 32, offset: 160)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !872, file: !289, line: 382, baseType: !300, size: 96, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !872, file: !289, line: 383, baseType: !20, size: 32, offset: 288)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !872, file: !289, line: 384, baseType: !20, size: 32, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !872, file: !289, line: 385, baseType: !20, size: 32, offset: 352)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !872, file: !289, line: 386, baseType: !20, size: 32, offset: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !872, file: !289, line: 387, baseType: !20, size: 32, offset: 416)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !872, file: !289, line: 388, baseType: !20, size: 32, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !872, file: !289, line: 389, baseType: !20, size: 32, offset: 480)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !872, file: !289, line: 390, baseType: !312, size: 64, offset: 512)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !872, file: !289, line: 391, baseType: !293, size: 32, offset: 576)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !872, file: !289, line: 392, baseType: !293, size: 32, offset: 608)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !872, file: !289, line: 393, baseType: !316, size: 128, offset: 640)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !872, file: !289, line: 394, baseType: !318, size: 160, offset: 768)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !872, file: !289, line: 395, baseType: !322, size: 160, offset: 928)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !872, file: !289, line: 396, baseType: !20, size: 32, offset: 1088)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !289, line: 355, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 340, size: 28704, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !897, file: !289, line: 342, baseType: !621, size: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !897, file: !289, line: 343, baseType: !623, size: 768, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !897, file: !289, line: 344, baseType: !621, size: 256, offset: 1024)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !897, file: !289, line: 345, baseType: !623, size: 768, offset: 1280)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !897, file: !289, line: 346, baseType: !621, size: 256, offset: 2048)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !897, file: !289, line: 347, baseType: !623, size: 768, offset: 2304)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !897, file: !289, line: 348, baseType: !621, size: 256, offset: 3072)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !897, file: !289, line: 349, baseType: !623, size: 768, offset: 3328)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !897, file: !289, line: 350, baseType: !621, size: 256, offset: 4096)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !897, file: !289, line: 351, baseType: !634, size: 1792, offset: 4352)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !897, file: !289, line: 352, baseType: !638, size: 1920, offset: 6144)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !897, file: !289, line: 353, baseType: !642, size: 20608, offset: 8064)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !897, file: !289, line: 354, baseType: !20, size: 32, offset: 28672)
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !914, retainedTypes: !920, splitDebugInlining: false, nameTableKind: None)
!913 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "de98d9c05272efa2ca465428751dd1b5")
!914 = !{!915, !345}
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !916, line: 65, baseType: !7, size: 32, elements: !917)
!916 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "b5ff32b0624c591654a3e02ee400cffe")
!917 = !{!918, !919}
!918 = !DIEnumerator(name: "GPIO_PIN_RESET", value: 0)
!919 = !DIEnumerator(name: "GPIO_PIN_SET", value: 1)
!920 = !{!21, !34, !921, !935, !944, !955}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !16, line: 438, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 424, size: 320, elements: !924)
!924 = !{!925, !926, !927, !928, !929, !930, !931, !932, !933, !934}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !923, file: !16, line: 426, baseType: !20, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !923, file: !16, line: 427, baseType: !20, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !923, file: !16, line: 428, baseType: !20, size: 32, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !923, file: !16, line: 429, baseType: !20, size: 32, offset: 96)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !923, file: !16, line: 430, baseType: !20, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !923, file: !16, line: 431, baseType: !20, size: 32, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !923, file: !16, line: 432, baseType: !20, size: 32, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !923, file: !16, line: 433, baseType: !20, size: 32, offset: 224)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !923, file: !16, line: 434, baseType: !20, size: 32, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !923, file: !16, line: 435, baseType: !20, size: 32, offset: 288)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFIO_TypeDef", file: !16, line: 380, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 373, size: 256, elements: !938)
