; ModuleID = './examples/ipcommdevice_freertos.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct.xSTATIC_TCB = type { i8*, [2 x %struct.xSTATIC_LIST_ITEM], i32, i8*, [16 x i8], i32, i8 }
%struct.xSTATIC_LIST_ITEM = type { i32, [4 x i8*] }
%"class.Cicada::Stm32Uart" = type { %"class.Cicada::BufferedSerial", i8, %struct.__UART_HandleTypeDef, %struct.USART_TypeDef*, i16, i16, i32 }
%"class.Cicada::BufferedSerial" = type { %"class.Cicada::IBufferedSerial", %"class.Cicada::LineCircularBuffer", %"class.Cicada::LineCircularBuffer" }
%"class.Cicada::IBufferedSerial" = type { %"class.Cicada::ICommDevice", %"class.Cicada::ICommDevice" }
%"class.Cicada::ICommDevice" = type { i32 (...)** }
%"class.Cicada::LineCircularBuffer" = type { %"class.Cicada::CircularBuffer.base", i16, [2 x i8] }
%"class.Cicada::CircularBuffer.base" = type <{ i32 (...)**, [4 x i8], i64, i64, i64, i64, i8* }>
%struct.__UART_HandleTypeDef = type { %struct.USART_TypeDef*, %struct.USART_TypeDef, i8*, i16, i16, i8*, i16, i16, %struct.__DMA_HandleTypeDef*, %struct.__DMA_HandleTypeDef*, i32, i32, i32, i32 }
%struct.USART_TypeDef = type { i32, i32, i32, i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xStackTask", scope: !2, file: !3, line: 21, type: !246, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !90, imports: !167, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../examples/stm32f1/ipcommdevice_freertos.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5122a0170262942b15fb1aecc535a5a6")
!4 = !{!5}
!5 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 41, baseType: !7, size: 32, elements: !8, identifier: "_ZTS17HAL_StatusTypeDef")
!6 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_def.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "4d6e0bbb91efacee14a68a416f506def")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "HAL_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HAL_ERROR", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "HAL_BUSY", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3, isUnsigned: true)
!13 = !{!14, !66, !79, !26, !82, !85, !86}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Task", scope: !17, file: !16, line: 193, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !18, vtableHolder: !15, identifier: "_ZTSN6Cicada4TaskE")
!16 = !DIFile(filename: "../cicada/task.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "c2aeaca9a01dbc0caa84f135ef9fda2b")
!17 = !DINamespace(name: "Cicada", scope: null)
!18 = !{!19, !25, !31, !34, !36, !37, !41, !44, !49, !50, !53, !56, !57, !58, !59, !62}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Task", scope: !16, file: !16, baseType: !20, size: 32, flags: DIFlagArtificial)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !22, size: 32)
!22 = !DISubroutineType(types: !23)
!23 = !{!24}
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_delay", scope: !15, file: !16, line: 283, baseType: !26, size: 16, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !27, line: 36, baseType: !28)
!27 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ab914e287601b2385e57880e6599aa6b")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !29, line: 57, baseType: !30)
!29 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f7024d0682a918b41f94e8be9cd90461")
!30 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_timeout", scope: !15, file: !16, line: 284, baseType: !32, size: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !27, line: 48, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !29, line: 79, baseType: !7)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_isTimeoutRunning", scope: !15, file: !16, line: 285, baseType: !35, size: 8, offset: 96)
!35 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_lastRun", scope: !15, file: !16, line: 286, baseType: !32, size: 32, offset: 128)
!37 = !DISubprogram(name: "Task", scope: !15, file: !16, line: 196, type: !38, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!38 = !DISubroutineType(types: !39)
!39 = !{null, !40, !26}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!41 = !DISubprogram(name: "~Task", scope: !15, file: !16, line: 198, type: !42, scopeLine: 198, containingType: !15, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !40}
!44 = !DISubprogram(name: "delay", linkageName: "_ZNK6Cicada4Task5delayEv", scope: !15, file: !16, line: 203, type: !45, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!45 = !DISubroutineType(types: !46)
!46 = !{!26, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!49 = !DISubprogram(name: "setDelay", linkageName: "_ZN6Cicada4Task8setDelayEt", scope: !15, file: !16, line: 212, type: !38, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!50 = !DISubprogram(name: "lastRun", linkageName: "_ZN6Cicada4Task7lastRunEv", scope: !15, file: !16, line: 222, type: !51, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!51 = !DISubroutineType(types: !52)
!52 = !{!32, !40}
!53 = !DISubprogram(name: "setLastRun", linkageName: "_ZN6Cicada4Task10setLastRunEj", scope: !15, file: !16, line: 230, type: !54, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !40, !32}
!56 = !DISubprogram(name: "run", linkageName: "_ZN6Cicada4Task3runEv", scope: !15, file: !16, line: 245, type: !42, scopeLine: 245, containingType: !15, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!57 = !DISubprogram(name: "startTimeout", linkageName: "_ZN6Cicada4Task12startTimeoutEv", scope: !15, file: !16, line: 251, type: !42, scopeLine: 251, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!58 = !DISubprogram(name: "resetTimeout", linkageName: "_ZN6Cicada4Task12resetTimeoutEv", scope: !15, file: !16, line: 262, type: !42, scopeLine: 262, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!59 = !DISubprogram(name: "isTimeout", linkageName: "_ZN6Cicada4Task9isTimeoutEj", scope: !15, file: !16, line: 272, type: !60, scopeLine: 272, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!60 = !DISubroutineType(types: !61)
!61 = !{!35, !40, !32}
!62 = !DISubprogram(name: "Task", scope: !15, file: !16, line: 281, type: !63, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !40, !65}
!65 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !48, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "USART_TypeDef", file: !68, line: 516, baseType: !69)
!68 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f103xb.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "d2562af6d7239ab46ca8ba238a43c848")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 507, size: 224, flags: DIFlagTypePassByValue, elements: !70, identifier: "_ZTS13USART_TypeDef")
!70 = !{!71, !73, !74, !75, !76, !77, !78}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !69, file: !68, line: 509, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !69, file: !68, line: 510, baseType: !72, size: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !69, file: !68, line: 511, baseType: !72, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !69, file: !68, line: 512, baseType: !72, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !69, file: !68, line: 513, baseType: !72, size: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "CR3", scope: !69, file: !68, line: 514, baseType: !72, size: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "GTPR", scope: !69, file: !68, line: 515, baseType: !72, size: 32, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !68, line: 367, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 358, size: 224, flags: DIFlagFwdDecl, identifier: "_ZTS12GPIO_TypeDef")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "UBaseType_t", file: !83, line: 57, baseType: !84)
!83 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/portable/GCC/ARM_CM3/portmacro.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5fd77bad595782d66ff9acd907773be8")
!84 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !27, line: 24, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !29, line: 43, baseType: !89)
!89 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !{!0, !91, !97, !126, !128, !142, !147, !156, !159}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "xStackComm", scope: !2, file: !3, line: 22, type: !93, isLocal: false, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8192, elements: !95)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "StackType_t", file: !83, line: 55, baseType: !32)
!95 = !{!96}
!96 = !DISubrange(count: 256)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "xTaskBuffer", scope: !2, file: !3, line: 23, type: !99, isLocal: false, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "StaticTask_t", file: !100, line: 1030, baseType: !101)
!100 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/include/FreeRTOS.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "35901dd1e618d03882fd7fe7e54fee1a")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xSTATIC_TCB", file: !100, line: 984, size: 608, flags: DIFlagTypePassByValue, elements: !102, identifier: "_ZTS11xSTATIC_TCB")
!102 = !{!103, !105, !118, !119, !120, !124, !125}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pxDummy1", scope: !101, file: !100, line: 986, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "xDummy3", scope: !101, file: !100, line: 990, baseType: !106, size: 320, offset: 32)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 320, elements: !116)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "StaticListItem_t", file: !100, line: 953, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xSTATIC_LIST_ITEM", file: !100, line: 948, size: 160, flags: DIFlagTypePassByValue, elements: !109, identifier: "_ZTS17xSTATIC_LIST_ITEM")
!109 = !{!110, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "xDummy1", scope: !108, file: !100, line: 950, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "TickType_t", file: !83, line: 63, baseType: !32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pvDummy2", scope: !108, file: !100, line: 951, baseType: !113, size: 128, offset: 32)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 128, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 4)
!116 = !{!117}
!117 = !DISubrange(count: 2)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "uxDummy5", scope: !101, file: !100, line: 991, baseType: !82, size: 32, offset: 352)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pxDummy6", scope: !101, file: !100, line: 992, baseType: !104, size: 32, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ucDummy7", scope: !101, file: !100, line: 993, baseType: !121, size: 128, offset: 416)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ulDummy18", scope: !101, file: !100, line: 1019, baseType: !32, size: 32, offset: 544)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ucDummy19", scope: !101, file: !100, line: 1020, baseType: !87, size: 8, offset: 576)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "xCommBuffer", scope: !2, file: !3, line: 24, type: !99, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "xIdleTaskTCB", scope: !130, file: !3, line: 158, type: !99, isLocal: true, isDefinition: true)
!130 = distinct !DISubprogram(name: "vApplicationGetIdleTaskMemory", scope: !3, file: !3, line: 155, type: !131, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !138)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133, !135, !137}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!138 = !{!139, !140, !141}
!139 = !DILocalVariable(name: "ppxIdleTaskTCBBuffer", arg: 1, scope: !130, file: !3, line: 155, type: !133)
!140 = !DILocalVariable(name: "ppxIdleTaskStackBuffer", arg: 2, scope: !130, file: !3, line: 156, type: !135)
!141 = !DILocalVariable(name: "pulIdleTaskStackSize", arg: 3, scope: !130, file: !3, line: 156, type: !137)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "uxIdleTaskStack", scope: !130, file: !3, line: 159, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 4096, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 128)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "instance", scope: !149, file: !3, line: 174, type: !153, isLocal: true, isDefinition: true)
!149 = distinct !DISubprogram(name: "USART1_IRQHandler", scope: !3, file: !3, line: 172, type: !150, scopeLine: 173, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !152)
!150 = !DISubroutineType(types: !151)
!151 = !{null}
!152 = !{}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !17, file: !155, line: 51, size: 1536, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada9Stm32UartE")
!155 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "f1205a68111afe9a0868ac35ca31b4e6")
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "instance", scope: !158, file: !3, line: 180, type: !153, isLocal: true, isDefinition: true)
!158 = distinct !DISubprogram(name: "USART2_IRQHandler", scope: !3, file: !3, line: 178, type: !150, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !152)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "serial", scope: !161, file: !3, line: 186, type: !153, isLocal: true, isDefinition: true)
!161 = distinct !DISubprogram(name: "_putchar", scope: !3, file: !3, line: 184, type: !162, scopeLine: 185, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !165)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !164}
!164 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!165 = !{!166}
!166 = !DILocalVariable(name: "c", arg: 1, scope: !161, file: !3, line: 184, type: !164)
!167 = !{!168, !174, !178, !181, !185, !188, !190, !192, !194, !197, !200, !203, !206, !209, !212, !213, !214, !215, !219, !221, !223, !225, !227, !230, !233, !236, !239, !242, !245}
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !170, file: !173, line: 47)
!169 = !DINamespace(name: "std", scope: null)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !27, line: 20, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !29, line: 41, baseType: !172)
!172 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!173 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstdint", directory: "/home/mjshen/RTOSExploration")
!174 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !175, file: !173, line: 48)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !27, line: 32, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !29, line: 55, baseType: !177)
!177 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !179, file: !173, line: 49)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !27, line: 44, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !29, line: 77, baseType: !24)
!181 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !182, file: !173, line: 50)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !27, line: 56, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !29, line: 103, baseType: !184)
!184 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!185 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !186, file: !173, line: 52)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !187, line: 51, baseType: !172)
!187 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "a169a1d650067906a9e00519a9405ebb")
!188 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !189, file: !173, line: 53)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !187, line: 61, baseType: !177)
!190 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !191, file: !173, line: 54)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !187, line: 71, baseType: !24)
!192 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !193, file: !173, line: 55)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !187, line: 81, baseType: !184)
!194 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !195, file: !173, line: 57)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !187, line: 21, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !29, line: 134, baseType: !172)
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !198, file: !173, line: 58)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !187, line: 27, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !29, line: 160, baseType: !177)
!200 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !201, file: !173, line: 59)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !187, line: 33, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !29, line: 182, baseType: !24)
!203 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !204, file: !173, line: 60)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !187, line: 39, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !29, line: 200, baseType: !184)
!206 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !207, file: !173, line: 62)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !27, line: 67, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !29, line: 214, baseType: !184)
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !210, file: !173, line: 63)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !27, line: 77, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !29, line: 230, baseType: !24)
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !87, file: !173, line: 65)
!213 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !26, file: !173, line: 66)
!214 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !32, file: !173, line: 67)
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !216, file: !173, line: 68)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !27, line: 60, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !29, line: 105, baseType: !218)
!218 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !220, file: !173, line: 70)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !187, line: 52, baseType: !89)
!221 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !222, file: !173, line: 71)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !187, line: 62, baseType: !30)
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !224, file: !173, line: 72)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !187, line: 72, baseType: !7)
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !226, file: !173, line: 73)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !187, line: 82, baseType: !218)
!227 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !228, file: !173, line: 75)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !187, line: 22, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !29, line: 136, baseType: !89)
!230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !231, file: !173, line: 76)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !187, line: 28, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !29, line: 162, baseType: !30)
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !234, file: !173, line: 77)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !187, line: 34, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !29, line: 184, baseType: !7)
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !237, file: !173, line: 78)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !187, line: 40, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !29, line: 202, baseType: !218)
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !240, file: !173, line: 80)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !27, line: 72, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !29, line: 222, baseType: !218)
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !169, entity: !243, file: !173, line: 81)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !27, line: 82, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !29, line: 232, baseType: !7)
!245 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !17, file: !3, line: 18)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 98304, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 3072)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "pow10", scope: !251, file: !252, line: 311, type: !308, isLocal: true, isDefinition: true)
!251 = distinct !DISubprogram(name: "_ftoa", scope: !252, file: !252, line: 299, type: !253, scopeLine: 300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !263, retainedNodes: !275)
!252 = !DIFile(filename: "../dep/printf/src/printf.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "7383fa86adf0d25d8eda174a9b330d6a")
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !257, !261, !255, !255, !262, !7, !7, !7}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !256, line: 46, baseType: !7)
!256 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_type", file: !252, line: 97, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !164, !104, !255, !255}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!262 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !264, globals: !274, splitDebugInlining: false, nameTableKind: None)
!264 = !{!255, !261, !243, !7, !24, !218, !84, !164, !177, !89, !30, !262, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_wrap_type", file: !252, line: 104, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 101, size: 64, elements: !268)
!268 = !{!269, !273}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fct", scope: !267, file: !252, line: 102, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !164, !104}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !267, file: !252, line: 103, baseType: !104, size: 32, offset: 32)
!274 = !{!249}
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !286, !290, !291, !292, !294, !296, !297, !298, !299, !302, !306}
!276 = !DILocalVariable(name: "out", arg: 1, scope: !251, file: !252, line: 299, type: !257)
!277 = !DILocalVariable(name: "buffer", arg: 2, scope: !251, file: !252, line: 299, type: !261)
!278 = !DILocalVariable(name: "idx", arg: 3, scope: !251, file: !252, line: 299, type: !255)
!279 = !DILocalVariable(name: "maxlen", arg: 4, scope: !251, file: !252, line: 299, type: !255)
!280 = !DILocalVariable(name: "value", arg: 5, scope: !251, file: !252, line: 299, type: !262)
!281 = !DILocalVariable(name: "prec", arg: 6, scope: !251, file: !252, line: 299, type: !7)
!282 = !DILocalVariable(name: "width", arg: 7, scope: !251, file: !252, line: 299, type: !7)
!283 = !DILocalVariable(name: "flags", arg: 8, scope: !251, file: !252, line: 299, type: !7)
!284 = !DILocalVariable(name: "start_idx", scope: !251, file: !252, line: 301, type: !285)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!286 = !DILocalVariable(name: "buf", scope: !251, file: !252, line: 303, type: !287)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 256, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 32)
!290 = !DILocalVariable(name: "len", scope: !251, file: !252, line: 304, type: !255)
!291 = !DILocalVariable(name: "diff", scope: !251, file: !252, line: 305, type: !262)
!292 = !DILocalVariable(name: "thres_max", scope: !251, file: !252, line: 308, type: !293)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!294 = !DILocalVariable(name: "negative", scope: !251, file: !252, line: 322, type: !295)
!295 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!296 = !DILocalVariable(name: "whole", scope: !251, file: !252, line: 338, type: !24)
!297 = !DILocalVariable(name: "tmp", scope: !251, file: !252, line: 339, type: !262)
!298 = !DILocalVariable(name: "frac", scope: !251, file: !252, line: 340, type: !84)
!299 = !DILocalVariable(name: "count", scope: !300, file: !252, line: 373, type: !7)
!300 = distinct !DILexicalBlock(scope: !301, file: !252, line: 372, column: 8)
!301 = distinct !DILexicalBlock(scope: !251, file: !252, line: 364, column: 7)
!302 = !DILocalVariable(name: "i", scope: !303, file: !252, line: 424, type: !255)
!303 = distinct !DILexicalBlock(scope: !304, file: !252, line: 424, column: 5)
!304 = distinct !DILexicalBlock(scope: !305, file: !252, line: 423, column: 58)
!305 = distinct !DILexicalBlock(scope: !251, file: !252, line: 423, column: 7)
!306 = !DILocalVariable(name: "i", scope: !307, file: !252, line: 430, type: !255)
!307 = distinct !DILexicalBlock(scope: !251, file: !252, line: 430, column: 3)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 640, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 10)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "AHBPrescTable", scope: !313, file: !314, line: 124, type: !382, isLocal: false, isDefinition: true)
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !315, retainedTypes: !321, globals: !373, splitDebugInlining: false, nameTableKind: None)
!314 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Source/Templates/system_stm32f1xx.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "2e873de3002e5d783190a46ff1c7da2d")
!315 = !{!316}
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !317, line: 151, baseType: !7, size: 32, elements: !318)
!317 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xx.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dc4ed8bdf8589b30d30d93eb6ee6ca27")
!318 = !{!319, !320}
!319 = !DIEnumerator(name: "RESET", value: 0)
!320 = !DIEnumerator(name: "SET", value: 1)
!321 = !{!322, !336, !32}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !68, line: 438, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 424, size: 320, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !324, file: !68, line: 426, baseType: !72, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !324, file: !68, line: 427, baseType: !72, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !324, file: !68, line: 428, baseType: !72, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !324, file: !68, line: 429, baseType: !72, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !324, file: !68, line: 430, baseType: !72, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !324, file: !68, line: 431, baseType: !72, size: 32, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !324, file: !68, line: 432, baseType: !72, size: 32, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !324, file: !68, line: 433, baseType: !72, size: 32, offset: 224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !324, file: !68, line: 434, baseType: !72, size: 32, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !324, file: !68, line: 435, baseType: !72, size: 32, offset: 288)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !338, line: 397, baseType: !339)
!338 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 374, size: 1120, elements: !340)
!340 = !{!341, !343, !344, !345, !346, !347, !348, !353, !354, !355, !356, !357, !358, !359, !360, !362, !363, !364, !366, !370, !372}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !339, file: !338, line: 376, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !339, file: !338, line: 377, baseType: !72, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !339, file: !338, line: 378, baseType: !72, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !339, file: !338, line: 379, baseType: !72, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !339, file: !338, line: 380, baseType: !72, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !339, file: !338, line: 381, baseType: !72, size: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !339, file: !338, line: 382, baseType: !349, size: 96, offset: 192)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 96, elements: !351)
!350 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !87)
!351 = !{!352}
!352 = !DISubrange(count: 12)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !339, file: !338, line: 383, baseType: !72, size: 32, offset: 288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !339, file: !338, line: 384, baseType: !72, size: 32, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !339, file: !338, line: 385, baseType: !72, size: 32, offset: 352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !339, file: !338, line: 386, baseType: !72, size: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !339, file: !338, line: 387, baseType: !72, size: 32, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !339, file: !338, line: 388, baseType: !72, size: 32, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !339, file: !338, line: 389, baseType: !72, size: 32, offset: 480)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !339, file: !338, line: 390, baseType: !361, size: 64, offset: 512)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 64, elements: !116)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !339, file: !338, line: 391, baseType: !342, size: 32, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !339, file: !338, line: 392, baseType: !342, size: 32, offset: 608)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !339, file: !338, line: 393, baseType: !365, size: 128, offset: 640)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 128, elements: !114)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !339, file: !338, line: 394, baseType: !367, size: 160, offset: 768)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 160, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 5)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !339, file: !338, line: 395, baseType: !371, size: 160, offset: 928)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !368)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !339, file: !338, line: 396, baseType: !72, size: 32, offset: 1088)
!373 = !{!374, !311, !376}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !313, file: !314, line: 123, type: !32, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "APBPrescTable", scope: !313, file: !314, line: 125, type: !378, isLocal: false, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 64, elements: !380)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!380 = !{!381}
!381 = !DISubrange(count: 8)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 128, elements: !122)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "uwTickPrio", scope: !385, file: !386, line: 80, type: !32, isLocal: false, isDefinition: true)
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !387, retainedTypes: !455, globals: !497, splitDebugInlining: false, nameTableKind: None)
!386 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "1a5fa7b79e9e470cf817b81d791a6ccb")
!387 = !{!388, !395, !401}
!388 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !389, line: 49, baseType: !7, size: 32, elements: !390)
!389 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5eab64b252ccd159497a11d87d26bc0b")
!390 = !{!391, !392, !393, !394}
!391 = !DIEnumerator(name: "HAL_TICK_FREQ_10HZ", value: 100)
!392 = !DIEnumerator(name: "HAL_TICK_FREQ_100HZ", value: 10)
!393 = !DIEnumerator(name: "HAL_TICK_FREQ_1KHZ", value: 1)
!394 = !DIEnumerator(name: "HAL_TICK_FREQ_DEFAULT", value: 1)
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 41, baseType: !7, size: 32, elements: !396)
!396 = !{!397, !398, !399, !400}
!397 = !DIEnumerator(name: "HAL_OK", value: 0)
!398 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!399 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!400 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 69, baseType: !24, size: 32, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!403 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!404 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!405 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!406 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!407 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!408 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!409 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!410 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!411 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!412 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!413 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!414 = !DIEnumerator(name: "TAMPER_IRQn", value: 2)
!415 = !DIEnumerator(name: "RTC_IRQn", value: 3)
!416 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!417 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!418 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!419 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!420 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!421 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!422 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!423 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!424 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!425 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!426 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!427 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!428 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!429 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!430 = !DIEnumerator(name: "ADC1_2_IRQn", value: 18)
!431 = !DIEnumerator(name: "USB_HP_CAN1_TX_IRQn", value: 19)
!432 = !DIEnumerator(name: "USB_LP_CAN1_RX0_IRQn", value: 20)
!433 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!434 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!435 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!436 = !DIEnumerator(name: "TIM1_BRK_IRQn", value: 24)
!437 = !DIEnumerator(name: "TIM1_UP_IRQn", value: 25)
!438 = !DIEnumerator(name: "TIM1_TRG_COM_IRQn", value: 26)
!439 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!440 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!441 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!442 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!443 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!444 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!445 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!446 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!447 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!448 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!449 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!450 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!451 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!452 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!453 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!454 = !DIEnumerator(name: "USBWakeUp_IRQn", value: 42)
!455 = !{!456, !32, !469, !483, !491, !137}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !68, line: 336, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 325, size: 288, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !458, file: !68, line: 327, baseType: !72, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !458, file: !68, line: 328, baseType: !72, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !458, file: !68, line: 329, baseType: !72, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !458, file: !68, line: 330, baseType: !72, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !458, file: !68, line: 331, baseType: !72, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !458, file: !68, line: 332, baseType: !72, size: 32, offset: 160)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !458, file: !68, line: 333, baseType: !72, size: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !458, file: !68, line: 334, baseType: !72, size: 32, offset: 224)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !458, file: !68, line: 335, baseType: !72, size: 32, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !68, line: 438, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 424, size: 320, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !471, file: !68, line: 426, baseType: !72, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !471, file: !68, line: 427, baseType: !72, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !471, file: !68, line: 428, baseType: !72, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !471, file: !68, line: 429, baseType: !72, size: 32, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !471, file: !68, line: 430, baseType: !72, size: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !471, file: !68, line: 431, baseType: !72, size: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !471, file: !68, line: 432, baseType: !72, size: 32, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !471, file: !68, line: 433, baseType: !72, size: 32, offset: 224)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !471, file: !68, line: 434, baseType: !72, size: 32, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !471, file: !68, line: 435, baseType: !72, size: 32, offset: 288)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !338, line: 700, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 694, size: 128, elements: !486)
!486 = !{!487, !488, !489, !490}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !485, file: !338, line: 696, baseType: !72, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !485, file: !338, line: 697, baseType: !72, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !485, file: !338, line: 698, baseType: !72, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !485, file: !338, line: 699, baseType: !342, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBGMCU_TypeDef", file: !68, line: 285, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 281, size: 64, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "IDCODE", scope: !493, file: !68, line: 283, baseType: !72, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !493, file: !68, line: 284, baseType: !72, size: 32, offset: 32)
!497 = !{!383, !498, !501}
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "uwTickFreq", scope: !385, file: !386, line: 81, type: !500, isLocal: false, isDefinition: true)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_TickFreqTypeDef", file: !389, line: 55, baseType: !388)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "uwTick", scope: !385, file: !386, line: 79, type: !72, isLocal: false, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "ucMaxSysCallPriority", scope: !505, file: !506, line: 164, type: !87, isLocal: true, isDefinition: true)
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !507, globals: !511, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/portable/GCC/ARM_CM3/port.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "3134ad912cd7b4d155d138db3d2b3f77")
!507 = !{!94, !508, !87, !32, !85, !509, !111}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "BaseType_t", file: !83, line: 56, baseType: !510)
!510 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!511 = !{!512, !503, !517, !519}
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "pcInterruptPriorityRegisters", scope: !505, file: !506, line: 166, type: !514, isLocal: true, isDefinition: true)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "ulMaxPRIGROUPValue", scope: !505, file: !506, line: 165, type: !32, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "uxCriticalNesting", scope: !505, file: !506, line: 133, type: !82, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "pxCurrentTCB", scope: !523, file: !524, line: 348, type: !618, isLocal: false, isDefinition: true)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !525, retainedTypes: !534, globals: !562, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/tasks.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "4c78d8e6db8748ab90199895767857f2")
!525 = !{!526}
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !527, line: 81, baseType: !7, size: 32, elements: !528)
!527 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/include/task.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "d024d745131a960c5ab0e9fb4124ba87")
!528 = !{!529, !530, !531, !532, !533}
!529 = !DIEnumerator(name: "eNoAction", value: 0)
!530 = !DIEnumerator(name: "eSetBits", value: 1)
!531 = !DIEnumerator(name: "eIncrement", value: 2)
!532 = !DIEnumerator(name: "eSetValueWithOverwrite", value: 3)
!533 = !DIEnumerator(name: "eSetValueWithoutOverwrite", value: 4)
!534 = !{!104, !535, !136, !509, !111, !85, !82, !32, !87, !561}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCB_t", file: !524, line: 343, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "tskTCB", file: !524, line: 339, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tskTaskControlBlock", file: !524, line: 269, size: 608, elements: !539)
!539 = !{!540, !543, !554, !555, !556, !557, !559, !560}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pxTopOfStack", scope: !538, file: !524, line: 271, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !94)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "xStateListItem", scope: !538, file: !524, line: 277, baseType: !544, size: 160, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !545, line: 149, baseType: !546)
!545 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Middlewares/Third_Party/FreeRTOS/Source/include/list.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "da6acc022f4d62328dbc603eb4dcc0f5")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !545, line: 139, size: 160, elements: !547)
!547 = !{!548, !549, !551, !552, !553}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !546, file: !545, line: 142, baseType: !111, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !546, file: !545, line: 143, baseType: !550, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !546, file: !545, line: 144, baseType: !550, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !546, file: !545, line: 145, baseType: !104, size: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !546, file: !545, line: 146, baseType: !104, size: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "xEventListItem", scope: !538, file: !524, line: 278, baseType: !544, size: 160, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "uxPriority", scope: !538, file: !524, line: 279, baseType: !82, size: 32, offset: 352)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pxStack", scope: !538, file: !524, line: 280, baseType: !136, size: 32, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pcTaskName", scope: !538, file: !524, line: 281, baseType: !558, size: 128, offset: 416)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !122)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ulNotifiedValue", scope: !538, file: !524, line: 325, baseType: !72, size: 32, offset: 544)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ucNotifyState", scope: !538, file: !524, line: 326, baseType: !350, size: 8, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskHandle_t", file: !527, line: 61, baseType: !104)
!562 = !{!521, !563, !579, !581, !583, !585, !587, !590, !593, !595, !597, !599, !601, !606, !608, !610, !614, !616}
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "xDelayedTaskList1", scope: !523, file: !524, line: 352, type: !565, isLocal: true, isDefinition: true)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "List_t", file: !545, line: 170, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !545, line: 163, size: 160, elements: !567)
!567 = !{!568, !570, !572}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !566, file: !545, line: 166, baseType: !569, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !82)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !566, file: !545, line: 167, baseType: !571, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !566, file: !545, line: 168, baseType: !573, size: 96, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !545, line: 158, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !545, line: 151, size: 96, elements: !575)
!575 = !{!576, !577, !578}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !574, file: !545, line: 154, baseType: !111, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !574, file: !545, line: 155, baseType: !550, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !574, file: !545, line: 156, baseType: !550, size: 32, offset: 64)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "xDelayedTaskList2", scope: !523, file: !524, line: 353, type: !565, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "uxTaskNumber", scope: !523, file: !524, line: 379, type: !82, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "uxSchedulerSuspended", scope: !523, file: !524, line: 391, type: !569, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "xIdleTaskHandle", scope: !523, file: !524, line: 381, type: !561, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "xNextTaskUnblockTime", scope: !523, file: !524, line: 380, type: !589, isLocal: true, isDefinition: true)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !111)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "xSchedulerRunning", scope: !523, file: !524, line: 375, type: !592, isLocal: true, isDefinition: true)
!592 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !509)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "xTickCount", scope: !523, file: !524, line: 373, type: !589, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "uxCurrentNumberOfTasks", scope: !523, file: !524, line: 372, type: !569, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "xPendingReadyList", scope: !523, file: !524, line: 356, type: !565, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "uxTopReadyPriority", scope: !523, file: !524, line: 374, type: !569, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "pxReadyTasksLists", scope: !523, file: !524, line: 351, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 1120, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 7)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "xYieldPending", scope: !523, file: !524, line: 377, type: !592, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "uxPendedTicks", scope: !523, file: !524, line: 376, type: !569, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "pxDelayedTaskList", scope: !523, file: !524, line: 354, type: !612, isLocal: true, isDefinition: true)
!612 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "pxOverflowDelayedTaskList", scope: !523, file: !524, line: 355, type: !612, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "xNumOfOverflows", scope: !523, file: !524, line: 378, type: !592, isLocal: true, isDefinition: true)
!618 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !535)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "instance", linkageName: "_ZN6Cicada9Stm32Uart8instanceE", scope: !621, file: !622, line: 32, type: !726, isLocal: false, isDefinition: true, declaration: !725)
!621 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !622, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !623, retainedTypes: !640, globals: !848, imports: !849, splitDebugInlining: false, nameTableKind: None)
!622 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "3cfb26aba75e1df83974cb6e4fff6457")
!623 = !{!624, !5, !625, !629}
!624 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 69, baseType: !24, size: 32, elements: !402, identifier: "_ZTS9IRQn_Type")
!625 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 52, baseType: !7, size: 32, elements: !626, identifier: "_ZTS15HAL_LockTypeDef")
!626 = !{!627, !628}
!627 = !DIEnumerator(name: "HAL_UNLOCKED", value: 0, isUnsigned: true)
!628 = !DIEnumerator(name: "HAL_LOCKED", value: 1, isUnsigned: true)
!629 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !630, line: 117, baseType: !7, size: 32, elements: !631, identifier: "_ZTS21HAL_UART_StateTypeDef")
!630 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "74469f61b271b78e5ff5784cb5eb97d1")
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639}
!632 = !DIEnumerator(name: "HAL_UART_STATE_RESET", value: 0, isUnsigned: true)
!633 = !DIEnumerator(name: "HAL_UART_STATE_READY", value: 32, isUnsigned: true)
!634 = !DIEnumerator(name: "HAL_UART_STATE_BUSY", value: 36, isUnsigned: true)
!635 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX", value: 33, isUnsigned: true)
!636 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_RX", value: 34, isUnsigned: true)
!637 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX_RX", value: 35, isUnsigned: true)
!638 = !DIEnumerator(name: "HAL_UART_STATE_TIMEOUT", value: 160, isUnsigned: true)
!639 = !DIEnumerator(name: "HAL_UART_STATE_ERROR", value: 224, isUnsigned: true)
!640 = !{!32, !66, !641, !651, !79, !87, !26, !179, !665, !695, !720}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFIO_TypeDef", file: !68, line: 380, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 373, size: 256, flags: DIFlagTypePassByValue, elements: !644, identifier: "_ZTS12AFIO_TypeDef")
!644 = !{!645, !646, !647, !649, !650}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "EVCR", scope: !643, file: !68, line: 375, baseType: !72, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR", scope: !643, file: !68, line: 376, baseType: !72, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !643, file: !68, line: 377, baseType: !648, size: 128, offset: 64)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !114)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !643, file: !68, line: 378, baseType: !32, size: 32, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR2", scope: !643, file: !68, line: 379, baseType: !72, size: 32, offset: 224)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !68, line: 438, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 424, size: 320, flags: DIFlagTypePassByValue, elements: !654, identifier: "_ZTS11RCC_TypeDef")
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !653, file: !68, line: 426, baseType: !72, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !653, file: !68, line: 427, baseType: !72, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !653, file: !68, line: 428, baseType: !72, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !653, file: !68, line: 429, baseType: !72, size: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !653, file: !68, line: 430, baseType: !72, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !653, file: !68, line: 431, baseType: !72, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !653, file: !68, line: 432, baseType: !72, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !653, file: !68, line: 433, baseType: !72, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !653, file: !68, line: 434, baseType: !72, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !653, file: !68, line: 435, baseType: !72, size: 32, offset: 288)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !338, line: 355, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 340, size: 28704, flags: DIFlagTypePassByValue, elements: !668, identifier: "_ZTS9NVIC_Type")
!668 = !{!669, !671, !675, !676, !677, !678, !679, !680, !681, !682, !686, !690, !694}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !667, file: !338, line: 342, baseType: !670, size: 256)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, elements: !380)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !667, file: !338, line: 343, baseType: !672, size: 768, offset: 256)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 768, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 24)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !667, file: !338, line: 344, baseType: !670, size: 256, offset: 1024)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !667, file: !338, line: 345, baseType: !672, size: 768, offset: 1280)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !667, file: !338, line: 346, baseType: !670, size: 256, offset: 2048)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !667, file: !338, line: 347, baseType: !672, size: 768, offset: 2304)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !667, file: !338, line: 348, baseType: !670, size: 256, offset: 3072)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !667, file: !338, line: 349, baseType: !672, size: 768, offset: 3328)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !667, file: !338, line: 350, baseType: !670, size: 256, offset: 4096)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !667, file: !338, line: 351, baseType: !683, size: 1792, offset: 4352)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1792, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 56)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !667, file: !338, line: 352, baseType: !687, size: 1920, offset: 6144)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 1920, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 240)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !667, file: !338, line: 353, baseType: !691, size: 20608, offset: 8064)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 20608, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 644)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !667, file: !338, line: 354, baseType: !72, size: 32, offset: 28672)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !338, line: 397, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 374, size: 1120, flags: DIFlagTypePassByValue, elements: !698, identifier: "_ZTS8SCB_Type")
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !697, file: !338, line: 376, baseType: !342, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !697, file: !338, line: 377, baseType: !72, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !697, file: !338, line: 378, baseType: !72, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !697, file: !338, line: 379, baseType: !72, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !697, file: !338, line: 380, baseType: !72, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !697, file: !338, line: 381, baseType: !72, size: 32, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !697, file: !338, line: 382, baseType: !349, size: 96, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !697, file: !338, line: 383, baseType: !72, size: 32, offset: 288)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !697, file: !338, line: 384, baseType: !72, size: 32, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !697, file: !338, line: 385, baseType: !72, size: 32, offset: 352)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !697, file: !338, line: 386, baseType: !72, size: 32, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !697, file: !338, line: 387, baseType: !72, size: 32, offset: 416)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !697, file: !338, line: 388, baseType: !72, size: 32, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !697, file: !338, line: 389, baseType: !72, size: 32, offset: 480)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !697, file: !338, line: 390, baseType: !361, size: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !697, file: !338, line: 391, baseType: !342, size: 32, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !697, file: !338, line: 392, baseType: !342, size: 32, offset: 608)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !697, file: !338, line: 393, baseType: !365, size: 128, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !697, file: !338, line: 394, baseType: !367, size: 160, offset: 768)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !697, file: !338, line: 395, baseType: !371, size: 160, offset: 928)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !697, file: !338, line: 396, baseType: !72, size: 32, offset: 1088)
!720 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !17, file: !155, line: 51, size: 1536, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !721, vtableHolder: !824)
!721 = !{!722, !725, !728, !729, !765, !766, !767, !768, !770, !776, !779, !782, !785, !788, !791, !792, !795, !796, !803, !807, !808, !809, !812, !813, !817, !821}
!722 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !720, baseType: !723, flags: DIFlagPublic, extraData: i32 0)
!723 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BufferedSerial", scope: !17, file: !724, line: 42, size: 832, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada14BufferedSerialE")
!724 = !DIFile(filename: "../cicada/bufferedserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "b9c9871d742db1af5ee8abb5df52fc59")
!725 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !720, file: !155, line: 120, baseType: !726, flags: DIFlagStaticMember)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 128, elements: !114)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !720, file: !155, line: 122, baseType: !87, size: 8, offset: 832)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_handle", scope: !720, file: !155, line: 123, baseType: !730, size: 576, offset: 864)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_HandleTypeDef", file: !630, line: 189, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__UART_HandleTypeDef", file: !630, line: 141, size: 576, flags: DIFlagTypePassByValue, elements: !732, identifier: "_ZTS20__UART_HandleTypeDef")
!732 = !{!733, !734, !745, !746, !747, !749, !750, !751, !752, !757, !758, !760, !763, !764}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Instance", scope: !731, file: !630, line: 143, baseType: !66, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Init", scope: !731, file: !630, line: 145, baseType: !735, size: 224, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_InitTypeDef", file: !630, line: 76, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 47, size: 224, flags: DIFlagTypePassByValue, elements: !737, identifier: "_ZTS16UART_InitTypeDef")
!737 = !{!738, !739, !740, !741, !742, !743, !744}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "BaudRate", scope: !736, file: !630, line: 49, baseType: !32, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "WordLength", scope: !736, file: !630, line: 54, baseType: !32, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "StopBits", scope: !736, file: !630, line: 57, baseType: !32, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Parity", scope: !736, file: !630, line: 60, baseType: !32, size: 32, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !736, file: !630, line: 67, baseType: !32, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "HwFlowCtl", scope: !736, file: !630, line: 70, baseType: !32, size: 32, offset: 160)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "OverSampling", scope: !736, file: !630, line: 73, baseType: !32, size: 32, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pTxBuffPtr", scope: !731, file: !630, line: 147, baseType: !86, size: 32, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferSize", scope: !731, file: !630, line: 149, baseType: !26, size: 16, offset: 288)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferCount", scope: !731, file: !630, line: 151, baseType: !748, size: 16, offset: 304)
!748 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !26)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pRxBuffPtr", scope: !731, file: !630, line: 153, baseType: !86, size: 32, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferSize", scope: !731, file: !630, line: 155, baseType: !26, size: 16, offset: 352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferCount", scope: !731, file: !630, line: 157, baseType: !748, size: 16, offset: 368)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "hdmatx", scope: !731, file: !630, line: 159, baseType: !753, size: 32, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HandleTypeDef", file: !755, line: 137, baseType: !756)
!755 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_dma.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dd8e7645a79a80f8166404bb078b3d4e")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__DMA_HandleTypeDef", file: !755, line: 111, size: 576, flags: DIFlagFwdDecl, identifier: "_ZTS19__DMA_HandleTypeDef")
!757 = !DIDerivedType(tag: DW_TAG_member, name: "hdmarx", scope: !731, file: !630, line: 161, baseType: !753, size: 32, offset: 416)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !731, file: !630, line: 163, baseType: !759, size: 32, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_LockTypeDef", file: !6, line: 56, baseType: !625)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "gState", scope: !731, file: !630, line: 165, baseType: !761, size: 32, offset: 480)
!761 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_UART_StateTypeDef", file: !630, line: 136, baseType: !629)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "RxState", scope: !731, file: !630, line: 169, baseType: !761, size: 32, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorCode", scope: !731, file: !630, line: 172, baseType: !72, size: 32, offset: 544)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_uartPort", scope: !720, file: !155, line: 124, baseType: !79, size: 32, offset: 1440)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_txPin", scope: !720, file: !155, line: 125, baseType: !26, size: 16, offset: 1472)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_rxPin", scope: !720, file: !155, line: 126, baseType: !26, size: 16, offset: 1488)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_uartInterruptInstance", scope: !720, file: !155, line: 127, baseType: !769, size: 32, offset: 1504)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !68, line: 126, baseType: !624)
!770 = !DISubprogram(name: "Stm32Uart", scope: !720, file: !155, line: 66, type: !771, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !773, !261, !261, !774, !66, !79, !26, !26}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "Size", scope: !17, file: !775, line: 32, baseType: !216)
!775 = !DIFile(filename: "../cicada/types.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "6dfa4c2c933d4c520c13fa7638528c51")
!776 = !DISubprogram(name: "Stm32Uart", scope: !720, file: !155, line: 83, type: !777, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !773, !261, !261, !774, !774, !66, !79, !26, !26}
!779 = !DISubprogram(name: "~Stm32Uart", scope: !720, file: !155, line: 86, type: !780, scopeLine: 86, containingType: !720, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !773}
!782 = !DISubprogram(name: "getInstance", linkageName: "_ZN6Cicada9Stm32Uart11getInstanceEP13USART_TypeDef", scope: !720, file: !155, line: 88, type: !783, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!783 = !DISubroutineType(types: !784)
!784 = !{!727, !66}
!785 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEv", scope: !720, file: !155, line: 93, type: !786, scopeLine: 93, containingType: !720, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!786 = !DISubroutineType(types: !787)
!787 = !{!35, !773}
!788 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEh", scope: !720, file: !155, line: 100, type: !789, scopeLine: 100, containingType: !720, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!789 = !DISubroutineType(types: !790)
!790 = !{!35, !773, !87}
!791 = !DISubprogram(name: "isOpen", linkageName: "_ZN6Cicada9Stm32Uart6isOpenEv", scope: !720, file: !155, line: 102, type: !786, scopeLine: 102, containingType: !720, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!792 = !DISubprogram(name: "setSerialConfig", linkageName: "_ZN6Cicada9Stm32Uart15setSerialConfigEjh", scope: !720, file: !155, line: 103, type: !793, scopeLine: 103, containingType: !720, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!793 = !DISubroutineType(types: !794)
!794 = !{!35, !773, !32, !87}
!795 = !DISubprogram(name: "close", linkageName: "_ZN6Cicada9Stm32Uart5closeEv", scope: !720, file: !155, line: 104, type: !780, scopeLine: 104, containingType: !720, virtualIndex: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!796 = !DISubprogram(name: "portName", linkageName: "_ZNK6Cicada9Stm32Uart8portNameEv", scope: !720, file: !155, line: 105, type: !797, scopeLine: 105, containingType: !720, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!797 = !DISubroutineType(types: !798)
!798 = !{!799, !801}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!803 = !DISubprogram(name: "rawRead", linkageName: "_ZN6Cicada9Stm32Uart7rawReadERh", scope: !720, file: !155, line: 106, type: !804, scopeLine: 106, containingType: !720, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!804 = !DISubroutineType(types: !805)
!805 = !{!35, !773, !806}
!806 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !87, size: 32)
!807 = !DISubprogram(name: "rawWrite", linkageName: "_ZN6Cicada9Stm32Uart8rawWriteEh", scope: !720, file: !155, line: 107, type: !789, scopeLine: 107, containingType: !720, virtualIndex: 22, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!808 = !DISubprogram(name: "startTransmit", linkageName: "_ZN6Cicada9Stm32Uart13startTransmitEv", scope: !720, file: !155, line: 108, type: !780, scopeLine: 108, containingType: !720, virtualIndex: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!809 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada9Stm32Uart20writeBufferProcessedEv", scope: !720, file: !155, line: 109, type: !810, scopeLine: 109, containingType: !720, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!810 = !DISubroutineType(types: !811)
!811 = !{!35, !801}
!812 = !DISubprogram(name: "handleInterrupt", linkageName: "_ZN6Cicada9Stm32Uart15handleInterruptEv", scope: !720, file: !155, line: 111, type: !780, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!813 = !DISubprogram(name: "Stm32Uart", scope: !720, file: !155, line: 115, type: !814, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !773, !816}
!816 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !802, size: 32)
!817 = !DISubprogram(name: "operator=", linkageName: "_ZN6Cicada9Stm32UartaSERKS0_", scope: !720, file: !155, line: 116, type: !818, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!818 = !DISubroutineType(types: !819)
!819 = !{!820, !773, !816}
!820 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !720, size: 32)
!821 = !DISubprogram(name: "init", linkageName: "_ZN6Cicada9Stm32Uart4initEP13USART_TypeDef", scope: !720, file: !155, line: 118, type: !822, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !773, !66}
!824 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ICommDevice", scope: !17, file: !825, line: 43, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !826, vtableHolder: !824, identifier: "_ZTSN6Cicada11ICommDeviceE")
!825 = !DIFile(filename: "../cicada/icommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "e83d2959922f5020d303a6315b56c6e9")
!826 = !{!827, !828, !832, !837, !838, !841, !844}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ICommDevice", scope: !825, file: !825, baseType: !20, size: 32, flags: DIFlagArtificial)
!828 = !DISubprogram(name: "~ICommDevice", scope: !824, file: !825, line: 46, type: !829, scopeLine: 46, containingType: !824, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !831}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!832 = !DISubprogram(name: "bytesAvailable", linkageName: "_ZNK6Cicada11ICommDevice14bytesAvailableEv", scope: !824, file: !825, line: 52, type: !833, scopeLine: 52, containingType: !824, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!833 = !DISubroutineType(types: !834)
!834 = !{!774, !835}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!837 = !DISubprogram(name: "spaceAvailable", linkageName: "_ZNK6Cicada11ICommDevice14spaceAvailableEv", scope: !824, file: !825, line: 60, type: !833, scopeLine: 60, containingType: !824, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!838 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada11ICommDevice20writeBufferProcessedEv", scope: !824, file: !825, line: 71, type: !839, scopeLine: 71, containingType: !824, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!839 = !DISubroutineType(types: !840)
!840 = !{!35, !835}
!841 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada11ICommDevice4readEPhy", scope: !824, file: !825, line: 85, type: !842, scopeLine: 85, containingType: !824, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!842 = !DISubroutineType(types: !843)
!843 = !{!774, !831, !86, !774}
!844 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada11ICommDevice5writeEPKhy", scope: !824, file: !825, line: 98, type: !845, scopeLine: 98, containingType: !824, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!845 = !DISubroutineType(types: !846)
!846 = !{!774, !831, !847, !774}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!848 = !{!619}
!849 = !{!168, !174, !178, !181, !185, !188, !190, !192, !194, !197, !200, !203, !206, !209, !212, !213, !214, !215, !219, !221, !223, !225, !227, !230, !233, !236, !239, !242, !850}
!850 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !621, entity: !17, file: !622, line: 28)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "_okStr", linkageName: "_ZN6Cicada12ATCommDevice6_okStrE", scope: !853, file: !854, line: 34, type: !799, isLocal: false, isDefinition: true, declaration: !937)
!853 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !854, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !855, globals: !974, imports: !979, splitDebugInlining: false, nameTableKind: None)
!854 = !DIFile(filename: "../cicada/commdevices/atcommdevice.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "2c00a0b2c5bf95afd2d356500bb68c03")
!855 = !{!847, !24, !86, !856}
!856 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ATCommDevice", scope: !17, file: !857, line: 39, size: 1856, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !858, vtableHolder: !824)
!857 = !DIFile(filename: "../cicada/commdevices/atcommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "533b96ced66a81acd2797c3eeacc1c13")
!858 = !{!859, !862, !927, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !944, !947, !950, !953, !956, !959, !962, !963, !966, !969, !970, !971}
!859 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !856, baseType: !860, flags: DIFlagPublic, extraData: i32 0)
!860 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "IPCommDevice", scope: !17, file: !861, line: 42, size: 1152, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada12IPCommDeviceE")
!861 = !DIFile(filename: "../cicada/commdevices/ipcommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5231d389687db9c7b4a2dc5416c977bf")
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_serial", scope: !856, file: !857, line: 83, baseType: !863, size: 32, offset: 1120, flags: DIFlagProtected)
!863 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !864, size: 32)
!864 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "IBufferedSerial", scope: !17, file: !865, line: 39, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !866, vtableHolder: !824, identifier: "_ZTSN6Cicada15IBufferedSerialE")
!865 = !DIFile(filename: "../cicada/ibufferedserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "0e5db7c0b86651abb573e233dc791166")
!866 = !{!867, !868, !897, !901, !904, !907, !910, !913, !916, !921, !922, !923, !926}
!867 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !864, baseType: !824, flags: DIFlagPublic, extraData: i32 0)
!868 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !864, baseType: !869, offset: 32, flags: DIFlagPublic, extraData: i32 0)
!869 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ISerial", scope: !17, file: !870, line: 37, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !871, vtableHolder: !869, identifier: "_ZTSN6Cicada7ISerialE")
!870 = !DIFile(filename: "../cicada/iserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "e3dc53a2acd15a8e90c357a32168f40f")
!871 = !{!872, !873, !877, !880, !881, !884, !885, !890, !893, !896}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ISerial", scope: !870, file: !870, baseType: !20, size: 32, flags: DIFlagArtificial)
!873 = !DISubprogram(name: "~ISerial", scope: !869, file: !870, line: 40, type: !874, scopeLine: 40, containingType: !869, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !876}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!877 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada7ISerial4openEv", scope: !869, file: !870, line: 46, type: !878, scopeLine: 46, containingType: !869, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!878 = !DISubroutineType(types: !879)
!879 = !{!35, !876}
!880 = !DISubprogram(name: "isOpen", linkageName: "_ZN6Cicada7ISerial6isOpenEv", scope: !869, file: !870, line: 52, type: !878, scopeLine: 52, containingType: !869, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!881 = !DISubprogram(name: "setSerialConfig", linkageName: "_ZN6Cicada7ISerial15setSerialConfigEjh", scope: !869, file: !870, line: 60, type: !882, scopeLine: 60, containingType: !869, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!882 = !DISubroutineType(types: !883)
!883 = !{!35, !876, !32, !87}
!884 = !DISubprogram(name: "close", linkageName: "_ZN6Cicada7ISerial5closeEv", scope: !869, file: !870, line: 65, type: !874, scopeLine: 65, containingType: !869, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!885 = !DISubprogram(name: "portName", linkageName: "_ZNK6Cicada7ISerial8portNameEv", scope: !869, file: !870, line: 71, type: !886, scopeLine: 71, containingType: !869, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!886 = !DISubroutineType(types: !887)
!887 = !{!799, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!890 = !DISubprogram(name: "rawRead", linkageName: "_ZN6Cicada7ISerial7rawReadERh", scope: !869, file: !870, line: 80, type: !891, scopeLine: 80, containingType: !869, virtualIndex: 7, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!891 = !DISubroutineType(types: !892)
!892 = !{!35, !876, !806}
!893 = !DISubprogram(name: "rawWrite", linkageName: "_ZN6Cicada7ISerial8rawWriteEh", scope: !869, file: !870, line: 87, type: !894, scopeLine: 87, containingType: !869, virtualIndex: 8, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!894 = !DISubroutineType(types: !895)
!895 = !{!35, !876, !87}
!896 = !DISubprogram(name: "startTransmit", linkageName: "_ZN6Cicada7ISerial13startTransmitEv", scope: !869, file: !870, line: 93, type: !874, scopeLine: 93, containingType: !869, virtualIndex: 9, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!897 = !DISubprogram(name: "~IBufferedSerial", scope: !864, file: !865, line: 42, type: !898, scopeLine: 42, containingType: !864, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!898 = !DISubroutineType(types: !899)
!899 = !{null, !900}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!901 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada15IBufferedSerial4readEPhy", scope: !864, file: !865, line: 44, type: !902, scopeLine: 44, containingType: !864, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!902 = !DISubroutineType(types: !903)
!903 = !{!774, !900, !86, !774}
!904 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEPKhy", scope: !864, file: !865, line: 45, type: !905, scopeLine: 45, containingType: !864, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!905 = !DISubroutineType(types: !906)
!906 = !{!774, !900, !847, !774}
!907 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada15IBufferedSerial4readEv", scope: !864, file: !865, line: 51, type: !908, scopeLine: 51, containingType: !864, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!908 = !DISubroutineType(types: !909)
!909 = !{!87, !900}
!910 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEPKh", scope: !864, file: !865, line: 62, type: !911, scopeLine: 62, containingType: !864, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!911 = !DISubroutineType(types: !912)
!912 = !{!774, !900, !847}
!913 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEh", scope: !864, file: !865, line: 68, type: !914, scopeLine: 68, containingType: !864, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !900, !87}
!916 = !DISubprogram(name: "canReadLine", linkageName: "_ZNK6Cicada15IBufferedSerial11canReadLineEv", scope: !864, file: !865, line: 73, type: !917, scopeLine: 73, containingType: !864, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!917 = !DISubroutineType(types: !918)
!918 = !{!35, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!921 = !DISubprogram(name: "readLine", linkageName: "_ZN6Cicada15IBufferedSerial8readLineEPhy", scope: !864, file: !865, line: 85, type: !902, scopeLine: 85, containingType: !864, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!922 = !DISubprogram(name: "flushReceiveBuffers", linkageName: "_ZN6Cicada15IBufferedSerial19flushReceiveBuffersEv", scope: !864, file: !865, line: 90, type: !898, scopeLine: 90, containingType: !864, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!923 = !DISubprogram(name: "readBufferSize", linkageName: "_ZN6Cicada15IBufferedSerial14readBufferSizeEv", scope: !864, file: !865, line: 95, type: !924, scopeLine: 95, containingType: !864, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!924 = !DISubroutineType(types: !925)
!925 = !{!774, !900}
