; ModuleID = './examples/ipcommdevice_stm32.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%"class.Cicada::Stm32Uart" = type { %"class.Cicada::BufferedSerial", i8, %struct.__UART_HandleTypeDef, %struct.USART_TypeDef*, i16, i16, i32 }
%"class.Cicada::BufferedSerial" = type { %"class.Cicada::IBufferedSerial", %"class.Cicada::LineCircularBuffer", %"class.Cicada::LineCircularBuffer" }
%"class.Cicada::IBufferedSerial" = type { %"class.Cicada::ICommDevice", %"class.Cicada::ICommDevice" }
%"class.Cicada::ICommDevice" = type { i32 (...)** }
%"class.Cicada::LineCircularBuffer" = type { %"class.Cicada::CircularBuffer.base", i16, [2 x i8] }
%"class.Cicada::CircularBuffer.base" = type <{ i32 (...)**, [4 x i8], i64, i64, i64, i64, i8* }>
%struct.__UART_HandleTypeDef = type { %struct.USART_TypeDef*, %struct.USART_TypeDef, i8*, i16, i16, i8*, i16, i16, %struct.__DMA_HandleTypeDef*, %struct.__DMA_HandleTypeDef*, i32, i32, i32, i32 }
%struct.USART_TypeDef = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.__DMA_HandleTypeDef = type { %struct.DMA_Channel_TypeDef*, %struct.USART_TypeDef, i32, i32, i8*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, i32, %struct.DMA_TypeDef*, i32 }
%struct.DMA_Channel_TypeDef = type { i32, i32, i32, i32 }
%struct.DMA_TypeDef = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "instance", scope: !2, file: !3, line: 157, type: !122, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "USART1_IRQHandler", scope: !3, file: !3, line: 155, type: !4, scopeLine: 156, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !121)
!3 = !DIFile(filename: "../examples/stm32f1/ipcommdevice_stm32.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "981e285bab603bfc0f1391c5844e4407")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !16, globals: !117, imports: !159, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8}
!8 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 41, baseType: !10, size: 32, elements: !11, identifier: "_ZTS17HAL_StatusTypeDef")
!9 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_def.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "4d6e0bbb91efacee14a68a416f506def")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15}
!12 = !DIEnumerator(name: "HAL_OK", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "HAL_ERROR", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "HAL_BUSY", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3, isUnsigned: true)
!16 = !{!17, !34, !37, !40, !44, !48, !51}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "USART_TypeDef", file: !19, line: 516, baseType: !20)
!19 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f103xb.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "d2562af6d7239ab46ca8ba238a43c848")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 507, size: 224, flags: DIFlagTypePassByValue, elements: !21, identifier: "_ZTS13USART_TypeDef")
!21 = !{!22, !28, !29, !30, !31, !32, !33}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !20, file: !19, line: 509, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 48, baseType: !26)
!25 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ab914e287601b2385e57880e6599aa6b")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !27, line: 79, baseType: !10)
!27 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f7024d0682a918b41f94e8be9cd90461")
!28 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !20, file: !19, line: 510, baseType: !23, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !20, file: !19, line: 511, baseType: !23, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !20, file: !19, line: 512, baseType: !23, size: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !20, file: !19, line: 513, baseType: !23, size: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "CR3", scope: !20, file: !19, line: 514, baseType: !23, size: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "GTPR", scope: !20, file: !19, line: 515, baseType: !23, size: 32, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !19, line: 367, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 358, size: 224, flags: DIFlagFwdDecl, identifier: "_ZTS12GPIO_TypeDef")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !25, line: 36, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !27, line: 57, baseType: !39)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SimCommDevice", scope: !43, file: !42, line: 33, size: 2240, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada13SimCommDeviceE")
!42 = !DIFile(filename: "../cicada/commdevices/simcommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "a544398dc40a994ae47c8561fb84bc57")
!43 = !DINamespace(name: "Cicada", scope: null)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !25, line: 24, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !27, line: 43, baseType: !47)
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "IPCommTask", file: !3, line: 19, size: 19456, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !49, vtableHolder: !51, identifier: "_ZTS10IPCommTask")
!49 = !{!50, !94, !96, !100, !101, !105, !109, !110, !114}
!50 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !48, baseType: !51, flags: DIFlagPublic, extraData: i32 0)
!51 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Task", scope: !43, file: !52, line: 193, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !53, vtableHolder: !51, identifier: "_ZTSN6Cicada4TaskE")
!52 = !DIFile(filename: "../cicada/task.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "c2aeaca9a01dbc0caa84f135ef9fda2b")
!53 = !{!54, !60, !61, !62, !64, !65, !69, !72, !77, !78, !81, !84, !85, !86, !87, !90}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Task", scope: !52, file: !52, baseType: !55, size: 32, flags: DIFlagArtificial)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !57, size: 32)
!57 = !DISubroutineType(types: !58)
!58 = !{!59}
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_delay", scope: !51, file: !52, line: 283, baseType: !37, size: 16, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_timeout", scope: !51, file: !52, line: 284, baseType: !24, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_isTimeoutRunning", scope: !51, file: !52, line: 285, baseType: !63, size: 8, offset: 96)
!63 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lastRun", scope: !51, file: !52, line: 286, baseType: !24, size: 32, offset: 128)
!65 = !DISubprogram(name: "Task", scope: !51, file: !52, line: 196, type: !66, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !68, !37}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!69 = !DISubprogram(name: "~Task", scope: !51, file: !52, line: 198, type: !70, scopeLine: 198, containingType: !51, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !68}
!72 = !DISubprogram(name: "delay", linkageName: "_ZNK6Cicada4Task5delayEv", scope: !51, file: !52, line: 203, type: !73, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!73 = !DISubroutineType(types: !74)
!74 = !{!37, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!77 = !DISubprogram(name: "setDelay", linkageName: "_ZN6Cicada4Task8setDelayEt", scope: !51, file: !52, line: 212, type: !66, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!78 = !DISubprogram(name: "lastRun", linkageName: "_ZN6Cicada4Task7lastRunEv", scope: !51, file: !52, line: 222, type: !79, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!79 = !DISubroutineType(types: !80)
!80 = !{!24, !68}
!81 = !DISubprogram(name: "setLastRun", linkageName: "_ZN6Cicada4Task10setLastRunEj", scope: !51, file: !52, line: 230, type: !82, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !68, !24}
!84 = !DISubprogram(name: "run", linkageName: "_ZN6Cicada4Task3runEv", scope: !51, file: !52, line: 245, type: !70, scopeLine: 245, containingType: !51, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!85 = !DISubprogram(name: "startTimeout", linkageName: "_ZN6Cicada4Task12startTimeoutEv", scope: !51, file: !52, line: 251, type: !70, scopeLine: 251, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!86 = !DISubprogram(name: "resetTimeout", linkageName: "_ZN6Cicada4Task12resetTimeoutEv", scope: !51, file: !52, line: 262, type: !70, scopeLine: 262, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!87 = !DISubprogram(name: "isTimeout", linkageName: "_ZN6Cicada4Task9isTimeoutEj", scope: !51, file: !52, line: 272, type: !88, scopeLine: 272, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!88 = !DISubroutineType(types: !89)
!89 = !{!63, !68, !24}
!90 = !DISubprogram(name: "Task", scope: !51, file: !52, line: 281, type: !91, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !68, !93}
!93 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !76, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_commBufferSize", scope: !48, file: !3, line: 84, baseType: !95, flags: DIFlagStaticMember, extraData: i16 1200)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_commReadBuffer", scope: !48, file: !3, line: 85, baseType: !97, size: 9600, offset: 160)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 9600, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 1200)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_commWriteBuffer", scope: !48, file: !3, line: 86, baseType: !97, size: 9600, offset: 9760)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "m_detector", scope: !48, file: !3, line: 88, baseType: !102, size: 32, offset: 19360)
!102 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !103, size: 32)
!103 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ModemDetect", scope: !43, file: !104, line: 39, size: 2624, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada11ModemDetectE")
!104 = !DIFile(filename: "../cicada/commdevices/modemdetect.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "b1dec331329dd985cf66a617d112eb19")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "m_commDev", scope: !48, file: !3, line: 89, baseType: !106, size: 32, offset: 19392)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ATCommDevice", scope: !43, file: !108, line: 39, size: 1856, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada12ATCommDeviceE")
!108 = !DIFile(filename: "../cicada/commdevices/atcommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "533b96ced66a81acd2797c3eeacc1c13")
!109 = !DIDerivedType(tag: DW_TAG_member, name: "m_i", scope: !48, file: !3, line: 90, baseType: !59, size: 32, offset: 19424)
!110 = !DISubprogram(name: "IPCommTask", scope: !48, file: !3, line: 22, type: !111, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !113, !102}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!114 = !DISubprogram(name: "run", linkageName: "_ZN10IPCommTask3runEv", scope: !48, file: !3, line: 27, type: !115, scopeLine: 27, containingType: !48, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !113}
!117 = !{!0, !118, !125, !133}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "instance", scope: !120, file: !3, line: 163, type: !122, isLocal: true, isDefinition: true)
!120 = distinct !DISubprogram(name: "USART2_IRQHandler", scope: !3, file: !3, line: 161, type: !4, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !121)
!121 = !{}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!123 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !43, file: !124, line: 51, size: 1536, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada9Stm32UartE")
!124 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "f1205a68111afe9a0868ac35ca31b4e6")
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "serial", scope: !127, file: !3, line: 169, type: !122, isLocal: true, isDefinition: true)
!127 = distinct !DISubprogram(name: "_putchar", scope: !3, file: !3, line: 167, type: !128, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !131)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !130}
!130 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!131 = !{!132}
!132 = !DILocalVariable(name: "c", arg: 1, scope: !127, file: !3, line: 167, type: !130)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "entrypoint", scope: !135, file: !3, line: 31, type: !45, isLocal: false, isDefinition: true)
!135 = distinct !DISubprogram(name: "run", linkageName: "_ZN10IPCommTask3runEv", scope: !48, file: !3, line: 27, type: !115, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, declaration: !114, retainedNodes: !136)
!136 = !{!137, !139, !140, !147, !156, !157}
!137 = !DILocalVariable(name: "this", arg: 1, scope: !135, type: !138, flags: DIFlagArtificial | DIFlagObjectPointer)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!139 = !DILocalVariable(name: "simCommDev", scope: !135, file: !3, line: 29, type: !40)
!140 = !DILocalVariable(name: "str", scope: !141, file: !3, line: 51, type: !143)
!141 = distinct !DILexicalBlock(scope: !142, file: !3, line: 50, column: 9)
!142 = distinct !DILexicalBlock(scope: !135, file: !3, line: 31, column: 9)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 568, elements: !145)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!145 = !{!146}
!146 = !DISubrange(count: 71)
!147 = !DILocalVariable(name: "buf", scope: !148, file: !3, line: 62, type: !153)
!148 = distinct !DILexicalBlock(scope: !149, file: !3, line: 61, column: 46)
!149 = distinct !DILexicalBlock(scope: !150, file: !3, line: 61, column: 17)
!150 = distinct !DILexicalBlock(scope: !151, file: !3, line: 60, column: 41)
!151 = distinct !DILexicalBlock(scope: !152, file: !3, line: 60, column: 9)
!152 = distinct !DILexicalBlock(scope: !142, file: !3, line: 60, column: 9)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 328, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 41)
!156 = !DILocalVariable(name: "bytesRead", scope: !148, file: !3, line: 63, type: !37)
!157 = !DILocalVariable(name: "i", scope: !158, file: !3, line: 64, type: !59)
!158 = distinct !DILexicalBlock(scope: !148, file: !3, line: 64, column: 17)
!159 = !{!160, !166, !170, !173, !177, !180, !182, !184, !186, !189, !192, !195, !198, !201, !204, !205, !206, !207, !211, !213, !215, !217, !219, !222, !225, !228, !231, !234, !237, !243, !247, !254, !256, !261, !267, !271, !275, !288, !292, !296, !300, !304, !309, !313, !317, !321, !325, !331, !335, !339, !341, !345, !349, !354, !358, !363, !365, !371, !375, !382, !384, !388, !392, !396, !400, !404, !409, !414, !415, !416, !417, !419, !420, !421, !422, !423, !424, !425, !427, !428, !429, !430, !431, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!160 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !162, file: !165, line: 47)
!161 = !DINamespace(name: "std", scope: null)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !25, line: 20, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !27, line: 41, baseType: !164)
!164 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!165 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstdint", directory: "/home/mjshen/RTOSExploration")
!166 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !167, file: !165, line: 48)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !25, line: 32, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !27, line: 55, baseType: !169)
!169 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!170 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !171, file: !165, line: 49)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !25, line: 44, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !27, line: 77, baseType: !59)
!173 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !174, file: !165, line: 50)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !25, line: 56, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !27, line: 103, baseType: !176)
!176 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!177 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !178, file: !165, line: 52)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !179, line: 51, baseType: !164)
!179 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "a169a1d650067906a9e00519a9405ebb")
!180 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !181, file: !165, line: 53)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !179, line: 61, baseType: !169)
!182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !183, file: !165, line: 54)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !179, line: 71, baseType: !59)
!184 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !185, file: !165, line: 55)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !179, line: 81, baseType: !176)
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !187, file: !165, line: 57)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !179, line: 21, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !27, line: 134, baseType: !164)
!189 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !190, file: !165, line: 58)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !179, line: 27, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !27, line: 160, baseType: !169)
!192 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !193, file: !165, line: 59)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !179, line: 33, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !27, line: 182, baseType: !59)
!195 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !196, file: !165, line: 60)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !179, line: 39, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !27, line: 200, baseType: !176)
!198 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !199, file: !165, line: 62)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !25, line: 67, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !27, line: 214, baseType: !176)
!201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !202, file: !165, line: 63)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !25, line: 77, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !27, line: 230, baseType: !59)
!204 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !45, file: !165, line: 65)
!205 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !37, file: !165, line: 66)
!206 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !24, file: !165, line: 67)
!207 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !208, file: !165, line: 68)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !25, line: 60, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !27, line: 105, baseType: !210)
!210 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !212, file: !165, line: 70)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !179, line: 52, baseType: !47)
!213 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !214, file: !165, line: 71)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !179, line: 62, baseType: !39)
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !216, file: !165, line: 72)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !179, line: 72, baseType: !10)
!217 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !218, file: !165, line: 73)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !179, line: 82, baseType: !210)
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !220, file: !165, line: 75)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !179, line: 22, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !27, line: 136, baseType: !47)
!222 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !223, file: !165, line: 76)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !179, line: 28, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !27, line: 162, baseType: !39)
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !226, file: !165, line: 77)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !179, line: 34, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !27, line: 184, baseType: !10)
!228 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !229, file: !165, line: 78)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !179, line: 40, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !27, line: 202, baseType: !210)
!231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !232, file: !165, line: 80)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !25, line: 72, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !27, line: 222, baseType: !210)
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !235, file: !165, line: 81)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !25, line: 82, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !27, line: 232, baseType: !10)
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !238, file: !242, line: 52)
!238 = !DISubprogram(name: "abs", scope: !239, file: !239, line: 70, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!239 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/stdlib.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ce64a6a93b8b46525165e9738bae1257")
!240 = !DISubroutineType(types: !241)
!241 = !{!59, !59}
!242 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/bits/std_abs.h", directory: "/home/mjshen/RTOSExploration")
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !244, file: !246, line: 127)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !239, line: 39, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 35, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!246 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstdlib", directory: "/home/mjshen/RTOSExploration")
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !248, file: !246, line: 128)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !239, line: 45, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 41, size: 64, flags: DIFlagTypePassByValue, elements: !250, identifier: "_ZTS6ldiv_t")
!250 = !{!251, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !249, file: !239, line: 43, baseType: !252, size: 32)
!252 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !249, file: !239, line: 44, baseType: !252, size: 32, offset: 32)
!254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !255, file: !246, line: 130)
!255 = !DISubprogram(name: "abort", scope: !239, file: !239, line: 69, type: !4, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !257, file: !246, line: 134)
!257 = !DISubprogram(name: "atexit", scope: !239, file: !239, line: 76, type: !258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!258 = !DISubroutineType(types: !259)
!259 = !{!59, !260}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!261 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !262, file: !246, line: 140)
!262 = !DISubprogram(name: "atof", scope: !239, file: !239, line: 77, type: !263, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!263 = !DISubroutineType(types: !264)
!264 = !{!265, !266}
!265 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !268, file: !246, line: 141)
!268 = !DISubprogram(name: "atoi", scope: !239, file: !239, line: 81, type: !269, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!269 = !DISubroutineType(types: !270)
!270 = !{!59, !266}
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !272, file: !246, line: 142)
!272 = !DISubprogram(name: "atol", scope: !239, file: !239, line: 83, type: !273, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!273 = !DISubroutineType(types: !274)
!274 = !{!252, !266}
!275 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !276, file: !246, line: 143)
!276 = !DISubprogram(name: "bsearch", scope: !239, file: !239, line: 85, type: !277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!277 = !DISubroutineType(types: !278)
!278 = !{!279, !280, !280, !282, !282, !284}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !283, line: 46, baseType: !10)
!283 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !239, line: 57, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{!59, !280, !280}
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !289, file: !246, line: 144)
!289 = !DISubprogram(name: "calloc", scope: !239, file: !239, line: 90, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!290 = !DISubroutineType(types: !291)
!291 = !{!279, !282, !282}
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !293, file: !246, line: 145)
!293 = !DISubprogram(name: "div", scope: !239, file: !239, line: 92, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!294 = !DISubroutineType(types: !295)
!295 = !{!244, !59, !59}
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !297, file: !246, line: 146)
!297 = !DISubprogram(name: "exit", scope: !239, file: !239, line: 93, type: !298, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !59}
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !301, file: !246, line: 147)
!301 = !DISubprogram(name: "free", scope: !239, file: !239, line: 94, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !279}
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !305, file: !246, line: 148)
!305 = !DISubprogram(name: "getenv", scope: !239, file: !239, line: 95, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!306 = !DISubroutineType(types: !307)
!307 = !{!308, !266}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !310, file: !246, line: 149)
!310 = !DISubprogram(name: "labs", scope: !239, file: !239, line: 106, type: !311, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!311 = !DISubroutineType(types: !312)
!312 = !{!252, !252}
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !314, file: !246, line: 150)
!314 = !DISubprogram(name: "ldiv", scope: !239, file: !239, line: 107, type: !315, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!315 = !DISubroutineType(types: !316)
!316 = !{!248, !252, !252}
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !318, file: !246, line: 151)
!318 = !DISubprogram(name: "malloc", scope: !239, file: !239, line: 108, type: !319, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!319 = !DISubroutineType(types: !320)
!320 = !{!279, !282}
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !322, file: !246, line: 153)
!322 = !DISubprogram(name: "mblen", scope: !239, file: !239, line: 109, type: !323, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!323 = !DISubroutineType(types: !324)
!324 = !{!59, !266, !282}
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !326, file: !246, line: 154)
!326 = !DISubprogram(name: "mbstowcs", scope: !239, file: !239, line: 115, type: !327, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!327 = !DISubroutineType(types: !328)
!328 = !{!282, !329, !266, !282}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_unsigned)
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !332, file: !246, line: 155)
!332 = !DISubprogram(name: "mbtowc", scope: !239, file: !239, line: 111, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!333 = !DISubroutineType(types: !334)
!334 = !{!59, !329, !266, !282}
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !336, file: !246, line: 157)
!336 = !DISubprogram(name: "qsort", scope: !239, file: !239, line: 143, type: !337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !279, !282, !282, !284}
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !340, file: !246, line: 163)
!340 = !DISubprogram(name: "rand", scope: !239, file: !239, line: 144, type: !57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !342, file: !246, line: 164)
!342 = !DISubprogram(name: "realloc", scope: !239, file: !239, line: 145, type: !343, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!343 = !DISubroutineType(types: !344)
!344 = !{!279, !279, !282}
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !346, file: !246, line: 165)
!346 = !DISubprogram(name: "srand", scope: !239, file: !239, line: 159, type: !347, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !10}
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !350, file: !246, line: 166)
!350 = !DISubprogram(name: "strtod", scope: !239, file: !239, line: 160, type: !351, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!351 = !DISubroutineType(types: !352)
!352 = !{!265, !266, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !355, file: !246, line: 167)
!355 = !DISubprogram(name: "strtol", scope: !239, file: !239, line: 171, type: !356, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!356 = !DISubroutineType(types: !357)
!357 = !{!252, !266, !353, !59}
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !359, file: !246, line: 168)
!359 = !DISubprogram(name: "strtoul", scope: !239, file: !239, line: 173, type: !360, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!360 = !DISubroutineType(types: !361)
!361 = !{!362, !266, !353, !59}
!362 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !364, file: !246, line: 169)
!364 = !DISubprogram(name: "system", scope: !239, file: !239, line: 191, type: !269, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !366, file: !246, line: 171)
!366 = !DISubprogram(name: "wcstombs", scope: !239, file: !239, line: 117, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!367 = !DISubroutineType(types: !368)
!368 = !{!282, !308, !369, !282}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !372, file: !246, line: 172)
!372 = !DISubprogram(name: "wctomb", scope: !239, file: !239, line: 113, type: !373, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!373 = !DISubroutineType(types: !374)
!374 = !{!59, !308, !330}
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !376, entity: !377, file: !246, line: 200)
!376 = !DINamespace(name: "__gnu_cxx", scope: null)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !239, line: 52, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 48, size: 128, flags: DIFlagTypePassByValue, elements: !379, identifier: "_ZTS7lldiv_t")
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !378, file: !239, line: 50, baseType: !176, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !378, file: !239, line: 51, baseType: !176, size: 64, offset: 64)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !376, entity: !383, file: !246, line: 206)
!383 = !DISubprogram(name: "_Exit", scope: !239, file: !239, line: 202, type: !298, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !376, entity: !385, file: !246, line: 210)
!385 = !DISubprogram(name: "llabs", scope: !239, file: !239, line: 267, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!386 = !DISubroutineType(types: !387)
!387 = !{!176, !176}
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !376, entity: !389, file: !246, line: 216)
!389 = !DISubprogram(name: "lldiv", scope: !239, file: !239, line: 268, type: !390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!390 = !DISubroutineType(types: !391)
!391 = !{!377, !176, !176}
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !376, entity: !393, file: !246, line: 227)
!393 = !DISubprogram(name: "atoll", scope: !239, file: !239, line: 263, type: !394, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!394 = !DISubroutineType(types: !395)
!395 = !{!176, !266}
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !376, entity: !397, file: !246, line: 228)
!397 = !DISubprogram(name: "strtoll", scope: !239, file: !239, line: 269, type: !398, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!398 = !DISubroutineType(types: !399)
!399 = !{!176, !266, !353, !59}
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !376, entity: !401, file: !246, line: 229)
!401 = !DISubprogram(name: "strtoull", scope: !239, file: !239, line: 273, type: !402, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!402 = !DISubroutineType(types: !403)
!403 = !{!210, !266, !353, !59}
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !376, entity: !405, file: !246, line: 231)
!405 = !DISubprogram(name: "strtof", scope: !239, file: !239, line: 163, type: !406, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !266, !353}
!408 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !376, entity: !410, file: !246, line: 232)
!410 = !DISubprogram(name: "strtold", scope: !239, file: !239, line: 324, type: !411, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!411 = !DISubroutineType(types: !412)
!412 = !{!413, !266, !353}
!413 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !377, file: !246, line: 240)
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !383, file: !246, line: 242)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !385, file: !246, line: 244)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !418, file: !246, line: 245)
!418 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !376, file: !246, line: 213, type: !390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !389, file: !246, line: 246)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !393, file: !246, line: 248)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !405, file: !246, line: 249)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !397, file: !246, line: 250)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !401, file: !246, line: 251)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !410, file: !246, line: 252)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !255, file: !426, line: 38)
!426 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/stdlib.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "74812296ae1ebf65f0c19983efc04bc1")
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !257, file: !426, line: 39)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !297, file: !426, line: 40)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !244, file: !426, line: 51)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !248, file: !426, line: 52)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !432, file: !426, line: 54)
!432 = !DISubprogram(name: "abs", linkageName: "_ZSt3abse", scope: !161, file: !242, line: 79, type: !433, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!433 = !DISubroutineType(types: !434)
!434 = !{!413, !413}
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !262, file: !426, line: 55)
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !268, file: !426, line: 56)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !272, file: !426, line: 57)
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !276, file: !426, line: 58)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !289, file: !426, line: 59)
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !418, file: !426, line: 60)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !301, file: !426, line: 61)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !305, file: !426, line: 62)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !310, file: !426, line: 63)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !314, file: !426, line: 64)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !318, file: !426, line: 65)
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !322, file: !426, line: 67)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !326, file: !426, line: 68)
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !332, file: !426, line: 69)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !336, file: !426, line: 71)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !340, file: !426, line: 72)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !342, file: !426, line: 73)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !346, file: !426, line: 74)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !350, file: !426, line: 75)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !355, file: !426, line: 76)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !359, file: !426, line: 77)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !364, file: !426, line: 78)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !366, file: !426, line: 80)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !372, file: !426, line: 81)
!459 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !6, entity: !43, file: !3, line: 15)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "pow10", scope: !462, file: !463, line: 311, type: !515, isLocal: true, isDefinition: true)
!462 = distinct !DISubprogram(name: "_ftoa", scope: !463, file: !463, line: 299, type: !464, scopeLine: 300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !470, retainedNodes: !482)
!463 = !DIFile(filename: "../dep/printf/src/printf.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "7383fa86adf0d25d8eda174a9b330d6a")
!464 = !DISubroutineType(types: !465)
!465 = !{!282, !466, !308, !282, !282, !265, !10, !10, !10}
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_type", file: !463, line: 97, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !130, !279, !282, !282}
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !471, globals: !481, splitDebugInlining: false, nameTableKind: None)
!471 = !{!282, !308, !235, !10, !59, !210, !362, !130, !169, !47, !39, !265, !472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_wrap_type", file: !463, line: 104, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !463, line: 101, size: 64, elements: !475)
!475 = !{!476, !480}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "fct", scope: !474, file: !463, line: 102, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !130, !279}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !474, file: !463, line: 103, baseType: !279, size: 32, offset: 32)
!481 = !{!460}
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !493, !497, !498, !499, !501, !503, !504, !505, !506, !509, !513}
!483 = !DILocalVariable(name: "out", arg: 1, scope: !462, file: !463, line: 299, type: !466)
!484 = !DILocalVariable(name: "buffer", arg: 2, scope: !462, file: !463, line: 299, type: !308)
!485 = !DILocalVariable(name: "idx", arg: 3, scope: !462, file: !463, line: 299, type: !282)
!486 = !DILocalVariable(name: "maxlen", arg: 4, scope: !462, file: !463, line: 299, type: !282)
!487 = !DILocalVariable(name: "value", arg: 5, scope: !462, file: !463, line: 299, type: !265)
!488 = !DILocalVariable(name: "prec", arg: 6, scope: !462, file: !463, line: 299, type: !10)
!489 = !DILocalVariable(name: "width", arg: 7, scope: !462, file: !463, line: 299, type: !10)
!490 = !DILocalVariable(name: "flags", arg: 8, scope: !462, file: !463, line: 299, type: !10)
!491 = !DILocalVariable(name: "start_idx", scope: !462, file: !463, line: 301, type: !492)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!493 = !DILocalVariable(name: "buf", scope: !462, file: !463, line: 303, type: !494)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 256, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 32)
!497 = !DILocalVariable(name: "len", scope: !462, file: !463, line: 304, type: !282)
!498 = !DILocalVariable(name: "diff", scope: !462, file: !463, line: 305, type: !265)
!499 = !DILocalVariable(name: "thres_max", scope: !462, file: !463, line: 308, type: !500)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!501 = !DILocalVariable(name: "negative", scope: !462, file: !463, line: 322, type: !502)
!502 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!503 = !DILocalVariable(name: "whole", scope: !462, file: !463, line: 338, type: !59)
!504 = !DILocalVariable(name: "tmp", scope: !462, file: !463, line: 339, type: !265)
!505 = !DILocalVariable(name: "frac", scope: !462, file: !463, line: 340, type: !362)
!506 = !DILocalVariable(name: "count", scope: !507, file: !463, line: 373, type: !10)
!507 = distinct !DILexicalBlock(scope: !508, file: !463, line: 372, column: 8)
!508 = distinct !DILexicalBlock(scope: !462, file: !463, line: 364, column: 7)
!509 = !DILocalVariable(name: "i", scope: !510, file: !463, line: 424, type: !282)
!510 = distinct !DILexicalBlock(scope: !511, file: !463, line: 424, column: 5)
!511 = distinct !DILexicalBlock(scope: !512, file: !463, line: 423, column: 58)
!512 = distinct !DILexicalBlock(scope: !462, file: !463, line: 423, column: 7)
!513 = !DILocalVariable(name: "i", scope: !514, file: !463, line: 430, type: !282)
!514 = distinct !DILexicalBlock(scope: !462, file: !463, line: 430, column: 3)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 640, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 10)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "AHBPrescTable", scope: !520, file: !521, line: 124, type: !593, isLocal: false, isDefinition: true)
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !522, retainedTypes: !528, globals: !584, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Source/Templates/system_stm32f1xx.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "2e873de3002e5d783190a46ff1c7da2d")
!522 = !{!523}
!523 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !524, line: 151, baseType: !10, size: 32, elements: !525)
!524 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xx.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dc4ed8bdf8589b30d30d93eb6ee6ca27")
!525 = !{!526, !527}
!526 = !DIEnumerator(name: "RESET", value: 0)
!527 = !DIEnumerator(name: "SET", value: 1)
!528 = !{!529, !543, !24}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !532)
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !531, file: !19, line: 426, baseType: !23, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !531, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !531, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !531, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !531, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !531, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !531, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !531, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !531, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !531, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !545, line: 397, baseType: !546)
!545 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 374, size: 1120, elements: !547)
!547 = !{!548, !550, !551, !552, !553, !554, !555, !560, !561, !562, !563, !564, !565, !566, !567, !571, !572, !573, !577, !581, !583}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !546, file: !545, line: 376, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !546, file: !545, line: 377, baseType: !23, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !546, file: !545, line: 378, baseType: !23, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !546, file: !545, line: 379, baseType: !23, size: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !546, file: !545, line: 380, baseType: !23, size: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !546, file: !545, line: 381, baseType: !23, size: 32, offset: 160)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !546, file: !545, line: 382, baseType: !556, size: 96, offset: 192)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 96, elements: !558)
!557 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!558 = !{!559}
!559 = !DISubrange(count: 12)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !546, file: !545, line: 383, baseType: !23, size: 32, offset: 288)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !546, file: !545, line: 384, baseType: !23, size: 32, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !546, file: !545, line: 385, baseType: !23, size: 32, offset: 352)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !546, file: !545, line: 386, baseType: !23, size: 32, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !546, file: !545, line: 387, baseType: !23, size: 32, offset: 416)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !546, file: !545, line: 388, baseType: !23, size: 32, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !546, file: !545, line: 389, baseType: !23, size: 32, offset: 480)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !546, file: !545, line: 390, baseType: !568, size: 64, offset: 512)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 64, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 2)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !546, file: !545, line: 391, baseType: !549, size: 32, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !546, file: !545, line: 392, baseType: !549, size: 32, offset: 608)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !546, file: !545, line: 393, baseType: !574, size: 128, offset: 640)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 128, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 4)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !546, file: !545, line: 394, baseType: !578, size: 160, offset: 768)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 160, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 5)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !546, file: !545, line: 395, baseType: !582, size: 160, offset: 928)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !579)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !546, file: !545, line: 396, baseType: !23, size: 32, offset: 1088)
!584 = !{!585, !518, !587}
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !520, file: !521, line: 123, type: !24, isLocal: false, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "APBPrescTable", scope: !520, file: !521, line: 125, type: !589, isLocal: false, isDefinition: true)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 64, elements: !591)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!591 = !{!592}
!592 = !DISubrange(count: 8)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 128, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 16)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "uwTickPrio", scope: !598, file: !599, line: 80, type: !24, isLocal: false, isDefinition: true)
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !600, retainedTypes: !668, globals: !711, splitDebugInlining: false, nameTableKind: None)
!599 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "1a5fa7b79e9e470cf817b81d791a6ccb")
!600 = !{!601, !608, !614}
!601 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !602, line: 49, baseType: !10, size: 32, elements: !603)
!602 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5eab64b252ccd159497a11d87d26bc0b")
!603 = !{!604, !605, !606, !607}
!604 = !DIEnumerator(name: "HAL_TICK_FREQ_10HZ", value: 100)
!605 = !DIEnumerator(name: "HAL_TICK_FREQ_100HZ", value: 10)
!606 = !DIEnumerator(name: "HAL_TICK_FREQ_1KHZ", value: 1)
!607 = !DIEnumerator(name: "HAL_TICK_FREQ_DEFAULT", value: 1)
!608 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 41, baseType: !10, size: 32, elements: !609)
!609 = !{!610, !611, !612, !613}
!610 = !DIEnumerator(name: "HAL_OK", value: 0)
!611 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!612 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!613 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!614 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 69, baseType: !59, size: 32, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!616 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!617 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!618 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!619 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!620 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!621 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!622 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!623 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!624 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!625 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!626 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!627 = !DIEnumerator(name: "TAMPER_IRQn", value: 2)
!628 = !DIEnumerator(name: "RTC_IRQn", value: 3)
!629 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!630 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!631 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!632 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!633 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!634 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!635 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!636 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!637 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!638 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!639 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!640 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!641 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!642 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!643 = !DIEnumerator(name: "ADC1_2_IRQn", value: 18)
!644 = !DIEnumerator(name: "USB_HP_CAN1_TX_IRQn", value: 19)
!645 = !DIEnumerator(name: "USB_LP_CAN1_RX0_IRQn", value: 20)
!646 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!647 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!648 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!649 = !DIEnumerator(name: "TIM1_BRK_IRQn", value: 24)
!650 = !DIEnumerator(name: "TIM1_UP_IRQn", value: 25)
!651 = !DIEnumerator(name: "TIM1_TRG_COM_IRQn", value: 26)
!652 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!653 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!654 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!655 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!656 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!657 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!658 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!659 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!660 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!661 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!662 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!663 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!664 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!665 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!666 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!667 = !DIEnumerator(name: "USBWakeUp_IRQn", value: 42)
!668 = !{!669, !24, !682, !696, !704, !710}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !19, line: 336, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 325, size: 288, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !671, file: !19, line: 327, baseType: !23, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !671, file: !19, line: 328, baseType: !23, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !671, file: !19, line: 329, baseType: !23, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !671, file: !19, line: 330, baseType: !23, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !671, file: !19, line: 331, baseType: !23, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !671, file: !19, line: 332, baseType: !23, size: 32, offset: 160)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !671, file: !19, line: 333, baseType: !23, size: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !671, file: !19, line: 334, baseType: !23, size: 32, offset: 224)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !671, file: !19, line: 335, baseType: !23, size: 32, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !684, file: !19, line: 426, baseType: !23, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !684, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !684, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !684, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !684, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !684, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !684, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !684, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !684, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !684, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !545, line: 700, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 694, size: 128, elements: !699)
!699 = !{!700, !701, !702, !703}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !698, file: !545, line: 696, baseType: !23, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !698, file: !545, line: 697, baseType: !23, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !698, file: !545, line: 698, baseType: !23, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !698, file: !545, line: 699, baseType: !549, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBGMCU_TypeDef", file: !19, line: 285, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 281, size: 64, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "IDCODE", scope: !706, file: !19, line: 283, baseType: !23, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !706, file: !19, line: 284, baseType: !23, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!711 = !{!596, !712, !715}
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "uwTickFreq", scope: !598, file: !599, line: 81, type: !714, isLocal: false, isDefinition: true)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_TickFreqTypeDef", file: !602, line: 55, baseType: !601)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "uwTick", scope: !598, file: !599, line: 79, type: !23, isLocal: false, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "instance", linkageName: "_ZN6Cicada9Stm32Uart8instanceE", scope: !719, file: !720, line: 32, type: !824, isLocal: false, isDefinition: true, declaration: !823)
!719 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !720, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !721, retainedTypes: !738, globals: !944, imports: !945, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "3cfb26aba75e1df83974cb6e4fff6457")
!721 = !{!722, !8, !723, !727}
!722 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 69, baseType: !59, size: 32, elements: !615, identifier: "_ZTS9IRQn_Type")
!723 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 52, baseType: !10, size: 32, elements: !724, identifier: "_ZTS15HAL_LockTypeDef")
!724 = !{!725, !726}
!725 = !DIEnumerator(name: "HAL_UNLOCKED", value: 0, isUnsigned: true)
!726 = !DIEnumerator(name: "HAL_LOCKED", value: 1, isUnsigned: true)
!727 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !728, line: 117, baseType: !10, size: 32, elements: !729, identifier: "_ZTS21HAL_UART_StateTypeDef")
!728 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "74469f61b271b78e5ff5784cb5eb97d1")
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737}
!730 = !DIEnumerator(name: "HAL_UART_STATE_RESET", value: 0, isUnsigned: true)
!731 = !DIEnumerator(name: "HAL_UART_STATE_READY", value: 32, isUnsigned: true)
!732 = !DIEnumerator(name: "HAL_UART_STATE_BUSY", value: 36, isUnsigned: true)
!733 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX", value: 33, isUnsigned: true)
!734 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_RX", value: 34, isUnsigned: true)
!735 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX_RX", value: 35, isUnsigned: true)
!736 = !DIEnumerator(name: "HAL_UART_STATE_TIMEOUT", value: 160, isUnsigned: true)
!737 = !DIEnumerator(name: "HAL_UART_STATE_ERROR", value: 224, isUnsigned: true)
!738 = !{!24, !17, !739, !749, !34, !45, !37, !171, !763, !793, !818}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFIO_TypeDef", file: !19, line: 380, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 373, size: 256, flags: DIFlagTypePassByValue, elements: !742, identifier: "_ZTS12AFIO_TypeDef")
!742 = !{!743, !744, !745, !747, !748}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "EVCR", scope: !741, file: !19, line: 375, baseType: !23, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR", scope: !741, file: !19, line: 376, baseType: !23, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !741, file: !19, line: 377, baseType: !746, size: 128, offset: 64)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !575)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !741, file: !19, line: 378, baseType: !24, size: 32, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR2", scope: !741, file: !19, line: 379, baseType: !23, size: 32, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, flags: DIFlagTypePassByValue, elements: !752, identifier: "_ZTS11RCC_TypeDef")
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !751, file: !19, line: 426, baseType: !23, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !751, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !751, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !751, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !751, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !751, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !751, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !751, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !751, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !751, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !545, line: 355, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 340, size: 28704, flags: DIFlagTypePassByValue, elements: !766, identifier: "_ZTS9NVIC_Type")
!766 = !{!767, !769, !773, !774, !775, !776, !777, !778, !779, !780, !784, !788, !792}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !765, file: !545, line: 342, baseType: !768, size: 256)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 256, elements: !591)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !765, file: !545, line: 343, baseType: !770, size: 768, offset: 256)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 768, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 24)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !765, file: !545, line: 344, baseType: !768, size: 256, offset: 1024)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !765, file: !545, line: 345, baseType: !770, size: 768, offset: 1280)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !765, file: !545, line: 346, baseType: !768, size: 256, offset: 2048)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !765, file: !545, line: 347, baseType: !770, size: 768, offset: 2304)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !765, file: !545, line: 348, baseType: !768, size: 256, offset: 3072)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !765, file: !545, line: 349, baseType: !770, size: 768, offset: 3328)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !765, file: !545, line: 350, baseType: !768, size: 256, offset: 4096)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !765, file: !545, line: 351, baseType: !781, size: 1792, offset: 4352)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1792, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 56)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !765, file: !545, line: 352, baseType: !785, size: 1920, offset: 6144)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 1920, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 240)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !765, file: !545, line: 353, baseType: !789, size: 20608, offset: 8064)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 20608, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 644)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !765, file: !545, line: 354, baseType: !23, size: 32, offset: 28672)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !545, line: 397, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 374, size: 1120, flags: DIFlagTypePassByValue, elements: !796, identifier: "_ZTS8SCB_Type")
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !795, file: !545, line: 376, baseType: !549, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !795, file: !545, line: 377, baseType: !23, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !795, file: !545, line: 378, baseType: !23, size: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !795, file: !545, line: 379, baseType: !23, size: 32, offset: 96)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !795, file: !545, line: 380, baseType: !23, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !795, file: !545, line: 381, baseType: !23, size: 32, offset: 160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !795, file: !545, line: 382, baseType: !556, size: 96, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !795, file: !545, line: 383, baseType: !23, size: 32, offset: 288)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !795, file: !545, line: 384, baseType: !23, size: 32, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !795, file: !545, line: 385, baseType: !23, size: 32, offset: 352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !795, file: !545, line: 386, baseType: !23, size: 32, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !795, file: !545, line: 387, baseType: !23, size: 32, offset: 416)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !795, file: !545, line: 388, baseType: !23, size: 32, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !795, file: !545, line: 389, baseType: !23, size: 32, offset: 480)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !795, file: !545, line: 390, baseType: !568, size: 64, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !795, file: !545, line: 391, baseType: !549, size: 32, offset: 576)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !795, file: !545, line: 392, baseType: !549, size: 32, offset: 608)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !795, file: !545, line: 393, baseType: !574, size: 128, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !795, file: !545, line: 394, baseType: !578, size: 160, offset: 768)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !795, file: !545, line: 395, baseType: !582, size: 160, offset: 928)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !795, file: !545, line: 396, baseType: !23, size: 32, offset: 1088)
!818 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !43, file: !124, line: 51, size: 1536, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !819, vtableHolder: !920)
!819 = !{!820, !823, !826, !827, !863, !864, !865, !866, !868, !874, !877, !880, !883, !886, !889, !890, !893, !894, !899, !903, !904, !905, !908, !909, !913, !917}
!820 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !818, baseType: !821, flags: DIFlagPublic, extraData: i32 0)
!821 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BufferedSerial", scope: !43, file: !822, line: 42, size: 832, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada14BufferedSerialE")
!822 = !DIFile(filename: "../cicada/bufferedserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "b9c9871d742db1af5ee8abb5df52fc59")
!823 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !818, file: !124, line: 120, baseType: !824, flags: DIFlagStaticMember)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 128, elements: !575)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !818, file: !124, line: 122, baseType: !45, size: 8, offset: 832)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_handle", scope: !818, file: !124, line: 123, baseType: !828, size: 576, offset: 864)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_HandleTypeDef", file: !728, line: 189, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__UART_HandleTypeDef", file: !728, line: 141, size: 576, flags: DIFlagTypePassByValue, elements: !830, identifier: "_ZTS20__UART_HandleTypeDef")
!830 = !{!831, !832, !843, !844, !845, !847, !848, !849, !850, !855, !856, !858, !861, !862}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Instance", scope: !829, file: !728, line: 143, baseType: !17, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Init", scope: !829, file: !728, line: 145, baseType: !833, size: 224, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_InitTypeDef", file: !728, line: 76, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !728, line: 47, size: 224, flags: DIFlagTypePassByValue, elements: !835, identifier: "_ZTS16UART_InitTypeDef")
!835 = !{!836, !837, !838, !839, !840, !841, !842}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "BaudRate", scope: !834, file: !728, line: 49, baseType: !24, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "WordLength", scope: !834, file: !728, line: 54, baseType: !24, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "StopBits", scope: !834, file: !728, line: 57, baseType: !24, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Parity", scope: !834, file: !728, line: 60, baseType: !24, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !834, file: !728, line: 67, baseType: !24, size: 32, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "HwFlowCtl", scope: !834, file: !728, line: 70, baseType: !24, size: 32, offset: 160)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "OverSampling", scope: !834, file: !728, line: 73, baseType: !24, size: 32, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pTxBuffPtr", scope: !829, file: !728, line: 147, baseType: !44, size: 32, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferSize", scope: !829, file: !728, line: 149, baseType: !37, size: 16, offset: 288)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferCount", scope: !829, file: !728, line: 151, baseType: !846, size: 16, offset: 304)
!846 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pRxBuffPtr", scope: !829, file: !728, line: 153, baseType: !44, size: 32, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferSize", scope: !829, file: !728, line: 155, baseType: !37, size: 16, offset: 352)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferCount", scope: !829, file: !728, line: 157, baseType: !846, size: 16, offset: 368)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "hdmatx", scope: !829, file: !728, line: 159, baseType: !851, size: 32, offset: 384)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HandleTypeDef", file: !853, line: 137, baseType: !854)
!853 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_dma.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dd8e7645a79a80f8166404bb078b3d4e")
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__DMA_HandleTypeDef", file: !853, line: 111, size: 576, flags: DIFlagFwdDecl, identifier: "_ZTS19__DMA_HandleTypeDef")
!855 = !DIDerivedType(tag: DW_TAG_member, name: "hdmarx", scope: !829, file: !728, line: 161, baseType: !851, size: 32, offset: 416)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !829, file: !728, line: 163, baseType: !857, size: 32, offset: 448)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_LockTypeDef", file: !9, line: 56, baseType: !723)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gState", scope: !829, file: !728, line: 165, baseType: !859, size: 32, offset: 480)
!859 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_UART_StateTypeDef", file: !728, line: 136, baseType: !727)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "RxState", scope: !829, file: !728, line: 169, baseType: !859, size: 32, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorCode", scope: !829, file: !728, line: 172, baseType: !23, size: 32, offset: 544)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_uartPort", scope: !818, file: !124, line: 124, baseType: !34, size: 32, offset: 1440)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_txPin", scope: !818, file: !124, line: 125, baseType: !37, size: 16, offset: 1472)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_rxPin", scope: !818, file: !124, line: 126, baseType: !37, size: 16, offset: 1488)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_uartInterruptInstance", scope: !818, file: !124, line: 127, baseType: !867, size: 32, offset: 1504)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !19, line: 126, baseType: !722)
!868 = !DISubprogram(name: "Stm32Uart", scope: !818, file: !124, line: 66, type: !869, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !871, !308, !308, !872, !17, !34, !37, !37}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "Size", scope: !43, file: !873, line: 32, baseType: !208)
!873 = !DIFile(filename: "../cicada/types.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "6dfa4c2c933d4c520c13fa7638528c51")
!874 = !DISubprogram(name: "Stm32Uart", scope: !818, file: !124, line: 83, type: !875, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !871, !308, !308, !872, !872, !17, !34, !37, !37}
!877 = !DISubprogram(name: "~Stm32Uart", scope: !818, file: !124, line: 86, type: !878, scopeLine: 86, containingType: !818, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !871}
!880 = !DISubprogram(name: "getInstance", linkageName: "_ZN6Cicada9Stm32Uart11getInstanceEP13USART_TypeDef", scope: !818, file: !124, line: 88, type: !881, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!881 = !DISubroutineType(types: !882)
!882 = !{!825, !17}
!883 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEv", scope: !818, file: !124, line: 93, type: !884, scopeLine: 93, containingType: !818, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!884 = !DISubroutineType(types: !885)
!885 = !{!63, !871}
!886 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEh", scope: !818, file: !124, line: 100, type: !887, scopeLine: 100, containingType: !818, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!887 = !DISubroutineType(types: !888)
!888 = !{!63, !871, !45}
!889 = !DISubprogram(name: "isOpen", linkageName: "_ZN6Cicada9Stm32Uart6isOpenEv", scope: !818, file: !124, line: 102, type: !884, scopeLine: 102, containingType: !818, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!890 = !DISubprogram(name: "setSerialConfig", linkageName: "_ZN6Cicada9Stm32Uart15setSerialConfigEjh", scope: !818, file: !124, line: 103, type: !891, scopeLine: 103, containingType: !818, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!891 = !DISubroutineType(types: !892)
!892 = !{!63, !871, !24, !45}
!893 = !DISubprogram(name: "close", linkageName: "_ZN6Cicada9Stm32Uart5closeEv", scope: !818, file: !124, line: 104, type: !878, scopeLine: 104, containingType: !818, virtualIndex: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!894 = !DISubprogram(name: "portName", linkageName: "_ZNK6Cicada9Stm32Uart8portNameEv", scope: !818, file: !124, line: 105, type: !895, scopeLine: 105, containingType: !818, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!895 = !DISubroutineType(types: !896)
!896 = !{!266, !897}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!899 = !DISubprogram(name: "rawRead", linkageName: "_ZN6Cicada9Stm32Uart7rawReadERh", scope: !818, file: !124, line: 106, type: !900, scopeLine: 106, containingType: !818, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!900 = !DISubroutineType(types: !901)
!901 = !{!63, !871, !902}
!902 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !45, size: 32)
!903 = !DISubprogram(name: "rawWrite", linkageName: "_ZN6Cicada9Stm32Uart8rawWriteEh", scope: !818, file: !124, line: 107, type: !887, scopeLine: 107, containingType: !818, virtualIndex: 22, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!904 = !DISubprogram(name: "startTransmit", linkageName: "_ZN6Cicada9Stm32Uart13startTransmitEv", scope: !818, file: !124, line: 108, type: !878, scopeLine: 108, containingType: !818, virtualIndex: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!905 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada9Stm32Uart20writeBufferProcessedEv", scope: !818, file: !124, line: 109, type: !906, scopeLine: 109, containingType: !818, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!906 = !DISubroutineType(types: !907)
!907 = !{!63, !897}
!908 = !DISubprogram(name: "handleInterrupt", linkageName: "_ZN6Cicada9Stm32Uart15handleInterruptEv", scope: !818, file: !124, line: 111, type: !878, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!909 = !DISubprogram(name: "Stm32Uart", scope: !818, file: !124, line: 115, type: !910, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !871, !912}
!912 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !898, size: 32)
!913 = !DISubprogram(name: "operator=", linkageName: "_ZN6Cicada9Stm32UartaSERKS0_", scope: !818, file: !124, line: 116, type: !914, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!914 = !DISubroutineType(types: !915)
!915 = !{!916, !871, !912}
!916 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !818, size: 32)
!917 = !DISubprogram(name: "init", linkageName: "_ZN6Cicada9Stm32Uart4initEP13USART_TypeDef", scope: !818, file: !124, line: 118, type: !918, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !871, !17}
!920 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ICommDevice", scope: !43, file: !921, line: 43, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !922, vtableHolder: !920, identifier: "_ZTSN6Cicada11ICommDeviceE")
!921 = !DIFile(filename: "../cicada/icommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "e83d2959922f5020d303a6315b56c6e9")
!922 = !{!923, !924, !928, !933, !934, !937, !940}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ICommDevice", scope: !921, file: !921, baseType: !55, size: 32, flags: DIFlagArtificial)
!924 = !DISubprogram(name: "~ICommDevice", scope: !920, file: !921, line: 46, type: !925, scopeLine: 46, containingType: !920, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !927}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!928 = !DISubprogram(name: "bytesAvailable", linkageName: "_ZNK6Cicada11ICommDevice14bytesAvailableEv", scope: !920, file: !921, line: 52, type: !929, scopeLine: 52, containingType: !920, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!929 = !DISubroutineType(types: !930)
!930 = !{!872, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!933 = !DISubprogram(name: "spaceAvailable", linkageName: "_ZNK6Cicada11ICommDevice14spaceAvailableEv", scope: !920, file: !921, line: 60, type: !929, scopeLine: 60, containingType: !920, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!934 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada11ICommDevice20writeBufferProcessedEv", scope: !920, file: !921, line: 71, type: !935, scopeLine: 71, containingType: !920, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!935 = !DISubroutineType(types: !936)
!936 = !{!63, !931}
!937 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada11ICommDevice4readEPhy", scope: !920, file: !921, line: 85, type: !938, scopeLine: 85, containingType: !920, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!938 = !DISubroutineType(types: !939)
!939 = !{!872, !927, !44, !872}
!940 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada11ICommDevice5writeEPKhy", scope: !920, file: !921, line: 98, type: !941, scopeLine: 98, containingType: !920, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!941 = !DISubroutineType(types: !942)
!942 = !{!872, !927, !943, !872}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!944 = !{!717}
!945 = !{!160, !166, !170, !173, !177, !180, !182, !184, !186, !189, !192, !195, !198, !201, !204, !205, !206, !207, !211, !213, !215, !217, !219, !222, !225, !228, !231, !234, !946}
!946 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !719, entity: !43, file: !720, line: 28)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "_lineEndStr", linkageName: "_ZN6Cicada12ATCommDevice11_lineEndStrE", scope: !949, file: !950, line: 35, type: !266, isLocal: false, isDefinition: true, declaration: !1033)
!949 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !950, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !951, globals: !1069, imports: !1074, splitDebugInlining: false, nameTableKind: None)
!950 = !DIFile(filename: "../cicada/commdevices/atcommdevice.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "2c00a0b2c5bf95afd2d356500bb68c03")
!951 = !{!943, !59, !44, !952}
!952 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ATCommDevice", scope: !43, file: !108, line: 39, size: 1856, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !953, vtableHolder: !920)
!953 = !{!954, !957, !1022, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1039, !1042, !1045, !1048, !1051, !1054, !1057, !1058, !1061, !1064, !1065, !1066}
!954 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !952, baseType: !955, flags: DIFlagPublic, extraData: i32 0)
!955 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "IPCommDevice", scope: !43, file: !956, line: 42, size: 1152, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada12IPCommDeviceE")
!956 = !DIFile(filename: "../cicada/commdevices/ipcommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5231d389687db9c7b4a2dc5416c977bf")
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_serial", scope: !952, file: !108, line: 83, baseType: !958, size: 32, offset: 1120, flags: DIFlagProtected)
!958 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !959, size: 32)
!959 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "IBufferedSerial", scope: !43, file: !960, line: 39, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !961, vtableHolder: !920, identifier: "_ZTSN6Cicada15IBufferedSerialE")
!960 = !DIFile(filename: "../cicada/ibufferedserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "0e5db7c0b86651abb573e233dc791166")
!961 = !{!962, !963, !992, !996, !999, !1002, !1005, !1008, !1011, !1016, !1017, !1018, !1021}
!962 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !959, baseType: !920, flags: DIFlagPublic, extraData: i32 0)
!963 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !959, baseType: !964, offset: 32, flags: DIFlagPublic, extraData: i32 0)
