; ModuleID = './examples/ntp.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%"class.Cicada::Stm32Uart" = type { %"class.Cicada::BufferedSerial", i8, %struct.__UART_HandleTypeDef, %struct.USART_TypeDef*, i16, i16, i32 }
%"class.Cicada::BufferedSerial" = type { %"class.Cicada::IBufferedSerial", %"class.Cicada::LineCircularBuffer", %"class.Cicada::LineCircularBuffer" }
%"class.Cicada::IBufferedSerial" = type { %"class.Cicada::ICommDevice", %"class.Cicada::ICommDevice" }
%"class.Cicada::ICommDevice" = type { i32 (...)** }
%"class.Cicada::LineCircularBuffer" = type { %"class.Cicada::CircularBuffer.base", i16, [2 x i8] }
%"class.Cicada::CircularBuffer.base" = type <{ i32 (...)**, [4 x i8], i64, i64, i64, i64, i8* }>
%struct.__UART_HandleTypeDef = type { %struct.USART_TypeDef*, %struct.USART_TypeDef, i8*, i16, i16, i8*, i16, i16, %struct.__DMA_HandleTypeDef*, %struct.__DMA_HandleTypeDef*, i32, i32, i32, i32 }
%struct.USART_TypeDef = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.__DMA_HandleTypeDef = type { %struct.DMA_Channel_TypeDef*, %struct.USART_TypeDef, i32, i32, i8*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, i32, %struct.DMA_TypeDef*, i32 }
%struct.DMA_Channel_TypeDef = type { i32, i32, i32, i32 }
%struct.DMA_TypeDef = type { i32, i32 }

!51 = !DISubprogram(name: "spaceAvailable", linkageName: "_ZNK6Cicada11ICommDevice14spaceAvailableEv", scope: !26, file: !27, line: 60, type: !40, scopeLine: 60, containingType: !26, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!52 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada11ICommDevice20writeBufferProcessedEv", scope: !26, file: !27, line: 71, type: !53, scopeLine: 71, containingType: !26, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !49}
!55 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!56 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada11ICommDevice4readEPhy", scope: !26, file: !27, line: 85, type: !57, scopeLine: 85, containingType: !26, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!57 = !DISubroutineType(types: !58)
!58 = !{!42, !38, !59, !42}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !45, line: 24, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !47, line: 43, baseType: !62)
!62 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada11ICommDevice5writeEPKhy", scope: !26, file: !27, line: 98, type: !64, scopeLine: 98, containingType: !26, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!64 = !DISubroutineType(types: !65)
!65 = !{!42, !38, !66, !42}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!68 = !DISubprogram(name: "~IStatefulDevice", scope: !22, file: !23, line: 41, type: !69, scopeLine: 41, containingType: !22, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!72 = !DISubprogram(name: "connect", linkageName: "_ZN6Cicada15IStatefulDevice7connectEv", scope: !22, file: !23, line: 46, type: !73, scopeLine: 46, containingType: !22, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!73 = !DISubroutineType(types: !74)
!74 = !{!55, !71}
!75 = !DISubprogram(name: "disconnect", linkageName: "_ZN6Cicada15IStatefulDevice10disconnectEv", scope: !22, file: !23, line: 51, type: !69, scopeLine: 51, containingType: !22, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!76 = !DISubprogram(name: "isConnected", linkageName: "_ZN6Cicada15IStatefulDevice11isConnectedEv", scope: !22, file: !23, line: 58, type: !73, scopeLine: 58, containingType: !22, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!77 = !DISubprogram(name: "isIdle", linkageName: "_ZN6Cicada15IStatefulDevice6isIdleEv", scope: !22, file: !23, line: 65, type: !73, scopeLine: 65, containingType: !22, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!78 = !DISubprogram(name: "resetStates", linkageName: "_ZN6Cicada15IStatefulDevice11resetStatesEv", scope: !22, file: !23, line: 70, type: !69, scopeLine: 70, containingType: !22, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!79 = !DISubprogram(name: "~IIPCommDevice", scope: !18, file: !17, line: 35, type: !80, scopeLine: 35, containingType: !18, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!83 = !DISubprogram(name: "setHostPort", linkageName: "_ZN6Cicada13IIPCommDevice11setHostPortEPKctNS0_14ConnectionTypeE", scope: !18, file: !17, line: 47, type: !84, scopeLine: 47, containingType: !18, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !82, !86, !89, !16}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !45, line: 36, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !47, line: 57, baseType: !91)
!91 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!92 = !{!93, !94}
!93 = !DIEnumerator(name: "UDP", value: 0, isUnsigned: true)
!94 = !DIEnumerator(name: "TCP", value: 1, isUnsigned: true)
!95 = !{!96, !111, !89, !59, !114, !117}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "USART_TypeDef", file: !98, line: 516, baseType: !99)
!98 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f103xb.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "d2562af6d7239ab46ca8ba238a43c848")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 507, size: 224, flags: DIFlagTypePassByValue, elements: !100, identifier: "_ZTS13USART_TypeDef")
!100 = !{!101, !105, !106, !107, !108, !109, !110}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !99, file: !98, line: 509, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !45, line: 48, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !47, line: 79, baseType: !10)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !99, file: !98, line: 510, baseType: !102, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !99, file: !98, line: 511, baseType: !102, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !99, file: !98, line: 512, baseType: !102, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !99, file: !98, line: 513, baseType: !102, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "CR3", scope: !99, file: !98, line: 514, baseType: !102, size: 32, offset: 160)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "GTPR", scope: !99, file: !98, line: 515, baseType: !102, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !98, line: 367, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 358, size: 224, flags: DIFlagFwdDecl, identifier: "_ZTS12GPIO_TypeDef")
!114 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "NTPTask", file: !3, line: 30, size: 576, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !115, vtableHolder: !117, identifier: "_ZTS7NTPTask")
!115 = !{!116, !154, !158, !162, !166}
!116 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !114, baseType: !117, flags: DIFlagPublic, extraData: i32 0)
!117 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Task", scope: !19, file: !118, line: 193, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !119, vtableHolder: !117, identifier: "_ZTSN6Cicada4TaskE")
!118 = !DIFile(filename: "../cicada/task.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "c2aeaca9a01dbc0caa84f135ef9fda2b")
!119 = !{!120, !121, !122, !123, !124, !125, !129, !132, !137, !138, !141, !144, !145, !146, !147, !150}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Task", scope: !118, file: !118, baseType: !30, size: 32, flags: DIFlagArtificial)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_delay", scope: !117, file: !118, line: 283, baseType: !89, size: 16, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_timeout", scope: !117, file: !118, line: 284, baseType: !103, size: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_isTimeoutRunning", scope: !117, file: !118, line: 285, baseType: !55, size: 8, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_lastRun", scope: !117, file: !118, line: 286, baseType: !103, size: 32, offset: 128)
!125 = !DISubprogram(name: "Task", scope: !117, file: !118, line: 196, type: !126, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !128, !89}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!129 = !DISubprogram(name: "~Task", scope: !117, file: !118, line: 198, type: !130, scopeLine: 198, containingType: !117, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !128}
!132 = !DISubprogram(name: "delay", linkageName: "_ZNK6Cicada4Task5delayEv", scope: !117, file: !118, line: 203, type: !133, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!133 = !DISubroutineType(types: !134)
!134 = !{!89, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!137 = !DISubprogram(name: "setDelay", linkageName: "_ZN6Cicada4Task8setDelayEt", scope: !117, file: !118, line: 212, type: !126, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!138 = !DISubprogram(name: "lastRun", linkageName: "_ZN6Cicada4Task7lastRunEv", scope: !117, file: !118, line: 222, type: !139, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!139 = !DISubroutineType(types: !140)
!140 = !{!103, !128}
!141 = !DISubprogram(name: "setLastRun", linkageName: "_ZN6Cicada4Task10setLastRunEj", scope: !117, file: !118, line: 230, type: !142, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !128, !103}
!144 = !DISubprogram(name: "run", linkageName: "_ZN6Cicada4Task3runEv", scope: !117, file: !118, line: 245, type: !130, scopeLine: 245, containingType: !117, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!145 = !DISubprogram(name: "startTimeout", linkageName: "_ZN6Cicada4Task12startTimeoutEv", scope: !117, file: !118, line: 251, type: !130, scopeLine: 251, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!146 = !DISubprogram(name: "resetTimeout", linkageName: "_ZN6Cicada4Task12resetTimeoutEv", scope: !117, file: !118, line: 262, type: !130, scopeLine: 262, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!147 = !DISubprogram(name: "isTimeout", linkageName: "_ZN6Cicada4Task9isTimeoutEj", scope: !117, file: !118, line: 272, type: !148, scopeLine: 272, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!148 = !DISubroutineType(types: !149)
!149 = !{!55, !128, !103}
!150 = !DISubprogram(name: "Task", scope: !117, file: !118, line: 281, type: !151, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !128, !153}
!153 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !136, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "m_commDev", scope: !114, file: !3, line: 68, baseType: !155, size: 32, offset: 160)
!155 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !156, size: 32)
!156 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SimCommDevice", scope: !19, file: !157, line: 33, size: 2240, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada13SimCommDeviceE")
!157 = !DIFile(filename: "../cicada/commdevices/simcommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "a544398dc40a994ae47c8561fb84bc57")
!158 = !DIDerivedType(tag: DW_TAG_member, name: "m_ntpPacket", scope: !114, file: !3, line: 69, baseType: !159, size: 384, offset: 192)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 384, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 12)
!162 = !DISubprogram(name: "NTPTask", scope: !114, file: !3, line: 33, type: !163, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !165, !155}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!166 = !DISubprogram(name: "run", linkageName: "_ZN7NTPTask3runEv", scope: !114, file: !3, line: 35, type: !167, scopeLine: 35, containingType: !114, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !165}
!169 = !{!0, !170, !177, !184}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "instance", scope: !172, file: !3, line: 146, type: !174, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "USART2_IRQHandler", scope: !3, file: !3, line: 144, type: !4, scopeLine: 145, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !173)
!173 = !{}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !19, file: !176, line: 51, size: 1536, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada9Stm32UartE")
!176 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "f1205a68111afe9a0868ac35ca31b4e6")
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "serial", scope: !179, file: !3, line: 152, type: !174, isLocal: true, isDefinition: true)
!179 = distinct !DISubprogram(name: "_putchar", scope: !3, file: !3, line: 150, type: !180, scopeLine: 151, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !182)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !88}
!182 = !{!183}
!183 = !DILocalVariable(name: "c", arg: 1, scope: !179, file: !3, line: 150, type: !88)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "entrypoint", scope: !186, file: !3, line: 37, type: !60, isLocal: false, isDefinition: true)
!186 = distinct !DISubprogram(name: "run", linkageName: "_ZN7NTPTask3runEv", scope: !114, file: !3, line: 35, type: !167, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, declaration: !166, retainedNodes: !187)
!187 = !{!188}
!188 = !DILocalVariable(name: "this", arg: 1, scope: !186, type: !189, flags: DIFlagArtificial | DIFlagObjectPointer)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!190 = !{!191, !197, !201, !204, !208, !211, !213, !215, !217, !220, !223, !226, !229, !232, !235, !236, !237, !238, !239, !241, !243, !245, !247, !250, !253, !256, !259, !262, !265, !271, !275, !282, !284, !289, !294, !298, !302, !315, !319, !323, !327, !331, !336, !340, !344, !348, !352, !358, !362, !366, !368, !372, !376, !381, !385, !390, !392, !398, !402, !409, !411, !415, !419, !423, !427, !431, !436, !441, !442, !443, !444, !446, !447, !448, !449, !450, !451, !452, !454, !455, !456, !457, !458, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486}
!191 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !193, file: !196, line: 47)
!192 = !DINamespace(name: "std", scope: null)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !45, line: 20, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !47, line: 41, baseType: !195)
!195 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!196 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstdint", directory: "/home/mjshen/RTOSExploration")
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !198, file: !196, line: 48)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !45, line: 32, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !47, line: 55, baseType: !200)
!200 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !202, file: !196, line: 49)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !45, line: 44, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !47, line: 77, baseType: !34)
!204 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !205, file: !196, line: 50)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !45, line: 56, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !47, line: 103, baseType: !207)
!207 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!208 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !209, file: !196, line: 52)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !210, line: 51, baseType: !195)
!210 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "a169a1d650067906a9e00519a9405ebb")
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !212, file: !196, line: 53)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !210, line: 61, baseType: !200)
!213 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !214, file: !196, line: 54)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !210, line: 71, baseType: !34)
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !216, file: !196, line: 55)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !210, line: 81, baseType: !207)
!217 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !218, file: !196, line: 57)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !210, line: 21, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !47, line: 134, baseType: !195)
!220 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !221, file: !196, line: 58)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !210, line: 27, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !47, line: 160, baseType: !200)
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !224, file: !196, line: 59)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !210, line: 33, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !47, line: 182, baseType: !34)
!226 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !227, file: !196, line: 60)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !210, line: 39, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !47, line: 200, baseType: !207)
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !230, file: !196, line: 62)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !45, line: 67, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !47, line: 214, baseType: !207)
!232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !233, file: !196, line: 63)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !45, line: 77, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !47, line: 230, baseType: !34)
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !60, file: !196, line: 65)
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !89, file: !196, line: 66)
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !103, file: !196, line: 67)
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !44, file: !196, line: 68)
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !240, file: !196, line: 70)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !210, line: 52, baseType: !62)
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !242, file: !196, line: 71)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !210, line: 62, baseType: !91)
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !244, file: !196, line: 72)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !210, line: 72, baseType: !10)
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !246, file: !196, line: 73)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !210, line: 82, baseType: !48)
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !248, file: !196, line: 75)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !210, line: 22, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !47, line: 136, baseType: !62)
!250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !251, file: !196, line: 76)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !210, line: 28, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !47, line: 162, baseType: !91)
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !254, file: !196, line: 77)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !210, line: 34, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !47, line: 184, baseType: !10)
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !257, file: !196, line: 78)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !210, line: 40, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !47, line: 202, baseType: !48)
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !260, file: !196, line: 80)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !45, line: 72, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !47, line: 222, baseType: !48)
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !263, file: !196, line: 81)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !45, line: 82, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !47, line: 232, baseType: !10)
!265 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !266, file: !270, line: 52)
!266 = !DISubprogram(name: "abs", scope: !267, file: !267, line: 70, type: !268, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!267 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/stdlib.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ce64a6a93b8b46525165e9738bae1257")
!268 = !DISubroutineType(types: !269)
!269 = !{!34, !34}
!270 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/bits/std_abs.h", directory: "/home/mjshen/RTOSExploration")
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !272, file: !274, line: 127)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !267, line: 39, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 35, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!274 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstdlib", directory: "/home/mjshen/RTOSExploration")
!275 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !276, file: !274, line: 128)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !267, line: 45, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 41, size: 64, flags: DIFlagTypePassByValue, elements: !278, identifier: "_ZTS6ldiv_t")
!278 = !{!279, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !277, file: !267, line: 43, baseType: !280, size: 32)
!280 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !277, file: !267, line: 44, baseType: !280, size: 32, offset: 32)
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !283, file: !274, line: 130)
!283 = !DISubprogram(name: "abort", scope: !267, file: !267, line: 69, type: !4, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !285, file: !274, line: 134)
!285 = !DISubprogram(name: "atexit", scope: !267, file: !267, line: 76, type: !286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!286 = !DISubroutineType(types: !287)
!287 = !{!34, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !290, file: !274, line: 140)
!290 = !DISubprogram(name: "atof", scope: !267, file: !267, line: 77, type: !291, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!291 = !DISubroutineType(types: !292)
!292 = !{!293, !86}
!293 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!294 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !295, file: !274, line: 141)
!295 = !DISubprogram(name: "atoi", scope: !267, file: !267, line: 81, type: !296, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!296 = !DISubroutineType(types: !297)
!297 = !{!34, !86}
!298 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !299, file: !274, line: 142)
!299 = !DISubprogram(name: "atol", scope: !267, file: !267, line: 83, type: !300, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!300 = !DISubroutineType(types: !301)
!301 = !{!280, !86}
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !303, file: !274, line: 143)
!303 = !DISubprogram(name: "bsearch", scope: !267, file: !267, line: 85, type: !304, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!304 = !DISubroutineType(types: !305)
!305 = !{!306, !307, !307, !309, !309, !311}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !310, line: 46, baseType: !10)
!310 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !267, line: 57, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DISubroutineType(types: !314)
!314 = !{!34, !307, !307}
!315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !316, file: !274, line: 144)
!316 = !DISubprogram(name: "calloc", scope: !267, file: !267, line: 90, type: !317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!317 = !DISubroutineType(types: !318)
!318 = !{!306, !309, !309}
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !320, file: !274, line: 145)
!320 = !DISubprogram(name: "div", scope: !267, file: !267, line: 92, type: !321, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!321 = !DISubroutineType(types: !322)
!322 = !{!272, !34, !34}
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !324, file: !274, line: 146)
!324 = !DISubprogram(name: "exit", scope: !267, file: !267, line: 93, type: !325, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !34}
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !328, file: !274, line: 147)
!328 = !DISubprogram(name: "free", scope: !267, file: !267, line: 94, type: !329, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !306}
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !332, file: !274, line: 148)
!332 = !DISubprogram(name: "getenv", scope: !267, file: !267, line: 95, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!333 = !DISubroutineType(types: !334)
!334 = !{!335, !86}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !337, file: !274, line: 149)
!337 = !DISubprogram(name: "labs", scope: !267, file: !267, line: 106, type: !338, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!338 = !DISubroutineType(types: !339)
!339 = !{!280, !280}
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !341, file: !274, line: 150)
!341 = !DISubprogram(name: "ldiv", scope: !267, file: !267, line: 107, type: !342, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!342 = !DISubroutineType(types: !343)
!343 = !{!276, !280, !280}
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !345, file: !274, line: 151)
!345 = !DISubprogram(name: "malloc", scope: !267, file: !267, line: 108, type: !346, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!346 = !DISubroutineType(types: !347)
!347 = !{!306, !309}
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !349, file: !274, line: 153)
!349 = !DISubprogram(name: "mblen", scope: !267, file: !267, line: 109, type: !350, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!350 = !DISubroutineType(types: !351)
!351 = !{!34, !86, !309}
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !353, file: !274, line: 154)
!353 = !DISubprogram(name: "mbstowcs", scope: !267, file: !267, line: 115, type: !354, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!354 = !DISubroutineType(types: !355)
!355 = !{!309, !356, !86, !309}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_unsigned)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !359, file: !274, line: 155)
!359 = !DISubprogram(name: "mbtowc", scope: !267, file: !267, line: 111, type: !360, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!360 = !DISubroutineType(types: !361)
!361 = !{!34, !356, !86, !309}
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !363, file: !274, line: 157)
!363 = !DISubprogram(name: "qsort", scope: !267, file: !267, line: 143, type: !364, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !306, !309, !309, !311}
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !367, file: !274, line: 163)
!367 = !DISubprogram(name: "rand", scope: !267, file: !267, line: 144, type: !32, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !369, file: !274, line: 164)
!369 = !DISubprogram(name: "realloc", scope: !267, file: !267, line: 145, type: !370, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!370 = !DISubroutineType(types: !371)
!371 = !{!306, !306, !309}
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !373, file: !274, line: 165)
!373 = !DISubprogram(name: "srand", scope: !267, file: !267, line: 159, type: !374, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !10}
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !377, file: !274, line: 166)
!377 = !DISubprogram(name: "strtod", scope: !267, file: !267, line: 160, type: !378, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!378 = !DISubroutineType(types: !379)
!379 = !{!293, !86, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !382, file: !274, line: 167)
!382 = !DISubprogram(name: "strtol", scope: !267, file: !267, line: 171, type: !383, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!383 = !DISubroutineType(types: !384)
!384 = !{!280, !86, !380, !34}
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !386, file: !274, line: 168)
!386 = !DISubprogram(name: "strtoul", scope: !267, file: !267, line: 173, type: !387, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!387 = !DISubroutineType(types: !388)
!388 = !{!389, !86, !380, !34}
!389 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !391, file: !274, line: 169)
!391 = !DISubprogram(name: "system", scope: !267, file: !267, line: 191, type: !296, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !393, file: !274, line: 171)
!393 = !DISubprogram(name: "wcstombs", scope: !267, file: !267, line: 117, type: !394, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!394 = !DISubroutineType(types: !395)
!395 = !{!309, !335, !396, !309}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !399, file: !274, line: 172)
!399 = !DISubprogram(name: "wctomb", scope: !267, file: !267, line: 113, type: !400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!400 = !DISubroutineType(types: !401)
!401 = !{!34, !335, !357}
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !403, entity: !404, file: !274, line: 200)
!403 = !DINamespace(name: "__gnu_cxx", scope: null)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !267, line: 52, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 48, size: 128, flags: DIFlagTypePassByValue, elements: !406, identifier: "_ZTS7lldiv_t")
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !405, file: !267, line: 50, baseType: !207, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !405, file: !267, line: 51, baseType: !207, size: 64, offset: 64)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !403, entity: !410, file: !274, line: 206)
!410 = !DISubprogram(name: "_Exit", scope: !267, file: !267, line: 202, type: !325, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !403, entity: !412, file: !274, line: 210)
!412 = !DISubprogram(name: "llabs", scope: !267, file: !267, line: 267, type: !413, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!413 = !DISubroutineType(types: !414)
!414 = !{!207, !207}
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !403, entity: !416, file: !274, line: 216)
!416 = !DISubprogram(name: "lldiv", scope: !267, file: !267, line: 268, type: !417, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!417 = !DISubroutineType(types: !418)
!418 = !{!404, !207, !207}
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !403, entity: !420, file: !274, line: 227)
!420 = !DISubprogram(name: "atoll", scope: !267, file: !267, line: 263, type: !421, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!421 = !DISubroutineType(types: !422)
!422 = !{!207, !86}
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !403, entity: !424, file: !274, line: 228)
!424 = !DISubprogram(name: "strtoll", scope: !267, file: !267, line: 269, type: !425, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!425 = !DISubroutineType(types: !426)
!426 = !{!207, !86, !380, !34}
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !403, entity: !428, file: !274, line: 229)
!428 = !DISubprogram(name: "strtoull", scope: !267, file: !267, line: 273, type: !429, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!429 = !DISubroutineType(types: !430)
!430 = !{!48, !86, !380, !34}
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !403, entity: !432, file: !274, line: 231)
!432 = !DISubprogram(name: "strtof", scope: !267, file: !267, line: 163, type: !433, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!433 = !DISubroutineType(types: !434)
!434 = !{!435, !86, !380}
!435 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !403, entity: !437, file: !274, line: 232)
!437 = !DISubprogram(name: "strtold", scope: !267, file: !267, line: 324, type: !438, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !86, !380}
!440 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !404, file: !274, line: 240)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !410, file: !274, line: 242)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !412, file: !274, line: 244)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !445, file: !274, line: 245)
!445 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !403, file: !274, line: 213, type: !417, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !416, file: !274, line: 246)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !420, file: !274, line: 248)
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !432, file: !274, line: 249)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !424, file: !274, line: 250)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !428, file: !274, line: 251)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !437, file: !274, line: 252)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !283, file: !453, line: 38)
!453 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/stdlib.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "74812296ae1ebf65f0c19983efc04bc1")
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !285, file: !453, line: 39)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !324, file: !453, line: 40)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !272, file: !453, line: 51)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !276, file: !453, line: 52)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !459, file: !453, line: 54)
!459 = !DISubprogram(name: "abs", linkageName: "_ZSt3abse", scope: !192, file: !270, line: 79, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!460 = !DISubroutineType(types: !461)
!461 = !{!440, !440}
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !290, file: !453, line: 55)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !295, file: !453, line: 56)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !299, file: !453, line: 57)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !303, file: !453, line: 58)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !316, file: !453, line: 59)
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !445, file: !453, line: 60)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !328, file: !453, line: 61)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !332, file: !453, line: 62)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !337, file: !453, line: 63)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !341, file: !453, line: 64)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !345, file: !453, line: 65)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !349, file: !453, line: 67)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !353, file: !453, line: 68)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !359, file: !453, line: 69)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !363, file: !453, line: 71)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !367, file: !453, line: 72)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !369, file: !453, line: 73)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !373, file: !453, line: 74)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !377, file: !453, line: 75)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !382, file: !453, line: 76)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !386, file: !453, line: 77)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !391, file: !453, line: 78)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !393, file: !453, line: 80)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !6, entity: !399, file: !453, line: 81)
!486 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !6, entity: !19, file: !3, line: 17)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "pow10", scope: !489, file: !490, line: 311, type: !542, isLocal: true, isDefinition: true)
!489 = distinct !DISubprogram(name: "_ftoa", scope: !490, file: !490, line: 299, type: !491, scopeLine: 300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !497, retainedNodes: !509)
!490 = !DIFile(filename: "../dep/printf/src/printf.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "7383fa86adf0d25d8eda174a9b330d6a")
!491 = !DISubroutineType(types: !492)
!492 = !{!309, !493, !335, !309, !309, !293, !10, !10, !10}
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_type", file: !490, line: 97, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !88, !306, !309, !309}
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !490, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !498, globals: !508, splitDebugInlining: false, nameTableKind: None)
!498 = !{!309, !335, !263, !10, !34, !48, !389, !88, !200, !62, !91, !293, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_wrap_type", file: !490, line: 104, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 101, size: 64, elements: !502)
!502 = !{!503, !507}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fct", scope: !501, file: !490, line: 102, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !88, !306}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !501, file: !490, line: 103, baseType: !306, size: 32, offset: 32)
!508 = !{!487}
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517, !518, !520, !524, !525, !526, !528, !530, !531, !532, !533, !536, !540}
!510 = !DILocalVariable(name: "out", arg: 1, scope: !489, file: !490, line: 299, type: !493)
!511 = !DILocalVariable(name: "buffer", arg: 2, scope: !489, file: !490, line: 299, type: !335)
!512 = !DILocalVariable(name: "idx", arg: 3, scope: !489, file: !490, line: 299, type: !309)
!513 = !DILocalVariable(name: "maxlen", arg: 4, scope: !489, file: !490, line: 299, type: !309)
!514 = !DILocalVariable(name: "value", arg: 5, scope: !489, file: !490, line: 299, type: !293)
!515 = !DILocalVariable(name: "prec", arg: 6, scope: !489, file: !490, line: 299, type: !10)
!516 = !DILocalVariable(name: "width", arg: 7, scope: !489, file: !490, line: 299, type: !10)
!517 = !DILocalVariable(name: "flags", arg: 8, scope: !489, file: !490, line: 299, type: !10)
!518 = !DILocalVariable(name: "start_idx", scope: !489, file: !490, line: 301, type: !519)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!520 = !DILocalVariable(name: "buf", scope: !489, file: !490, line: 303, type: !521)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 256, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 32)
!524 = !DILocalVariable(name: "len", scope: !489, file: !490, line: 304, type: !309)
!525 = !DILocalVariable(name: "diff", scope: !489, file: !490, line: 305, type: !293)
!526 = !DILocalVariable(name: "thres_max", scope: !489, file: !490, line: 308, type: !527)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!528 = !DILocalVariable(name: "negative", scope: !489, file: !490, line: 322, type: !529)
!529 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!530 = !DILocalVariable(name: "whole", scope: !489, file: !490, line: 338, type: !34)
!531 = !DILocalVariable(name: "tmp", scope: !489, file: !490, line: 339, type: !293)
!532 = !DILocalVariable(name: "frac", scope: !489, file: !490, line: 340, type: !389)
!533 = !DILocalVariable(name: "count", scope: !534, file: !490, line: 373, type: !10)
!534 = distinct !DILexicalBlock(scope: !535, file: !490, line: 372, column: 8)
!535 = distinct !DILexicalBlock(scope: !489, file: !490, line: 364, column: 7)
!536 = !DILocalVariable(name: "i", scope: !537, file: !490, line: 424, type: !309)
!537 = distinct !DILexicalBlock(scope: !538, file: !490, line: 424, column: 5)
!538 = distinct !DILexicalBlock(scope: !539, file: !490, line: 423, column: 58)
!539 = distinct !DILexicalBlock(scope: !489, file: !490, line: 423, column: 7)
!540 = !DILocalVariable(name: "i", scope: !541, file: !490, line: 430, type: !309)
!541 = distinct !DILexicalBlock(scope: !489, file: !490, line: 430, column: 3)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 640, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 10)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "AHBPrescTable", scope: !547, file: !548, line: 124, type: !617, isLocal: false, isDefinition: true)
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !549, retainedTypes: !555, globals: !609, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Source/Templates/system_stm32f1xx.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "2e873de3002e5d783190a46ff1c7da2d")
!549 = !{!550}
!550 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !551, line: 151, baseType: !10, size: 32, elements: !552)
!551 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xx.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dc4ed8bdf8589b30d30d93eb6ee6ca27")
!552 = !{!553, !554}
!553 = !DIEnumerator(name: "RESET", value: 0)
!554 = !DIEnumerator(name: "SET", value: 1)
!555 = !{!556, !570, !103}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !98, line: 438, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 424, size: 320, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !558, file: !98, line: 426, baseType: !102, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !558, file: !98, line: 427, baseType: !102, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !558, file: !98, line: 428, baseType: !102, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !558, file: !98, line: 429, baseType: !102, size: 32, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !558, file: !98, line: 430, baseType: !102, size: 32, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !558, file: !98, line: 431, baseType: !102, size: 32, offset: 160)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !558, file: !98, line: 432, baseType: !102, size: 32, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !558, file: !98, line: 433, baseType: !102, size: 32, offset: 224)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !558, file: !98, line: 434, baseType: !102, size: 32, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !558, file: !98, line: 435, baseType: !102, size: 32, offset: 288)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !572, line: 397, baseType: !573)
!572 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build")
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !572, line: 374, size: 1120, elements: !574)
!574 = !{!575, !577, !578, !579, !580, !581, !582, !585, !586, !587, !588, !589, !590, !591, !592, !596, !597, !598, !602, !606, !608}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !573, file: !572, line: 376, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !573, file: !572, line: 377, baseType: !102, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !573, file: !572, line: 378, baseType: !102, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !573, file: !572, line: 379, baseType: !102, size: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !573, file: !572, line: 380, baseType: !102, size: 32, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !573, file: !572, line: 381, baseType: !102, size: 32, offset: 160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !573, file: !572, line: 382, baseType: !583, size: 96, offset: 192)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 96, elements: !160)
!584 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !573, file: !572, line: 383, baseType: !102, size: 32, offset: 288)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !573, file: !572, line: 384, baseType: !102, size: 32, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !573, file: !572, line: 385, baseType: !102, size: 32, offset: 352)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !573, file: !572, line: 386, baseType: !102, size: 32, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !573, file: !572, line: 387, baseType: !102, size: 32, offset: 416)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !573, file: !572, line: 388, baseType: !102, size: 32, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !573, file: !572, line: 389, baseType: !102, size: 32, offset: 480)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !573, file: !572, line: 390, baseType: !593, size: 64, offset: 512)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 64, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 2)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !573, file: !572, line: 391, baseType: !576, size: 32, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !573, file: !572, line: 392, baseType: !576, size: 32, offset: 608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !573, file: !572, line: 393, baseType: !599, size: 128, offset: 640)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 128, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 4)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !573, file: !572, line: 394, baseType: !603, size: 160, offset: 768)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 160, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 5)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !573, file: !572, line: 395, baseType: !607, size: 160, offset: 928)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 160, elements: !604)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !573, file: !572, line: 396, baseType: !102, size: 32, offset: 1088)
!609 = !{!610, !545, !612}
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !547, file: !548, line: 123, type: !103, isLocal: false, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "APBPrescTable", scope: !547, file: !548, line: 125, type: !614, isLocal: false, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 8)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 128, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 16)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "uwTickPrio", scope: !622, file: !623, line: 80, type: !103, isLocal: false, isDefinition: true)
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !624, retainedTypes: !692, globals: !735, splitDebugInlining: false, nameTableKind: None)
!623 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "1a5fa7b79e9e470cf817b81d791a6ccb")
!624 = !{!625, !632, !638}
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !626, line: 49, baseType: !10, size: 32, elements: !627)
!626 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5eab64b252ccd159497a11d87d26bc0b")
!627 = !{!628, !629, !630, !631}
!628 = !DIEnumerator(name: "HAL_TICK_FREQ_10HZ", value: 100)
!629 = !DIEnumerator(name: "HAL_TICK_FREQ_100HZ", value: 10)
!630 = !DIEnumerator(name: "HAL_TICK_FREQ_1KHZ", value: 1)
!631 = !DIEnumerator(name: "HAL_TICK_FREQ_DEFAULT", value: 1)
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 41, baseType: !10, size: 32, elements: !633)
!633 = !{!634, !635, !636, !637}
!634 = !DIEnumerator(name: "HAL_OK", value: 0)
!635 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!636 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!637 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!638 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 69, baseType: !34, size: 32, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!640 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!641 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!642 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!643 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!644 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!645 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!646 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!647 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!648 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!649 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!650 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!651 = !DIEnumerator(name: "TAMPER_IRQn", value: 2)
!652 = !DIEnumerator(name: "RTC_IRQn", value: 3)
!653 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!654 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!655 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!656 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!657 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!658 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!659 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!660 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!661 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!662 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!663 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!664 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!665 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!666 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!667 = !DIEnumerator(name: "ADC1_2_IRQn", value: 18)
!668 = !DIEnumerator(name: "USB_HP_CAN1_TX_IRQn", value: 19)
!669 = !DIEnumerator(name: "USB_LP_CAN1_RX0_IRQn", value: 20)
!670 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!671 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!672 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!673 = !DIEnumerator(name: "TIM1_BRK_IRQn", value: 24)
!674 = !DIEnumerator(name: "TIM1_UP_IRQn", value: 25)
!675 = !DIEnumerator(name: "TIM1_TRG_COM_IRQn", value: 26)
!676 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!677 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!678 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!679 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!680 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!681 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!682 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!683 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!684 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!685 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!686 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!687 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!688 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!689 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!690 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!691 = !DIEnumerator(name: "USBWakeUp_IRQn", value: 42)
!692 = !{!693, !103, !706, !720, !728, !734}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !98, line: 336, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 325, size: 288, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !695, file: !98, line: 327, baseType: !102, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !695, file: !98, line: 328, baseType: !102, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !695, file: !98, line: 329, baseType: !102, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !695, file: !98, line: 330, baseType: !102, size: 32, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !695, file: !98, line: 331, baseType: !102, size: 32, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !695, file: !98, line: 332, baseType: !102, size: 32, offset: 160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !695, file: !98, line: 333, baseType: !102, size: 32, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !695, file: !98, line: 334, baseType: !102, size: 32, offset: 224)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !695, file: !98, line: 335, baseType: !102, size: 32, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !98, line: 438, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 424, size: 320, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !708, file: !98, line: 426, baseType: !102, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !708, file: !98, line: 427, baseType: !102, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !708, file: !98, line: 428, baseType: !102, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !708, file: !98, line: 429, baseType: !102, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !708, file: !98, line: 430, baseType: !102, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !708, file: !98, line: 431, baseType: !102, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !708, file: !98, line: 432, baseType: !102, size: 32, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !708, file: !98, line: 433, baseType: !102, size: 32, offset: 224)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !708, file: !98, line: 434, baseType: !102, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !708, file: !98, line: 435, baseType: !102, size: 32, offset: 288)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !572, line: 700, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !572, line: 694, size: 128, elements: !723)
!723 = !{!724, !725, !726, !727}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !722, file: !572, line: 696, baseType: !102, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !722, file: !572, line: 697, baseType: !102, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !722, file: !572, line: 698, baseType: !102, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !722, file: !572, line: 699, baseType: !576, size: 32, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBGMCU_TypeDef", file: !98, line: 285, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 281, size: 64, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "IDCODE", scope: !730, file: !98, line: 283, baseType: !102, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !730, file: !98, line: 284, baseType: !102, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!735 = !{!620, !736, !739}
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "uwTickFreq", scope: !622, file: !623, line: 81, type: !738, isLocal: false, isDefinition: true)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_TickFreqTypeDef", file: !626, line: 55, baseType: !625)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "uwTick", scope: !622, file: !623, line: 79, type: !102, isLocal: false, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "_lineEndStr", linkageName: "_ZN6Cicada12ATCommDevice11_lineEndStrE", scope: !743, file: !744, line: 35, type: !86, isLocal: false, isDefinition: true, declaration: !829)
!743 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !744, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !745, globals: !865, imports: !870, splitDebugInlining: false, nameTableKind: None)
!744 = !DIFile(filename: "../cicada/commdevices/atcommdevice.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "2c00a0b2c5bf95afd2d356500bb68c03")
!745 = !{!66, !34, !59, !746}
!746 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ATCommDevice", scope: !19, file: !747, line: 39, size: 1856, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !748, vtableHolder: !26)
!747 = !DIFile(filename: "../cicada/commdevices/atcommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "533b96ced66a81acd2797c3eeacc1c13")
!748 = !{!749, !752, !818, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !835, !838, !841, !844, !847, !850, !853, !854, !857, !860, !861, !862}
!749 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !746, baseType: !750, flags: DIFlagPublic, extraData: i32 0)
!750 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "IPCommDevice", scope: !19, file: !751, line: 42, size: 1152, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada12IPCommDeviceE")
!751 = !DIFile(filename: "../cicada/commdevices/ipcommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5231d389687db9c7b4a2dc5416c977bf")
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_serial", scope: !746, file: !747, line: 83, baseType: !753, size: 32, offset: 1120, flags: DIFlagProtected)
!753 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !754, size: 32)
!754 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "IBufferedSerial", scope: !19, file: !755, line: 39, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !756, vtableHolder: !26, identifier: "_ZTSN6Cicada15IBufferedSerialE")
!755 = !DIFile(filename: "../cicada/ibufferedserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "0e5db7c0b86651abb573e233dc791166")
!756 = !{!757, !758, !788, !792, !795, !798, !801, !804, !807, !812, !813, !814, !817}
!757 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !754, baseType: !26, flags: DIFlagPublic, extraData: i32 0)
!758 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !754, baseType: !759, offset: 32, flags: DIFlagPublic, extraData: i32 0)
!759 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ISerial", scope: !19, file: !760, line: 37, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !761, vtableHolder: !759, identifier: "_ZTSN6Cicada7ISerialE")
!760 = !DIFile(filename: "../cicada/iserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "e3dc53a2acd15a8e90c357a32168f40f")
!761 = !{!762, !763, !767, !770, !771, !774, !775, !780, !784, !787}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ISerial", scope: !760, file: !760, baseType: !30, size: 32, flags: DIFlagArtificial)
!763 = !DISubprogram(name: "~ISerial", scope: !759, file: !760, line: 40, type: !764, scopeLine: 40, containingType: !759, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !766}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!767 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada7ISerial4openEv", scope: !759, file: !760, line: 46, type: !768, scopeLine: 46, containingType: !759, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!768 = !DISubroutineType(types: !769)
!769 = !{!55, !766}
!770 = !DISubprogram(name: "isOpen", linkageName: "_ZN6Cicada7ISerial6isOpenEv", scope: !759, file: !760, line: 52, type: !768, scopeLine: 52, containingType: !759, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!771 = !DISubprogram(name: "setSerialConfig", linkageName: "_ZN6Cicada7ISerial15setSerialConfigEjh", scope: !759, file: !760, line: 60, type: !772, scopeLine: 60, containingType: !759, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!772 = !DISubroutineType(types: !773)
!773 = !{!55, !766, !103, !60}
!774 = !DISubprogram(name: "close", linkageName: "_ZN6Cicada7ISerial5closeEv", scope: !759, file: !760, line: 65, type: !764, scopeLine: 65, containingType: !759, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!775 = !DISubprogram(name: "portName", linkageName: "_ZNK6Cicada7ISerial8portNameEv", scope: !759, file: !760, line: 71, type: !776, scopeLine: 71, containingType: !759, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!776 = !DISubroutineType(types: !777)
!777 = !{!86, !778}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!780 = !DISubprogram(name: "rawRead", linkageName: "_ZN6Cicada7ISerial7rawReadERh", scope: !759, file: !760, line: 80, type: !781, scopeLine: 80, containingType: !759, virtualIndex: 7, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!781 = !DISubroutineType(types: !782)
!782 = !{!55, !766, !783}
!783 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !60, size: 32)
!784 = !DISubprogram(name: "rawWrite", linkageName: "_ZN6Cicada7ISerial8rawWriteEh", scope: !759, file: !760, line: 87, type: !785, scopeLine: 87, containingType: !759, virtualIndex: 8, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!785 = !DISubroutineType(types: !786)
!786 = !{!55, !766, !60}
!787 = !DISubprogram(name: "startTransmit", linkageName: "_ZN6Cicada7ISerial13startTransmitEv", scope: !759, file: !760, line: 93, type: !764, scopeLine: 93, containingType: !759, virtualIndex: 9, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!788 = !DISubprogram(name: "~IBufferedSerial", scope: !754, file: !755, line: 42, type: !789, scopeLine: 42, containingType: !754, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !791}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!792 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada15IBufferedSerial4readEPhy", scope: !754, file: !755, line: 44, type: !793, scopeLine: 44, containingType: !754, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!793 = !DISubroutineType(types: !794)
!794 = !{!42, !791, !59, !42}
!795 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEPKhy", scope: !754, file: !755, line: 45, type: !796, scopeLine: 45, containingType: !754, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!796 = !DISubroutineType(types: !797)
!797 = !{!42, !791, !66, !42}
!798 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada15IBufferedSerial4readEv", scope: !754, file: !755, line: 51, type: !799, scopeLine: 51, containingType: !754, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!799 = !DISubroutineType(types: !800)
!800 = !{!60, !791}
!801 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEPKh", scope: !754, file: !755, line: 62, type: !802, scopeLine: 62, containingType: !754, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!802 = !DISubroutineType(types: !803)
!803 = !{!42, !791, !66}
!804 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEh", scope: !754, file: !755, line: 68, type: !805, scopeLine: 68, containingType: !754, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !791, !60}
!807 = !DISubprogram(name: "canReadLine", linkageName: "_ZNK6Cicada15IBufferedSerial11canReadLineEv", scope: !754, file: !755, line: 73, type: !808, scopeLine: 73, containingType: !754, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!808 = !DISubroutineType(types: !809)
!809 = !{!55, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!812 = !DISubprogram(name: "readLine", linkageName: "_ZN6Cicada15IBufferedSerial8readLineEPhy", scope: !754, file: !755, line: 85, type: !793, scopeLine: 85, containingType: !754, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!813 = !DISubprogram(name: "flushReceiveBuffers", linkageName: "_ZN6Cicada15IBufferedSerial19flushReceiveBuffersEv", scope: !754, file: !755, line: 90, type: !789, scopeLine: 90, containingType: !754, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!814 = !DISubprogram(name: "readBufferSize", linkageName: "_ZN6Cicada15IBufferedSerial14readBufferSizeEv", scope: !754, file: !755, line: 95, type: !815, scopeLine: 95, containingType: !754, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!815 = !DISubroutineType(types: !816)
!816 = !{!42, !791}
!817 = !DISubprogram(name: "writeBufferSize", linkageName: "_ZN6Cicada15IBufferedSerial15writeBufferSizeEv", scope: !754, file: !755, line: 96, type: !815, scopeLine: 96, containingType: !754, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_lineBuffer", scope: !746, file: !747, line: 85, baseType: !819, size: 488, offset: 1152, flags: DIFlagProtected)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 488, elements: !820)
!820 = !{!821}
!821 = !DISubrange(count: 61)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_lbFill", scope: !746, file: !747, line: 86, baseType: !60, size: 8, offset: 1640, flags: DIFlagProtected)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_sendState", scope: !746, file: !747, line: 88, baseType: !193, size: 8, offset: 1648, flags: DIFlagProtected)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_replyState", scope: !746, file: !747, line: 89, baseType: !193, size: 8, offset: 1656, flags: DIFlagProtected)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_bytesToWrite", scope: !746, file: !747, line: 90, baseType: !42, size: 64, offset: 1664, flags: DIFlagProtected)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_bytesToReceive", scope: !746, file: !747, line: 91, baseType: !42, size: 64, offset: 1728, flags: DIFlagProtected)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_bytesToRead", scope: !746, file: !747, line: 92, baseType: !42, size: 64, offset: 1792, flags: DIFlagProtected)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_okStr", scope: !746, file: !747, line: 94, baseType: !86, flags: DIFlagProtected | DIFlagStaticMember)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_lineEndStr", scope: !746, file: !747, line: 95, baseType: !86, flags: DIFlagProtected | DIFlagStaticMember)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_quoteEndStr", scope: !746, file: !747, line: 96, baseType: !86, flags: DIFlagProtected | DIFlagStaticMember)
!831 = !DISubprogram(name: "ATCommDevice", scope: !746, file: !747, line: 42, type: !832, scopeLine: 42, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !834, !753, !59, !59, !42}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!835 = !DISubprogram(name: "ATCommDevice", scope: !746, file: !747, line: 44, type: !836, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !834, !753, !59, !59, !42, !42}
!838 = !DISubprogram(name: "~ATCommDevice", scope: !746, file: !747, line: 46, type: !839, scopeLine: 46, containingType: !746, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !834}
!841 = !DISubprogram(name: "serialWrite", linkageName: "_ZN6Cicada12ATCommDevice11serialWriteEPc", scope: !746, file: !747, line: 59, type: !842, scopeLine: 59, containingType: !746, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!842 = !DISubroutineType(types: !843)
!843 = !{!42, !834, !335}
!844 = !DISubprogram(name: "serialRead", linkageName: "_ZN6Cicada12ATCommDevice10serialReadEPcy", scope: !746, file: !747, line: 71, type: !845, scopeLine: 71, containingType: !746, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!845 = !DISubroutineType(types: !846)
!846 = !{!42, !834, !335, !42}
!847 = !DISubprogram(name: "logStates", linkageName: "_ZN6Cicada12ATCommDevice9logStatesEaa", scope: !746, file: !747, line: 74, type: !848, scopeLine: 74, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !834, !193, !193}
!850 = !DISubprogram(name: "handleDisconnect", linkageName: "_ZN6Cicada12ATCommDevice16handleDisconnectEa", scope: !746, file: !747, line: 75, type: !851, scopeLine: 75, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!851 = !DISubroutineType(types: !852)
!852 = !{!55, !834, !193}
!853 = !DISubprogram(name: "handleConnect", linkageName: "_ZN6Cicada12ATCommDevice13handleConnectEa", scope: !746, file: !747, line: 76, type: !851, scopeLine: 76, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!854 = !DISubprogram(name: "sendCommand", linkageName: "_ZN6Cicada12ATCommDevice11sendCommandEPKc", scope: !746, file: !747, line: 77, type: !855, scopeLine: 77, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !834, !86}
!857 = !DISubprogram(name: "prepareSending", linkageName: "_ZN6Cicada12ATCommDevice14prepareSendingEb", scope: !746, file: !747, line: 78, type: !858, scopeLine: 78, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!858 = !DISubroutineType(types: !859)
!859 = !{!55, !834, !55}
!860 = !DISubprogram(name: "sendData", linkageName: "_ZN6Cicada12ATCommDevice8sendDataEv", scope: !746, file: !747, line: 79, type: !839, scopeLine: 79, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!861 = !DISubprogram(name: "flushReadBuffer", linkageName: "_ZN6Cicada12ATCommDevice15flushReadBufferEv", scope: !746, file: !747, line: 80, type: !839, scopeLine: 80, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!862 = !DISubprogram(name: "receive", linkageName: "_ZN6Cicada12ATCommDevice7receiveEv", scope: !746, file: !747, line: 81, type: !863, scopeLine: 81, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!863 = !DISubroutineType(types: !864)
!864 = !{!55, !834}
!865 = !{!866, !741, !868}
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "_okStr", linkageName: "_ZN6Cicada12ATCommDevice6_okStrE", scope: !743, file: !744, line: 34, type: !86, isLocal: false, isDefinition: true, declaration: !828)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "_quoteEndStr", linkageName: "_ZN6Cicada12ATCommDevice12_quoteEndStrE", scope: !743, file: !744, line: 36, type: !86, isLocal: false, isDefinition: true, declaration: !830)
!870 = !{!191, !197, !201, !204, !208, !211, !213, !215, !217, !220, !223, !226, !229, !232, !235, !236, !237, !238, !239, !241, !243, !245, !247, !250, !253, !256, !259, !262, !871, !876, !880, !884, !890, !894, !901, !905, !910, !986, !988, !993, !997, !999, !1001, !1003, !1005, !1010, !1014, !1018, !1022, !1026, !1030, !1034, !1038, !1040, !1044, !1050, !1054, !1058, !1060, !1062, !1066, !1070, !1072, !1074, !1076, !1078, !1082, !1084, !1086, !1090, !1094, !1098, !1102, !1106, !1110, !1112, !1121, !1125, !1129, !1133, !1135, !1137, !1141, !1145, !1146, !1147, !1148, !1149, !1150, !1159, !1163, !1167, !1169, !1173, !1177, !1179, !1181, !1183, !1187, !1191, !1195, !1199, !1203, !1205, !1207, !1209, !1213, !1217, !1221, !1223, !1225}
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !872, file: !875, line: 58)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "imaxdiv_t", file: !873, line: 315, baseType: !874)
!873 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/inttypes.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "1342af5b7f05910ff6fa824a20b79245")
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !873, line: 312, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS9imaxdiv_t")
!875 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cinttypes", directory: "/home/mjshen/RTOSExploration")
!876 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !877, file: !875, line: 61)
!877 = !DISubprogram(name: "imaxabs", scope: !873, file: !873, line: 323, type: !878, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!878 = !DISubroutineType(types: !879)
!879 = !{!230, !230}
!880 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !881, file: !875, line: 62)
!881 = !DISubprogram(name: "imaxdiv", scope: !873, file: !873, line: 324, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!882 = !DISubroutineType(types: !883)
!883 = !{!872, !230, !230}
!884 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !885, file: !875, line: 68)
!885 = !DISubprogram(name: "strtoimax", scope: !873, file: !873, line: 325, type: !886, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!886 = !DISubroutineType(types: !887)
!887 = !{!230, !888, !889, !34}
!888 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !86)
!889 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !380)
!890 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !891, file: !875, line: 69)
!891 = !DISubprogram(name: "strtoumax", scope: !873, file: !873, line: 327, type: !892, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!892 = !DISubroutineType(types: !893)
!893 = !{!260, !888, !889, !34}
!894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !895, file: !875, line: 72)
!895 = !DISubprogram(name: "wcstoimax", scope: !873, file: !873, line: 329, type: !896, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!896 = !DISubroutineType(types: !897)
!897 = !{!230, !898, !899, !34}
!898 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !396)
!899 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!901 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !902, file: !875, line: 73)
!902 = !DISubprogram(name: "wcstoumax", scope: !873, file: !873, line: 331, type: !903, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!903 = !DISubroutineType(types: !904)
!904 = !{!260, !898, !899, !34}
!905 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !906, file: !909, line: 58)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "max_align_t", file: !907, line: 24, baseType: !908)
!907 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/__stddef_max_align_t.h", directory: "", checksumkind: CSK_MD5, checksum: "48e8e2456f77e6cda35d245130fa7259")
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !907, line: 19, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS11max_align_t")
!909 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstddef", directory: "/home/mjshen/RTOSExploration")
!910 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !911, file: !985, line: 98)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !912, line: 66, baseType: !913)
!912 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/stdio.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f9fec3134fbe599333115bffe9fa8133")
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !914, line: 292, baseType: !915)
!914 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "c7a2657565d7077fe3d3f464b271e0ba")
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !914, line: 186, size: 832, flags: DIFlagTypePassByValue, elements: !916, identifier: "_ZTS7__sFILE")
!916 = !{!917, !919, !920, !921, !922, !923, !928, !929, !930, !936, !940, !946, !950, !951, !952, !953, !957, !961, !962, !963, !965, !966, !972, !984}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !915, file: !914, line: 187, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !915, file: !914, line: 188, baseType: !34, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !915, file: !914, line: 189, baseType: !34, size: 32, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !915, file: !914, line: 190, baseType: !200, size: 16, offset: 96)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !915, file: !914, line: 191, baseType: !200, size: 16, offset: 112)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !915, file: !914, line: 192, baseType: !924, size: 64, offset: 128)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !914, line: 122, size: 64, flags: DIFlagTypePassByValue, elements: !925, identifier: "_ZTS6__sbuf")
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !924, file: !914, line: 123, baseType: !918, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !924, file: !914, line: 124, baseType: !34, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !915, file: !914, line: 193, baseType: !34, size: 32, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !915, file: !914, line: 200, baseType: !306, size: 32, offset: 224)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !915, file: !914, line: 202, baseType: !931, size: 32, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DISubroutineType(types: !933)
!933 = !{!34, !934, !306, !335, !34}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !914, line: 613, size: 8512, flags: DIFlagFwdDecl, identifier: "_ZTS6_reent")
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !915, file: !914, line: 204, baseType: !937, size: 32, offset: 288)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{!34, !934, !306, !86, !34}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !915, file: !914, line: 207, baseType: !941, size: 32, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DISubroutineType(types: !943)
!943 = !{!944, !934, !306, !944, !34}
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !945, line: 116, baseType: !280)
!945 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "b45aad52ebaa1042158f2766af29f8e2")
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !915, file: !914, line: 208, baseType: !947, size: 32, offset: 352)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = !DISubroutineType(types: !949)
!949 = !{!34, !934, !306}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !915, file: !914, line: 211, baseType: !924, size: 64, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !915, file: !914, line: 212, baseType: !918, size: 32, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !915, file: !914, line: 213, baseType: !34, size: 32, offset: 480)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !915, file: !914, line: 216, baseType: !954, size: 24, offset: 512)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 24, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 3)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !915, file: !914, line: 217, baseType: !958, size: 8, offset: 536)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 1)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !915, file: !914, line: 220, baseType: !924, size: 64, offset: 544)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !915, file: !914, line: 223, baseType: !34, size: 32, offset: 608)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !915, file: !914, line: 224, baseType: !964, size: 32, offset: 640)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !945, line: 46, baseType: !280)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !915, file: !914, line: 227, baseType: !934, size: 32, offset: 672)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !915, file: !914, line: 231, baseType: !967, size: 32, offset: 704)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !914, line: 35, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !969, line: 34, baseType: !970)
!969 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "9390f2fa4a45b9ec624c9a037c5d6ca9")
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !969, line: 33, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS6__lock")
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !915, file: !914, line: 233, baseType: !973, size: 64, offset: 736)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !945, line: 170, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !945, line: 162, size: 64, flags: DIFlagTypePassByValue, elements: !975, identifier: "_ZTS10_mbstate_t")
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !974, file: !945, line: 164, baseType: !34, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !974, file: !945, line: 169, baseType: !978, size: 32, offset: 32)
!978 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !974, file: !945, line: 165, size: 32, flags: DIFlagTypePassByValue, elements: !979, identifier: "_ZTSN10_mbstate_tUt_E")
!979 = !{!980, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !978, file: !945, line: 167, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !310, line: 116, baseType: !34)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !978, file: !945, line: 168, baseType: !983, size: 32)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 32, elements: !600)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !915, file: !914, line: 234, baseType: !34, size: 32, offset: 800)
!985 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstdio", directory: "/home/mjshen/RTOSExploration")
!986 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !987, file: !985, line: 99)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !912, line: 73, baseType: !944)
!988 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !989, file: !985, line: 101)
!989 = !DISubprogram(name: "clearerr", scope: !912, file: !912, line: 238, type: !990, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !992}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!993 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !994, file: !985, line: 102)
!994 = !DISubprogram(name: "fclose", scope: !912, file: !912, line: 191, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!995 = !DISubroutineType(types: !996)
!996 = !{!34, !992}
!997 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !998, file: !985, line: 103)
!998 = !DISubprogram(name: "feof", scope: !912, file: !912, line: 239, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!999 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !1000, file: !985, line: 104)
!1000 = !DISubprogram(name: "ferror", scope: !912, file: !912, line: 240, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1001 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !1002, file: !985, line: 105)
!1002 = !DISubprogram(name: "fflush", scope: !912, file: !912, line: 192, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1003 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !192, entity: !1004, file: !985, line: 106)
!1004 = !DISubprogram(name: "fgetc", scope: !912, file: !912, line: 212, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
