; ModuleID = './examples/printf.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%"class.Cicada::Stm32Uart" = type { %"class.Cicada::BufferedSerial", i8, %struct.__UART_HandleTypeDef, %struct.USART_TypeDef*, i16, i16, i32 }
%"class.Cicada::BufferedSerial" = type { %"class.Cicada::IBufferedSerial", %"class.Cicada::LineCircularBuffer", %"class.Cicada::LineCircularBuffer" }
%"class.Cicada::IBufferedSerial" = type { %"class.Cicada::ICommDevice", %"class.Cicada::ICommDevice" }
%"class.Cicada::ICommDevice" = type { i32 (...)** }
%"class.Cicada::LineCircularBuffer" = type { %"class.Cicada::CircularBuffer.base", i16, [2 x i8] }
%"class.Cicada::CircularBuffer.base" = type <{ i32 (...)**, [4 x i8], i64, i64, i64, i64, i8* }>
%struct.__UART_HandleTypeDef = type { %struct.USART_TypeDef*, %struct.USART_TypeDef, i8*, i16, i16, i8*, i16, i16, %struct.__DMA_HandleTypeDef*, %struct.__DMA_HandleTypeDef*, i32, i32, i32, i32 }
%struct.USART_TypeDef = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.__DMA_HandleTypeDef = type { %struct.DMA_Channel_TypeDef*, %struct.USART_TypeDef, i32, i32, i8*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, i32, %struct.DMA_TypeDef*, i32 }
%struct.DMA_Channel_TypeDef = type { i32, i32, i32, i32 }
%struct.DMA_TypeDef = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "instance", scope: !2, file: !3, line: 104, type: !108, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "USART2_IRQHandler", scope: !3, file: !3, line: 102, type: !4, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !283)
!3 = !DIFile(filename: "../examples/stm32f1/printf.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "3912c4bbd3ec7485a56a2cfb7adb3a89")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !16, globals: !99, imports: !120, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8}
!8 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 41, baseType: !10, size: 32, elements: !11, identifier: "_ZTS17HAL_StatusTypeDef")
!9 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_def.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "4d6e0bbb91efacee14a68a416f506def")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15}
!12 = !DIEnumerator(name: "HAL_OK", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "HAL_ERROR", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "HAL_BUSY", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3, isUnsigned: true)
!16 = !{!17, !34, !37, !40, !43}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "USART_TypeDef", file: !19, line: 516, baseType: !20)
!19 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f103xb.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "d2562af6d7239ab46ca8ba238a43c848")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 507, size: 224, flags: DIFlagTypePassByValue, elements: !21, identifier: "_ZTS13USART_TypeDef")
!21 = !{!22, !28, !29, !30, !31, !32, !33}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !20, file: !19, line: 509, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 48, baseType: !26)
!25 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ab914e287601b2385e57880e6599aa6b")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !27, line: 79, baseType: !10)
!27 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f7024d0682a918b41f94e8be9cd90461")
!28 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !20, file: !19, line: 510, baseType: !23, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !20, file: !19, line: 511, baseType: !23, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !20, file: !19, line: 512, baseType: !23, size: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !20, file: !19, line: 513, baseType: !23, size: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "CR3", scope: !20, file: !19, line: 514, baseType: !23, size: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "GTPR", scope: !20, file: !19, line: 515, baseType: !23, size: 32, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !19, line: 367, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 358, size: 224, flags: DIFlagFwdDecl, identifier: "_ZTS12GPIO_TypeDef")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !25, line: 36, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !27, line: 57, baseType: !39)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SerialTask", file: !3, line: 16, size: 224, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !41, vtableHolder: !43, identifier: "_ZTS10SerialTask")
!41 = !{!42, !87, !91, !92, !96}
!42 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !40, baseType: !43, flags: DIFlagPublic, extraData: i32 0)
!43 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Task", scope: !45, file: !44, line: 193, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !46, vtableHolder: !43, identifier: "_ZTSN6Cicada4TaskE")
!44 = !DIFile(filename: "../cicada/task.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "c2aeaca9a01dbc0caa84f135ef9fda2b")
!45 = !DINamespace(name: "Cicada", scope: null)
!46 = !{!47, !53, !54, !55, !57, !58, !62, !65, !70, !71, !74, !77, !78, !79, !80, !83}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Task", scope: !44, file: !44, baseType: !48, size: 32, flags: DIFlagArtificial)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !50, size: 32)
!50 = !DISubroutineType(types: !51)
!51 = !{!52}
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_delay", scope: !43, file: !44, line: 283, baseType: !37, size: 16, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_timeout", scope: !43, file: !44, line: 284, baseType: !24, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_isTimeoutRunning", scope: !43, file: !44, line: 285, baseType: !56, size: 8, offset: 96)
!56 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_lastRun", scope: !43, file: !44, line: 286, baseType: !24, size: 32, offset: 128)
!58 = !DISubprogram(name: "Task", scope: !43, file: !44, line: 196, type: !59, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !61, !37}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!62 = !DISubprogram(name: "~Task", scope: !43, file: !44, line: 198, type: !63, scopeLine: 198, containingType: !43, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !61}
!65 = !DISubprogram(name: "delay", linkageName: "_ZNK6Cicada4Task5delayEv", scope: !43, file: !44, line: 203, type: !66, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!66 = !DISubroutineType(types: !67)
!67 = !{!37, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!70 = !DISubprogram(name: "setDelay", linkageName: "_ZN6Cicada4Task8setDelayEt", scope: !43, file: !44, line: 212, type: !59, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!71 = !DISubprogram(name: "lastRun", linkageName: "_ZN6Cicada4Task7lastRunEv", scope: !43, file: !44, line: 222, type: !72, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!72 = !DISubroutineType(types: !73)
!73 = !{!24, !61}
!74 = !DISubprogram(name: "setLastRun", linkageName: "_ZN6Cicada4Task10setLastRunEj", scope: !43, file: !44, line: 230, type: !75, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !61, !24}
!77 = !DISubprogram(name: "run", linkageName: "_ZN6Cicada4Task3runEv", scope: !43, file: !44, line: 245, type: !63, scopeLine: 245, containingType: !43, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!78 = !DISubprogram(name: "startTimeout", linkageName: "_ZN6Cicada4Task12startTimeoutEv", scope: !43, file: !44, line: 251, type: !63, scopeLine: 251, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!79 = !DISubprogram(name: "resetTimeout", linkageName: "_ZN6Cicada4Task12resetTimeoutEv", scope: !43, file: !44, line: 262, type: !63, scopeLine: 262, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!80 = !DISubprogram(name: "isTimeout", linkageName: "_ZN6Cicada4Task9isTimeoutEj", scope: !43, file: !44, line: 272, type: !81, scopeLine: 272, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!81 = !DISubroutineType(types: !82)
!82 = !{!56, !61, !24}
!83 = !DISubprogram(name: "Task", scope: !43, file: !44, line: 281, type: !84, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !61, !86}
!86 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !69, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "m_serial", scope: !40, file: !3, line: 46, baseType: !88, size: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !89, size: 32)
!89 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BufferedSerial", scope: !45, file: !90, line: 42, size: 832, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada14BufferedSerialE")
!90 = !DIFile(filename: "../cicada/bufferedserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "b9c9871d742db1af5ee8abb5df52fc59")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "m_i", scope: !40, file: !3, line: 47, baseType: !52, size: 32, offset: 192)
!92 = !DISubprogram(name: "SerialTask", scope: !40, file: !3, line: 19, type: !93, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !95, !88}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!96 = !DISubprogram(name: "run", linkageName: "_ZN10SerialTask3runEv", scope: !40, file: !3, line: 21, type: !97, scopeLine: 21, containingType: !40, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !95}
!99 = !{!0, !100, !111}
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "serial", scope: !102, file: !3, line: 110, type: !108, isLocal: true, isDefinition: true)
!102 = distinct !DISubprogram(name: "_putchar", scope: !3, file: !3, line: 108, type: !103, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !106)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105}
!105 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!106 = !{!107}
!107 = !DILocalVariable(name: "c", arg: 1, scope: !102, file: !3, line: 108, type: !105)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !45, file: !110, line: 51, size: 1536, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada9Stm32UartE")
!110 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "f1205a68111afe9a0868ac35ca31b4e6")
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "entrypoint", scope: !113, file: !3, line: 23, type: !117, isLocal: false, isDefinition: true)
!113 = distinct !DISubprogram(name: "run", linkageName: "_ZN10SerialTask3runEv", scope: !40, file: !3, line: 21, type: !97, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, declaration: !96, retainedNodes: !114)
!114 = !{!115}
!115 = !DILocalVariable(name: "this", arg: 1, scope: !113, type: !116, flags: DIFlagArtificial | DIFlagObjectPointer)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !25, line: 24, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !27, line: 43, baseType: !119)
!119 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!120 = !{!121, !127, !131, !134, !138, !141, !143, !145, !147, !150, !153, !156, !159, !162, !165, !166, !167, !168, !172, !174, !176, !178, !180, !183, !186, !189, !192, !195, !198, !211, !215, !219, !221, !225, !232, !236, !238, !240, !244, !248, !252, !256, !260, !262, !264, !266, !270, !274, !278, !280, !282}
!121 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !123, file: !126, line: 47)
!122 = !DINamespace(name: "std", scope: null)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !25, line: 20, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !27, line: 41, baseType: !125)
!125 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!126 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstdint", directory: "/home/mjshen/RTOSExploration")
!127 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !128, file: !126, line: 48)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !25, line: 32, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !27, line: 55, baseType: !130)
!130 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!131 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !132, file: !126, line: 49)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !25, line: 44, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !27, line: 77, baseType: !52)
!134 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !135, file: !126, line: 50)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !25, line: 56, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !27, line: 103, baseType: !137)
!137 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!138 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !139, file: !126, line: 52)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !140, line: 51, baseType: !125)
!140 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "a169a1d650067906a9e00519a9405ebb")
!141 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !142, file: !126, line: 53)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !140, line: 61, baseType: !130)
!143 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !144, file: !126, line: 54)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !140, line: 71, baseType: !52)
!145 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !146, file: !126, line: 55)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !140, line: 81, baseType: !137)
!147 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !148, file: !126, line: 57)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !140, line: 21, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !27, line: 134, baseType: !125)
!150 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !151, file: !126, line: 58)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !140, line: 27, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !27, line: 160, baseType: !130)
!153 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !154, file: !126, line: 59)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !140, line: 33, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !27, line: 182, baseType: !52)
!156 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !157, file: !126, line: 60)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !140, line: 39, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !27, line: 200, baseType: !137)
!159 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !160, file: !126, line: 62)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !25, line: 67, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !27, line: 214, baseType: !137)
!162 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !163, file: !126, line: 63)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !25, line: 77, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !27, line: 230, baseType: !52)
!165 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !117, file: !126, line: 65)
!166 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !37, file: !126, line: 66)
!167 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !24, file: !126, line: 67)
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !169, file: !126, line: 68)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !25, line: 60, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !27, line: 105, baseType: !171)
!171 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!172 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !173, file: !126, line: 70)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !140, line: 52, baseType: !119)
!174 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !175, file: !126, line: 71)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !140, line: 62, baseType: !39)
!176 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !177, file: !126, line: 72)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !140, line: 72, baseType: !10)
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !179, file: !126, line: 73)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !140, line: 82, baseType: !171)
!180 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !181, file: !126, line: 75)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !140, line: 22, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !27, line: 136, baseType: !119)
!183 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !184, file: !126, line: 76)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !140, line: 28, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !27, line: 162, baseType: !39)
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !187, file: !126, line: 77)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !140, line: 34, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !27, line: 184, baseType: !10)
!189 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !190, file: !126, line: 78)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !140, line: 40, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !27, line: 202, baseType: !171)
!192 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !193, file: !126, line: 80)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !25, line: 72, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !27, line: 222, baseType: !171)
!195 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !196, file: !126, line: 81)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !25, line: 82, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !27, line: 232, baseType: !10)
!198 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !199, file: !210, line: 77)
!199 = !DISubprogram(name: "memchr", scope: !200, file: !200, line: 29, type: !201, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/string.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "00b3471f69c722645cab66876c511e27")
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !204, !52, !206}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !207, line: 40, baseType: !208)
!207 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/strings.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "dceb1b71cd72987b246237af8552faba")
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !209, line: 131, baseType: !10)
!209 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "b45aad52ebaa1042158f2766af29f8e2")
!210 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstring", directory: "/home/mjshen/RTOSExploration")
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !212, file: !210, line: 78)
!212 = !DISubprogram(name: "memcmp", scope: !200, file: !200, line: 30, type: !213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!213 = !DISubroutineType(types: !214)
!214 = !{!52, !204, !204, !206}
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !216, file: !210, line: 79)
!216 = !DISubprogram(name: "memcpy", scope: !200, file: !200, line: 31, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!217 = !DISubroutineType(types: !218)
!218 = !{!203, !203, !204, !206}
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !220, file: !210, line: 80)
!220 = !DISubprogram(name: "memmove", scope: !200, file: !200, line: 32, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !222, file: !210, line: 81)
!222 = !DISubprogram(name: "memset", scope: !200, file: !200, line: 33, type: !223, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!223 = !DISubroutineType(types: !224)
!224 = !{!203, !203, !52, !206}
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !226, file: !210, line: 82)
!226 = !DISubprogram(name: "strcat", scope: !200, file: !200, line: 34, type: !227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !229, !230}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !233, file: !210, line: 83)
!233 = !DISubprogram(name: "strcmp", scope: !200, file: !200, line: 36, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DISubroutineType(types: !235)
!235 = !{!52, !230, !230}
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !237, file: !210, line: 84)
!237 = !DISubprogram(name: "strcoll", scope: !200, file: !200, line: 37, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !239, file: !210, line: 85)
!239 = !DISubprogram(name: "strcpy", scope: !200, file: !200, line: 38, type: !227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !241, file: !210, line: 86)
!241 = !DISubprogram(name: "strcspn", scope: !200, file: !200, line: 39, type: !242, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!242 = !DISubroutineType(types: !243)
!243 = !{!206, !230, !230}
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !245, file: !210, line: 87)
!245 = !DISubprogram(name: "strerror", scope: !200, file: !200, line: 40, type: !246, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DISubroutineType(types: !247)
!247 = !{!229, !52}
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !249, file: !210, line: 88)
!249 = !DISubprogram(name: "strlen", scope: !200, file: !200, line: 41, type: !250, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!250 = !DISubroutineType(types: !251)
!251 = !{!206, !230}
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !253, file: !210, line: 89)
!253 = !DISubprogram(name: "strncat", scope: !200, file: !200, line: 42, type: !254, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!254 = !DISubroutineType(types: !255)
!255 = !{!229, !229, !230, !206}
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !257, file: !210, line: 90)
!257 = !DISubprogram(name: "strncmp", scope: !200, file: !200, line: 43, type: !258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!258 = !DISubroutineType(types: !259)
!259 = !{!52, !230, !230, !206}
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !261, file: !210, line: 91)
!261 = !DISubprogram(name: "strncpy", scope: !200, file: !200, line: 44, type: !254, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !263, file: !210, line: 92)
!263 = !DISubprogram(name: "strspn", scope: !200, file: !200, line: 47, type: !242, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !265, file: !210, line: 93)
!265 = !DISubprogram(name: "strtok", scope: !200, file: !200, line: 50, type: !227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !267, file: !210, line: 94)
!267 = !DISubprogram(name: "strxfrm", scope: !200, file: !200, line: 52, type: !268, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!268 = !DISubroutineType(types: !269)
!269 = !{!206, !229, !230, !206}
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !271, file: !210, line: 95)
!271 = !DISubprogram(name: "strchr", scope: !200, file: !200, line: 35, type: !272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!272 = !DISubroutineType(types: !273)
!273 = !{!229, !230, !52}
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !275, file: !210, line: 96)
!275 = !DISubprogram(name: "strpbrk", scope: !200, file: !200, line: 45, type: !276, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!276 = !DISubroutineType(types: !277)
!277 = !{!229, !230, !230}
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !279, file: !210, line: 97)
!279 = !DISubprogram(name: "strrchr", scope: !200, file: !200, line: 46, type: !272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !122, entity: !281, file: !210, line: 98)
!281 = !DISubprogram(name: "strstr", scope: !200, file: !200, line: 48, type: !276, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!282 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !6, entity: !45, file: !3, line: 12)
!283 = !{}
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "pow10", scope: !286, file: !287, line: 311, type: !343, isLocal: true, isDefinition: true)
!286 = distinct !DISubprogram(name: "_ftoa", scope: !287, file: !287, line: 299, type: !288, scopeLine: 300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !310)
!287 = !DIFile(filename: "../dep/printf/src/printf.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "7383fa86adf0d25d8eda174a9b330d6a")
!288 = !DISubroutineType(types: !289)
!289 = !{!290, !292, !229, !290, !290, !296, !10, !10, !10}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !291, line: 46, baseType: !10)
!291 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_type", file: !287, line: 97, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !105, !203, !290, !290}
!296 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !298, globals: !309, splitDebugInlining: false, nameTableKind: None)
!298 = !{!290, !229, !196, !10, !52, !171, !299, !105, !130, !119, !39, !296, !300}
!299 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_wrap_type", file: !287, line: 104, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 101, size: 64, elements: !303)
!303 = !{!304, !308}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fct", scope: !302, file: !287, line: 102, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !105, !203}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !302, file: !287, line: 103, baseType: !203, size: 32, offset: 32)
!309 = !{!284}
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !321, !325, !326, !327, !329, !331, !332, !333, !334, !337, !341}
!311 = !DILocalVariable(name: "out", arg: 1, scope: !286, file: !287, line: 299, type: !292)
!312 = !DILocalVariable(name: "buffer", arg: 2, scope: !286, file: !287, line: 299, type: !229)
!313 = !DILocalVariable(name: "idx", arg: 3, scope: !286, file: !287, line: 299, type: !290)
!314 = !DILocalVariable(name: "maxlen", arg: 4, scope: !286, file: !287, line: 299, type: !290)
!315 = !DILocalVariable(name: "value", arg: 5, scope: !286, file: !287, line: 299, type: !296)
!316 = !DILocalVariable(name: "prec", arg: 6, scope: !286, file: !287, line: 299, type: !10)
!317 = !DILocalVariable(name: "width", arg: 7, scope: !286, file: !287, line: 299, type: !10)
!318 = !DILocalVariable(name: "flags", arg: 8, scope: !286, file: !287, line: 299, type: !10)
!319 = !DILocalVariable(name: "start_idx", scope: !286, file: !287, line: 301, type: !320)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!321 = !DILocalVariable(name: "buf", scope: !286, file: !287, line: 303, type: !322)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 256, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 32)
!325 = !DILocalVariable(name: "len", scope: !286, file: !287, line: 304, type: !290)
!326 = !DILocalVariable(name: "diff", scope: !286, file: !287, line: 305, type: !296)
!327 = !DILocalVariable(name: "thres_max", scope: !286, file: !287, line: 308, type: !328)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!329 = !DILocalVariable(name: "negative", scope: !286, file: !287, line: 322, type: !330)
!330 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!331 = !DILocalVariable(name: "whole", scope: !286, file: !287, line: 338, type: !52)
!332 = !DILocalVariable(name: "tmp", scope: !286, file: !287, line: 339, type: !296)
!333 = !DILocalVariable(name: "frac", scope: !286, file: !287, line: 340, type: !299)
!334 = !DILocalVariable(name: "count", scope: !335, file: !287, line: 373, type: !10)
!335 = distinct !DILexicalBlock(scope: !336, file: !287, line: 372, column: 8)
!336 = distinct !DILexicalBlock(scope: !286, file: !287, line: 364, column: 7)
!337 = !DILocalVariable(name: "i", scope: !338, file: !287, line: 424, type: !290)
!338 = distinct !DILexicalBlock(scope: !339, file: !287, line: 424, column: 5)
!339 = distinct !DILexicalBlock(scope: !340, file: !287, line: 423, column: 58)
!340 = distinct !DILexicalBlock(scope: !286, file: !287, line: 423, column: 7)
!341 = !DILocalVariable(name: "i", scope: !342, file: !287, line: 430, type: !290)
!342 = distinct !DILexicalBlock(scope: !286, file: !287, line: 430, column: 3)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 640, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 10)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "AHBPrescTable", scope: !348, file: !349, line: 124, type: !421, isLocal: false, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !350, retainedTypes: !356, globals: !412, splitDebugInlining: false, nameTableKind: None)
!349 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Source/Templates/system_stm32f1xx.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "2e873de3002e5d783190a46ff1c7da2d")
!350 = !{!351}
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !352, line: 151, baseType: !10, size: 32, elements: !353)
!352 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xx.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dc4ed8bdf8589b30d30d93eb6ee6ca27")
!353 = !{!354, !355}
!354 = !DIEnumerator(name: "RESET", value: 0)
!355 = !DIEnumerator(name: "SET", value: 1)
!356 = !{!357, !371, !24}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !359, file: !19, line: 426, baseType: !23, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !359, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !359, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !359, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !359, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !359, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !359, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !359, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !359, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !359, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !373, line: 397, baseType: !374)
!373 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 374, size: 1120, elements: !375)
!375 = !{!376, !378, !379, !380, !381, !382, !383, !388, !389, !390, !391, !392, !393, !394, !395, !399, !400, !401, !405, !409, !411}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !374, file: !373, line: 376, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !374, file: !373, line: 377, baseType: !23, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !374, file: !373, line: 378, baseType: !23, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !374, file: !373, line: 379, baseType: !23, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !374, file: !373, line: 380, baseType: !23, size: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !374, file: !373, line: 381, baseType: !23, size: 32, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !374, file: !373, line: 382, baseType: !384, size: 96, offset: 192)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 96, elements: !386)
!385 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!386 = !{!387}
!387 = !DISubrange(count: 12)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !374, file: !373, line: 383, baseType: !23, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !374, file: !373, line: 384, baseType: !23, size: 32, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !374, file: !373, line: 385, baseType: !23, size: 32, offset: 352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !374, file: !373, line: 386, baseType: !23, size: 32, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !374, file: !373, line: 387, baseType: !23, size: 32, offset: 416)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !374, file: !373, line: 388, baseType: !23, size: 32, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !374, file: !373, line: 389, baseType: !23, size: 32, offset: 480)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !374, file: !373, line: 390, baseType: !396, size: 64, offset: 512)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 64, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 2)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !374, file: !373, line: 391, baseType: !377, size: 32, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !374, file: !373, line: 392, baseType: !377, size: 32, offset: 608)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !374, file: !373, line: 393, baseType: !402, size: 128, offset: 640)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 128, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 4)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !374, file: !373, line: 394, baseType: !406, size: 160, offset: 768)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 160, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 5)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !374, file: !373, line: 395, baseType: !410, size: 160, offset: 928)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !407)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !374, file: !373, line: 396, baseType: !23, size: 32, offset: 1088)
!412 = !{!413, !346, !415}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !348, file: !349, line: 123, type: !24, isLocal: false, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "APBPrescTable", scope: !348, file: !349, line: 125, type: !417, isLocal: false, isDefinition: true)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 64, elements: !419)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!419 = !{!420}
!420 = !DISubrange(count: 8)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 128, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 16)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "uwTickPrio", scope: !426, file: !427, line: 80, type: !24, isLocal: false, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !428, retainedTypes: !496, globals: !539, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "1a5fa7b79e9e470cf817b81d791a6ccb")
!428 = !{!429, !436, !442}
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !430, line: 49, baseType: !10, size: 32, elements: !431)
!430 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5eab64b252ccd159497a11d87d26bc0b")
!431 = !{!432, !433, !434, !435}
!432 = !DIEnumerator(name: "HAL_TICK_FREQ_10HZ", value: 100)
!433 = !DIEnumerator(name: "HAL_TICK_FREQ_100HZ", value: 10)
!434 = !DIEnumerator(name: "HAL_TICK_FREQ_1KHZ", value: 1)
!435 = !DIEnumerator(name: "HAL_TICK_FREQ_DEFAULT", value: 1)
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 41, baseType: !10, size: 32, elements: !437)
!437 = !{!438, !439, !440, !441}
!438 = !DIEnumerator(name: "HAL_OK", value: 0)
!439 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!440 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!441 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!442 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 69, baseType: !52, size: 32, elements: !443)
!443 = !{!444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!444 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!445 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!446 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!447 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!448 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!449 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!450 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!451 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!452 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!453 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!454 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!455 = !DIEnumerator(name: "TAMPER_IRQn", value: 2)
!456 = !DIEnumerator(name: "RTC_IRQn", value: 3)
!457 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!458 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!459 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!460 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!461 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!462 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!463 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!464 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!465 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!466 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!467 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!468 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!469 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!470 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!471 = !DIEnumerator(name: "ADC1_2_IRQn", value: 18)
!472 = !DIEnumerator(name: "USB_HP_CAN1_TX_IRQn", value: 19)
!473 = !DIEnumerator(name: "USB_LP_CAN1_RX0_IRQn", value: 20)
!474 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!475 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!476 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!477 = !DIEnumerator(name: "TIM1_BRK_IRQn", value: 24)
!478 = !DIEnumerator(name: "TIM1_UP_IRQn", value: 25)
!479 = !DIEnumerator(name: "TIM1_TRG_COM_IRQn", value: 26)
!480 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!481 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!482 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!483 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!484 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!485 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!486 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!487 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!488 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!489 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!490 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!491 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!492 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!493 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!494 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!495 = !DIEnumerator(name: "USBWakeUp_IRQn", value: 42)
!496 = !{!497, !24, !510, !524, !532, !538}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !19, line: 336, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 325, size: 288, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !499, file: !19, line: 327, baseType: !23, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !499, file: !19, line: 328, baseType: !23, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !499, file: !19, line: 329, baseType: !23, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !499, file: !19, line: 330, baseType: !23, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !499, file: !19, line: 331, baseType: !23, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !499, file: !19, line: 332, baseType: !23, size: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !499, file: !19, line: 333, baseType: !23, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !499, file: !19, line: 334, baseType: !23, size: 32, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !499, file: !19, line: 335, baseType: !23, size: 32, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !512, file: !19, line: 426, baseType: !23, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !512, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !512, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !512, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !512, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !512, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !512, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !512, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !512, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !512, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !373, line: 700, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 694, size: 128, elements: !527)
!527 = !{!528, !529, !530, !531}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !526, file: !373, line: 696, baseType: !23, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !526, file: !373, line: 697, baseType: !23, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !526, file: !373, line: 698, baseType: !23, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !526, file: !373, line: 699, baseType: !377, size: 32, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBGMCU_TypeDef", file: !19, line: 285, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 281, size: 64, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "IDCODE", scope: !534, file: !19, line: 283, baseType: !23, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !534, file: !19, line: 284, baseType: !23, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!539 = !{!424, !540, !543}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "uwTickFreq", scope: !426, file: !427, line: 81, type: !542, isLocal: false, isDefinition: true)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_TickFreqTypeDef", file: !430, line: 55, baseType: !429)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "uwTick", scope: !426, file: !427, line: 79, type: !23, isLocal: false, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "instance", linkageName: "_ZN6Cicada9Stm32Uart8instanceE", scope: !547, file: !548, line: 32, type: !650, isLocal: false, isDefinition: true, declaration: !649)
!547 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !548, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !549, retainedTypes: !566, globals: !771, imports: !772, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "3cfb26aba75e1df83974cb6e4fff6457")
!549 = !{!550, !8, !551, !555}
!550 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 69, baseType: !52, size: 32, elements: !443, identifier: "_ZTS9IRQn_Type")
!551 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 52, baseType: !10, size: 32, elements: !552, identifier: "_ZTS15HAL_LockTypeDef")
!552 = !{!553, !554}
!553 = !DIEnumerator(name: "HAL_UNLOCKED", value: 0, isUnsigned: true)
!554 = !DIEnumerator(name: "HAL_LOCKED", value: 1, isUnsigned: true)
!555 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !556, line: 117, baseType: !10, size: 32, elements: !557, identifier: "_ZTS21HAL_UART_StateTypeDef")
!556 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "74469f61b271b78e5ff5784cb5eb97d1")
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565}
!558 = !DIEnumerator(name: "HAL_UART_STATE_RESET", value: 0, isUnsigned: true)
!559 = !DIEnumerator(name: "HAL_UART_STATE_READY", value: 32, isUnsigned: true)
!560 = !DIEnumerator(name: "HAL_UART_STATE_BUSY", value: 36, isUnsigned: true)
!561 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX", value: 33, isUnsigned: true)
!562 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_RX", value: 34, isUnsigned: true)
!563 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX_RX", value: 35, isUnsigned: true)
!564 = !DIEnumerator(name: "HAL_UART_STATE_TIMEOUT", value: 160, isUnsigned: true)
!565 = !DIEnumerator(name: "HAL_UART_STATE_ERROR", value: 224, isUnsigned: true)
!566 = !{!24, !17, !567, !577, !34, !117, !37, !132, !591, !621, !646}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFIO_TypeDef", file: !19, line: 380, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 373, size: 256, flags: DIFlagTypePassByValue, elements: !570, identifier: "_ZTS12AFIO_TypeDef")
!570 = !{!571, !572, !573, !575, !576}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "EVCR", scope: !569, file: !19, line: 375, baseType: !23, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR", scope: !569, file: !19, line: 376, baseType: !23, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !569, file: !19, line: 377, baseType: !574, size: 128, offset: 64)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !403)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !569, file: !19, line: 378, baseType: !24, size: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR2", scope: !569, file: !19, line: 379, baseType: !23, size: 32, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, flags: DIFlagTypePassByValue, elements: !580, identifier: "_ZTS11RCC_TypeDef")
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !579, file: !19, line: 426, baseType: !23, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !579, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !579, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !579, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !579, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !579, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !579, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !579, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !579, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !579, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !373, line: 355, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 340, size: 28704, flags: DIFlagTypePassByValue, elements: !594, identifier: "_ZTS9NVIC_Type")
!594 = !{!595, !597, !601, !602, !603, !604, !605, !606, !607, !608, !612, !616, !620}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !593, file: !373, line: 342, baseType: !596, size: 256)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 256, elements: !419)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !593, file: !373, line: 343, baseType: !598, size: 768, offset: 256)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 768, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 24)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !593, file: !373, line: 344, baseType: !596, size: 256, offset: 1024)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !593, file: !373, line: 345, baseType: !598, size: 768, offset: 1280)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !593, file: !373, line: 346, baseType: !596, size: 256, offset: 2048)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !593, file: !373, line: 347, baseType: !598, size: 768, offset: 2304)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !593, file: !373, line: 348, baseType: !596, size: 256, offset: 3072)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !593, file: !373, line: 349, baseType: !598, size: 768, offset: 3328)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !593, file: !373, line: 350, baseType: !596, size: 256, offset: 4096)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !593, file: !373, line: 351, baseType: !609, size: 1792, offset: 4352)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1792, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 56)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !593, file: !373, line: 352, baseType: !613, size: 1920, offset: 6144)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 1920, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 240)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !593, file: !373, line: 353, baseType: !617, size: 20608, offset: 8064)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 20608, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 644)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !593, file: !373, line: 354, baseType: !23, size: 32, offset: 28672)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !373, line: 397, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 374, size: 1120, flags: DIFlagTypePassByValue, elements: !624, identifier: "_ZTS8SCB_Type")
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !623, file: !373, line: 376, baseType: !377, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !623, file: !373, line: 377, baseType: !23, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !623, file: !373, line: 378, baseType: !23, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !623, file: !373, line: 379, baseType: !23, size: 32, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !623, file: !373, line: 380, baseType: !23, size: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !623, file: !373, line: 381, baseType: !23, size: 32, offset: 160)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !623, file: !373, line: 382, baseType: !384, size: 96, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !623, file: !373, line: 383, baseType: !23, size: 32, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !623, file: !373, line: 384, baseType: !23, size: 32, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !623, file: !373, line: 385, baseType: !23, size: 32, offset: 352)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !623, file: !373, line: 386, baseType: !23, size: 32, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !623, file: !373, line: 387, baseType: !23, size: 32, offset: 416)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !623, file: !373, line: 388, baseType: !23, size: 32, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !623, file: !373, line: 389, baseType: !23, size: 32, offset: 480)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !623, file: !373, line: 390, baseType: !396, size: 64, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !623, file: !373, line: 391, baseType: !377, size: 32, offset: 576)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !623, file: !373, line: 392, baseType: !377, size: 32, offset: 608)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !623, file: !373, line: 393, baseType: !402, size: 128, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !623, file: !373, line: 394, baseType: !406, size: 160, offset: 768)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !623, file: !373, line: 395, baseType: !410, size: 160, offset: 928)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !623, file: !373, line: 396, baseType: !23, size: 32, offset: 1088)
!646 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !45, file: !110, line: 51, size: 1536, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !647, vtableHolder: !747)
!647 = !{!648, !649, !652, !653, !690, !691, !692, !693, !695, !701, !704, !707, !710, !713, !716, !717, !720, !721, !726, !730, !731, !732, !735, !736, !740, !744}
!648 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !646, baseType: !89, flags: DIFlagPublic, extraData: i32 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !646, file: !110, line: 120, baseType: !650, flags: DIFlagStaticMember)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 128, elements: !403)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !646, file: !110, line: 122, baseType: !117, size: 8, offset: 832)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_handle", scope: !646, file: !110, line: 123, baseType: !654, size: 576, offset: 864)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_HandleTypeDef", file: !556, line: 189, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__UART_HandleTypeDef", file: !556, line: 141, size: 576, flags: DIFlagTypePassByValue, elements: !656, identifier: "_ZTS20__UART_HandleTypeDef")
!656 = !{!657, !658, !669, !671, !672, !674, !675, !676, !677, !682, !683, !685, !688, !689}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Instance", scope: !655, file: !556, line: 143, baseType: !17, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Init", scope: !655, file: !556, line: 145, baseType: !659, size: 224, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_InitTypeDef", file: !556, line: 76, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !556, line: 47, size: 224, flags: DIFlagTypePassByValue, elements: !661, identifier: "_ZTS16UART_InitTypeDef")
!661 = !{!662, !663, !664, !665, !666, !667, !668}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "BaudRate", scope: !660, file: !556, line: 49, baseType: !24, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "WordLength", scope: !660, file: !556, line: 54, baseType: !24, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "StopBits", scope: !660, file: !556, line: 57, baseType: !24, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Parity", scope: !660, file: !556, line: 60, baseType: !24, size: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !660, file: !556, line: 67, baseType: !24, size: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "HwFlowCtl", scope: !660, file: !556, line: 70, baseType: !24, size: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "OverSampling", scope: !660, file: !556, line: 73, baseType: !24, size: 32, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pTxBuffPtr", scope: !655, file: !556, line: 147, baseType: !670, size: 32, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferSize", scope: !655, file: !556, line: 149, baseType: !37, size: 16, offset: 288)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferCount", scope: !655, file: !556, line: 151, baseType: !673, size: 16, offset: 304)
!673 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pRxBuffPtr", scope: !655, file: !556, line: 153, baseType: !670, size: 32, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferSize", scope: !655, file: !556, line: 155, baseType: !37, size: 16, offset: 352)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferCount", scope: !655, file: !556, line: 157, baseType: !673, size: 16, offset: 368)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "hdmatx", scope: !655, file: !556, line: 159, baseType: !678, size: 32, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HandleTypeDef", file: !680, line: 137, baseType: !681)
!680 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_dma.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dd8e7645a79a80f8166404bb078b3d4e")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__DMA_HandleTypeDef", file: !680, line: 111, size: 576, flags: DIFlagFwdDecl, identifier: "_ZTS19__DMA_HandleTypeDef")
!682 = !DIDerivedType(tag: DW_TAG_member, name: "hdmarx", scope: !655, file: !556, line: 161, baseType: !678, size: 32, offset: 416)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !655, file: !556, line: 163, baseType: !684, size: 32, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_LockTypeDef", file: !9, line: 56, baseType: !551)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "gState", scope: !655, file: !556, line: 165, baseType: !686, size: 32, offset: 480)
!686 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_UART_StateTypeDef", file: !556, line: 136, baseType: !555)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RxState", scope: !655, file: !556, line: 169, baseType: !686, size: 32, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorCode", scope: !655, file: !556, line: 172, baseType: !23, size: 32, offset: 544)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_uartPort", scope: !646, file: !110, line: 124, baseType: !34, size: 32, offset: 1440)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_txPin", scope: !646, file: !110, line: 125, baseType: !37, size: 16, offset: 1472)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_rxPin", scope: !646, file: !110, line: 126, baseType: !37, size: 16, offset: 1488)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_uartInterruptInstance", scope: !646, file: !110, line: 127, baseType: !694, size: 32, offset: 1504)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !19, line: 126, baseType: !550)
!695 = !DISubprogram(name: "Stm32Uart", scope: !646, file: !110, line: 66, type: !696, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !698, !229, !229, !699, !17, !34, !37, !37}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "Size", scope: !45, file: !700, line: 32, baseType: !169)
!700 = !DIFile(filename: "../cicada/types.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "6dfa4c2c933d4c520c13fa7638528c51")
!701 = !DISubprogram(name: "Stm32Uart", scope: !646, file: !110, line: 83, type: !702, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !698, !229, !229, !699, !699, !17, !34, !37, !37}
!704 = !DISubprogram(name: "~Stm32Uart", scope: !646, file: !110, line: 86, type: !705, scopeLine: 86, containingType: !646, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !698}
!707 = !DISubprogram(name: "getInstance", linkageName: "_ZN6Cicada9Stm32Uart11getInstanceEP13USART_TypeDef", scope: !646, file: !110, line: 88, type: !708, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!708 = !DISubroutineType(types: !709)
!709 = !{!651, !17}
!710 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEv", scope: !646, file: !110, line: 93, type: !711, scopeLine: 93, containingType: !646, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!711 = !DISubroutineType(types: !712)
!712 = !{!56, !698}
!713 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEh", scope: !646, file: !110, line: 100, type: !714, scopeLine: 100, containingType: !646, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!714 = !DISubroutineType(types: !715)
!715 = !{!56, !698, !117}
!716 = !DISubprogram(name: "isOpen", linkageName: "_ZN6Cicada9Stm32Uart6isOpenEv", scope: !646, file: !110, line: 102, type: !711, scopeLine: 102, containingType: !646, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!717 = !DISubprogram(name: "setSerialConfig", linkageName: "_ZN6Cicada9Stm32Uart15setSerialConfigEjh", scope: !646, file: !110, line: 103, type: !718, scopeLine: 103, containingType: !646, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!718 = !DISubroutineType(types: !719)
!719 = !{!56, !698, !24, !117}
!720 = !DISubprogram(name: "close", linkageName: "_ZN6Cicada9Stm32Uart5closeEv", scope: !646, file: !110, line: 104, type: !705, scopeLine: 104, containingType: !646, virtualIndex: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!721 = !DISubprogram(name: "portName", linkageName: "_ZNK6Cicada9Stm32Uart8portNameEv", scope: !646, file: !110, line: 105, type: !722, scopeLine: 105, containingType: !646, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!722 = !DISubroutineType(types: !723)
!723 = !{!230, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!726 = !DISubprogram(name: "rawRead", linkageName: "_ZN6Cicada9Stm32Uart7rawReadERh", scope: !646, file: !110, line: 106, type: !727, scopeLine: 106, containingType: !646, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!727 = !DISubroutineType(types: !728)
!728 = !{!56, !698, !729}
!729 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !117, size: 32)
!730 = !DISubprogram(name: "rawWrite", linkageName: "_ZN6Cicada9Stm32Uart8rawWriteEh", scope: !646, file: !110, line: 107, type: !714, scopeLine: 107, containingType: !646, virtualIndex: 22, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!731 = !DISubprogram(name: "startTransmit", linkageName: "_ZN6Cicada9Stm32Uart13startTransmitEv", scope: !646, file: !110, line: 108, type: !705, scopeLine: 108, containingType: !646, virtualIndex: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!732 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada9Stm32Uart20writeBufferProcessedEv", scope: !646, file: !110, line: 109, type: !733, scopeLine: 109, containingType: !646, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!733 = !DISubroutineType(types: !734)
!734 = !{!56, !724}
!735 = !DISubprogram(name: "handleInterrupt", linkageName: "_ZN6Cicada9Stm32Uart15handleInterruptEv", scope: !646, file: !110, line: 111, type: !705, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!736 = !DISubprogram(name: "Stm32Uart", scope: !646, file: !110, line: 115, type: !737, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !698, !739}
!739 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !725, size: 32)
!740 = !DISubprogram(name: "operator=", linkageName: "_ZN6Cicada9Stm32UartaSERKS0_", scope: !646, file: !110, line: 116, type: !741, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!741 = !DISubroutineType(types: !742)
!742 = !{!743, !698, !739}
!743 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !646, size: 32)
!744 = !DISubprogram(name: "init", linkageName: "_ZN6Cicada9Stm32Uart4initEP13USART_TypeDef", scope: !646, file: !110, line: 118, type: !745, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !698, !17}
!747 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ICommDevice", scope: !45, file: !748, line: 43, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !749, vtableHolder: !747, identifier: "_ZTSN6Cicada11ICommDeviceE")
!748 = !DIFile(filename: "../cicada/icommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "e83d2959922f5020d303a6315b56c6e9")
!749 = !{!750, !751, !755, !760, !761, !764, !767}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ICommDevice", scope: !748, file: !748, baseType: !48, size: 32, flags: DIFlagArtificial)
!751 = !DISubprogram(name: "~ICommDevice", scope: !747, file: !748, line: 46, type: !752, scopeLine: 46, containingType: !747, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!755 = !DISubprogram(name: "bytesAvailable", linkageName: "_ZNK6Cicada11ICommDevice14bytesAvailableEv", scope: !747, file: !748, line: 52, type: !756, scopeLine: 52, containingType: !747, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!756 = !DISubroutineType(types: !757)
!757 = !{!699, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!760 = !DISubprogram(name: "spaceAvailable", linkageName: "_ZNK6Cicada11ICommDevice14spaceAvailableEv", scope: !747, file: !748, line: 60, type: !756, scopeLine: 60, containingType: !747, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!761 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada11ICommDevice20writeBufferProcessedEv", scope: !747, file: !748, line: 71, type: !762, scopeLine: 71, containingType: !747, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!762 = !DISubroutineType(types: !763)
!763 = !{!56, !758}
!764 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada11ICommDevice4readEPhy", scope: !747, file: !748, line: 85, type: !765, scopeLine: 85, containingType: !747, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!765 = !DISubroutineType(types: !766)
!766 = !{!699, !754, !670, !699}
!767 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada11ICommDevice5writeEPKhy", scope: !747, file: !748, line: 98, type: !768, scopeLine: 98, containingType: !747, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!768 = !DISubroutineType(types: !769)
!769 = !{!699, !754, !770, !699}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!771 = !{!545}
!772 = !{!121, !127, !131, !134, !138, !141, !143, !145, !147, !150, !153, !156, !159, !162, !165, !166, !167, !168, !172, !174, !176, !178, !180, !183, !186, !189, !192, !195, !773}
!773 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !547, entity: !45, file: !548, line: 28)
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !775, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !776, retainedTypes: !781, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_rcc.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "bf5d5e021854d33cea3d58ed6b9d5087")
!776 = !{!436, !351, !777}
!777 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !352, line: 157, baseType: !10, size: 32, elements: !778)
!778 = !{!779, !780}
!779 = !DIEnumerator(name: "DISABLE", value: 0)
!780 = !DIEnumerator(name: "ENABLE", value: 1)
!781 = !{!782, !24, !203, !117, !796, !797, !803, !37, !816, !827}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793, !794, !795}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !784, file: !19, line: 426, baseType: !23, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !784, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !784, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !784, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !784, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !784, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !784, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !784, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !784, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !784, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !19, line: 418, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 414, size: 64, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !799, file: !19, line: 416, baseType: !23, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !799, file: !19, line: 417, baseType: !23, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !19, line: 336, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 325, size: 288, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !805, file: !19, line: 327, baseType: !23, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !805, file: !19, line: 328, baseType: !23, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !805, file: !19, line: 329, baseType: !23, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !805, file: !19, line: 330, baseType: !23, size: 32, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !805, file: !19, line: 331, baseType: !23, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !805, file: !19, line: 332, baseType: !23, size: 32, offset: 160)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !805, file: !19, line: 333, baseType: !23, size: 32, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !805, file: !19, line: 334, baseType: !23, size: 32, offset: 224)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !805, file: !19, line: 335, baseType: !23, size: 32, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !19, line: 367, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 358, size: 224, elements: !819)
!819 = !{!820, !821, !822, !823, !824, !825, !826}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "CRL", scope: !818, file: !19, line: 360, baseType: !23, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "CRH", scope: !818, file: !19, line: 361, baseType: !23, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !818, file: !19, line: 362, baseType: !23, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !818, file: !19, line: 363, baseType: !23, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !818, file: !19, line: 364, baseType: !23, size: 32, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !818, file: !19, line: 365, baseType: !23, size: 32, offset: 160)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !818, file: !19, line: 366, baseType: !23, size: 32, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!828 = distinct !DICompileUnit(language: DW_LANG_C99, file: !829, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !830, retainedTypes: !831, splitDebugInlining: false, nameTableKind: None)
!829 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_cortex.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "83cb8d6817603f64d73dca2a0b01efa1")
!830 = !{!442}
!831 = !{!832, !24, !840, !132, !117, !865}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !373, line: 700, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 694, size: 128, elements: !835)
!835 = !{!836, !837, !838, !839}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !834, file: !373, line: 696, baseType: !23, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !834, file: !373, line: 697, baseType: !23, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !834, file: !373, line: 698, baseType: !23, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !834, file: !373, line: 699, baseType: !377, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !373, line: 397, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 374, size: 1120, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !842, file: !373, line: 376, baseType: !377, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !842, file: !373, line: 377, baseType: !23, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !842, file: !373, line: 378, baseType: !23, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !842, file: !373, line: 379, baseType: !23, size: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !842, file: !373, line: 380, baseType: !23, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !842, file: !373, line: 381, baseType: !23, size: 32, offset: 160)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !842, file: !373, line: 382, baseType: !384, size: 96, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !842, file: !373, line: 383, baseType: !23, size: 32, offset: 288)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !842, file: !373, line: 384, baseType: !23, size: 32, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !842, file: !373, line: 385, baseType: !23, size: 32, offset: 352)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !842, file: !373, line: 386, baseType: !23, size: 32, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !842, file: !373, line: 387, baseType: !23, size: 32, offset: 416)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !842, file: !373, line: 388, baseType: !23, size: 32, offset: 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !842, file: !373, line: 389, baseType: !23, size: 32, offset: 480)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !842, file: !373, line: 390, baseType: !396, size: 64, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !842, file: !373, line: 391, baseType: !377, size: 32, offset: 576)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !842, file: !373, line: 392, baseType: !377, size: 32, offset: 608)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !842, file: !373, line: 393, baseType: !402, size: 128, offset: 640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !842, file: !373, line: 394, baseType: !406, size: 160, offset: 768)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !842, file: !373, line: 395, baseType: !410, size: 160, offset: 928)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !842, file: !373, line: 396, baseType: !23, size: 32, offset: 1088)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !373, line: 355, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 340, size: 28704, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !867, file: !373, line: 342, baseType: !596, size: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !867, file: !373, line: 343, baseType: !598, size: 768, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !867, file: !373, line: 344, baseType: !596, size: 256, offset: 1024)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !867, file: !373, line: 345, baseType: !598, size: 768, offset: 1280)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !867, file: !373, line: 346, baseType: !596, size: 256, offset: 2048)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !867, file: !373, line: 347, baseType: !598, size: 768, offset: 2304)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !867, file: !373, line: 348, baseType: !596, size: 256, offset: 3072)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !867, file: !373, line: 349, baseType: !598, size: 768, offset: 3328)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !867, file: !373, line: 350, baseType: !596, size: 256, offset: 4096)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !867, file: !373, line: 351, baseType: !609, size: 1792, offset: 4352)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !867, file: !373, line: 352, baseType: !613, size: 1920, offset: 6144)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !867, file: !373, line: 353, baseType: !617, size: 20608, offset: 8064)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !867, file: !373, line: 354, baseType: !23, size: 32, offset: 28672)
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !884, retainedTypes: !890, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "de98d9c05272efa2ca465428751dd1b5")
!884 = !{!885, !436}
!885 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !886, line: 65, baseType: !10, size: 32, elements: !887)
!886 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "b5ff32b0624c591654a3e02ee400cffe")
!887 = !{!888, !889}
!888 = !DIEnumerator(name: "GPIO_PIN_RESET", value: 0)
!889 = !DIEnumerator(name: "GPIO_PIN_SET", value: 1)
!890 = !{!24, !37, !891, !905, !914, !925}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !893, file: !19, line: 426, baseType: !23, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !893, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !893, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !893, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !893, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !893, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !893, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !893, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !893, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !893, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFIO_TypeDef", file: !19, line: 380, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 373, size: 256, elements: !908)
!908 = !{!909, !910, !911, !912, !913}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "EVCR", scope: !907, file: !19, line: 375, baseType: !23, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR", scope: !907, file: !19, line: 376, baseType: !23, size: 32, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !907, file: !19, line: 377, baseType: !574, size: 128, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !907, file: !19, line: 378, baseType: !24, size: 32, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR2", scope: !907, file: !19, line: 379, baseType: !23, size: 32, offset: 224)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !19, line: 367, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 358, size: 224, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "CRL", scope: !916, file: !19, line: 360, baseType: !23, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "CRH", scope: !916, file: !19, line: 361, baseType: !23, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !916, file: !19, line: 362, baseType: !23, size: 32, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !916, file: !19, line: 363, baseType: !23, size: 32, offset: 96)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !916, file: !19, line: 364, baseType: !23, size: 32, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !916, file: !19, line: 365, baseType: !23, size: 32, offset: 160)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !916, file: !19, line: 366, baseType: !23, size: 32, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !19, line: 319, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 311, size: 192, elements: !928)
!928 = !{!929, !930, !931, !932, !933, !934}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !927, file: !19, line: 313, baseType: !23, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !927, file: !19, line: 314, baseType: !23, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !927, file: !19, line: 315, baseType: !23, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !927, file: !19, line: 316, baseType: !23, size: 32, offset: 96)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !927, file: !19, line: 317, baseType: !23, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !927, file: !19, line: 318, baseType: !23, size: 32, offset: 160)
