; ModuleID = './examples/serial.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%"class.Cicada::Stm32Uart" = type { %"class.Cicada::BufferedSerial", i8, %struct.__UART_HandleTypeDef, %struct.USART_TypeDef*, i16, i16, i32 }
%"class.Cicada::BufferedSerial" = type { %"class.Cicada::IBufferedSerial", %"class.Cicada::LineCircularBuffer", %"class.Cicada::LineCircularBuffer" }
%"class.Cicada::IBufferedSerial" = type { %"class.Cicada::ICommDevice", %"class.Cicada::ICommDevice" }
%"class.Cicada::ICommDevice" = type { i32 (...)** }
%"class.Cicada::LineCircularBuffer" = type { %"class.Cicada::CircularBuffer.base", i16, [2 x i8] }
%"class.Cicada::CircularBuffer.base" = type <{ i32 (...)**, [4 x i8], i64, i64, i64, i64, i8* }>
%struct.__UART_HandleTypeDef = type { %struct.USART_TypeDef*, %struct.USART_TypeDef, i8*, i16, i16, i8*, i16, i16, %struct.__DMA_HandleTypeDef*, %struct.__DMA_HandleTypeDef*, i32, i32, i32, i32 }
%struct.USART_TypeDef = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.__DMA_HandleTypeDef = type { %struct.DMA_Channel_TypeDef*, %struct.USART_TypeDef, i32, i32, i8*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, void (%struct.__DMA_HandleTypeDef*)*, i32, %struct.DMA_TypeDef*, i32 }
%struct.DMA_Channel_TypeDef = type { i32, i32, i32, i32 }
%struct.DMA_TypeDef = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "instance", scope: !2, file: !3, line: 112, type: !375, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "USART2_IRQHandler", scope: !3, file: !3, line: 110, type: !4, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !374)
!3 = !DIFile(filename: "../examples/stm32f1/serial.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "04d385882f3b0a8c1c0c82a10f3573f0")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !16, globals: !198, imports: !216, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8}
!8 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 41, baseType: !10, size: 32, elements: !11, identifier: "_ZTS17HAL_StatusTypeDef")
!9 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_def.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "4d6e0bbb91efacee14a68a416f506def")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15}
!12 = !DIEnumerator(name: "HAL_OK", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "HAL_ERROR", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "HAL_BUSY", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3, isUnsigned: true)
!16 = !{!17, !34, !37, !40, !45, !46, !49}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "USART_TypeDef", file: !19, line: 516, baseType: !20)
!19 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f103xb.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "d2562af6d7239ab46ca8ba238a43c848")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 507, size: 224, flags: DIFlagTypePassByValue, elements: !21, identifier: "_ZTS13USART_TypeDef")
!21 = !{!22, !28, !29, !30, !31, !32, !33}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !20, file: !19, line: 509, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 48, baseType: !26)
!25 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ab914e287601b2385e57880e6599aa6b")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !27, line: 79, baseType: !10)
!27 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f7024d0682a918b41f94e8be9cd90461")
!28 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !20, file: !19, line: 510, baseType: !23, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !20, file: !19, line: 511, baseType: !23, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !20, file: !19, line: 512, baseType: !23, size: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !20, file: !19, line: 513, baseType: !23, size: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "CR3", scope: !20, file: !19, line: 514, baseType: !23, size: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "GTPR", scope: !20, file: !19, line: 515, baseType: !23, size: 32, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !19, line: 367, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 358, size: 224, flags: DIFlagFwdDecl, identifier: "_ZTS12GPIO_TypeDef")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !25, line: 36, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !27, line: 57, baseType: !39)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !25, line: 24, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !27, line: 43, baseType: !44)
!44 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!46 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SerialTask", file: !3, line: 15, size: 224, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !47, vtableHolder: !49, identifier: "_ZTS10SerialTask")
!47 = !{!48, !93, !190, !191, !195}
!48 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !46, baseType: !49, flags: DIFlagPublic, extraData: i32 0)
!49 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Task", scope: !51, file: !50, line: 193, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !52, vtableHolder: !49, identifier: "_ZTSN6Cicada4TaskE")
!50 = !DIFile(filename: "../cicada/task.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "c2aeaca9a01dbc0caa84f135ef9fda2b")
!51 = !DINamespace(name: "Cicada", scope: null)
!52 = !{!53, !59, !60, !61, !63, !64, !68, !71, !76, !77, !80, !83, !84, !85, !86, !89}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Task", scope: !50, file: !50, baseType: !54, size: 32, flags: DIFlagArtificial)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !56, size: 32)
!56 = !DISubroutineType(types: !57)
!57 = !{!58}
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_delay", scope: !49, file: !50, line: 283, baseType: !37, size: 16, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_timeout", scope: !49, file: !50, line: 284, baseType: !24, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_isTimeoutRunning", scope: !49, file: !50, line: 285, baseType: !62, size: 8, offset: 96)
!62 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_lastRun", scope: !49, file: !50, line: 286, baseType: !24, size: 32, offset: 128)
!64 = !DISubprogram(name: "Task", scope: !49, file: !50, line: 196, type: !65, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !37}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!68 = !DISubprogram(name: "~Task", scope: !49, file: !50, line: 198, type: !69, scopeLine: 198, containingType: !49, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !67}
!71 = !DISubprogram(name: "delay", linkageName: "_ZNK6Cicada4Task5delayEv", scope: !49, file: !50, line: 203, type: !72, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!72 = !DISubroutineType(types: !73)
!73 = !{!37, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!76 = !DISubprogram(name: "setDelay", linkageName: "_ZN6Cicada4Task8setDelayEt", scope: !49, file: !50, line: 212, type: !65, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!77 = !DISubprogram(name: "lastRun", linkageName: "_ZN6Cicada4Task7lastRunEv", scope: !49, file: !50, line: 222, type: !78, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!78 = !DISubroutineType(types: !79)
!79 = !{!24, !67}
!80 = !DISubprogram(name: "setLastRun", linkageName: "_ZN6Cicada4Task10setLastRunEj", scope: !49, file: !50, line: 230, type: !81, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !67, !24}
!83 = !DISubprogram(name: "run", linkageName: "_ZN6Cicada4Task3runEv", scope: !49, file: !50, line: 245, type: !69, scopeLine: 245, containingType: !49, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!84 = !DISubprogram(name: "startTimeout", linkageName: "_ZN6Cicada4Task12startTimeoutEv", scope: !49, file: !50, line: 251, type: !69, scopeLine: 251, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubprogram(name: "resetTimeout", linkageName: "_ZN6Cicada4Task12resetTimeoutEv", scope: !49, file: !50, line: 262, type: !69, scopeLine: 262, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!86 = !DISubprogram(name: "isTimeout", linkageName: "_ZN6Cicada4Task9isTimeoutEj", scope: !49, file: !50, line: 272, type: !87, scopeLine: 272, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!87 = !DISubroutineType(types: !88)
!88 = !{!62, !67, !24}
!89 = !DISubprogram(name: "Task", scope: !49, file: !50, line: 281, type: !90, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !67, !92}
!92 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !75, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "m_serial", scope: !46, file: !3, line: 54, baseType: !94, size: 32, offset: 160)
!94 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !95, size: 32)
!95 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "IBufferedSerial", scope: !51, file: !96, line: 39, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !97, vtableHolder: !99, identifier: "_ZTSN6Cicada15IBufferedSerialE")
!96 = !DIFile(filename: "../cicada/ibufferedserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "0e5db7c0b86651abb573e233dc791166")
!97 = !{!98, !127, !160, !164, !167, !170, !173, !176, !179, !184, !185, !186, !189}
!98 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !95, baseType: !99, flags: DIFlagPublic, extraData: i32 0)
!99 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ICommDevice", scope: !51, file: !100, line: 43, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !101, vtableHolder: !99, identifier: "_ZTSN6Cicada11ICommDeviceE")
!100 = !DIFile(filename: "../cicada/icommdevice.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "e83d2959922f5020d303a6315b56c6e9")
!101 = !{!102, !103, !107, !117, !118, !121, !124}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ICommDevice", scope: !100, file: !100, baseType: !54, size: 32, flags: DIFlagArtificial)
!103 = !DISubprogram(name: "~ICommDevice", scope: !99, file: !100, line: 46, type: !104, scopeLine: 46, containingType: !99, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!107 = !DISubprogram(name: "bytesAvailable", linkageName: "_ZNK6Cicada11ICommDevice14bytesAvailableEv", scope: !99, file: !100, line: 52, type: !108, scopeLine: 52, containingType: !99, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!108 = !DISubroutineType(types: !109)
!109 = !{!110, !115}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "Size", scope: !51, file: !111, line: 32, baseType: !112)
!111 = !DIFile(filename: "../cicada/types.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "6dfa4c2c933d4c520c13fa7638528c51")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !25, line: 60, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !27, line: 105, baseType: !114)
!114 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!117 = !DISubprogram(name: "spaceAvailable", linkageName: "_ZNK6Cicada11ICommDevice14spaceAvailableEv", scope: !99, file: !100, line: 60, type: !108, scopeLine: 60, containingType: !99, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!118 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada11ICommDevice20writeBufferProcessedEv", scope: !99, file: !100, line: 71, type: !119, scopeLine: 71, containingType: !99, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!119 = !DISubroutineType(types: !120)
!120 = !{!62, !115}
!121 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada11ICommDevice4readEPhy", scope: !99, file: !100, line: 85, type: !122, scopeLine: 85, containingType: !99, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!122 = !DISubroutineType(types: !123)
!123 = !{!110, !106, !45, !110}
!124 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada11ICommDevice5writeEPKhy", scope: !99, file: !100, line: 98, type: !125, scopeLine: 98, containingType: !99, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!125 = !DISubroutineType(types: !126)
!126 = !{!110, !106, !40, !110}
!127 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !95, baseType: !128, offset: 32, flags: DIFlagPublic, extraData: i32 0)
!128 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ISerial", scope: !51, file: !129, line: 37, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !130, vtableHolder: !128, identifier: "_ZTSN6Cicada7ISerialE")
!129 = !DIFile(filename: "../cicada/iserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "e3dc53a2acd15a8e90c357a32168f40f")
!130 = !{!131, !132, !136, !139, !140, !143, !144, !152, !156, !159}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ISerial", scope: !129, file: !129, baseType: !54, size: 32, flags: DIFlagArtificial)
!132 = !DISubprogram(name: "~ISerial", scope: !128, file: !129, line: 40, type: !133, scopeLine: 40, containingType: !128, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!136 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada7ISerial4openEv", scope: !128, file: !129, line: 46, type: !137, scopeLine: 46, containingType: !128, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!137 = !DISubroutineType(types: !138)
!138 = !{!62, !135}
!139 = !DISubprogram(name: "isOpen", linkageName: "_ZN6Cicada7ISerial6isOpenEv", scope: !128, file: !129, line: 52, type: !137, scopeLine: 52, containingType: !128, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!140 = !DISubprogram(name: "setSerialConfig", linkageName: "_ZN6Cicada7ISerial15setSerialConfigEjh", scope: !128, file: !129, line: 60, type: !141, scopeLine: 60, containingType: !128, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!141 = !DISubroutineType(types: !142)
!142 = !{!62, !135, !24, !42}
!143 = !DISubprogram(name: "close", linkageName: "_ZN6Cicada7ISerial5closeEv", scope: !128, file: !129, line: 65, type: !133, scopeLine: 65, containingType: !128, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!144 = !DISubprogram(name: "portName", linkageName: "_ZNK6Cicada7ISerial8portNameEv", scope: !128, file: !129, line: 71, type: !145, scopeLine: 71, containingType: !128, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!145 = !DISubroutineType(types: !146)
!146 = !{!147, !150}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!152 = !DISubprogram(name: "rawRead", linkageName: "_ZN6Cicada7ISerial7rawReadERh", scope: !128, file: !129, line: 80, type: !153, scopeLine: 80, containingType: !128, virtualIndex: 7, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!153 = !DISubroutineType(types: !154)
!154 = !{!62, !135, !155}
!155 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !42, size: 32)
!156 = !DISubprogram(name: "rawWrite", linkageName: "_ZN6Cicada7ISerial8rawWriteEh", scope: !128, file: !129, line: 87, type: !157, scopeLine: 87, containingType: !128, virtualIndex: 8, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!157 = !DISubroutineType(types: !158)
!158 = !{!62, !135, !42}
!159 = !DISubprogram(name: "startTransmit", linkageName: "_ZN6Cicada7ISerial13startTransmitEv", scope: !128, file: !129, line: 93, type: !133, scopeLine: 93, containingType: !128, virtualIndex: 9, flags: DIFlagProtected | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!160 = !DISubprogram(name: "~IBufferedSerial", scope: !95, file: !96, line: 42, type: !161, scopeLine: 42, containingType: !95, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!164 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada15IBufferedSerial4readEPhy", scope: !95, file: !96, line: 44, type: !165, scopeLine: 44, containingType: !95, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!165 = !DISubroutineType(types: !166)
!166 = !{!110, !163, !45, !110}
!167 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEPKhy", scope: !95, file: !96, line: 45, type: !168, scopeLine: 45, containingType: !95, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!168 = !DISubroutineType(types: !169)
!169 = !{!110, !163, !40, !110}
!170 = !DISubprogram(name: "read", linkageName: "_ZN6Cicada15IBufferedSerial4readEv", scope: !95, file: !96, line: 51, type: !171, scopeLine: 51, containingType: !95, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!171 = !DISubroutineType(types: !172)
!172 = !{!42, !163}
!173 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEPKh", scope: !95, file: !96, line: 62, type: !174, scopeLine: 62, containingType: !95, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{!110, !163, !40}
!176 = !DISubprogram(name: "write", linkageName: "_ZN6Cicada15IBufferedSerial5writeEh", scope: !95, file: !96, line: 68, type: !177, scopeLine: 68, containingType: !95, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !163, !42}
!179 = !DISubprogram(name: "canReadLine", linkageName: "_ZNK6Cicada15IBufferedSerial11canReadLineEv", scope: !95, file: !96, line: 73, type: !180, scopeLine: 73, containingType: !95, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!180 = !DISubroutineType(types: !181)
!181 = !{!62, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!184 = !DISubprogram(name: "readLine", linkageName: "_ZN6Cicada15IBufferedSerial8readLineEPhy", scope: !95, file: !96, line: 85, type: !165, scopeLine: 85, containingType: !95, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!185 = !DISubprogram(name: "flushReceiveBuffers", linkageName: "_ZN6Cicada15IBufferedSerial19flushReceiveBuffersEv", scope: !95, file: !96, line: 90, type: !161, scopeLine: 90, containingType: !95, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!186 = !DISubprogram(name: "readBufferSize", linkageName: "_ZN6Cicada15IBufferedSerial14readBufferSizeEv", scope: !95, file: !96, line: 95, type: !187, scopeLine: 95, containingType: !95, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!187 = !DISubroutineType(types: !188)
!188 = !{!110, !163}
!189 = !DISubprogram(name: "writeBufferSize", linkageName: "_ZN6Cicada15IBufferedSerial15writeBufferSizeEv", scope: !95, file: !96, line: 96, type: !187, scopeLine: 96, containingType: !95, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "m_i", scope: !46, file: !3, line: 55, baseType: !58, size: 32, offset: 192)
!191 = !DISubprogram(name: "SerialTask", scope: !46, file: !3, line: 18, type: !192, scopeLine: 18, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194, !94}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!195 = !DISubprogram(name: "run", linkageName: "_ZN10SerialTask3runEv", scope: !46, file: !3, line: 20, type: !196, scopeLine: 20, containingType: !46, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !194}
!198 = !{!0, !199}
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "entrypoint", scope: !201, file: !3, line: 22, type: !42, isLocal: false, isDefinition: true)
!201 = distinct !DISubprogram(name: "run", linkageName: "_ZN10SerialTask3runEv", scope: !46, file: !3, line: 20, type: !196, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, declaration: !195, retainedNodes: !202)
!202 = !{!203, !205, !211}
!203 = !DILocalVariable(name: "this", arg: 1, scope: !201, type: !204, flags: DIFlagArtificial | DIFlagObjectPointer)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!205 = !DILocalVariable(name: "send_str", scope: !206, file: !3, line: 34, type: !147)
!206 = distinct !DILexicalBlock(scope: !207, file: !3, line: 33, column: 13)
!207 = distinct !DILexicalBlock(scope: !208, file: !3, line: 32, column: 41)
!208 = distinct !DILexicalBlock(scope: !209, file: !3, line: 32, column: 9)
!209 = distinct !DILexicalBlock(scope: !210, file: !3, line: 32, column: 9)
!210 = distinct !DILexicalBlock(scope: !201, file: !3, line: 22, column: 9)
!211 = !DILocalVariable(name: "buf", scope: !212, file: !3, line: 41, type: !213)
!212 = distinct !DILexicalBlock(scope: !207, file: !3, line: 40, column: 13)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 256, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 32)
!216 = !{!217, !223, !227, !230, !234, !237, !239, !241, !243, !246, !249, !252, !255, !258, !261, !262, !263, !264, !265, !267, !269, !271, !273, !276, !279, !282, !285, !288, !291, !304, !308, !312, !314, !318, !323, !327, !329, !331, !335, !339, !343, !347, !351, !353, !355, !357, !361, !365, !369, !371, !373}
!217 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !219, file: !222, line: 47)
!218 = !DINamespace(name: "std", scope: null)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !25, line: 20, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !27, line: 41, baseType: !221)
!221 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!222 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstdint", directory: "/home/mjshen/RTOSExploration")
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !224, file: !222, line: 48)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !25, line: 32, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !27, line: 55, baseType: !226)
!226 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!227 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !228, file: !222, line: 49)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !25, line: 44, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !27, line: 77, baseType: !58)
!230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !231, file: !222, line: 50)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !25, line: 56, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !27, line: 103, baseType: !233)
!233 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !235, file: !222, line: 52)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !236, line: 51, baseType: !221)
!236 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "a169a1d650067906a9e00519a9405ebb")
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !238, file: !222, line: 53)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !236, line: 61, baseType: !226)
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !240, file: !222, line: 54)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !236, line: 71, baseType: !58)
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !242, file: !222, line: 55)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !236, line: 81, baseType: !233)
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !244, file: !222, line: 57)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !236, line: 21, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !27, line: 134, baseType: !221)
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !247, file: !222, line: 58)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !236, line: 27, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !27, line: 160, baseType: !226)
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !250, file: !222, line: 59)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !236, line: 33, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !27, line: 182, baseType: !58)
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !253, file: !222, line: 60)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !236, line: 39, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !27, line: 200, baseType: !233)
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !256, file: !222, line: 62)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !25, line: 67, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !27, line: 214, baseType: !233)
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !259, file: !222, line: 63)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !25, line: 77, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !27, line: 230, baseType: !58)
!261 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !42, file: !222, line: 65)
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !37, file: !222, line: 66)
!263 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !24, file: !222, line: 67)
!264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !112, file: !222, line: 68)
!265 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !266, file: !222, line: 70)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !236, line: 52, baseType: !44)
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !268, file: !222, line: 71)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !236, line: 62, baseType: !39)
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !270, file: !222, line: 72)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !236, line: 72, baseType: !10)
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !272, file: !222, line: 73)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !236, line: 82, baseType: !114)
!273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !274, file: !222, line: 75)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !236, line: 22, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !27, line: 136, baseType: !44)
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !277, file: !222, line: 76)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !236, line: 28, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !27, line: 162, baseType: !39)
!279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !280, file: !222, line: 77)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !236, line: 34, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !27, line: 184, baseType: !10)
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !283, file: !222, line: 78)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !236, line: 40, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !27, line: 202, baseType: !114)
!285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !286, file: !222, line: 80)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !25, line: 72, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !27, line: 222, baseType: !114)
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !289, file: !222, line: 81)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !25, line: 82, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !27, line: 232, baseType: !10)
!291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !292, file: !303, line: 77)
!292 = !DISubprogram(name: "memchr", scope: !293, file: !293, line: 29, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!293 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/string.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "00b3471f69c722645cab66876c511e27")
!294 = !DISubroutineType(types: !295)
!295 = !{!296, !297, !58, !299}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !300, line: 40, baseType: !301)
!300 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/strings.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "dceb1b71cd72987b246237af8552faba")
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !302, line: 131, baseType: !10)
!302 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "b45aad52ebaa1042158f2766af29f8e2")
!303 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/c++/10.3.1/cstring", directory: "/home/mjshen/RTOSExploration")
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !305, file: !303, line: 78)
!305 = !DISubprogram(name: "memcmp", scope: !293, file: !293, line: 30, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!306 = !DISubroutineType(types: !307)
!307 = !{!58, !297, !297, !299}
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !309, file: !303, line: 79)
!309 = !DISubprogram(name: "memcpy", scope: !293, file: !293, line: 31, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!310 = !DISubroutineType(types: !311)
!311 = !{!296, !296, !297, !299}
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !313, file: !303, line: 80)
!313 = !DISubprogram(name: "memmove", scope: !293, file: !293, line: 32, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !315, file: !303, line: 81)
!315 = !DISubprogram(name: "memset", scope: !293, file: !293, line: 33, type: !316, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DISubroutineType(types: !317)
!317 = !{!296, !296, !58, !299}
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !319, file: !303, line: 82)
!319 = !DISubprogram(name: "strcat", scope: !293, file: !293, line: 34, type: !320, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !322, !147}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !324, file: !303, line: 83)
!324 = !DISubprogram(name: "strcmp", scope: !293, file: !293, line: 36, type: !325, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!325 = !DISubroutineType(types: !326)
!326 = !{!58, !147, !147}
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !328, file: !303, line: 84)
!328 = !DISubprogram(name: "strcoll", scope: !293, file: !293, line: 37, type: !325, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !330, file: !303, line: 85)
!330 = !DISubprogram(name: "strcpy", scope: !293, file: !293, line: 38, type: !320, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !332, file: !303, line: 86)
!332 = !DISubprogram(name: "strcspn", scope: !293, file: !293, line: 39, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!333 = !DISubroutineType(types: !334)
!334 = !{!299, !147, !147}
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !336, file: !303, line: 87)
!336 = !DISubprogram(name: "strerror", scope: !293, file: !293, line: 40, type: !337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!337 = !DISubroutineType(types: !338)
!338 = !{!322, !58}
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !340, file: !303, line: 88)
!340 = !DISubprogram(name: "strlen", scope: !293, file: !293, line: 41, type: !341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!341 = !DISubroutineType(types: !342)
!342 = !{!299, !147}
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !344, file: !303, line: 89)
!344 = !DISubprogram(name: "strncat", scope: !293, file: !293, line: 42, type: !345, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!345 = !DISubroutineType(types: !346)
!346 = !{!322, !322, !147, !299}
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !348, file: !303, line: 90)
!348 = !DISubprogram(name: "strncmp", scope: !293, file: !293, line: 43, type: !349, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!349 = !DISubroutineType(types: !350)
!350 = !{!58, !147, !147, !299}
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !352, file: !303, line: 91)
!352 = !DISubprogram(name: "strncpy", scope: !293, file: !293, line: 44, type: !345, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !354, file: !303, line: 92)
!354 = !DISubprogram(name: "strspn", scope: !293, file: !293, line: 47, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !356, file: !303, line: 93)
!356 = !DISubprogram(name: "strtok", scope: !293, file: !293, line: 50, type: !320, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !358, file: !303, line: 94)
!358 = !DISubprogram(name: "strxfrm", scope: !293, file: !293, line: 52, type: !359, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!359 = !DISubroutineType(types: !360)
!360 = !{!299, !322, !147, !299}
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !362, file: !303, line: 95)
!362 = !DISubprogram(name: "strchr", scope: !293, file: !293, line: 35, type: !363, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!363 = !DISubroutineType(types: !364)
!364 = !{!322, !147, !58}
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !366, file: !303, line: 96)
!366 = !DISubprogram(name: "strpbrk", scope: !293, file: !293, line: 45, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!367 = !DISubroutineType(types: !368)
!368 = !{!322, !147, !147}
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !370, file: !303, line: 97)
!370 = !DISubprogram(name: "strrchr", scope: !293, file: !293, line: 46, type: !363, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !218, entity: !372, file: !303, line: 98)
!372 = !DISubprogram(name: "strstr", scope: !293, file: !293, line: 48, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!373 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !6, entity: !51, file: !3, line: 11)
!374 = !{}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !51, file: !377, line: 51, size: 1536, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada9Stm32UartE")
!377 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "f1205a68111afe9a0868ac35ca31b4e6")
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "AHBPrescTable", scope: !380, file: !381, line: 124, type: !452, isLocal: false, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !388, globals: !444, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Source/Templates/system_stm32f1xx.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "2e873de3002e5d783190a46ff1c7da2d")
!382 = !{!383}
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !384, line: 151, baseType: !10, size: 32, elements: !385)
!384 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xx.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dc4ed8bdf8589b30d30d93eb6ee6ca27")
!385 = !{!386, !387}
!386 = !DIEnumerator(name: "RESET", value: 0)
!387 = !DIEnumerator(name: "SET", value: 1)
!388 = !{!389, !403, !24}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !391, file: !19, line: 426, baseType: !23, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !391, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !391, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !391, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !391, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !391, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !391, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !391, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !391, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !391, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !405, line: 397, baseType: !406)
!405 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/CMSIS/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 374, size: 1120, elements: !407)
!407 = !{!408, !410, !411, !412, !413, !414, !415, !420, !421, !422, !423, !424, !425, !426, !427, !431, !432, !433, !437, !441, !443}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !406, file: !405, line: 376, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !406, file: !405, line: 377, baseType: !23, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !406, file: !405, line: 378, baseType: !23, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !406, file: !405, line: 379, baseType: !23, size: 32, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !406, file: !405, line: 380, baseType: !23, size: 32, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !406, file: !405, line: 381, baseType: !23, size: 32, offset: 160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !406, file: !405, line: 382, baseType: !416, size: 96, offset: 192)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 96, elements: !418)
!417 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !42)
!418 = !{!419}
!419 = !DISubrange(count: 12)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !406, file: !405, line: 383, baseType: !23, size: 32, offset: 288)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !406, file: !405, line: 384, baseType: !23, size: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !406, file: !405, line: 385, baseType: !23, size: 32, offset: 352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !406, file: !405, line: 386, baseType: !23, size: 32, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !406, file: !405, line: 387, baseType: !23, size: 32, offset: 416)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !406, file: !405, line: 388, baseType: !23, size: 32, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !406, file: !405, line: 389, baseType: !23, size: 32, offset: 480)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !406, file: !405, line: 390, baseType: !428, size: 64, offset: 512)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 64, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 2)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !406, file: !405, line: 391, baseType: !409, size: 32, offset: 576)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !406, file: !405, line: 392, baseType: !409, size: 32, offset: 608)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !406, file: !405, line: 393, baseType: !434, size: 128, offset: 640)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 128, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 4)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !406, file: !405, line: 394, baseType: !438, size: 160, offset: 768)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 160, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 5)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !406, file: !405, line: 395, baseType: !442, size: 160, offset: 928)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !439)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !406, file: !405, line: 396, baseType: !23, size: 32, offset: 1088)
!444 = !{!445, !378, !447}
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !380, file: !381, line: 123, type: !24, isLocal: false, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "APBPrescTable", scope: !380, file: !381, line: 125, type: !449, isLocal: false, isDefinition: true)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 8)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 16)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "uwTickPrio", scope: !457, file: !458, line: 80, type: !24, isLocal: false, isDefinition: true)
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !459, retainedTypes: !527, globals: !570, splitDebugInlining: false, nameTableKind: None)
!458 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "1a5fa7b79e9e470cf817b81d791a6ccb")
!459 = !{!460, !467, !473}
!460 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !461, line: 49, baseType: !10, size: 32, elements: !462)
!461 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "5eab64b252ccd159497a11d87d26bc0b")
!462 = !{!463, !464, !465, !466}
!463 = !DIEnumerator(name: "HAL_TICK_FREQ_10HZ", value: 100)
!464 = !DIEnumerator(name: "HAL_TICK_FREQ_100HZ", value: 10)
!465 = !DIEnumerator(name: "HAL_TICK_FREQ_1KHZ", value: 1)
!466 = !DIEnumerator(name: "HAL_TICK_FREQ_DEFAULT", value: 1)
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 41, baseType: !10, size: 32, elements: !468)
!468 = !{!469, !470, !471, !472}
!469 = !DIEnumerator(name: "HAL_OK", value: 0)
!470 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!471 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!472 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 69, baseType: !58, size: 32, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!475 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!476 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!477 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!478 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!479 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!480 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!481 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!482 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!483 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!484 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!485 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!486 = !DIEnumerator(name: "TAMPER_IRQn", value: 2)
!487 = !DIEnumerator(name: "RTC_IRQn", value: 3)
!488 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!489 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!490 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!491 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!492 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!493 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!494 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!495 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!496 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!497 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!498 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!499 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!500 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!501 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!502 = !DIEnumerator(name: "ADC1_2_IRQn", value: 18)
!503 = !DIEnumerator(name: "USB_HP_CAN1_TX_IRQn", value: 19)
!504 = !DIEnumerator(name: "USB_LP_CAN1_RX0_IRQn", value: 20)
!505 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!506 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!507 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!508 = !DIEnumerator(name: "TIM1_BRK_IRQn", value: 24)
!509 = !DIEnumerator(name: "TIM1_UP_IRQn", value: 25)
!510 = !DIEnumerator(name: "TIM1_TRG_COM_IRQn", value: 26)
!511 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!512 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!513 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!514 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!515 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!516 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!517 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!518 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!519 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!520 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!521 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!522 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!523 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!524 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!525 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!526 = !DIEnumerator(name: "USBWakeUp_IRQn", value: 42)
!527 = !{!528, !24, !541, !555, !563, !569}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !19, line: 336, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 325, size: 288, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !530, file: !19, line: 327, baseType: !23, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !530, file: !19, line: 328, baseType: !23, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !530, file: !19, line: 329, baseType: !23, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !530, file: !19, line: 330, baseType: !23, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !530, file: !19, line: 331, baseType: !23, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !530, file: !19, line: 332, baseType: !23, size: 32, offset: 160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !530, file: !19, line: 333, baseType: !23, size: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !530, file: !19, line: 334, baseType: !23, size: 32, offset: 224)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !530, file: !19, line: 335, baseType: !23, size: 32, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !543, file: !19, line: 426, baseType: !23, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !543, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !543, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !543, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !543, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !543, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !543, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !543, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !543, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !543, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !405, line: 700, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 694, size: 128, elements: !558)
!558 = !{!559, !560, !561, !562}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !557, file: !405, line: 696, baseType: !23, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !557, file: !405, line: 697, baseType: !23, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !557, file: !405, line: 698, baseType: !23, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !557, file: !405, line: 699, baseType: !409, size: 32, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBGMCU_TypeDef", file: !19, line: 285, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 281, size: 64, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "IDCODE", scope: !565, file: !19, line: 283, baseType: !23, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !565, file: !19, line: 284, baseType: !23, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!570 = !{!455, !571, !574}
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "uwTickFreq", scope: !457, file: !458, line: 81, type: !573, isLocal: false, isDefinition: true)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_TickFreqTypeDef", file: !461, line: 55, baseType: !460)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "uwTick", scope: !457, file: !458, line: 79, type: !23, isLocal: false, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "instance", linkageName: "_ZN6Cicada9Stm32Uart8instanceE", scope: !578, file: !579, line: 32, type: !683, isLocal: false, isDefinition: true, declaration: !682)
!578 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !579, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !580, retainedTypes: !597, globals: !776, imports: !777, splitDebugInlining: false, nameTableKind: None)
!579 = !DIFile(filename: "../cicada/platform/stm32f1/stm32uart.cpp", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "3cfb26aba75e1df83974cb6e4fff6457")
!580 = !{!581, !8, !582, !586}
!581 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 69, baseType: !58, size: 32, elements: !474, identifier: "_ZTS9IRQn_Type")
!582 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 52, baseType: !10, size: 32, elements: !583, identifier: "_ZTS15HAL_LockTypeDef")
!583 = !{!584, !585}
!584 = !DIEnumerator(name: "HAL_UNLOCKED", value: 0, isUnsigned: true)
!585 = !DIEnumerator(name: "HAL_LOCKED", value: 1, isUnsigned: true)
!586 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, file: !587, line: 117, baseType: !10, size: 32, elements: !588, identifier: "_ZTS21HAL_UART_StateTypeDef")
!587 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_uart.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "74469f61b271b78e5ff5784cb5eb97d1")
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596}
!589 = !DIEnumerator(name: "HAL_UART_STATE_RESET", value: 0, isUnsigned: true)
!590 = !DIEnumerator(name: "HAL_UART_STATE_READY", value: 32, isUnsigned: true)
!591 = !DIEnumerator(name: "HAL_UART_STATE_BUSY", value: 36, isUnsigned: true)
!592 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX", value: 33, isUnsigned: true)
!593 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_RX", value: 34, isUnsigned: true)
!594 = !DIEnumerator(name: "HAL_UART_STATE_BUSY_TX_RX", value: 35, isUnsigned: true)
!595 = !DIEnumerator(name: "HAL_UART_STATE_TIMEOUT", value: 160, isUnsigned: true)
!596 = !DIEnumerator(name: "HAL_UART_STATE_ERROR", value: 224, isUnsigned: true)
!597 = !{!24, !17, !598, !608, !34, !42, !37, !228, !622, !652, !677}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFIO_TypeDef", file: !19, line: 380, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 373, size: 256, flags: DIFlagTypePassByValue, elements: !601, identifier: "_ZTS12AFIO_TypeDef")
!601 = !{!602, !603, !604, !606, !607}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "EVCR", scope: !600, file: !19, line: 375, baseType: !23, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR", scope: !600, file: !19, line: 376, baseType: !23, size: 32, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !600, file: !19, line: 377, baseType: !605, size: 128, offset: 64)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !435)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !600, file: !19, line: 378, baseType: !24, size: 32, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "MAPR2", scope: !600, file: !19, line: 379, baseType: !23, size: 32, offset: 224)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, flags: DIFlagTypePassByValue, elements: !611, identifier: "_ZTS11RCC_TypeDef")
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !610, file: !19, line: 426, baseType: !23, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !610, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !610, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !610, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !610, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !610, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !610, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !610, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !610, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !610, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !405, line: 355, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 340, size: 28704, flags: DIFlagTypePassByValue, elements: !625, identifier: "_ZTS9NVIC_Type")
!625 = !{!626, !628, !632, !633, !634, !635, !636, !637, !638, !639, !643, !647, !651}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !624, file: !405, line: 342, baseType: !627, size: 256)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 256, elements: !450)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !624, file: !405, line: 343, baseType: !629, size: 768, offset: 256)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 768, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 24)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !624, file: !405, line: 344, baseType: !627, size: 256, offset: 1024)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !624, file: !405, line: 345, baseType: !629, size: 768, offset: 1280)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !624, file: !405, line: 346, baseType: !627, size: 256, offset: 2048)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !624, file: !405, line: 347, baseType: !629, size: 768, offset: 2304)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !624, file: !405, line: 348, baseType: !627, size: 256, offset: 3072)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !624, file: !405, line: 349, baseType: !629, size: 768, offset: 3328)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !624, file: !405, line: 350, baseType: !627, size: 256, offset: 4096)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !624, file: !405, line: 351, baseType: !640, size: 1792, offset: 4352)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1792, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 56)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !624, file: !405, line: 352, baseType: !644, size: 1920, offset: 6144)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 1920, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 240)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !624, file: !405, line: 353, baseType: !648, size: 20608, offset: 8064)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 20608, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 644)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !624, file: !405, line: 354, baseType: !23, size: 32, offset: 28672)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !405, line: 397, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 374, size: 1120, flags: DIFlagTypePassByValue, elements: !655, identifier: "_ZTS8SCB_Type")
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !654, file: !405, line: 376, baseType: !409, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !654, file: !405, line: 377, baseType: !23, size: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !654, file: !405, line: 378, baseType: !23, size: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !654, file: !405, line: 379, baseType: !23, size: 32, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !654, file: !405, line: 380, baseType: !23, size: 32, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !654, file: !405, line: 381, baseType: !23, size: 32, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !654, file: !405, line: 382, baseType: !416, size: 96, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !654, file: !405, line: 383, baseType: !23, size: 32, offset: 288)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !654, file: !405, line: 384, baseType: !23, size: 32, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !654, file: !405, line: 385, baseType: !23, size: 32, offset: 352)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !654, file: !405, line: 386, baseType: !23, size: 32, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !654, file: !405, line: 387, baseType: !23, size: 32, offset: 416)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !654, file: !405, line: 388, baseType: !23, size: 32, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !654, file: !405, line: 389, baseType: !23, size: 32, offset: 480)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !654, file: !405, line: 390, baseType: !428, size: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !654, file: !405, line: 391, baseType: !409, size: 32, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !654, file: !405, line: 392, baseType: !409, size: 32, offset: 608)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !654, file: !405, line: 393, baseType: !434, size: 128, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !654, file: !405, line: 394, baseType: !438, size: 160, offset: 768)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !654, file: !405, line: 395, baseType: !442, size: 160, offset: 928)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !654, file: !405, line: 396, baseType: !23, size: 32, offset: 1088)
!677 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stm32Uart", scope: !51, file: !377, line: 51, size: 1536, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !678, vtableHolder: !99)
!678 = !{!679, !682, !685, !686, !722, !723, !724, !725, !727, !731, !734, !737, !740, !743, !746, !747, !750, !751, !756, !759, !760, !761, !764, !765, !769, !773}
!679 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !677, baseType: !680, flags: DIFlagPublic, extraData: i32 0)
!680 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BufferedSerial", scope: !51, file: !681, line: 42, size: 832, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Cicada14BufferedSerialE")
!681 = !DIFile(filename: "../cicada/bufferedserial.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "b9c9871d742db1af5ee8abb5df52fc59")
!682 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !677, file: !377, line: 120, baseType: !683, flags: DIFlagStaticMember)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 128, elements: !435)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !677, file: !377, line: 122, baseType: !42, size: 8, offset: 832)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_handle", scope: !677, file: !377, line: 123, baseType: !687, size: 576, offset: 864)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_HandleTypeDef", file: !587, line: 189, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__UART_HandleTypeDef", file: !587, line: 141, size: 576, flags: DIFlagTypePassByValue, elements: !689, identifier: "_ZTS20__UART_HandleTypeDef")
!689 = !{!690, !691, !702, !703, !704, !706, !707, !708, !709, !714, !715, !717, !720, !721}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Instance", scope: !688, file: !587, line: 143, baseType: !17, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Init", scope: !688, file: !587, line: 145, baseType: !692, size: 224, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_InitTypeDef", file: !587, line: 76, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !587, line: 47, size: 224, flags: DIFlagTypePassByValue, elements: !694, identifier: "_ZTS16UART_InitTypeDef")
!694 = !{!695, !696, !697, !698, !699, !700, !701}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "BaudRate", scope: !693, file: !587, line: 49, baseType: !24, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "WordLength", scope: !693, file: !587, line: 54, baseType: !24, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "StopBits", scope: !693, file: !587, line: 57, baseType: !24, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Parity", scope: !693, file: !587, line: 60, baseType: !24, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !693, file: !587, line: 67, baseType: !24, size: 32, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "HwFlowCtl", scope: !693, file: !587, line: 70, baseType: !24, size: 32, offset: 160)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "OverSampling", scope: !693, file: !587, line: 73, baseType: !24, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pTxBuffPtr", scope: !688, file: !587, line: 147, baseType: !45, size: 32, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferSize", scope: !688, file: !587, line: 149, baseType: !37, size: 16, offset: 288)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "TxXferCount", scope: !688, file: !587, line: 151, baseType: !705, size: 16, offset: 304)
!705 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pRxBuffPtr", scope: !688, file: !587, line: 153, baseType: !45, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferSize", scope: !688, file: !587, line: 155, baseType: !37, size: 16, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "RxXferCount", scope: !688, file: !587, line: 157, baseType: !705, size: 16, offset: 368)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "hdmatx", scope: !688, file: !587, line: 159, baseType: !710, size: 32, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HandleTypeDef", file: !712, line: 137, baseType: !713)
!712 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_dma.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "dd8e7645a79a80f8166404bb078b3d4e")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__DMA_HandleTypeDef", file: !712, line: 111, size: 576, flags: DIFlagFwdDecl, identifier: "_ZTS19__DMA_HandleTypeDef")
!714 = !DIDerivedType(tag: DW_TAG_member, name: "hdmarx", scope: !688, file: !587, line: 161, baseType: !710, size: 32, offset: 416)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !688, file: !587, line: 163, baseType: !716, size: 32, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_LockTypeDef", file: !9, line: 56, baseType: !582)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "gState", scope: !688, file: !587, line: 165, baseType: !718, size: 32, offset: 480)
!718 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_UART_StateTypeDef", file: !587, line: 136, baseType: !586)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "RxState", scope: !688, file: !587, line: 169, baseType: !718, size: 32, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorCode", scope: !688, file: !587, line: 172, baseType: !23, size: 32, offset: 544)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_uartPort", scope: !677, file: !377, line: 124, baseType: !34, size: 32, offset: 1440)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_txPin", scope: !677, file: !377, line: 125, baseType: !37, size: 16, offset: 1472)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_rxPin", scope: !677, file: !377, line: 126, baseType: !37, size: 16, offset: 1488)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_uartInterruptInstance", scope: !677, file: !377, line: 127, baseType: !726, size: 32, offset: 1504)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !19, line: 126, baseType: !581)
!727 = !DISubprogram(name: "Stm32Uart", scope: !677, file: !377, line: 66, type: !728, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !730, !322, !322, !110, !17, !34, !37, !37}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!731 = !DISubprogram(name: "Stm32Uart", scope: !677, file: !377, line: 83, type: !732, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !730, !322, !322, !110, !110, !17, !34, !37, !37}
!734 = !DISubprogram(name: "~Stm32Uart", scope: !677, file: !377, line: 86, type: !735, scopeLine: 86, containingType: !677, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !730}
!737 = !DISubprogram(name: "getInstance", linkageName: "_ZN6Cicada9Stm32Uart11getInstanceEP13USART_TypeDef", scope: !677, file: !377, line: 88, type: !738, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!738 = !DISubroutineType(types: !739)
!739 = !{!684, !17}
!740 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEv", scope: !677, file: !377, line: 93, type: !741, scopeLine: 93, containingType: !677, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!741 = !DISubroutineType(types: !742)
!742 = !{!62, !730}
!743 = !DISubprogram(name: "open", linkageName: "_ZN6Cicada9Stm32Uart4openEh", scope: !677, file: !377, line: 100, type: !744, scopeLine: 100, containingType: !677, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!744 = !DISubroutineType(types: !745)
!745 = !{!62, !730, !42}
!746 = !DISubprogram(name: "isOpen", linkageName: "_ZN6Cicada9Stm32Uart6isOpenEv", scope: !677, file: !377, line: 102, type: !741, scopeLine: 102, containingType: !677, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!747 = !DISubprogram(name: "setSerialConfig", linkageName: "_ZN6Cicada9Stm32Uart15setSerialConfigEjh", scope: !677, file: !377, line: 103, type: !748, scopeLine: 103, containingType: !677, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!748 = !DISubroutineType(types: !749)
!749 = !{!62, !730, !24, !42}
!750 = !DISubprogram(name: "close", linkageName: "_ZN6Cicada9Stm32Uart5closeEv", scope: !677, file: !377, line: 104, type: !735, scopeLine: 104, containingType: !677, virtualIndex: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!751 = !DISubprogram(name: "portName", linkageName: "_ZNK6Cicada9Stm32Uart8portNameEv", scope: !677, file: !377, line: 105, type: !752, scopeLine: 105, containingType: !677, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!752 = !DISubroutineType(types: !753)
!753 = !{!147, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!756 = !DISubprogram(name: "rawRead", linkageName: "_ZN6Cicada9Stm32Uart7rawReadERh", scope: !677, file: !377, line: 106, type: !757, scopeLine: 106, containingType: !677, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!757 = !DISubroutineType(types: !758)
!758 = !{!62, !730, !155}
!759 = !DISubprogram(name: "rawWrite", linkageName: "_ZN6Cicada9Stm32Uart8rawWriteEh", scope: !677, file: !377, line: 107, type: !744, scopeLine: 107, containingType: !677, virtualIndex: 22, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!760 = !DISubprogram(name: "startTransmit", linkageName: "_ZN6Cicada9Stm32Uart13startTransmitEv", scope: !677, file: !377, line: 108, type: !735, scopeLine: 108, containingType: !677, virtualIndex: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!761 = !DISubprogram(name: "writeBufferProcessed", linkageName: "_ZNK6Cicada9Stm32Uart20writeBufferProcessedEv", scope: !677, file: !377, line: 109, type: !762, scopeLine: 109, containingType: !677, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!762 = !DISubroutineType(types: !763)
!763 = !{!62, !754}
!764 = !DISubprogram(name: "handleInterrupt", linkageName: "_ZN6Cicada9Stm32Uart15handleInterruptEv", scope: !677, file: !377, line: 111, type: !735, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!765 = !DISubprogram(name: "Stm32Uart", scope: !677, file: !377, line: 115, type: !766, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !730, !768}
!768 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !755, size: 32)
!769 = !DISubprogram(name: "operator=", linkageName: "_ZN6Cicada9Stm32UartaSERKS0_", scope: !677, file: !377, line: 116, type: !770, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!770 = !DISubroutineType(types: !771)
!771 = !{!772, !730, !768}
!772 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !677, size: 32)
!773 = !DISubprogram(name: "init", linkageName: "_ZN6Cicada9Stm32Uart4initEP13USART_TypeDef", scope: !677, file: !377, line: 118, type: !774, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !730, !17}
!776 = !{!576}
!777 = !{!217, !223, !227, !230, !234, !237, !239, !241, !243, !246, !249, !252, !255, !258, !261, !262, !263, !264, !265, !267, !269, !271, !273, !276, !279, !282, !285, !288, !778}
!778 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !578, entity: !51, file: !579, line: 28)
!779 = distinct !DICompileUnit(language: DW_LANG_C99, file: !780, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !781, retainedTypes: !786, splitDebugInlining: false, nameTableKind: None)
!780 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_rcc.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "bf5d5e021854d33cea3d58ed6b9d5087")
!781 = !{!467, !383, !782}
!782 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !384, line: 157, baseType: !10, size: 32, elements: !783)
!783 = !{!784, !785}
!784 = !DIEnumerator(name: "DISABLE", value: 0)
!785 = !DIEnumerator(name: "ENABLE", value: 1)
!786 = !{!787, !24, !296, !42, !801, !802, !808, !37, !821, !832}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !789, file: !19, line: 426, baseType: !23, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !789, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !789, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !789, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !789, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !789, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !789, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !789, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !789, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !789, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !19, line: 418, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 414, size: 64, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !804, file: !19, line: 416, baseType: !23, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !804, file: !19, line: 417, baseType: !23, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !19, line: 336, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 325, size: 288, elements: !811)
!811 = !{!812, !813, !814, !815, !816, !817, !818, !819, !820}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !810, file: !19, line: 327, baseType: !23, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !810, file: !19, line: 328, baseType: !23, size: 32, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !810, file: !19, line: 329, baseType: !23, size: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !810, file: !19, line: 330, baseType: !23, size: 32, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !810, file: !19, line: 331, baseType: !23, size: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !810, file: !19, line: 332, baseType: !23, size: 32, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !810, file: !19, line: 333, baseType: !23, size: 32, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !810, file: !19, line: 334, baseType: !23, size: 32, offset: 224)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !810, file: !19, line: 335, baseType: !23, size: 32, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !19, line: 367, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 358, size: 224, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "CRL", scope: !823, file: !19, line: 360, baseType: !23, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "CRH", scope: !823, file: !19, line: 361, baseType: !23, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !823, file: !19, line: 362, baseType: !23, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !823, file: !19, line: 363, baseType: !23, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !823, file: !19, line: 364, baseType: !23, size: 32, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !823, file: !19, line: 365, baseType: !23, size: 32, offset: 160)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !823, file: !19, line: 366, baseType: !23, size: 32, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 32)
!833 = distinct !DICompileUnit(language: DW_LANG_C99, file: !834, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !835, retainedTypes: !836, splitDebugInlining: false, nameTableKind: None)
!834 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_cortex.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "83cb8d6817603f64d73dca2a0b01efa1")
!835 = !{!473}
!836 = !{!837, !24, !845, !228, !42, !870}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !405, line: 700, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 694, size: 128, elements: !840)
!840 = !{!841, !842, !843, !844}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !839, file: !405, line: 696, baseType: !23, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !839, file: !405, line: 697, baseType: !23, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !839, file: !405, line: 698, baseType: !23, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !839, file: !405, line: 699, baseType: !409, size: 32, offset: 96)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !405, line: 397, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 374, size: 1120, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !847, file: !405, line: 376, baseType: !409, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !847, file: !405, line: 377, baseType: !23, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !847, file: !405, line: 378, baseType: !23, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !847, file: !405, line: 379, baseType: !23, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !847, file: !405, line: 380, baseType: !23, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !847, file: !405, line: 381, baseType: !23, size: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !847, file: !405, line: 382, baseType: !416, size: 96, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !847, file: !405, line: 383, baseType: !23, size: 32, offset: 288)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !847, file: !405, line: 384, baseType: !23, size: 32, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !847, file: !405, line: 385, baseType: !23, size: 32, offset: 352)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !847, file: !405, line: 386, baseType: !23, size: 32, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !847, file: !405, line: 387, baseType: !23, size: 32, offset: 416)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !847, file: !405, line: 388, baseType: !23, size: 32, offset: 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !847, file: !405, line: 389, baseType: !23, size: 32, offset: 480)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !847, file: !405, line: 390, baseType: !428, size: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !847, file: !405, line: 391, baseType: !409, size: 32, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !847, file: !405, line: 392, baseType: !409, size: 32, offset: 608)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !847, file: !405, line: 393, baseType: !434, size: 128, offset: 640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !847, file: !405, line: 394, baseType: !438, size: 160, offset: 768)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !847, file: !405, line: 395, baseType: !442, size: 160, offset: 928)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !847, file: !405, line: 396, baseType: !23, size: 32, offset: 1088)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !405, line: 355, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 340, size: 28704, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !872, file: !405, line: 342, baseType: !627, size: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !872, file: !405, line: 343, baseType: !629, size: 768, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !872, file: !405, line: 344, baseType: !627, size: 256, offset: 1024)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !872, file: !405, line: 345, baseType: !629, size: 768, offset: 1280)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !872, file: !405, line: 346, baseType: !627, size: 256, offset: 2048)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !872, file: !405, line: 347, baseType: !629, size: 768, offset: 2304)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !872, file: !405, line: 348, baseType: !627, size: 256, offset: 3072)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !872, file: !405, line: 349, baseType: !629, size: 768, offset: 3328)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !872, file: !405, line: 350, baseType: !627, size: 256, offset: 4096)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !872, file: !405, line: 351, baseType: !640, size: 1792, offset: 4352)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !872, file: !405, line: 352, baseType: !644, size: 1920, offset: 6144)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !872, file: !405, line: 353, baseType: !648, size: 20608, offset: 8064)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !872, file: !405, line: 354, baseType: !23, size: 32, offset: 28672)
!887 = distinct !DICompileUnit(language: DW_LANG_C99, file: !888, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !889, retainedTypes: !895, splitDebugInlining: false, nameTableKind: None)
!888 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "de98d9c05272efa2ca465428751dd1b5")
!889 = !{!890, !467}
!890 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !891, line: 65, baseType: !10, size: 32, elements: !892)
!891 = !DIFile(filename: "../dep/STM32Cube_FW_F1_V1.8.0/Drivers/STM32F1xx_HAL_Driver/Inc/stm32f1xx_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Cicada-FW/build", checksumkind: CSK_MD5, checksum: "b5ff32b0624c591654a3e02ee400cffe")
!892 = !{!893, !894}
!893 = !DIEnumerator(name: "GPIO_PIN_RESET", value: 0)
!894 = !DIEnumerator(name: "GPIO_PIN_SET", value: 1)
!895 = !{!24, !37, !896, !910, !919, !930}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 438, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 424, size: 320, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !898, file: !19, line: 426, baseType: !23, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !898, file: !19, line: 427, baseType: !23, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !898, file: !19, line: 428, baseType: !23, size: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !898, file: !19, line: 429, baseType: !23, size: 32, offset: 96)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !898, file: !19, line: 430, baseType: !23, size: 32, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !898, file: !19, line: 431, baseType: !23, size: 32, offset: 160)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !898, file: !19, line: 432, baseType: !23, size: 32, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !898, file: !19, line: 433, baseType: !23, size: 32, offset: 224)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !898, file: !19, line: 434, baseType: !23, size: 32, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !898, file: !19, line: 435, baseType: !23, size: 32, offset: 288)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "AFIO_TypeDef", file: !19, line: 380, baseType: !912)
