; ModuleID = 'build/actinius_icarus_bee_ns/echo_bot/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "uart_msgq", scope: !27, file: !209, line: 19, type: !223, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !206, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !111, line: 336, size: 608, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !145, !149, !153, !167, !172, !178, !184, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !110, file: !111, line: 365, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DISubroutineType(types: !116)
!116 = !{!107, !117, !144}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !121)
!120 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = !{!122, !126, !127, !128, !137, !138}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 380, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !119, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !119, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !119, file: !120, line: 386, baseType: !129, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !131)
!131 = !{!132, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !130, file: !120, line: 359, baseType: !133, size: 8)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !130, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !119, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !120, line: 43, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !143)
!143 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !110, file: !111, line: 366, baseType: !146, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !117, !134}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !110, file: !111, line: 374, baseType: !150, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DISubroutineType(types: !152)
!152 = !{!107, !117}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !110, file: !111, line: 377, baseType: !154, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DISubroutineType(types: !156)
!156 = !{!107, !117, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !111, line: 122, size: 64, elements: !160)
!160 = !{!161, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !159, file: !111, line: 123, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !159, file: !111, line: 124, baseType: !133, size: 8, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !159, file: !111, line: 125, baseType: !133, size: 8, offset: 40)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !159, file: !111, line: 126, baseType: !133, size: 8, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !159, file: !111, line: 127, baseType: !133, size: 8, offset: 56)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !110, file: !111, line: 379, baseType: !168, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{!107, !117, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !110, file: !111, line: 384, baseType: !173, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{!107, !117, !176, !107}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !110, file: !111, line: 393, baseType: !179, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!107, !117, !182, !183}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !110, file: !111, line: 402, baseType: !185, size: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !117}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !110, file: !111, line: 405, baseType: !185, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !110, file: !111, line: 408, baseType: !150, size: 32, offset: 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !110, file: !111, line: 411, baseType: !185, size: 32, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !110, file: !111, line: 414, baseType: !185, size: 32, offset: 352)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !110, file: !111, line: 417, baseType: !150, size: 32, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !110, file: !111, line: 420, baseType: !150, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !110, file: !111, line: 423, baseType: !185, size: 32, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !110, file: !111, line: 426, baseType: !185, size: 32, offset: 480)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !110, file: !111, line: 429, baseType: !150, size: 32, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !110, file: !111, line: 432, baseType: !150, size: 32, offset: 544)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !110, file: !111, line: 435, baseType: !199, size: 32, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !117, !202, !102}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !111, line: 142, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !117, !102}
!206 = !{!25, !207, !211, !216, !221}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "uart_dev", scope: !27, file: !209, line: 21, type: !210, isLocal: true, isDefinition: true)
!209 = !DIFile(filename: "zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "_k_fifo_buf_uart_msgq", scope: !27, file: !209, line: 19, type: !213, isLocal: true, isDefinition: true, align: 32)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 2560, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 320)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "rx_buf", scope: !27, file: !209, line: 24, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 256, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 32)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "rx_buf_pos", scope: !27, file: !209, line: 25, type: !107, isLocal: true, isDefinition: true)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !224, line: 4204, size: 320, elements: !225)
!224 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = !{!226, !247, !251, !254, !255, !257, !258, !259, !260, !261}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !223, file: !224, line: 4206, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !228, line: 233, baseType: !229)
!228 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 231, size: 64, elements: !230)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !229, file: !228, line: 232, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !233, line: 48, baseType: !234)
!233 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !233, line: 37, size: 64, elements: !235)
!235 = !{!236, !242}
!236 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 38, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 38, size: 32, elements: !238)
!238 = !{!239, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !237, file: !233, line: 39, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !233, line: 40, baseType: !240, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 42, baseType: !243, size: 32, offset: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 42, size: 32, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !243, file: !233, line: 43, baseType: !240, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !233, line: 44, baseType: !240, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !223, file: !224, line: 4208, baseType: !248, offset: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !223, file: !224, line: 4210, baseType: !252, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !253, line: 214, baseType: !32)
!253 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !223, file: !224, line: 4212, baseType: !162, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !223, file: !224, line: 4214, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !223, file: !224, line: 4216, baseType: !256, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !223, file: !224, line: 4218, baseType: !256, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !223, file: !224, line: 4220, baseType: !256, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !223, file: !224, line: 4222, baseType: !162, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !224, line: 4227, baseType: !133, size: 8, offset: 288)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "_char_out", scope: !264, file: !268, line: 54, type: !269, isLocal: false, isDefinition: true)
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !266, globals: !267, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!266 = !{!102, !107}
!267 = !{!262}
!268 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!107, !107}
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !274, file: !335, line: 65, type: !336, isLocal: true, isDefinition: true, align: 32)
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !276, globals: !328, splitDebugInlining: false, nameTableKind: None)
!275 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!276 = !{!102, !107, !277, !162, !288}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !279, file: !278, line: 167, baseType: !287)
!278 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !278, file: !278, line: 134, type: !280, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !274, retainedNodes: !282)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !162}
!282 = !{!283, !284, !286}
!283 = !DILocalVariable(name: "time_us", arg: 1, scope: !279, file: !278, line: 134, type: !162)
!284 = !DILocalVariable(name: "delay_cycles", scope: !279, file: !278, line: 168, type: !285)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!286 = !DILocalVariable(name: "cycles", scope: !279, file: !278, line: 171, type: !162)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !290, line: 1928, baseType: !291)
!290 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 1909, size: 11360, elements: !292)
!292 = !{!293, !299, !300, !301, !302, !306, !307, !308, !309, !313, !314, !318, !319, !320, !321, !322, !326, !327}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !291, file: !290, line: 1910, baseType: !294, size: 8192)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 8192, elements: !297)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !162)
!297 = !{!298}
!298 = !DISubrange(count: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !291, file: !290, line: 1911, baseType: !295, size: 32, offset: 8192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !291, file: !290, line: 1912, baseType: !295, size: 32, offset: 8224)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !291, file: !290, line: 1913, baseType: !295, size: 32, offset: 8256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !291, file: !290, line: 1914, baseType: !303, size: 1984, offset: 8288)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 1984, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 62)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !291, file: !290, line: 1915, baseType: !296, size: 32, offset: 10272)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !291, file: !290, line: 1916, baseType: !295, size: 32, offset: 10304)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !291, file: !290, line: 1917, baseType: !296, size: 32, offset: 10336)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !291, file: !290, line: 1918, baseType: !310, size: 96, offset: 10368)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 96, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 3)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !291, file: !290, line: 1919, baseType: !296, size: 32, offset: 10464)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !291, file: !290, line: 1920, baseType: !315, size: 256, offset: 10496)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 256, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 8)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !291, file: !290, line: 1921, baseType: !296, size: 32, offset: 10752)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !291, file: !290, line: 1922, baseType: !295, size: 32, offset: 10784)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !291, file: !290, line: 1923, baseType: !296, size: 32, offset: 10816)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !291, file: !290, line: 1924, baseType: !296, size: 32, offset: 10848)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !291, file: !290, line: 1925, baseType: !323, size: 416, offset: 10880)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 416, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 13)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !291, file: !290, line: 1926, baseType: !296, size: 32, offset: 11296)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !291, file: !290, line: 1927, baseType: !296, size: 32, offset: 11328)
!328 = !{!272, !329}
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !279, file: !278, line: 161, type: !331, isLocal: true, isDefinition: true, align: 128)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 48, elements: !311)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !334)
!334 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!335 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !338, line: 51, size: 64, elements: !339)
!338 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = !{!340, !347}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !337, file: !338, line: 60, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DISubroutineType(types: !343)
!343 = !{!107, !344}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !338, line: 48, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !337, file: !338, line: 65, baseType: !344, size: 32, offset: 32)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !350, file: !386, line: 27, type: !411, isLocal: true, isDefinition: true)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !364, globals: !383, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!352 = !{!353, !30}
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !354, line: 27, baseType: !32, size: 32, elements: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363}
!356 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!357 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!358 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!359 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!360 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!361 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!362 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!363 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!364 = !{!102, !103, !107, !24, !365, !256, !162, !381}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !367, line: 54, size: 96, elements: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = !{!369, !376, !380}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !366, file: !367, line: 55, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !371, line: 33, baseType: !372)
!371 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !371, line: 29, size: 32, elements: !373)
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !371, line: 30, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !366, file: !367, line: 60, baseType: !377, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !353}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !366, file: !367, line: 65, baseType: !377, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !382)
!382 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!383 = !{!348, !384, !388, !390, !401, !403}
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !350, file: !386, line: 44, type: !387, isLocal: true, isDefinition: true)
!386 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !350, file: !386, line: 49, type: !387, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !350, file: !386, line: 36, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 128, elements: !399)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !354, line: 114, size: 128, elements: !394)
!394 = !{!395, !396, !397, !398}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !393, file: !354, line: 115, baseType: !353, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !393, file: !354, line: 141, baseType: !133, size: 8, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !393, file: !354, line: 149, baseType: !162, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !393, file: !354, line: 156, baseType: !162, size: 32, offset: 96)
!399 = !{!400}
!400 = !DISubrange(count: 1)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !350, file: !386, line: 40, type: !392, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !350, file: !386, line: 28, type: !405, isLocal: true, isDefinition: true)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !371, line: 40, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !371, line: 35, size: 64, elements: !407)
!407 = !{!408, !410}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !406, file: !371, line: 36, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !406, file: !371, line: 37, baseType: !409, size: 32, offset: 32)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 32, elements: !399)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !413, line: 22, baseType: !414)
!413 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!414 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!415 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!416 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !419, file: !446, line: 50, type: !433, isLocal: true, isDefinition: true)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !421, globals: !443, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!421 = !{!142, !103, !252, !107, !102, !162, !381, !422, !256, !433, !434}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !424, line: 45, size: 64, elements: !425)
!424 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!425 = !{!426, !432}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !423, file: !424, line: 46, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !371, line: 33, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !371, line: 29, size: 32, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !428, file: !371, line: 30, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !423, file: !424, line: 48, baseType: !162, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !424, line: 38, size: 64, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !435, file: !424, line: 39, baseType: !427, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !435, file: !424, line: 41, baseType: !439, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !424, line: 35, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !433}
!443 = !{!444, !448, !456, !417, !458, !468}
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "latency_lock", scope: !419, file: !446, line: 44, type: !447, isLocal: true, isDefinition: true)
!446 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !419, file: !446, line: 46, type: !450, isLocal: true, isDefinition: true)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !371, line: 40, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !371, line: 35, size: 64, elements: !452)
!452 = !{!453, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !451, file: !371, line: 36, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !451, file: !371, line: 37, baseType: !454, size: 32, offset: 32)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "latency_subs", scope: !419, file: !446, line: 52, type: !450, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !419, file: !446, line: 39, type: !460, isLocal: true, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, elements: !466)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 35, size: 96, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !461, file: !446, line: 36, baseType: !353, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !461, file: !446, line: 37, baseType: !133, size: 8, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !461, file: !446, line: 38, baseType: !412, size: 32, offset: 64)
!466 = !{!467}
!467 = !DISubrange(count: 0)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !419, file: !446, line: 48, type: !433, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !472, file: !479, line: 47, type: !492, isLocal: true, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !474, retainedTypes: !475, globals: !476, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!474 = !{!353}
!475 = !{!252, !107}
!476 = !{!477, !470, !489}
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "cpus_states", scope: !472, file: !479, line: 50, type: !480, isLocal: true, isDefinition: true)
!479 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 32, elements: !399)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !354, line: 114, size: 128, elements: !484)
!484 = !{!485, !486, !487, !488}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !483, file: !354, line: 115, baseType: !353, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !483, file: !354, line: 141, baseType: !133, size: 8, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !483, file: !354, line: 149, baseType: !162, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !483, file: !354, line: 156, baseType: !162, size: 32, offset: 96)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !472, file: !479, line: 55, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 8, elements: !399)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, elements: !466)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "static_regions", scope: !495, file: !502, line: 62, type: !631, isLocal: true, isDefinition: true)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !497, globals: !498, splitDebugInlining: false, nameTableKind: None)
!496 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!497 = !{!252, !107, !162, !102}
!498 = !{!499, !493}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !501, file: !502, line: 198, type: !618, isLocal: true, isDefinition: true)
!501 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !502, file: !502, line: 175, type: !503, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !495, retainedNodes: !615)
!502 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!503 = !DISubroutineType(types: !504)
!504 = !{null, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !507, line: 245, size: 1024, elements: !508)
!507 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!508 = !{!509, !572, !585, !586, !587, !588, !594, !610}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !506, file: !507, line: 247, baseType: !510, size: 384)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !507, line: 57, size: 384, elements: !511)
!511 = !{!512, !539, !546, !547, !548, !559, !560, !561}
!512 = !DIDerivedType(tag: DW_TAG_member, scope: !510, file: !507, line: 60, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !510, file: !507, line: 60, size: 64, elements: !514)
!514 = !{!515, !530}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !513, file: !507, line: 61, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !233, line: 49, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !233, line: 37, size: 64, elements: !518)
!518 = !{!519, !525}
!519 = !DIDerivedType(tag: DW_TAG_member, scope: !517, file: !233, line: 38, baseType: !520, size: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !517, file: !233, line: 38, size: 32, elements: !521)
!521 = !{!522, !524}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !520, file: !233, line: 39, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !233, line: 40, baseType: !523, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, scope: !517, file: !233, line: 42, baseType: !526, size: 32, offset: 32)
!526 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !517, file: !233, line: 42, size: 32, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !526, file: !233, line: 43, baseType: !523, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !526, file: !233, line: 44, baseType: !523, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !513, file: !507, line: 62, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !532, line: 49, size: 64, elements: !533)
!532 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !531, file: !532, line: 50, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 64, elements: !537)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!537 = !{!538}
!538 = !DISubrange(count: 2)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !510, file: !507, line: 68, baseType: !540, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !228, line: 233, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 231, size: 64, elements: !543)
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !542, file: !228, line: 232, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !233, line: 48, baseType: !517)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !510, file: !507, line: 71, baseType: !133, size: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !510, file: !507, line: 74, baseType: !133, size: 8, offset: 104)
!548 = !DIDerivedType(tag: DW_TAG_member, scope: !510, file: !507, line: 90, baseType: !549, size: 16, offset: 112)
!549 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !510, file: !507, line: 90, size: 16, elements: !550)
!550 = !{!551, !558}
!551 = !DIDerivedType(tag: DW_TAG_member, scope: !549, file: !507, line: 91, baseType: !552, size: 16)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !549, file: !507, line: 91, size: 16, elements: !553)
!553 = !{!554, !557}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !552, file: !507, line: 96, baseType: !555, size: 8)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !556)
!556 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !552, file: !507, line: 97, baseType: !133, size: 8, offset: 8)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !549, file: !507, line: 100, baseType: !333, size: 16)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !510, file: !507, line: 107, baseType: !162, size: 32, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !510, file: !507, line: 127, baseType: !102, size: 32, offset: 160)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !510, file: !507, line: 131, baseType: !562, size: 192, offset: 192)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !228, line: 244, size: 192, elements: !563)
!563 = !{!564, !565, !571}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !562, file: !228, line: 245, baseType: !516, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !562, file: !228, line: 246, baseType: !566, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !228, line: 242, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !570}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !562, file: !228, line: 249, baseType: !105, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !506, file: !507, line: 250, baseType: !573, size: 288, offset: 384)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !574, line: 25, size: 288, elements: !575)
!574 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !573, file: !574, line: 26, baseType: !162, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !573, file: !574, line: 27, baseType: !162, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !573, file: !574, line: 28, baseType: !162, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !573, file: !574, line: 29, baseType: !162, size: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !573, file: !574, line: 30, baseType: !162, size: 32, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !573, file: !574, line: 31, baseType: !162, size: 32, offset: 160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !573, file: !574, line: 32, baseType: !162, size: 32, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !573, file: !574, line: 33, baseType: !162, size: 32, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !573, file: !574, line: 34, baseType: !162, size: 32, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !506, file: !507, line: 253, baseType: !102, size: 32, offset: 672)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !506, file: !507, line: 256, baseType: !541, size: 64, offset: 704)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !506, file: !507, line: 294, baseType: !107, size: 32, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !506, file: !507, line: 300, baseType: !589, size: 96, offset: 800)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !507, line: 149, size: 96, elements: !590)
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !589, file: !507, line: 153, baseType: !22, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !589, file: !507, line: 162, baseType: !252, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !589, file: !507, line: 168, baseType: !252, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !506, file: !507, line: 325, baseType: !595, size: 32, offset: 896)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !224, line: 5073, size: 160, elements: !597)
!597 = !{!598, !607, !608}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !596, file: !224, line: 5074, baseType: !599, size: 96)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !600, line: 56, size: 96, elements: !601)
!600 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!601 = !{!602, !605, !606}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !599, file: !600, line: 57, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !600, line: 57, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !599, file: !600, line: 58, baseType: !102, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !599, file: !600, line: 59, baseType: !252, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !596, file: !224, line: 5075, baseType: !541, size: 64, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !596, file: !224, line: 5076, baseType: !609, offset: 160)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !506, file: !507, line: 343, baseType: !611, size: 64, offset: 928)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !574, line: 60, size: 64, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !611, file: !574, line: 63, baseType: !162, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !611, file: !574, line: 66, baseType: !162, size: 32, offset: 32)
!615 = !{!616, !617}
!616 = !DILocalVariable(name: "thread", arg: 1, scope: !501, file: !502, line: 175, type: !505)
!617 = !DILocalVariable(name: "region_num", scope: !501, file: !502, line: 200, type: !133)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, elements: !466)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !620, line: 52, size: 96, elements: !621)
!620 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!621 = !{!622, !623, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !619, file: !620, line: 53, baseType: !22, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !619, file: !620, line: 54, baseType: !252, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !619, file: !620, line: 55, baseType: !625, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !626, line: 304, baseType: !627)
!626 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !626, line: 301, size: 32, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !627, file: !626, line: 302, baseType: !333, size: 16)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !627, file: !626, line: 303, baseType: !333, size: 16, offset: 16)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 96, elements: !399)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !635, file: !689, line: 39, type: !133, isLocal: true, isDefinition: true)
!635 = distinct !DICompileUnit(language: DW_LANG_C99, file: !636, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !637, globals: !680, splitDebugInlining: false, nameTableKind: None)
!636 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!637 = !{!638, !102, !107, !666}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !640, line: 1495, baseType: !641)
!640 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !640, line: 1474, size: 448, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !656}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !641, file: !640, line: 1476, baseType: !295, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !641, file: !640, line: 1477, baseType: !296, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !641, file: !640, line: 1478, baseType: !296, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !641, file: !640, line: 1479, baseType: !296, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !641, file: !640, line: 1480, baseType: !296, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !641, file: !640, line: 1481, baseType: !296, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !641, file: !640, line: 1482, baseType: !296, size: 32, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !641, file: !640, line: 1483, baseType: !296, size: 32, offset: 224)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !641, file: !640, line: 1484, baseType: !296, size: 32, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !641, file: !640, line: 1485, baseType: !296, size: 32, offset: 288)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !641, file: !640, line: 1486, baseType: !296, size: 32, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !641, file: !640, line: 1487, baseType: !655, size: 32, offset: 352)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 32, elements: !399)
!656 = !DIDerivedType(tag: DW_TAG_member, scope: !641, file: !640, line: 1488, baseType: !657, size: 64, offset: 384)
!657 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !641, file: !640, line: 1488, size: 64, elements: !658)
!658 = !{!659, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !657, file: !640, line: 1489, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 64, elements: !537)
!661 = !DIDerivedType(tag: DW_TAG_member, scope: !657, file: !640, line: 1490, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !657, file: !640, line: 1490, size: 64, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !662, file: !640, line: 1491, baseType: !296, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !662, file: !640, line: 1492, baseType: !296, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !669, line: 27, size: 128, elements: !670)
!669 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!670 = !{!671, !672, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !668, file: !669, line: 29, baseType: !162, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !668, file: !669, line: 31, baseType: !123, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !668, file: !669, line: 37, baseType: !674, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !626, line: 298, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !626, line: 289, size: 64, elements: !676)
!676 = !{!677, !678, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !675, file: !626, line: 291, baseType: !133, size: 5, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !675, file: !626, line: 293, baseType: !133, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !675, file: !626, line: 295, baseType: !162, size: 32, offset: 32)
!680 = !{!633, !681}
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !635, file: !683, line: 31, type: !684, isLocal: true, isDefinition: true)
!683 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 160, elements: !399)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !683, line: 21, size: 160, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !685, file: !683, line: 22, baseType: !107, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !685, file: !683, line: 23, baseType: !668, size: 128, offset: 32)
!689 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !692, file: !699, line: 21, type: !269, isLocal: true, isDefinition: true)
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !694, globals: !698, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!694 = !{!695, !107, !102}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !697, line: 22, baseType: !107)
!697 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!698 = !{!690}
!699 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !702, file: !707, line: 13, type: !726, isLocal: true, isDefinition: true)
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !704, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!704 = !{!705, !700}
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "mpu_config", scope: !702, file: !707, line: 37, type: !708, isLocal: false, isDefinition: true)
!707 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !669, line: 41, size: 64, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !709, file: !669, line: 43, baseType: !162, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !709, file: !669, line: 45, baseType: !713, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !669, line: 27, size: 128, elements: !716)
!716 = !{!717, !718, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !715, file: !669, line: 29, baseType: !162, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !715, file: !669, line: 31, baseType: !123, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !715, file: !669, line: 37, baseType: !720, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !626, line: 298, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !626, line: 289, size: 64, elements: !722)
!722 = !{!723, !724, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !721, file: !626, line: 291, baseType: !133, size: 5, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !721, file: !626, line: 293, baseType: !133, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !721, file: !626, line: 295, baseType: !162, size: 32, offset: 32)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 256, elements: !537)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_bee_init", scope: !729, file: !825, line: 39, type: !826, isLocal: true, isDefinition: true, align: 32)
!729 = distinct !DICompileUnit(language: DW_LANG_C99, file: !730, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !731, retainedTypes: !743, globals: !824, splitDebugInlining: false, nameTableKind: None)
!730 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!731 = !{!732, !738}
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !733, line: 506, baseType: !32, size: 32, elements: !734)
!733 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!734 = !{!735, !736, !737}
!735 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!736 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!737 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !733, line: 512, baseType: !32, size: 32, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!741 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!742 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!743 = !{!744, !813, !818, !779, !738, !732, !823, !102}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !733, line: 523, size: 288, elements: !747)
!747 = !{!748, !769, !775, !780, !784, !785, !786, !790, !809}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !746, file: !733, line: 524, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = !DISubroutineType(types: !751)
!751 = !{!107, !752, !767, !768}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !755)
!755 = !{!756, !757, !758, !759, !765, !766}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !754, file: !120, line: 380, baseType: !123, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !754, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !754, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !754, file: !120, line: 386, baseType: !760, size: 32, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !761, file: !120, line: 359, baseType: !133, size: 8)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !761, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !754, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !754, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !733, line: 237, baseType: !133)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !733, line: 257, baseType: !162)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !746, file: !733, line: 530, baseType: !770, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!771 = !DISubroutineType(types: !772)
!772 = !{!107, !752, !773}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !733, line: 229, baseType: !162)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !746, file: !733, line: 532, baseType: !776, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DISubroutineType(types: !778)
!778 = !{!107, !752, !779, !774}
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !733, line: 216, baseType: !162)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !746, file: !733, line: 535, baseType: !781, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{!107, !752, !779}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !746, file: !733, line: 537, baseType: !781, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !746, file: !733, line: 539, baseType: !781, size: 32, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !746, file: !733, line: 541, baseType: !787, size: 32, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DISubroutineType(types: !789)
!789 = !{!107, !752, !767, !732, !738}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !746, file: !733, line: 544, baseType: !791, size: 32, offset: 224)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DISubroutineType(types: !793)
!793 = !{!107, !752, !794, !136}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !733, line: 478, size: 96, elements: !796)
!796 = !{!797, !803, !808}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !795, file: !733, line: 482, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !371, line: 33, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !371, line: 29, size: 32, elements: !800)
!800 = !{!801}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !799, file: !371, line: 30, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !795, file: !733, line: 485, baseType: !804, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !733, line: 464, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !752, !794, !779}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !795, file: !733, line: 493, baseType: !779, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !746, file: !733, line: 547, baseType: !810, size: 32, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DISubroutineType(types: !812)
!812 = !{!162, !752}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !733, line: 428, size: 32, elements: !816)
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !815, file: !733, line: 434, baseType: !779, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !733, line: 441, size: 32, elements: !821)
!821 = !{!822}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !820, file: !733, line: 447, baseType: !779, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!824 = !{!727}
!825 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !338, line: 51, size: 64, elements: !828)
!828 = !{!829, !833}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !827, file: !338, line: 60, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DISubroutineType(types: !832)
!832 = !{!107, !752}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !827, file: !338, line: 65, baseType: !752, size: 32, offset: 32)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "__device_dts_ord_48", scope: !836, file: !1039, line: 733, type: !1142, isLocal: false, isDefinition: true, align: 32)
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !837, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !838, retainedTypes: !956, globals: !1035, splitDebugInlining: false, nameTableKind: None)
!837 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/echo_bot")
!838 = !{!839, !845, !30, !850, !855, !859, !863, !867, !873, !877, !921, !928, !947}
!839 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !840, line: 23, baseType: !32, size: 32, elements: !841)
!840 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !{!842, !843, !844}
!842 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!843 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!844 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!845 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !840, line: 48, baseType: !32, size: 32, elements: !846)
!846 = !{!847, !848, !849}
!847 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!848 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!849 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 167, baseType: !32, size: 32, elements: !852)
!851 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!852 = !{!853, !854}
!853 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!854 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 107, baseType: !32, size: 32, elements: !856)
!856 = !{!857, !858}
!857 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!858 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!859 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 208, baseType: !32, size: 32, elements: !860)
!860 = !{!861, !862}
!861 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!862 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!863 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 261, baseType: !32, size: 32, elements: !864)
!864 = !{!865, !866}
!865 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!866 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 237, baseType: !32, size: 32, elements: !868)
!868 = !{!869, !870, !871, !872}
!869 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!870 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!871 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!872 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 152, baseType: !32, size: 32, elements: !874)
!874 = !{!875, !876}
!875 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!876 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !290, line: 71, baseType: !107, size: 32, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920}
!879 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!880 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!881 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!882 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!883 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!884 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!885 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!886 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!887 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!888 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!889 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!890 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!891 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!892 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!893 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!894 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!895 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!896 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!897 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!898 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!899 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!900 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!901 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!902 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!903 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!904 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!905 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!906 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!907 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!908 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!909 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!910 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!911 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!912 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!913 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!914 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!915 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!916 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!917 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!918 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!919 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!920 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !922, line: 44, baseType: !32, size: 32, elements: !923)
!922 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!923 = !{!924, !925, !926, !927}
!924 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!925 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!926 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!927 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!928 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !929, line: 54, baseType: !32, size: 32, elements: !930)
!929 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!930 = !{!931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946}
!931 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!932 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!933 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!934 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!935 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!936 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!937 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!938 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!939 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!940 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!941 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!942 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!943 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!944 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!945 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!946 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!947 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !948, line: 53, baseType: !32, size: 32, elements: !949)
!948 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!949 = !{!950, !951, !952, !953, !954, !955}
!950 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!951 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!952 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!953 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!954 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!955 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!956 = !{!839, !102, !107, !957, !999, !1000, !1001, !1002, !103, !162, !381, !136, !1003, !182, !433, !1004, !1034, !252}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !290, line: 923, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 883, size: 10464, elements: !960)
!960 = !{!961, !962, !963, !964, !965, !969, !970, !971, !972, !973, !974, !975, !976, !980, !981, !982, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !959, file: !290, line: 884, baseType: !296, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !959, file: !290, line: 885, baseType: !296, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !959, file: !290, line: 886, baseType: !296, size: 32, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !959, file: !290, line: 887, baseType: !296, size: 32, offset: 96)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !959, file: !290, line: 888, baseType: !966, size: 896, offset: 128)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 896, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 28)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !959, file: !290, line: 889, baseType: !296, size: 32, offset: 1024)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !959, file: !290, line: 890, baseType: !296, size: 32, offset: 1056)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !959, file: !290, line: 891, baseType: !296, size: 32, offset: 1088)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !959, file: !290, line: 892, baseType: !296, size: 32, offset: 1120)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !959, file: !290, line: 893, baseType: !966, size: 896, offset: 1152)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !959, file: !290, line: 894, baseType: !296, size: 32, offset: 2048)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !959, file: !290, line: 895, baseType: !296, size: 32, offset: 2080)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !959, file: !290, line: 896, baseType: !977, size: 960, offset: 2112)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 960, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 30)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !959, file: !290, line: 897, baseType: !296, size: 32, offset: 3072)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !959, file: !290, line: 898, baseType: !296, size: 32, offset: 3104)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !959, file: !290, line: 899, baseType: !983, size: 3008, offset: 3136)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 3008, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 94)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !959, file: !290, line: 900, baseType: !296, size: 32, offset: 6144)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !959, file: !290, line: 901, baseType: !296, size: 32, offset: 6176)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !959, file: !290, line: 902, baseType: !296, size: 32, offset: 6208)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !959, file: !290, line: 903, baseType: !295, size: 32, offset: 6240)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !959, file: !290, line: 904, baseType: !303, size: 1984, offset: 6272)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !959, file: !290, line: 905, baseType: !295, size: 32, offset: 8256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !959, file: !290, line: 907, baseType: !295, size: 32, offset: 8288)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !959, file: !290, line: 910, baseType: !295, size: 32, offset: 8320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !959, file: !290, line: 911, baseType: !295, size: 32, offset: 8352)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !959, file: !290, line: 913, baseType: !295, size: 32, offset: 8384)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !959, file: !290, line: 917, baseType: !295, size: 32, offset: 8416)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !959, file: !290, line: 919, baseType: !303, size: 1984, offset: 8448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !959, file: !290, line: 920, baseType: !296, size: 32, offset: 10432)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !851, line: 146, baseType: !855)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !851, line: 164, baseType: !873)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !640, line: 485, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !640, line: 468, size: 28704, elements: !1007)
!1007 = !{!1008, !1012, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1029, !1033}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1006, file: !640, line: 470, baseType: !1009, size: 512)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 512, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 16)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1006, file: !640, line: 471, baseType: !1013, size: 512, offset: 512)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 512, elements: !1010)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1006, file: !640, line: 472, baseType: !1009, size: 512, offset: 1024)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !1006, file: !640, line: 473, baseType: !1013, size: 512, offset: 1536)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1006, file: !640, line: 474, baseType: !1009, size: 512, offset: 2048)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1006, file: !640, line: 475, baseType: !1013, size: 512, offset: 2560)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1006, file: !640, line: 476, baseType: !1009, size: 512, offset: 3072)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1006, file: !640, line: 477, baseType: !1013, size: 512, offset: 3584)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1006, file: !640, line: 478, baseType: !1009, size: 512, offset: 4096)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1006, file: !640, line: 479, baseType: !1013, size: 512, offset: 4608)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !1006, file: !640, line: 480, baseType: !1009, size: 512, offset: 5120)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1006, file: !640, line: 481, baseType: !1013, size: 512, offset: 5632)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !1006, file: !640, line: 482, baseType: !1025, size: 3968, offset: 6144)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1026, size: 3968, elements: !1027)
!1026 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!1027 = !{!1028}
!1028 = !DISubrange(count: 496)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !1006, file: !640, line: 483, baseType: !1030, size: 18560, offset: 10112)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 18560, elements: !1031)
!1031 = !{!1032}
!1032 = !DISubrange(count: 580)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !1006, file: !640, line: 484, baseType: !296, size: 32, offset: 28672)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !922, line: 56, baseType: !102)
!1035 = !{!1036, !1086, !1127, !834, !1132, !1157, !1159, !1176, !1178, !1188, !1191, !1206, !1244, !1258}
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "on", scope: !1038, file: !1039, line: 549, type: !412, isLocal: true, isDefinition: true)
!1038 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !1039, file: !1039, line: 547, type: !1040, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !836, retainedNodes: !1042)
!1039 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1040 = !DISubroutineType(types: !1041)
!1041 = !{null, !845}
!1042 = !{!1043, !1044, !1047}
!1043 = !DILocalVariable(name: "start_mode", arg: 1, scope: !1038, file: !1039, line: 547, type: !845)
!1044 = !DILocalVariable(name: "err", scope: !1045, file: !1039, line: 553, type: !107)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !1039, line: 552, column: 31)
!1046 = distinct !DILexicalBlock(scope: !1038, file: !1039, line: 552, column: 6)
!1047 = !DILocalVariable(name: "mgr", scope: !1045, file: !1039, line: 554, type: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 32)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !1050, line: 154, size: 224, elements: !1051)
!1050 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1051 = !{!1052, !1064, !1065, !1081, !1083, !1084, !1085}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !1049, file: !1050, line: 158, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !371, line: 40, baseType: !1054)
