; ModuleID = 'build/actinius_icarus_bee_ns/tracing/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__thread_entry = type { void (i8*, i8*, i8*)*, i8*, i8*, i8* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "threadA_sem", scope: !27, file: !114, line: 63, type: !115, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/tracing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !141, !287, !291, !296, !298, !300}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !27, file: !114, line: 64, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/tracing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !116, line: 2909, size: 128, elements: !117)
!116 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !{!118, !139, !140}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !115, file: !116, line: 2910, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !120, line: 233, baseType: !121)
!120 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 231, size: 64, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !121, file: !120, line: 232, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !125, line: 48, baseType: !126)
!125 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !125, line: 37, size: 64, elements: !127)
!127 = !{!128, !134}
!128 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !125, line: 38, baseType: !129, size: 32)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !125, line: 38, size: 32, elements: !130)
!130 = !{!131, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !129, file: !125, line: 39, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !125, line: 40, baseType: !132, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !125, line: 42, baseType: !135, size: 32, offset: 32)
!135 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !125, line: 42, size: 32, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !135, file: !125, line: 43, baseType: !132, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !125, line: 44, baseType: !132, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !115, file: !116, line: 2911, baseType: !32, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !115, file: !116, line: 2912, baseType: !32, size: 32, offset: 96)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_a", scope: !27, file: !114, line: 111, type: !143, isLocal: false, isDefinition: true, align: 32)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !116, line: 620, size: 384, elements: !144)
!144 = !{!145, !264, !271, !272, !273, !274, !275, !276, !277, !278, !280, !284}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !143, file: !116, line: 621, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !148, line: 245, size: 1408, elements: !149)
!148 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!149 = !{!150, !199, !212, !213, !214, !226, !227, !232, !233, !241, !259}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !147, file: !148, line: 247, baseType: !151, size: 384)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !148, line: 57, size: 384, elements: !152)
!152 = !{!153, !167, !169, !172, !173, !186, !187, !188}
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !148, line: 60, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !148, line: 60, size: 64, elements: !155)
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !154, file: !148, line: 61, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !125, line: 49, baseType: !126)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !154, file: !148, line: 62, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !160, line: 49, size: 64, elements: !161)
!160 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !159, file: !160, line: 50, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !165)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!165 = !{!166}
!166 = !DISubrange(count: 2)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !151, file: !148, line: 68, baseType: !168, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !151, file: !148, line: 71, baseType: !170, size: 8, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !171)
!171 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !151, file: !148, line: 74, baseType: !170, size: 8, offset: 104)
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !148, line: 90, baseType: !174, size: 16, offset: 112)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !148, line: 90, size: 16, elements: !175)
!175 = !{!176, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !174, file: !148, line: 91, baseType: !177, size: 16)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !174, file: !148, line: 91, size: 16, elements: !178)
!178 = !{!179, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !177, file: !148, line: 96, baseType: !180, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !181)
!181 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !177, file: !148, line: 97, baseType: !170, size: 8, offset: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !174, file: !148, line: 100, baseType: !184, size: 16)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !185)
!185 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !151, file: !148, line: 107, baseType: !108, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !151, file: !148, line: 127, baseType: !106, size: 32, offset: 160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !151, file: !148, line: 131, baseType: !189, size: 192, offset: 192)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !120, line: 244, size: 192, elements: !190)
!190 = !{!191, !192, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !189, file: !120, line: 245, baseType: !157, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !189, file: !120, line: 246, baseType: !193, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !120, line: 242, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !189, file: !120, line: 249, baseType: !104, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !147, file: !148, line: 250, baseType: !200, size: 288, offset: 384)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !201, line: 25, size: 288, elements: !202)
!201 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !200, file: !201, line: 26, baseType: !108, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !200, file: !201, line: 27, baseType: !108, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !200, file: !201, line: 28, baseType: !108, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !200, file: !201, line: 29, baseType: !108, size: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !200, file: !201, line: 30, baseType: !108, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !200, file: !201, line: 31, baseType: !108, size: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !200, file: !201, line: 32, baseType: !108, size: 32, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !200, file: !201, line: 33, baseType: !108, size: 32, offset: 224)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !200, file: !201, line: 34, baseType: !108, size: 32, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !147, file: !148, line: 253, baseType: !106, size: 32, offset: 672)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !147, file: !148, line: 256, baseType: !119, size: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !147, file: !148, line: 271, baseType: !215, size: 128, offset: 768)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !148, line: 34, size: 128, elements: !216)
!216 = !{!217, !223, !224, !225}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !215, file: !148, line: 35, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !219, line: 46, baseType: !220)
!219 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !106, !106, !106}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !215, file: !148, line: 36, baseType: !106, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !215, file: !148, line: 37, baseType: !106, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !215, file: !148, line: 38, baseType: !106, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !147, file: !148, line: 274, baseType: !146, size: 32, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !148, line: 279, baseType: !228, size: 256, offset: 928)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 256, elements: !230)
!229 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!230 = !{!231}
!231 = !DISubrange(count: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !147, file: !148, line: 294, baseType: !107, size: 32, offset: 1184)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !147, file: !148, line: 300, baseType: !234, size: 96, offset: 1216)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !148, line: 149, size: 96, elements: !235)
!235 = !{!236, !237, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !234, file: !148, line: 153, baseType: !22, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !234, file: !148, line: 162, baseType: !238, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !239, line: 214, baseType: !32)
!239 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !234, file: !148, line: 168, baseType: !238, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !147, file: !148, line: 325, baseType: !242, size: 32, offset: 1312)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !116, line: 5073, size: 160, elements: !244)
!244 = !{!245, !254, !255}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !243, file: !116, line: 5074, baseType: !246, size: 96)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !247, line: 56, size: 96, elements: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = !{!249, !252, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !246, file: !247, line: 57, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !247, line: 57, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !246, file: !247, line: 58, baseType: !106, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !246, file: !247, line: 59, baseType: !238, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !243, file: !116, line: 5075, baseType: !119, size: 64, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !243, file: !116, line: 5076, baseType: !256, offset: 160)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !257, line: 43, elements: !258)
!257 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!258 = !{}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !147, file: !148, line: 343, baseType: !260, size: 64, offset: 1344)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !201, line: 60, size: 64, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !260, file: !201, line: 63, baseType: !108, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !260, file: !201, line: 66, baseType: !108, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !143, file: !116, line: 622, baseType: !265, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !219, line: 44, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !268, line: 47, size: 8, elements: !269)
!268 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !268, line: 48, baseType: !229, size: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !143, file: !116, line: 623, baseType: !32, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !143, file: !116, line: 624, baseType: !218, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !143, file: !116, line: 625, baseType: !106, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !143, file: !116, line: 626, baseType: !106, size: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !143, file: !116, line: 627, baseType: !106, size: 32, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !143, file: !116, line: 628, baseType: !107, size: 32, offset: 224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !143, file: !116, line: 629, baseType: !108, size: 32, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !143, file: !116, line: 630, baseType: !279, size: 32, offset: 288)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !143, file: !116, line: 631, baseType: !281, size: 32, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DISubroutineType(types: !283)
!283 = !{null}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !143, file: !116, line: 632, baseType: !285, size: 32, offset: 352)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "thread_a", scope: !27, file: !114, line: 111, type: !289, isLocal: false, isDefinition: true)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !148, line: 347, baseType: !146)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !27, file: !114, line: 79, type: !293, isLocal: false, isDefinition: true, align: 64)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 16384, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 2048)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "threadB_data", scope: !27, file: !114, line: 80, type: !147, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_a", scope: !27, file: !114, line: 111, type: !293, isLocal: false, isDefinition: true, align: 64)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_a", scope: !27, file: !114, line: 111, type: !147, isLocal: false, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "_char_out", scope: !304, file: !308, line: 54, type: !309, isLocal: false, isDefinition: true)
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !306, globals: !307, splitDebugInlining: false, nameTableKind: None)
!305 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!306 = !{!106, !107}
!307 = !{!302}
!308 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DISubroutineType(types: !311)
!311 = !{!107, !107}
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !314, file: !373, line: 65, type: !374, isLocal: true, isDefinition: true, align: 32)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !316, globals: !368, splitDebugInlining: false, nameTableKind: None)
!315 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!316 = !{!106, !107, !317, !108, !328}
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !319, file: !318, line: 167, baseType: !327)
!318 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!319 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !318, file: !318, line: 134, type: !320, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !314, retainedNodes: !322)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !108}
!322 = !{!323, !324, !326}
!323 = !DILocalVariable(name: "time_us", arg: 1, scope: !319, file: !318, line: 134, type: !108)
!324 = !DILocalVariable(name: "delay_cycles", scope: !319, file: !318, line: 168, type: !325)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!326 = !DILocalVariable(name: "cycles", scope: !319, file: !318, line: 171, type: !108)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !330, line: 1928, baseType: !331)
!330 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 1909, size: 11360, elements: !332)
!332 = !{!333, !339, !340, !341, !342, !346, !347, !348, !349, !353, !354, !358, !359, !360, !361, !362, !366, !367}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !331, file: !330, line: 1910, baseType: !334, size: 8192)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 8192, elements: !337)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!337 = !{!338}
!338 = !DISubrange(count: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !331, file: !330, line: 1911, baseType: !335, size: 32, offset: 8192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !331, file: !330, line: 1912, baseType: !335, size: 32, offset: 8224)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !331, file: !330, line: 1913, baseType: !335, size: 32, offset: 8256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !331, file: !330, line: 1914, baseType: !343, size: 1984, offset: 8288)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 1984, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 62)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !331, file: !330, line: 1915, baseType: !336, size: 32, offset: 10272)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !331, file: !330, line: 1916, baseType: !335, size: 32, offset: 10304)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !331, file: !330, line: 1917, baseType: !336, size: 32, offset: 10336)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !331, file: !330, line: 1918, baseType: !350, size: 96, offset: 10368)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 96, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 3)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !331, file: !330, line: 1919, baseType: !336, size: 32, offset: 10464)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !331, file: !330, line: 1920, baseType: !355, size: 256, offset: 10496)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 256, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 8)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !331, file: !330, line: 1921, baseType: !336, size: 32, offset: 10752)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !331, file: !330, line: 1922, baseType: !335, size: 32, offset: 10784)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !331, file: !330, line: 1923, baseType: !336, size: 32, offset: 10816)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !331, file: !330, line: 1924, baseType: !336, size: 32, offset: 10848)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !331, file: !330, line: 1925, baseType: !363, size: 416, offset: 10880)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 416, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 13)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !331, file: !330, line: 1926, baseType: !336, size: 32, offset: 11296)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !331, file: !330, line: 1927, baseType: !336, size: 32, offset: 11328)
!368 = !{!312, !369}
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !319, file: !318, line: 161, type: !371, isLocal: true, isDefinition: true, align: 128)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 48, elements: !351)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!373 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !376, line: 51, size: 64, elements: !377)
!376 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!377 = !{!378, !385}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !375, file: !376, line: 60, baseType: !379, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = !DISubroutineType(types: !381)
!381 = !{!107, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !376, line: 48, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !375, file: !376, line: 65, baseType: !382, size: 32, offset: 32)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "_kernel_thread_info_offsets", scope: !388, file: !393, line: 41, type: !396, isLocal: false, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !306, globals: !390, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!390 = !{!386, !391, !394}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "_kernel_thread_info_num_offsets", scope: !388, file: !393, line: 140, type: !238, isLocal: false, isDefinition: true)
!393 = !DIFile(filename: "zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "_kernel_thread_info_size_t_size", scope: !388, file: !393, line: 145, type: !170, isLocal: false, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 448, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 14)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !401, file: !436, line: 27, type: !461, isLocal: true, isDefinition: true)
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !403, retainedTypes: !415, globals: !433, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!403 = !{!404, !30}
!404 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !405, line: 27, baseType: !32, size: 32, elements: !406)
!405 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414}
!407 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!408 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!409 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!410 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!411 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!412 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!413 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!414 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!415 = !{!106, !102, !107, !24, !416, !432, !108, !109}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 32)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !418, line: 54, size: 96, elements: !419)
!418 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = !{!420, !427, !431}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !417, file: !418, line: 55, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !422, line: 33, baseType: !423)
!422 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !422, line: 29, size: 32, elements: !424)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !423, file: !422, line: 30, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !417, file: !418, line: 60, baseType: !428, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !404}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !417, file: !418, line: 65, baseType: !428, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!433 = !{!399, !434, !438, !440, !451, !453}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !401, file: !436, line: 44, type: !437, isLocal: true, isDefinition: true)
!436 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !257, line: 43, elements: !258)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !401, file: !436, line: 49, type: !437, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !401, file: !436, line: 36, type: !442, isLocal: true, isDefinition: true)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 128, elements: !449)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !405, line: 114, size: 128, elements: !444)
!444 = !{!445, !446, !447, !448}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !443, file: !405, line: 115, baseType: !404, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !443, file: !405, line: 141, baseType: !170, size: 8, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !443, file: !405, line: 149, baseType: !108, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !443, file: !405, line: 156, baseType: !108, size: 32, offset: 96)
!449 = !{!450}
!450 = !DISubrange(count: 1)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !401, file: !436, line: 40, type: !442, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !401, file: !436, line: 28, type: !455, isLocal: true, isDefinition: true)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !422, line: 40, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !422, line: 35, size: 64, elements: !457)
!457 = !{!458, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !456, file: !422, line: 36, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !456, file: !422, line: 37, baseType: !459, size: 32, offset: 32)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 32, elements: !449)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !463, line: 22, baseType: !464)
!463 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!464 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!465 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!466 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !469, file: !497, line: 50, type: !279, isLocal: true, isDefinition: true)
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !403, retainedTypes: !471, globals: !494, splitDebugInlining: false, nameTableKind: None)
!470 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!471 = !{!472, !102, !238, !107, !106, !108, !109, !474, !432, !279, !485}
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !473)
!473 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !476, line: 45, size: 64, elements: !477)
!476 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!477 = !{!478, !484}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !475, file: !476, line: 46, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !422, line: 33, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !422, line: 29, size: 32, elements: !481)
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !480, file: !422, line: 30, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !475, file: !476, line: 48, baseType: !108, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !476, line: 38, size: 64, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !486, file: !476, line: 39, baseType: !479, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !486, file: !476, line: 41, baseType: !490, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !476, line: 35, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !279}
!494 = !{!495, !499, !507, !467, !509, !519}
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "latency_lock", scope: !469, file: !497, line: 44, type: !498, isLocal: true, isDefinition: true)
!497 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !257, line: 43, elements: !258)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !469, file: !497, line: 46, type: !501, isLocal: true, isDefinition: true)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !422, line: 40, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !422, line: 35, size: 64, elements: !503)
!503 = !{!504, !506}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !502, file: !422, line: 36, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !502, file: !422, line: 37, baseType: !505, size: 32, offset: 32)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "latency_subs", scope: !469, file: !497, line: 52, type: !501, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !469, file: !497, line: 39, type: !511, isLocal: true, isDefinition: true)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, elements: !517)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 35, size: 96, elements: !513)
!513 = !{!514, !515, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !512, file: !497, line: 36, baseType: !404, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !512, file: !497, line: 37, baseType: !170, size: 8, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !512, file: !497, line: 38, baseType: !462, size: 32, offset: 64)
!517 = !{!518}
!518 = !DISubrange(count: 0)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !469, file: !497, line: 48, type: !279, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !523, file: !530, line: 47, type: !544, isLocal: true, isDefinition: true)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !525, retainedTypes: !526, globals: !527, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!525 = !{!404}
!526 = !{!238, !107}
!527 = !{!528, !521, !540}
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "cpus_states", scope: !523, file: !530, line: 50, type: !531, isLocal: true, isDefinition: true)
!530 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 32, elements: !449)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !405, line: 114, size: 128, elements: !535)
!535 = !{!536, !537, !538, !539}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !534, file: !405, line: 115, baseType: !404, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !534, file: !405, line: 141, baseType: !170, size: 8, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !534, file: !405, line: 149, baseType: !108, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !534, file: !405, line: 156, baseType: !108, size: 32, offset: 96)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !523, file: !530, line: 55, type: !542, isLocal: true, isDefinition: true)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 8, elements: !449)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, elements: !517)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "static_regions", scope: !547, file: !554, line: 62, type: !682, isLocal: true, isDefinition: true)
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !549, globals: !550, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!549 = !{!238, !107, !108, !106}
!550 = !{!551, !545}
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !553, file: !554, line: 198, type: !669, isLocal: true, isDefinition: true)
!553 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !554, file: !554, line: 175, type: !555, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !547, retainedNodes: !666)
!554 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = !DISubroutineType(types: !556)
!556 = !{null, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !148, line: 245, size: 1408, elements: !559)
!559 = !{!560, !618, !630, !631, !632, !639, !640, !641, !642, !648, !661}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !558, file: !148, line: 247, baseType: !561, size: 384)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !148, line: 57, size: 384, elements: !562)
!562 = !{!563, !587, !594, !595, !596, !605, !606, !607}
!563 = !DIDerivedType(tag: DW_TAG_member, scope: !561, file: !148, line: 60, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !561, file: !148, line: 60, size: 64, elements: !565)
!565 = !{!566, !581}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !564, file: !148, line: 61, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !125, line: 49, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !125, line: 37, size: 64, elements: !569)
!569 = !{!570, !576}
!570 = !DIDerivedType(tag: DW_TAG_member, scope: !568, file: !125, line: 38, baseType: !571, size: 32)
!571 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !568, file: !125, line: 38, size: 32, elements: !572)
!572 = !{!573, !575}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !571, file: !125, line: 39, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !571, file: !125, line: 40, baseType: !574, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, scope: !568, file: !125, line: 42, baseType: !577, size: 32, offset: 32)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !568, file: !125, line: 42, size: 32, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !577, file: !125, line: 43, baseType: !574, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !577, file: !125, line: 44, baseType: !574, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !564, file: !148, line: 62, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !160, line: 49, size: 64, elements: !583)
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !582, file: !160, line: 50, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 64, elements: !165)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !561, file: !148, line: 68, baseType: !588, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !120, line: 233, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 231, size: 64, elements: !591)
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !590, file: !120, line: 232, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !125, line: 48, baseType: !568)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !561, file: !148, line: 71, baseType: !170, size: 8, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !561, file: !148, line: 74, baseType: !170, size: 8, offset: 104)
!596 = !DIDerivedType(tag: DW_TAG_member, scope: !561, file: !148, line: 90, baseType: !597, size: 16, offset: 112)
!597 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !561, file: !148, line: 90, size: 16, elements: !598)
!598 = !{!599, !604}
!599 = !DIDerivedType(tag: DW_TAG_member, scope: !597, file: !148, line: 91, baseType: !600, size: 16)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !148, line: 91, size: 16, elements: !601)
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !600, file: !148, line: 96, baseType: !180, size: 8)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !600, file: !148, line: 97, baseType: !170, size: 8, offset: 8)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !597, file: !148, line: 100, baseType: !184, size: 16)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !561, file: !148, line: 107, baseType: !108, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !561, file: !148, line: 127, baseType: !106, size: 32, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !561, file: !148, line: 131, baseType: !608, size: 192, offset: 192)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !120, line: 244, size: 192, elements: !609)
!609 = !{!610, !611, !617}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !608, file: !120, line: 245, baseType: !567, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !608, file: !120, line: 246, baseType: !612, size: 32, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !120, line: 242, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !608, file: !120, line: 249, baseType: !104, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !558, file: !148, line: 250, baseType: !619, size: 288, offset: 384)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !201, line: 25, size: 288, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !619, file: !201, line: 26, baseType: !108, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !619, file: !201, line: 27, baseType: !108, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !619, file: !201, line: 28, baseType: !108, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !619, file: !201, line: 29, baseType: !108, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !619, file: !201, line: 30, baseType: !108, size: 32, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !619, file: !201, line: 31, baseType: !108, size: 32, offset: 160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !619, file: !201, line: 32, baseType: !108, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !619, file: !201, line: 33, baseType: !108, size: 32, offset: 224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !619, file: !201, line: 34, baseType: !108, size: 32, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !558, file: !148, line: 253, baseType: !106, size: 32, offset: 672)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !558, file: !148, line: 256, baseType: !589, size: 64, offset: 704)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !558, file: !148, line: 271, baseType: !633, size: 128, offset: 768)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !148, line: 34, size: 128, elements: !634)
!634 = !{!635, !636, !637, !638}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !633, file: !148, line: 35, baseType: !218, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !633, file: !148, line: 36, baseType: !106, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !633, file: !148, line: 37, baseType: !106, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !633, file: !148, line: 38, baseType: !106, size: 32, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !558, file: !148, line: 274, baseType: !557, size: 32, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !558, file: !148, line: 279, baseType: !228, size: 256, offset: 928)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !558, file: !148, line: 294, baseType: !107, size: 32, offset: 1184)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !558, file: !148, line: 300, baseType: !643, size: 96, offset: 1216)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !148, line: 149, size: 96, elements: !644)
!644 = !{!645, !646, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !643, file: !148, line: 153, baseType: !22, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !643, file: !148, line: 162, baseType: !238, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !643, file: !148, line: 168, baseType: !238, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !558, file: !148, line: 325, baseType: !649, size: 32, offset: 1312)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !116, line: 5073, size: 160, elements: !651)
!651 = !{!652, !658, !659}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !650, file: !116, line: 5074, baseType: !653, size: 96)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !247, line: 56, size: 96, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !653, file: !247, line: 57, baseType: !250, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !653, file: !247, line: 58, baseType: !106, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !653, file: !247, line: 59, baseType: !238, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !650, file: !116, line: 5075, baseType: !589, size: 64, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !650, file: !116, line: 5076, baseType: !660, offset: 160)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !257, line: 43, elements: !258)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !558, file: !148, line: 343, baseType: !662, size: 64, offset: 1344)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !201, line: 60, size: 64, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !662, file: !201, line: 63, baseType: !108, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !662, file: !201, line: 66, baseType: !108, size: 32, offset: 32)
!666 = !{!667, !668}
!667 = !DILocalVariable(name: "thread", arg: 1, scope: !553, file: !554, line: 175, type: !557)
!668 = !DILocalVariable(name: "region_num", scope: !553, file: !554, line: 200, type: !170)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, elements: !517)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !671, line: 52, size: 96, elements: !672)
!671 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!672 = !{!673, !674, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !670, file: !671, line: 53, baseType: !22, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !670, file: !671, line: 54, baseType: !238, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !670, file: !671, line: 55, baseType: !676, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !677, line: 304, baseType: !678)
!677 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !677, line: 301, size: 32, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !678, file: !677, line: 302, baseType: !184, size: 16)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !678, file: !677, line: 303, baseType: !184, size: 16, offset: 16)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 96, elements: !449)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !686, file: !740, line: 39, type: !170, isLocal: true, isDefinition: true)
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !688, globals: !731, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!688 = !{!689, !106, !107, !717}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !691, line: 1495, baseType: !692)
!691 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !691, line: 1474, size: 448, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !707}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !692, file: !691, line: 1476, baseType: !335, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !692, file: !691, line: 1477, baseType: !336, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !692, file: !691, line: 1478, baseType: !336, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !692, file: !691, line: 1479, baseType: !336, size: 32, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !692, file: !691, line: 1480, baseType: !336, size: 32, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !692, file: !691, line: 1481, baseType: !336, size: 32, offset: 160)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !692, file: !691, line: 1482, baseType: !336, size: 32, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !692, file: !691, line: 1483, baseType: !336, size: 32, offset: 224)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !692, file: !691, line: 1484, baseType: !336, size: 32, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !692, file: !691, line: 1485, baseType: !336, size: 32, offset: 288)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !692, file: !691, line: 1486, baseType: !336, size: 32, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !692, file: !691, line: 1487, baseType: !706, size: 32, offset: 352)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 32, elements: !449)
!707 = !DIDerivedType(tag: DW_TAG_member, scope: !692, file: !691, line: 1488, baseType: !708, size: 64, offset: 384)
!708 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !692, file: !691, line: 1488, size: 64, elements: !709)
!709 = !{!710, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !708, file: !691, line: 1489, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 64, elements: !165)
!712 = !DIDerivedType(tag: DW_TAG_member, scope: !708, file: !691, line: 1490, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !708, file: !691, line: 1490, size: 64, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !713, file: !691, line: 1491, baseType: !336, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !713, file: !691, line: 1492, baseType: !336, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !720, line: 27, size: 128, elements: !721)
!720 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!721 = !{!722, !723, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !719, file: !720, line: 29, baseType: !108, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !719, file: !720, line: 31, baseType: !285, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !719, file: !720, line: 37, baseType: !725, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !677, line: 298, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !677, line: 289, size: 64, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !726, file: !677, line: 291, baseType: !170, size: 5, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !726, file: !677, line: 293, baseType: !170, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !726, file: !677, line: 295, baseType: !108, size: 32, offset: 32)
!731 = !{!684, !732}
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !686, file: !734, line: 31, type: !735, isLocal: true, isDefinition: true)
!734 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 160, elements: !449)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !734, line: 21, size: 160, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !736, file: !734, line: 22, baseType: !107, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !736, file: !734, line: 23, baseType: !719, size: 128, offset: 32)
!740 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !743, file: !750, line: 21, type: !309, isLocal: true, isDefinition: true)
!743 = distinct !DICompileUnit(language: DW_LANG_C99, file: !744, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !745, globals: !749, splitDebugInlining: false, nameTableKind: None)
!744 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!745 = !{!746, !107, !106}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !748, line: 22, baseType: !107)
!748 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!749 = !{!741}
!750 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !753, file: !758, line: 13, type: !777, isLocal: true, isDefinition: true)
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !755, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!755 = !{!756, !751}
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "mpu_config", scope: !753, file: !758, line: 37, type: !759, isLocal: false, isDefinition: true)
!758 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !720, line: 41, size: 64, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !760, file: !720, line: 43, baseType: !108, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !760, file: !720, line: 45, baseType: !764, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !720, line: 27, size: 128, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !766, file: !720, line: 29, baseType: !108, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !766, file: !720, line: 31, baseType: !285, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !766, file: !720, line: 37, baseType: !771, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !677, line: 298, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !677, line: 289, size: 64, elements: !773)
!773 = !{!774, !775, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !772, file: !677, line: 291, baseType: !170, size: 5, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !772, file: !677, line: 293, baseType: !170, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !772, file: !677, line: 295, baseType: !108, size: 32, offset: 32)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 256, elements: !165)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_bee_init", scope: !780, file: !881, line: 39, type: !882, isLocal: true, isDefinition: true, align: 32)
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !782, retainedTypes: !794, globals: !880, splitDebugInlining: false, nameTableKind: None)
!781 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!782 = !{!783, !789}
!783 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !784, line: 506, baseType: !32, size: 32, elements: !785)
!784 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!785 = !{!786, !787, !788}
!786 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!787 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!788 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !784, line: 512, baseType: !32, size: 32, elements: !790)
!790 = !{!791, !792, !793}
!791 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!792 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!793 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!794 = !{!795, !869, !874, !835, !789, !783, !879, !106}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !784, line: 523, size: 288, elements: !798)
!798 = !{!799, !825, !831, !836, !840, !841, !842, !846, !865}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !797, file: !784, line: 524, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = !DISubroutineType(types: !802)
!802 = !{!107, !803, !823, !824}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !806, line: 378, size: 192, elements: !807)
!806 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!807 = !{!808, !809, !810, !811, !818, !819}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !805, file: !806, line: 380, baseType: !285, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !805, file: !806, line: 382, baseType: !13, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !805, file: !806, line: 384, baseType: !13, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !805, file: !806, line: 386, baseType: !812, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !806, line: 351, size: 16, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !813, file: !806, line: 359, baseType: !170, size: 8)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !813, file: !806, line: 364, baseType: !817, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!817 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !805, file: !806, line: 388, baseType: !106, size: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !805, file: !806, line: 396, baseType: !820, size: 32, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !806, line: 43, baseType: !472)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !784, line: 237, baseType: !170)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !784, line: 257, baseType: !108)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !797, file: !784, line: 530, baseType: !826, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DISubroutineType(types: !828)
!828 = !{!107, !803, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !784, line: 229, baseType: !108)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !797, file: !784, line: 532, baseType: !832, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DISubroutineType(types: !834)
!834 = !{!107, !803, !835, !830}
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !784, line: 216, baseType: !108)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !797, file: !784, line: 535, baseType: !837, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DISubroutineType(types: !839)
!839 = !{!107, !803, !835}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !797, file: !784, line: 537, baseType: !837, size: 32, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !797, file: !784, line: 539, baseType: !837, size: 32, offset: 160)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !797, file: !784, line: 541, baseType: !843, size: 32, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{!107, !803, !823, !783, !789}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !797, file: !784, line: 544, baseType: !847, size: 32, offset: 224)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DISubroutineType(types: !849)
!849 = !{!107, !803, !850, !817}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !784, line: 478, size: 96, elements: !852)
!852 = !{!853, !859, !864}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !851, file: !784, line: 482, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !422, line: 33, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !422, line: 29, size: 32, elements: !856)
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !855, file: !422, line: 30, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !851, file: !784, line: 485, baseType: !860, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !784, line: 464, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !803, !850, !835}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !851, file: !784, line: 493, baseType: !835, size: 32, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !797, file: !784, line: 547, baseType: !866, size: 32, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(types: !868)
!868 = !{!108, !803}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !784, line: 428, size: 32, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !871, file: !784, line: 434, baseType: !835, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !784, line: 441, size: 32, elements: !877)
!877 = !{!878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !876, file: !784, line: 447, baseType: !835, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!880 = !{!778}
!881 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !376, line: 51, size: 64, elements: !884)
!884 = !{!885, !889}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !883, file: !376, line: 60, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = !DISubroutineType(types: !888)
!888 = !{!107, !803}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !883, file: !376, line: 65, baseType: !803, size: 32, offset: 32)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "__device_dts_ord_48", scope: !892, file: !1096, line: 733, type: !1199, isLocal: false, isDefinition: true, align: 32)
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !894, retainedTypes: !1012, globals: !1092, splitDebugInlining: false, nameTableKind: None)
!893 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/tracing")
!894 = !{!895, !901, !30, !906, !911, !915, !919, !923, !929, !933, !977, !984, !1003}
!895 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !896, line: 23, baseType: !32, size: 32, elements: !897)
!896 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!897 = !{!898, !899, !900}
!898 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!899 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!900 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !896, line: 48, baseType: !32, size: 32, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!904 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!905 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 167, baseType: !32, size: 32, elements: !908)
!907 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!908 = !{!909, !910}
!909 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!910 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 107, baseType: !32, size: 32, elements: !912)
!912 = !{!913, !914}
!913 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!914 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 208, baseType: !32, size: 32, elements: !916)
!916 = !{!917, !918}
!917 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!918 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 261, baseType: !32, size: 32, elements: !920)
!920 = !{!921, !922}
!921 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!922 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 237, baseType: !32, size: 32, elements: !924)
!924 = !{!925, !926, !927, !928}
!925 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!926 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!927 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!928 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!929 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 152, baseType: !32, size: 32, elements: !930)
!930 = !{!931, !932}
!931 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!932 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !330, line: 71, baseType: !107, size: 32, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976}
!935 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!936 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!937 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!938 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!939 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!940 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!941 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!942 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!943 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!944 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!945 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!946 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!947 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!948 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!949 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!950 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!951 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!952 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!953 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!954 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!955 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!956 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!957 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!958 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!959 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!960 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!961 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!962 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!963 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!964 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!965 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!966 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!967 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!968 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!969 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!970 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!971 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!972 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!973 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!974 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!975 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!976 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!977 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !978, line: 44, baseType: !32, size: 32, elements: !979)
!978 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!979 = !{!980, !981, !982, !983}
!980 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!981 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!982 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!983 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!984 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !985, line: 54, baseType: !32, size: 32, elements: !986)
!985 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!986 = !{!987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002}
!987 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!988 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!989 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!990 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!991 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!992 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!993 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!994 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!995 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!996 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!997 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!998 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!999 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!1000 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!1001 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!1002 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!1003 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1004, line: 53, baseType: !32, size: 32, elements: !1005)
!1004 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011}
!1006 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!1007 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!1008 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!1009 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!1010 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!1011 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!1012 = !{!895, !106, !107, !1013, !1055, !1056, !1057, !1058, !102, !108, !109, !817, !1059, !1060, !279, !1061, !1091, !238}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !330, line: 923, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 883, size: 10464, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1036, !1037, !1038, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !1015, file: !330, line: 884, baseType: !336, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !1015, file: !330, line: 885, baseType: !336, size: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !1015, file: !330, line: 886, baseType: !336, size: 32, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !1015, file: !330, line: 887, baseType: !336, size: 32, offset: 96)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !1015, file: !330, line: 888, baseType: !1022, size: 896, offset: 128)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 896, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 28)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !1015, file: !330, line: 889, baseType: !336, size: 32, offset: 1024)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !1015, file: !330, line: 890, baseType: !336, size: 32, offset: 1056)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !1015, file: !330, line: 891, baseType: !336, size: 32, offset: 1088)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !1015, file: !330, line: 892, baseType: !336, size: 32, offset: 1120)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1015, file: !330, line: 893, baseType: !1022, size: 896, offset: 1152)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !1015, file: !330, line: 894, baseType: !336, size: 32, offset: 2048)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !1015, file: !330, line: 895, baseType: !336, size: 32, offset: 2080)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1015, file: !330, line: 896, baseType: !1033, size: 960, offset: 2112)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 960, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 30)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !1015, file: !330, line: 897, baseType: !336, size: 32, offset: 3072)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !1015, file: !330, line: 898, baseType: !336, size: 32, offset: 3104)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1015, file: !330, line: 899, baseType: !1039, size: 3008, offset: 3136)
