; ModuleID = 'build/adafruit_feather_m0_basic_proto/subsys/pm/latency/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.test_api = type { void (%struct.device*)*, void (%struct.device*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.dev_test_data = type { %struct.pm_policy_latency_subscription, %struct.pm_policy_latency_request }
%struct.pm_policy_latency_subscription = type { %struct._snode, void (i32)* }
%struct._snode = type { %struct._snode* }
%struct.pm_policy_latency_request = type { %struct._snode, i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.10, i8*, i32 }
%union.anon.10 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_app", scope: !27, file: !199, line: 14, type: !201, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !107, globals: !196, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/latency/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency")
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !38, line: 27, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!40 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!41 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!42 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!43 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!44 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!45 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!46 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!47 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!48 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!49 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!50 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!51 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!52 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!53 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!54 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!55 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!56 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!106 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!107 = !{!108, !109, !123, !124, !117, !125, !135, !154, !155, !159, !161}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !110, file: !111, line: 80, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !115)
!115 = !{!116, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !111, line: 47, baseType: !117, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !114, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !114, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !114, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !110, file: !111, line: 82, baseType: !108, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !127)
!127 = !{!128, !146, !150}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !126, file: !31, line: 89, baseType: !129, size: 96)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !130)
!130 = !{!131, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !129, file: !31, line: 67, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !133)
!133 = !{!134, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !132, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !132, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !132, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !132, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !132, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !129, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !129, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !135)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !126, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !31, line: 94, baseType: !151, offset: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: -1)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !156, line: 46, baseType: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !158)
!158 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !160)
!160 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "test_api", file: !164, line: 8, size: 64, elements: !165)
!164 = !DIFile(filename: "zephyr/samples/subsys/pm/latency/src/test.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!165 = !{!166, !195}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !163, file: !164, line: 9, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !173, line: 378, size: 192, elements: !174)
!173 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !{!175, !179, !180, !181, !188, !189}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !173, line: 380, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !172, file: !173, line: 382, baseType: !13, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !172, file: !173, line: 384, baseType: !13, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !172, file: !173, line: 386, baseType: !182, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !173, line: 351, size: 16, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !183, file: !173, line: 359, baseType: !117, size: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !183, file: !173, line: 364, baseType: !187, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!187 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !172, file: !173, line: 388, baseType: !108, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !172, file: !173, line: 396, baseType: !190, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !173, line: 43, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !194)
!194 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !163, file: !164, line: 10, baseType: !167, size: 32, offset: 32)
!196 = !{!25, !197}
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !199, line: 14, type: !200, isLocal: true, isDefinition: true)
!199 = !DIFile(filename: "zephyr/samples/subsys/pm/latency/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 17, baseType: !176, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 18, baseType: !117, size: 8, offset: 32)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "log_const_soc_pm", scope: !209, file: !260, line: 11, type: !262, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !223, globals: !257, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/latency/src/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency")
!211 = !{!212, !30, !37}
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !213, line: 27, baseType: !32, size: 32, elements: !214)
!213 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222}
!215 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!216 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!217 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!218 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!219 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!220 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!221 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!222 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!223 = !{!108, !224, !123, !124, !235, !117, !236, !135}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !226)
!226 = !{!227, !234}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !225, file: !111, line: 80, baseType: !228, size: 32)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !229)
!229 = !{!230, !231, !232, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !228, file: !111, line: 47, baseType: !117, size: 8)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !228, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !228, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !228, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !225, file: !111, line: 82, baseType: !108, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !238)
!238 = !{!239, !255, !256}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !237, file: !31, line: 89, baseType: !240, size: 96)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !241)
!241 = !{!242, !253, !254}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !240, file: !31, line: 67, baseType: !243, size: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !243, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !243, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !243, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !243, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !243, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !243, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !243, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !240, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !240, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !237, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !237, file: !31, line: 94, baseType: !151, offset: 128)
!257 = !{!207, !258}
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !209, file: !260, line: 11, type: !261, isLocal: true, isDefinition: true)
!260 = !DIFile(filename: "zephyr/samples/subsys/pm/latency/src/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !203, line: 17, baseType: !176, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !263, file: !203, line: 18, baseType: !117, size: 8, offset: 32)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "log_const_dev_test", scope: !269, file: !308, line: 13, type: !381, isLocal: false, isDefinition: true)
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !271, retainedTypes: !272, globals: !305, splitDebugInlining: false, nameTableKind: None)
!270 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/latency/src/test.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency")
!271 = !{!30}
!272 = !{!108, !273, !123, !124, !117, !284, !135, !154}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !275)
!275 = !{!276, !283}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !274, file: !111, line: 80, baseType: !277, size: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !277, file: !111, line: 47, baseType: !117, size: 8)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !277, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !277, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !277, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !274, file: !111, line: 82, baseType: !108, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !286)
!286 = !{!287, !303, !304}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !285, file: !31, line: 89, baseType: !288, size: 96)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !289)
!289 = !{!290, !301, !302}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !288, file: !31, line: 67, baseType: !291, size: 32)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !291, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !291, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !291, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !291, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !291, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !291, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !291, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !288, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !288, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !285, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !285, file: !31, line: 94, baseType: !151, offset: 128)
!305 = !{!267, !306, !312, !328, !340, !366, !368, !378}
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "__devicehdl_dev_test", scope: !269, file: !308, line: 62, type: !309, isLocal: false, isDefinition: true, align: 16)
!308 = !DIFile(filename: "zephyr/samples/subsys/pm/latency/src/test.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 48, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 3)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "__device_dev_test", scope: !269, file: !308, line: 62, type: !314, isLocal: true, isDefinition: true, align: 32)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !173, line: 378, size: 192, elements: !316)
!316 = !{!317, !318, !319, !320, !326, !327}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !173, line: 380, baseType: !176, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !315, file: !173, line: 382, baseType: !13, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !315, file: !173, line: 384, baseType: !13, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !315, file: !173, line: 386, baseType: !321, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !173, line: 351, size: 16, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !322, file: !173, line: 359, baseType: !117, size: 8)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !322, file: !173, line: 364, baseType: !187, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !173, line: 388, baseType: !108, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !315, file: !173, line: 396, baseType: !190, size: 32, offset: 160)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "__init___device_dev_test", scope: !269, file: !308, line: 62, type: !330, isLocal: true, isDefinition: true, align: 32)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !332, line: 51, size: 64, elements: !333)
!332 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !{!334, !339}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !331, file: !332, line: 60, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DISubroutineType(types: !337)
!337 = !{!123, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !331, file: !332, line: 65, baseType: !338, size: 32, offset: 32)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "data", scope: !269, file: !308, line: 60, type: !342, isLocal: true, isDefinition: true)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_test_data", file: !308, line: 15, size: 128, elements: !343)
!343 = !{!344, !361}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !342, file: !308, line: 16, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !346, line: 38, size: 64, elements: !347)
!346 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!347 = !{!348, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !345, file: !346, line: 39, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !350, line: 33, baseType: !351)
!350 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !350, line: 29, size: 32, elements: !352)
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !351, file: !350, line: 30, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !345, file: !346, line: 41, baseType: !356, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !346, line: 35, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !360}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !123)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !342, file: !308, line: 17, baseType: !362, size: 64, offset: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !346, line: 45, size: 64, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !362, file: !346, line: 46, baseType: !349, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !362, file: !346, line: 48, baseType: !135, size: 32, offset: 32)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "__devstate_dev_test", scope: !269, file: !308, line: 62, type: !322, isLocal: true, isDefinition: true, align: 8)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "dev_test_api", scope: !269, file: !308, line: 50, type: !370, isLocal: true, isDefinition: true)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "test_api", file: !164, line: 8, size: 64, elements: !372)
!372 = !{!373, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !371, file: !164, line: 9, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !338}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !371, file: !164, line: 10, baseType: !374, size: 32, offset: 32)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !269, file: !308, line: 13, type: !380, isLocal: true, isDefinition: true)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !203, line: 17, baseType: !176, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !382, file: !203, line: 18, baseType: !117, size: 8, offset: 32)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "__devicehdl_dev_test", scope: !388, file: !393, line: 17, type: !309, isLocal: false, isDefinition: true, align: 16)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !390, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency")
!390 = !{!391, !394, !386}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_18", scope: !388, file: !393, line: 7, type: !309, isLocal: false, isDefinition: true, align: 16)
!393 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency")
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !388, file: !393, line: 12, type: !309, isLocal: false, isDefinition: true, align: 16)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !398, file: !451, line: 18, type: !453, isLocal: false, isDefinition: true)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !271, retainedTypes: !400, globals: !448, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency")
!400 = !{!22, !108, !24, !401, !403, !405, !406, !123, !235, !408, !410, !411, !412, !413, !414, !416, !124, !117, !427, !135, !176}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !407, line: 214, baseType: !32)
!407 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !415)
!415 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 32)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !418)
!418 = !{!419, !426}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !417, file: !111, line: 80, baseType: !420, size: 32)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !421)
!421 = !{!422, !423, !424, !425}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !420, file: !111, line: 47, baseType: !117, size: 8)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !420, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !420, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !420, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !417, file: !111, line: 82, baseType: !108, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !429)
!429 = !{!430, !446, !447}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !428, file: !31, line: 89, baseType: !431, size: 96)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !432)
!432 = !{!433, !444, !445}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !431, file: !31, line: 67, baseType: !434, size: 32)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !434, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !434, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !434, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !434, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !434, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !434, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !434, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !434, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !431, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !431, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !428, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !428, file: !31, line: 94, baseType: !151, offset: 128)
!448 = !{!396, !449}
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !398, file: !451, line: 18, type: !452, isLocal: true, isDefinition: true)
!451 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !454, file: !203, line: 17, baseType: !176, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !454, file: !203, line: 18, baseType: !117, size: 8, offset: 32)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "_char_out", scope: !460, file: !465, line: 54, type: !466, isLocal: false, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !462, retainedTypes: !463, globals: !464, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency")
!462 = !{!37}
!463 = !{!108, !123}
!464 = !{!458}
!465 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DISubroutineType(types: !468)
!468 = !{!123, !123}
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !471, file: !1203, line: 202, type: !1204, isLocal: true, isDefinition: true, align: 32)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !462, retainedTypes: !473, globals: !1202, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/pm/latency")
!473 = !{!108, !123, !474, !596, !933, !934, !1001}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !476, line: 335, baseType: !477)
!476 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 320, size: 288, elements: !478)
!478 = !{!479, !490, !498, !512, !523, !534, !536, !547, !548, !559, !560, !575, !576, !586}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !477, file: !476, line: 321, baseType: !480, size: 16)
!480 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !476, line: 50, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !476, line: 43, size: 16, elements: !483)
!483 = !{!484, !489}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !482, file: !476, line: 48, baseType: !485, size: 16)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !476, line: 44, size: 16, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !485, file: !476, line: 45, baseType: !414, size: 7, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !485, file: !476, line: 47, baseType: !414, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !482, file: !476, line: 49, baseType: !414, size: 16)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !477, file: !476, line: 322, baseType: !491, size: 16, offset: 16)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 16, elements: !496)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !493, line: 52, baseType: !494)
!493 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!496 = !{!497}
!497 = !DISubrange(count: 2)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !477, file: !476, line: 323, baseType: !499, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !476, line: 107, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !476, line: 94, size: 32, elements: !502)
!502 = !{!503, !511}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !501, file: !476, line: 105, baseType: !504, size: 32)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !476, line: 95, size: 32, elements: !505)
!505 = !{!506, !507, !508, !509, !510}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !504, file: !476, line: 97, baseType: !135, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !504, file: !476, line: 99, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !504, file: !476, line: 100, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !504, file: !476, line: 102, baseType: !135, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !504, file: !476, line: 103, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !501, file: !476, line: 106, baseType: !135, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !477, file: !476, line: 324, baseType: !513, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !476, line: 155, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !476, line: 148, size: 32, elements: !516)
!516 = !{!517, !522}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !515, file: !476, line: 153, baseType: !518, size: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !515, file: !476, line: 149, size: 32, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !518, file: !476, line: 150, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !518, file: !476, line: 151, baseType: !135, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !515, file: !476, line: 154, baseType: !135, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !477, file: !476, line: 325, baseType: !524, size: 8, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !476, line: 194, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !476, line: 187, size: 8, elements: !527)
!527 = !{!528, !533}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !526, file: !476, line: 192, baseType: !529, size: 8)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !476, line: 188, size: 8, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !529, file: !476, line: 189, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !529, file: !476, line: 190, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !526, file: !476, line: 193, baseType: !117, size: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !477, file: !476, line: 326, baseType: !535, size: 24, offset: 104)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 24, elements: !310)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !477, file: !476, line: 327, baseType: !537, size: 8, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !476, line: 215, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !476, line: 208, size: 8, elements: !540)
!540 = !{!541, !546}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !539, file: !476, line: 213, baseType: !542, size: 8)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !539, file: !476, line: 209, size: 8, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !542, file: !476, line: 210, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !542, file: !476, line: 211, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !539, file: !476, line: 214, baseType: !117, size: 8)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !477, file: !476, line: 328, baseType: !535, size: 24, offset: 136)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !477, file: !476, line: 329, baseType: !549, size: 8, offset: 160)
!549 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !476, line: 236, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !476, line: 229, size: 8, elements: !552)
!552 = !{!553, !558}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !551, file: !476, line: 234, baseType: !554, size: 8)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !551, file: !476, line: 230, size: 8, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !554, file: !476, line: 231, baseType: !494, size: 1, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !554, file: !476, line: 232, baseType: !494, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !551, file: !476, line: 235, baseType: !117, size: 8)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !477, file: !476, line: 330, baseType: !535, size: 24, offset: 168)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !477, file: !476, line: 331, baseType: !561, size: 16, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !476, line: 262, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !476, line: 250, size: 16, elements: !564)
!564 = !{!565, !574}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !563, file: !476, line: 260, baseType: !566, size: 16)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !563, file: !476, line: 251, size: 16, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !566, file: !476, line: 252, baseType: !414, size: 1, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !566, file: !476, line: 253, baseType: !414, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !566, file: !476, line: 254, baseType: !414, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !566, file: !476, line: 255, baseType: !414, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !566, file: !476, line: 256, baseType: !414, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !566, file: !476, line: 258, baseType: !414, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !563, file: !476, line: 261, baseType: !414, size: 16)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !477, file: !476, line: 332, baseType: !491, size: 16, offset: 208)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !477, file: !476, line: 333, baseType: !577, size: 32, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !476, line: 290, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !476, line: 284, size: 32, elements: !580)
!580 = !{!581, !585}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !579, file: !476, line: 288, baseType: !582, size: 32)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !579, file: !476, line: 285, size: 32, elements: !583)
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !582, file: !476, line: 286, baseType: !135, size: 22, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !579, file: !476, line: 289, baseType: !135, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !477, file: !476, line: 334, baseType: !587, size: 16, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !476, line: 308, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !476, line: 303, size: 16, elements: !590)
!590 = !{!591, !595}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !589, file: !476, line: 306, baseType: !592, size: 16)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !589, file: !476, line: 304, size: 16, elements: !593)
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !592, file: !476, line: 305, baseType: !414, size: 16, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !589, file: !476, line: 307, baseType: !414, size: 16)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !598, line: 928, baseType: !599)
!598 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !598, line: 899, size: 672, elements: !600)
!600 = !{!601, !625, !649, !675, !700, !716, !717, !735, !736, !753, !764, !765, !780, !800, !801, !813, !825, !835, !836, !853, !855, !866, !867, !879, !891, !892, !903, !919}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !599, file: !598, line: 900, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !598, line: 64, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 43, size: 32, elements: !605)
!605 = !{!606, !624}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !604, file: !598, line: 62, baseType: !607, size: 32)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !604, file: !598, line: 44, size: 32, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !607, file: !598, line: 45, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !607, file: !598, line: 46, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !607, file: !598, line: 47, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !607, file: !598, line: 48, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !607, file: !598, line: 49, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !607, file: !598, line: 50, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !607, file: !598, line: 51, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !607, file: !598, line: 52, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !607, file: !598, line: 53, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !607, file: !598, line: 54, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !607, file: !598, line: 55, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !607, file: !598, line: 56, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !607, file: !598, line: 58, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !607, file: !598, line: 59, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !607, file: !598, line: 60, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !604, file: !598, line: 63, baseType: !135, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !599, file: !598, line: 901, baseType: !626, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !598, line: 125, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 104, size: 32, elements: !629)
!629 = !{!630, !648}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !628, file: !598, line: 123, baseType: !631, size: 32)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !628, file: !598, line: 105, size: 32, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !631, file: !598, line: 106, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !631, file: !598, line: 107, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !631, file: !598, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !631, file: !598, line: 109, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !631, file: !598, line: 110, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !631, file: !598, line: 111, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !631, file: !598, line: 112, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !631, file: !598, line: 113, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !631, file: !598, line: 114, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !631, file: !598, line: 115, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !631, file: !598, line: 116, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !631, file: !598, line: 117, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !631, file: !598, line: 119, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !631, file: !598, line: 120, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !631, file: !598, line: 121, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !628, file: !598, line: 124, baseType: !135, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !599, file: !598, line: 902, baseType: !650, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !598, line: 186, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 165, size: 32, elements: !653)
!653 = !{!654, !674}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !652, file: !598, line: 184, baseType: !655, size: 32)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !652, file: !598, line: 166, size: 32, elements: !656)
!656 = !{!657, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !655, file: !598, line: 167, baseType: !658, size: 1, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !655, file: !598, line: 168, baseType: !658, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !655, file: !598, line: 169, baseType: !658, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !655, file: !598, line: 170, baseType: !658, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !655, file: !598, line: 171, baseType: !658, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !655, file: !598, line: 172, baseType: !658, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !655, file: !598, line: 173, baseType: !658, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !655, file: !598, line: 174, baseType: !658, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !655, file: !598, line: 175, baseType: !658, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !655, file: !598, line: 176, baseType: !658, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !655, file: !598, line: 177, baseType: !658, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !655, file: !598, line: 178, baseType: !658, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !655, file: !598, line: 180, baseType: !658, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !655, file: !598, line: 181, baseType: !658, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !655, file: !598, line: 182, baseType: !658, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !652, file: !598, line: 185, baseType: !135, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !599, file: !598, line: 903, baseType: !676, size: 32, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !598, line: 247, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 226, size: 32, elements: !680)
!680 = !{!681, !699}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !679, file: !598, line: 245, baseType: !682, size: 32)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !679, file: !598, line: 227, size: 32, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !682, file: !598, line: 228, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !682, file: !598, line: 229, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !682, file: !598, line: 230, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !682, file: !598, line: 231, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !682, file: !598, line: 232, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !682, file: !598, line: 233, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !682, file: !598, line: 234, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !682, file: !598, line: 235, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !682, file: !598, line: 236, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !682, file: !598, line: 237, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !682, file: !598, line: 238, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !682, file: !598, line: 239, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !682, file: !598, line: 241, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !682, file: !598, line: 242, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !682, file: !598, line: 243, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !679, file: !598, line: 246, baseType: !135, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !599, file: !598, line: 904, baseType: !701, size: 16, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !598, line: 300, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 287, size: 16, elements: !704)
!704 = !{!705, !715}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !703, file: !598, line: 298, baseType: !706, size: 16)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !703, file: !598, line: 288, size: 16, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713, !714}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !706, file: !598, line: 290, baseType: !414, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !706, file: !598, line: 291, baseType: !414, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !706, file: !598, line: 293, baseType: !414, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !706, file: !598, line: 294, baseType: !414, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !706, file: !598, line: 295, baseType: !414, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !706, file: !598, line: 296, baseType: !414, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !706, file: !598, line: 297, baseType: !414, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !703, file: !598, line: 299, baseType: !414, size: 16)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !599, file: !598, line: 905, baseType: !491, size: 16, offset: 144)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !599, file: !598, line: 906, baseType: !718, size: 16, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !598, line: 352, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 336, size: 16, elements: !721)
!721 = !{!722, !734}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !720, file: !598, line: 350, baseType: !723, size: 16)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !720, file: !598, line: 337, size: 16, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !723, file: !598, line: 339, baseType: !414, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !723, file: !598, line: 340, baseType: !414, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !723, file: !598, line: 341, baseType: !414, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !723, file: !598, line: 342, baseType: !414, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !723, file: !598, line: 343, baseType: !414, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !723, file: !598, line: 344, baseType: !414, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !723, file: !598, line: 345, baseType: !414, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !723, file: !598, line: 346, baseType: !414, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !723, file: !598, line: 348, baseType: !414, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !720, file: !598, line: 351, baseType: !414, size: 16)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !599, file: !598, line: 907, baseType: !491, size: 16, offset: 176)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !599, file: !598, line: 908, baseType: !737, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !598, line: 398, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 381, size: 32, elements: !740)
!740 = !{!741, !752}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !739, file: !598, line: 396, baseType: !742, size: 32)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !739, file: !598, line: 382, size: 32, elements: !743)
!743 = !{!744, !745, !746, !747, !748, !749, !750, !751}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !742, file: !598, line: 384, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !742, file: !598, line: 385, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !742, file: !598, line: 386, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !742, file: !598, line: 388, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !742, file: !598, line: 389, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !742, file: !598, line: 390, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !742, file: !598, line: 392, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !742, file: !598, line: 394, baseType: !135, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !739, file: !598, line: 397, baseType: !135, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !599, file: !598, line: 909, baseType: !754, size: 8, offset: 224)
!754 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !598, line: 433, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 426, size: 8, elements: !757)
!757 = !{!758, !763}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !756, file: !598, line: 431, baseType: !759, size: 8)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !756, file: !598, line: 427, size: 8, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !759, file: !598, line: 428, baseType: !117, size: 5, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !759, file: !598, line: 430, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !756, file: !598, line: 432, baseType: !117, size: 8)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !599, file: !598, line: 910, baseType: !535, size: 24, offset: 232)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !599, file: !598, line: 911, baseType: !766, size: 32, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !598, line: 462, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 448, size: 32, elements: !769)
!769 = !{!770, !779}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !768, file: !598, line: 460, baseType: !771, size: 32)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !768, file: !598, line: 449, size: 32, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !771, file: !598, line: 451, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !771, file: !598, line: 453, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !771, file: !598, line: 454, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !771, file: !598, line: 455, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !771, file: !598, line: 457, baseType: !135, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !771, file: !598, line: 459, baseType: !135, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !768, file: !598, line: 461, baseType: !135, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !599, file: !598, line: 912, baseType: !781, size: 16, offset: 288)
!781 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !598, line: 520, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 503, size: 16, elements: !784)
!784 = !{!785, !799}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !783, file: !598, line: 518, baseType: !786, size: 16)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !783, file: !598, line: 504, size: 16, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !786, file: !598, line: 506, baseType: !414, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !786, file: !598, line: 507, baseType: !414, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !786, file: !598, line: 508, baseType: !414, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !786, file: !598, line: 509, baseType: !414, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !786, file: !598, line: 510, baseType: !414, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !786, file: !598, line: 511, baseType: !414, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !786, file: !598, line: 512, baseType: !414, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !786, file: !598, line: 513, baseType: !414, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !786, file: !598, line: 514, baseType: !414, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !786, file: !598, line: 515, baseType: !414, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !786, file: !598, line: 516, baseType: !414, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !783, file: !598, line: 519, baseType: !414, size: 16)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !599, file: !598, line: 913, baseType: !491, size: 16, offset: 304)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !599, file: !598, line: 914, baseType: !802, size: 32, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !598, line: 559, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 552, size: 32, elements: !805)
!805 = !{!806, !812}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !804, file: !598, line: 557, baseType: !807, size: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !804, file: !598, line: 553, size: 32, elements: !808)
!808 = !{!809, !810, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !807, file: !598, line: 554, baseType: !135, size: 10, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !807, file: !598, line: 555, baseType: !135, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !807, file: !598, line: 556, baseType: !135, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !804, file: !598, line: 558, baseType: !135, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !599, file: !598, line: 915, baseType: !814, size: 32, offset: 352)
!814 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !598, line: 585, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 578, size: 32, elements: !817)
!817 = !{!818, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !816, file: !598, line: 583, baseType: !819, size: 32)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !598, line: 579, size: 32, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !819, file: !598, line: 580, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !819, file: !598, line: 581, baseType: !135, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !819, file: !598, line: 582, baseType: !135, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !816, file: !598, line: 584, baseType: !135, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !599, file: !598, line: 916, baseType: !826, size: 8, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !598, line: 610, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 604, size: 8, elements: !829)
!829 = !{!830, !834}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !828, file: !598, line: 608, baseType: !831, size: 8)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !828, file: !598, line: 605, size: 8, elements: !832)
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !831, file: !598, line: 607, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !828, file: !598, line: 609, baseType: !117, size: 8)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !599, file: !598, line: 917, baseType: !535, size: 24, offset: 392)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !599, file: !598, line: 918, baseType: !837, size: 32, offset: 416)
!837 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !598, line: 639, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 622, size: 32, elements: !840)
!840 = !{!841, !852}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !839, file: !598, line: 637, baseType: !842, size: 32)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !839, file: !598, line: 623, size: 32, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !842, file: !598, line: 625, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !842, file: !598, line: 626, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !842, file: !598, line: 627, baseType: !135, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !842, file: !598, line: 629, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !842, file: !598, line: 631, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !842, file: !598, line: 632, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !842, file: !598, line: 634, baseType: !135, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !842, file: !598, line: 635, baseType: !135, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !839, file: !598, line: 638, baseType: !135, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !599, file: !598, line: 919, baseType: !854, size: 32, offset: 448)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 32, elements: !148)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !599, file: !598, line: 920, baseType: !856, size: 16, offset: 480)
!856 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !598, line: 715, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 706, size: 16, elements: !859)
!859 = !{!860, !865}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !858, file: !598, line: 713, baseType: !861, size: 16)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !858, file: !598, line: 707, size: 16, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !861, file: !598, line: 709, baseType: !414, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !861, file: !598, line: 711, baseType: !414, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !858, file: !598, line: 714, baseType: !414, size: 16)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !599, file: !598, line: 921, baseType: !491, size: 16, offset: 496)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !599, file: !598, line: 922, baseType: !868, size: 32, offset: 512)
!868 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !598, line: 739, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 729, size: 32, elements: !871)
!871 = !{!872, !878}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !870, file: !598, line: 737, baseType: !873, size: 32)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !870, file: !598, line: 730, size: 32, elements: !874)
!874 = !{!875, !876, !877}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !873, file: !598, line: 732, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !873, file: !598, line: 733, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !873, file: !598, line: 735, baseType: !135, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !870, file: !598, line: 738, baseType: !135, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !599, file: !598, line: 923, baseType: !880, size: 8, offset: 544)
!880 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !598, line: 765, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 756, size: 8, elements: !883)
!883 = !{!884, !890}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !882, file: !598, line: 763, baseType: !885, size: 8)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !882, file: !598, line: 757, size: 8, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !885, file: !598, line: 759, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !885, file: !598, line: 761, baseType: !117, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !885, file: !598, line: 762, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !882, file: !598, line: 764, baseType: !117, size: 8)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !599, file: !598, line: 924, baseType: !535, size: 24, offset: 552)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !599, file: !598, line: 925, baseType: !893, size: 32, offset: 576)
!893 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !598, line: 789, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !598, line: 781, size: 32, elements: !896)
!896 = !{!897, !902}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !895, file: !598, line: 787, baseType: !898, size: 32)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !895, file: !598, line: 782, size: 32, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !898, file: !598, line: 783, baseType: !135, size: 12, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !898, file: !598, line: 785, baseType: !135, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !895, file: !598, line: 788, baseType: !135, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !599, file: !598, line: 926, baseType: !904, size: 32, offset: 608)
