; ModuleID = 'build/96b_carbon_nrf51/work_queue/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.zbus_observer = type { i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type { i32 }
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !27, file: !106, line: 16, type: !282, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !323, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/work_queue/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !307, !319, !190, !321}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_wq_info", file: !106, line: 68, size: 192, elements: !107)
!106 = !DIFile(filename: "zephyr/samples/subsys/zbus/work_queue/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!107 = !{!108, !263, !318}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !105, file: !106, line: 69, baseType: !109, size: 128)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !110, line: 3663, size: 128, elements: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112, !119, !125, !262}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !109, file: !110, line: 3669, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !114, line: 33, baseType: !115)
!114 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !114, line: 29, size: 32, elements: !116)
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !114, line: 30, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !109, file: !110, line: 3672, baseType: !120, size: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !110, line: 3071, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !109, file: !110, line: 3675, baseType: !126, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !110, line: 3810, size: 1408, elements: !128)
!128 = !{!129, !252, !259, !260, !261}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !127, file: !110, line: 3812, baseType: !130, size: 1152)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !131, line: 245, size: 1152, elements: !132)
!131 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!132 = !{!133, !205, !218, !219, !220, !225, !226, !247}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !130, file: !131, line: 247, baseType: !134, size: 384)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !131, line: 57, size: 384, elements: !135)
!135 = !{!136, !164, !172, !175, !176, !189, !191, !192}
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !131, line: 60, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !131, line: 60, size: 64, elements: !138)
!138 = !{!139, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !137, file: !131, line: 61, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !141, line: 49, baseType: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !141, line: 37, size: 64, elements: !143)
!143 = !{!144, !150}
!144 = !DIDerivedType(tag: DW_TAG_member, scope: !142, file: !141, line: 38, baseType: !145, size: 32)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !141, line: 38, size: 32, elements: !146)
!146 = !{!147, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !145, file: !141, line: 39, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !141, line: 40, baseType: !148, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, scope: !142, file: !141, line: 42, baseType: !151, size: 32, offset: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !141, line: 42, size: 32, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !151, file: !141, line: 43, baseType: !148, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !151, file: !141, line: 44, baseType: !148, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !137, file: !131, line: 62, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !156, file: !157, line: 50, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!162 = !{!163}
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !134, file: !131, line: 68, baseType: !165, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !167, line: 233, baseType: !168)
!167 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 231, size: 64, elements: !169)
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !168, file: !167, line: 232, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !141, line: 48, baseType: !142)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !134, file: !131, line: 71, baseType: !173, size: 8, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !174)
!174 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !134, file: !131, line: 74, baseType: !173, size: 8, offset: 104)
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !131, line: 90, baseType: !177, size: 16, offset: 112)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !131, line: 90, size: 16, elements: !178)
!178 = !{!179, !186}
!179 = !DIDerivedType(tag: DW_TAG_member, scope: !177, file: !131, line: 91, baseType: !180, size: 16)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !131, line: 91, size: 16, elements: !181)
!181 = !{!182, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !180, file: !131, line: 96, baseType: !183, size: 8)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !184)
!184 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !180, file: !131, line: 97, baseType: !173, size: 8, offset: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !177, file: !131, line: 100, baseType: !187, size: 16)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !188)
!188 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !134, file: !131, line: 107, baseType: !190, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !134, file: !131, line: 127, baseType: !102, size: 32, offset: 160)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !134, file: !131, line: 131, baseType: !193, size: 192, offset: 192)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !167, line: 244, size: 192, elements: !194)
!194 = !{!195, !196, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !193, file: !167, line: 245, baseType: !140, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !193, file: !167, line: 246, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !167, line: 242, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !193, file: !167, line: 249, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !204)
!204 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !130, file: !131, line: 250, baseType: !206, size: 288, offset: 384)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !207, line: 25, size: 288, elements: !208)
!207 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !206, file: !207, line: 26, baseType: !190, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !206, file: !207, line: 27, baseType: !190, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !206, file: !207, line: 28, baseType: !190, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !206, file: !207, line: 29, baseType: !190, size: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !206, file: !207, line: 30, baseType: !190, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !206, file: !207, line: 31, baseType: !190, size: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !206, file: !207, line: 32, baseType: !190, size: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !206, file: !207, line: 33, baseType: !190, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !206, file: !207, line: 34, baseType: !190, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !130, file: !131, line: 253, baseType: !102, size: 32, offset: 672)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !130, file: !131, line: 256, baseType: !166, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !131, line: 279, baseType: !221, size: 256, offset: 768)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 256, elements: !223)
!222 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!223 = !{!224}
!224 = !DISubrange(count: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !130, file: !131, line: 294, baseType: !103, size: 32, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !130, file: !131, line: 325, baseType: !227, size: 32, offset: 1056)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !110, line: 5073, size: 192, elements: !229)
!229 = !{!230, !241, !242}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !228, file: !110, line: 5074, baseType: !231, size: 96)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !232, line: 56, size: 96, elements: !233)
!232 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = !{!234, !237, !238}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !231, file: !232, line: 57, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !232, line: 57, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !231, file: !232, line: 58, baseType: !102, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !231, file: !232, line: 59, baseType: !239, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !240, line: 214, baseType: !32)
!240 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !228, file: !110, line: 5075, baseType: !166, size: 64, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !228, file: !110, line: 5076, baseType: !243, size: 32, offset: 160)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, size: 32, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !243, file: !244, line: 52, baseType: !22, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !130, file: !131, line: 343, baseType: !248, size: 64, offset: 1088)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !207, line: 60, size: 64, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !248, file: !207, line: 63, baseType: !190, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !248, file: !207, line: 66, baseType: !190, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !127, file: !110, line: 3819, baseType: !253, size: 64, offset: 1152)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !114, line: 40, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !114, line: 35, size: 64, elements: !255)
!255 = !{!256, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !254, file: !114, line: 36, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !254, file: !114, line: 37, baseType: !257, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !127, file: !110, line: 3822, baseType: !166, size: 64, offset: 1216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !127, file: !110, line: 3825, baseType: !166, size: 64, offset: 1280)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !127, file: !110, line: 3828, baseType: !190, size: 32, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !109, file: !110, line: 3683, baseType: !190, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !105, file: !106, line: 70, baseType: !264, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !267, line: 29, size: 192, elements: !268)
!267 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!268 = !{!269, !271, !273, !274, !280, !289}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !266, file: !267, line: 35, baseType: !270, size: 16)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !266, file: !267, line: 40, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !266, file: !267, line: 45, baseType: !272, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !266, file: !267, line: 51, baseType: !275, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{!279, !13, !239}
!279 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !266, file: !267, line: 56, baseType: !281, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !110, line: 2720, size: 160, elements: !283)
!283 = !{!284, !285, !287, !288}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !282, file: !110, line: 2722, baseType: !166, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !282, file: !110, line: 2724, baseType: !286, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !282, file: !110, line: 2727, baseType: !190, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !282, file: !110, line: 2730, baseType: !103, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !266, file: !267, line: 67, baseType: !290, size: 32, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !267, line: 85, size: 96, elements: !295)
!295 = !{!296, !297, !313}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !294, file: !267, line: 91, baseType: !279, size: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !294, file: !267, line: 93, baseType: !298, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !110, line: 4204, size: 352, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !308, !309, !310, !311, !312}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !300, file: !110, line: 4206, baseType: !166, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !300, file: !110, line: 4208, baseType: !243, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !300, file: !110, line: 4210, baseType: !239, size: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !300, file: !110, line: 4212, baseType: !190, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !300, file: !110, line: 4214, baseType: !307, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !300, file: !110, line: 4216, baseType: !307, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !300, file: !110, line: 4218, baseType: !307, size: 32, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !300, file: !110, line: 4220, baseType: !307, size: 32, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !300, file: !110, line: 4222, baseType: !190, size: 32, offset: 288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !110, line: 4227, baseType: !173, size: 8, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !294, file: !267, line: 96, baseType: !314, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !264}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !105, file: !106, line: 71, baseType: !173, size: 8, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !320, line: 46, baseType: !203)
!320 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !322)
!322 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!323 = !{!25, !324, !326, !328, !330, !332, !334, !336, !338, !340, !342, !344, !346, !379, !383, !385, !387, !389, !391, !393, !395, !397, !399, !404, !409, !411, !413, !415, !417, !419, !421, !423, !431, !436, !443, !448, !450, !452}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "version_chan", scope: !27, file: !106, line: 16, type: !265, isLocal: false, isDefinition: true, align: 32)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "_zbus_mutex_sensor_data_chan", scope: !27, file: !106, line: 26, type: !282, isLocal: true, isDefinition: true, align: 32)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "sensor_data_chan", scope: !27, file: !106, line: 26, type: !265, isLocal: false, isDefinition: true, align: 32)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "fast_handler1_lis", scope: !27, file: !106, line: 46, type: !294, isLocal: false, isDefinition: true, align: 32)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "fast_handler2_lis", scope: !27, file: !106, line: 56, type: !294, isLocal: false, isDefinition: true, align: 32)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "fast_handler3_lis", scope: !27, file: !106, line: 66, type: !294, isLocal: false, isDefinition: true, align: 32)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "delay_handler1_lis", scope: !27, file: !106, line: 97, type: !294, isLocal: false, isDefinition: true, align: 32)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "delay_handler2_lis", scope: !27, file: !106, line: 106, type: !294, isLocal: false, isDefinition: true, align: 32)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "delay_handler3_lis", scope: !27, file: !106, line: 115, type: !294, isLocal: false, isDefinition: true, align: 32)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_thread_handler1_sub", scope: !27, file: !106, line: 128, type: !300, isLocal: false, isDefinition: true, align: 32)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "thread_handler1_sub", scope: !27, file: !106, line: 128, type: !294, isLocal: false, isDefinition: true, align: 32)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_handler1_id", scope: !27, file: !106, line: 145, type: !348, isLocal: false, isDefinition: true, align: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !110, line: 620, size: 384, elements: !349)
!349 = !{!350, !351, !359, !360, !365, !366, !367, !368, !369, !370, !372, !376}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !348, file: !110, line: 621, baseType: !286, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !348, file: !110, line: 622, baseType: !352, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !354, line: 44, baseType: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !356, line: 47, size: 8, elements: !357)
!356 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = !{!358}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !355, file: !356, line: 48, baseType: !222, size: 8)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !348, file: !110, line: 623, baseType: !32, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !348, file: !110, line: 624, baseType: !361, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !354, line: 46, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !102, !102, !102}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !348, file: !110, line: 625, baseType: !102, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !348, file: !110, line: 626, baseType: !102, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !348, file: !110, line: 627, baseType: !102, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !348, file: !110, line: 628, baseType: !103, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !348, file: !110, line: 629, baseType: !190, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !348, file: !110, line: 630, baseType: !371, size: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !348, file: !110, line: 631, baseType: !373, size: 32, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DISubroutineType(types: !375)
!375 = !{null}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !348, file: !110, line: 632, baseType: !377, size: 32, offset: 352)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "thread_handler1_id", scope: !27, file: !106, line: 145, type: !381, isLocal: false, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !131, line: 347, baseType: !286)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_thread_handler2_sub", scope: !27, file: !106, line: 147, type: !300, isLocal: false, isDefinition: true, align: 32)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "thread_handler2_sub", scope: !27, file: !106, line: 147, type: !294, isLocal: false, isDefinition: true, align: 32)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_handler2_id", scope: !27, file: !106, line: 164, type: !348, isLocal: false, isDefinition: true, align: 32)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "thread_handler2_id", scope: !27, file: !106, line: 164, type: !381, isLocal: false, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_thread_handler3_sub", scope: !27, file: !106, line: 166, type: !300, isLocal: false, isDefinition: true, align: 32)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "thread_handler3_sub", scope: !27, file: !106, line: 166, type: !294, isLocal: false, isDefinition: true, align: 32)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "_k_thread_data_thread_handler3_id", scope: !27, file: !106, line: 183, type: !348, isLocal: false, isDefinition: true, align: 32)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "thread_handler3_id", scope: !27, file: !106, line: 183, type: !381, isLocal: false, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_thread_handler1_sub", scope: !27, file: !106, line: 128, type: !401, isLocal: true, isDefinition: true, align: 32)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 128, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 16)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_handler1_id", scope: !27, file: !106, line: 145, type: !406, isLocal: false, isDefinition: true, align: 64)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 8192, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 1024)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_handler1_id", scope: !27, file: !106, line: 145, type: !130, isLocal: false, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_thread_handler2_sub", scope: !27, file: !106, line: 147, type: !401, isLocal: true, isDefinition: true, align: 32)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_handler2_id", scope: !27, file: !106, line: 164, type: !406, isLocal: false, isDefinition: true, align: 64)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_handler2_id", scope: !27, file: !106, line: 164, type: !130, isLocal: false, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_thread_handler3_sub", scope: !27, file: !106, line: 166, type: !401, isLocal: true, isDefinition: true, align: 32)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "_k_thread_stack_thread_handler3_id", scope: !27, file: !106, line: 183, type: !406, isLocal: false, isDefinition: true, align: 64)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "_k_thread_obj_thread_handler3_id", scope: !27, file: !106, line: 183, type: !130, isLocal: false, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !27, file: !106, line: 16, type: !425, isLocal: true, isDefinition: true)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !426, line: 9, size: 32, elements: !427)
!426 = !DIFile(filename: "zephyr/samples/subsys/zbus/work_queue/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !425, file: !426, line: 10, baseType: !173, size: 8)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !425, file: !426, line: 11, baseType: !173, size: 8, offset: 8)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !425, file: !426, line: 12, baseType: !187, size: 16, offset: 16)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !27, file: !106, line: 16, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 32, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 1)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "_zbus_message_sensor_data_chan", scope: !27, file: !106, line: 26, type: !438, isLocal: true, isDefinition: true)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_msg", file: !426, line: 15, size: 96, elements: !439)
!439 = !{!440, !441, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !438, file: !426, line: 16, baseType: !190, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "press", scope: !438, file: !426, line: 17, baseType: !190, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "humidity", scope: !438, file: !426, line: 18, baseType: !190, size: 32, offset: 64)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "_zbus_observers_sensor_data_chan", scope: !27, file: !106, line: 26, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 320, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 10)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "wq_handler1", scope: !27, file: !106, line: 74, type: !105, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "wq_handler2", scope: !27, file: !106, line: 75, type: !105, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "wq_handler3", scope: !27, file: !106, line: 76, type: !105, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "_k_thread_obj_peripheral_thread_id", scope: !456, file: !462, line: 30, type: !467, isLocal: false, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !458, globals: !459, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/work_queue/src/sensors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!458 = !{!319, !102, !103, !190, !321}
!459 = !{!460, !579, !583, !454}
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "_k_thread_data_peripheral_thread_id", scope: !456, file: !462, line: 30, type: !463, isLocal: false, isDefinition: true, align: 32)
!462 = !DIFile(filename: "zephyr/samples/subsys/zbus/work_queue/src/sensors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !110, line: 620, size: 384, elements: !464)
!464 = !{!465, !563, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !463, file: !110, line: 621, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !131, line: 245, size: 1152, elements: !468)
!468 = !{!469, !527, !539, !540, !541, !542, !543, !558}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !467, file: !131, line: 247, baseType: !470, size: 384)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !131, line: 57, size: 384, elements: !471)
!471 = !{!472, !496, !503, !504, !505, !514, !515, !516}
!472 = !DIDerivedType(tag: DW_TAG_member, scope: !470, file: !131, line: 60, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !470, file: !131, line: 60, size: 64, elements: !474)
!474 = !{!475, !490}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !473, file: !131, line: 61, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !141, line: 49, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !141, line: 37, size: 64, elements: !478)
!478 = !{!479, !485}
!479 = !DIDerivedType(tag: DW_TAG_member, scope: !477, file: !141, line: 38, baseType: !480, size: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !477, file: !141, line: 38, size: 32, elements: !481)
!481 = !{!482, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !480, file: !141, line: 39, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !480, file: !141, line: 40, baseType: !483, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, scope: !477, file: !141, line: 42, baseType: !486, size: 32, offset: 32)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !477, file: !141, line: 42, size: 32, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !486, file: !141, line: 43, baseType: !483, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !486, file: !141, line: 44, baseType: !483, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !473, file: !131, line: 62, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !491, file: !157, line: 50, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 64, elements: !162)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !470, file: !131, line: 68, baseType: !497, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !167, line: 233, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 231, size: 64, elements: !500)
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !499, file: !167, line: 232, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !141, line: 48, baseType: !477)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !470, file: !131, line: 71, baseType: !173, size: 8, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !470, file: !131, line: 74, baseType: !173, size: 8, offset: 104)
!505 = !DIDerivedType(tag: DW_TAG_member, scope: !470, file: !131, line: 90, baseType: !506, size: 16, offset: 112)
!506 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !470, file: !131, line: 90, size: 16, elements: !507)
!507 = !{!508, !513}
!508 = !DIDerivedType(tag: DW_TAG_member, scope: !506, file: !131, line: 91, baseType: !509, size: 16)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !506, file: !131, line: 91, size: 16, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !509, file: !131, line: 96, baseType: !183, size: 8)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !509, file: !131, line: 97, baseType: !173, size: 8, offset: 8)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !506, file: !131, line: 100, baseType: !187, size: 16)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !470, file: !131, line: 107, baseType: !190, size: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !470, file: !131, line: 127, baseType: !102, size: 32, offset: 160)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !470, file: !131, line: 131, baseType: !517, size: 192, offset: 192)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !167, line: 244, size: 192, elements: !518)
!518 = !{!519, !520, !526}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !517, file: !167, line: 245, baseType: !476, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !517, file: !167, line: 246, baseType: !521, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !167, line: 242, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !517, file: !167, line: 249, baseType: !203, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !467, file: !131, line: 250, baseType: !528, size: 288, offset: 384)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !207, line: 25, size: 288, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !528, file: !207, line: 26, baseType: !190, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !528, file: !207, line: 27, baseType: !190, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !528, file: !207, line: 28, baseType: !190, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !528, file: !207, line: 29, baseType: !190, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !528, file: !207, line: 30, baseType: !190, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !528, file: !207, line: 31, baseType: !190, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !528, file: !207, line: 32, baseType: !190, size: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !528, file: !207, line: 33, baseType: !190, size: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !528, file: !207, line: 34, baseType: !190, size: 32, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !467, file: !131, line: 253, baseType: !102, size: 32, offset: 672)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !467, file: !131, line: 256, baseType: !498, size: 64, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !467, file: !131, line: 279, baseType: !221, size: 256, offset: 768)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !467, file: !131, line: 294, baseType: !103, size: 32, offset: 1024)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !467, file: !131, line: 325, baseType: !544, size: 32, offset: 1056)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !110, line: 5073, size: 192, elements: !546)
!546 = !{!547, !553, !554}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !545, file: !110, line: 5074, baseType: !548, size: 96)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !232, line: 56, size: 96, elements: !549)
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !548, file: !232, line: 57, baseType: !235, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !548, file: !232, line: 58, baseType: !102, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !548, file: !232, line: 59, baseType: !239, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !545, file: !110, line: 5075, baseType: !498, size: 64, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !545, file: !110, line: 5076, baseType: !555, size: 32, offset: 160)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, size: 32, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !555, file: !244, line: 52, baseType: !22, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !467, file: !131, line: 343, baseType: !559, size: 64, offset: 1088)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !207, line: 60, size: 64, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !559, file: !207, line: 63, baseType: !190, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !559, file: !207, line: 66, baseType: !190, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !463, file: !110, line: 622, baseType: !564, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !354, line: 44, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !356, line: 47, size: 8, elements: !567)
!567 = !{!568}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !566, file: !356, line: 48, baseType: !222, size: 8)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !463, file: !110, line: 623, baseType: !32, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !463, file: !110, line: 624, baseType: !361, size: 32, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !463, file: !110, line: 625, baseType: !102, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !463, file: !110, line: 626, baseType: !102, size: 32, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !463, file: !110, line: 627, baseType: !102, size: 32, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !463, file: !110, line: 628, baseType: !103, size: 32, offset: 224)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !463, file: !110, line: 629, baseType: !190, size: 32, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !463, file: !110, line: 630, baseType: !371, size: 32, offset: 288)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !463, file: !110, line: 631, baseType: !373, size: 32, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !463, file: !110, line: 632, baseType: !377, size: 32, offset: 352)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "peripheral_thread_id", scope: !456, file: !462, line: 30, type: !581, isLocal: false, isDefinition: true)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !131, line: 347, baseType: !466)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "_k_thread_stack_peripheral_thread_id", scope: !456, file: !462, line: 30, type: !585, isLocal: false, isDefinition: true, align: 64)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 8192, elements: !407)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !588, file: !603, line: 18, type: !604, isLocal: false, isDefinition: true)
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !590, globals: !602, splitDebugInlining: false, nameTableKind: None)
!589 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!590 = !{!22, !102, !24, !591, !593, !595, !239, !103, !596, !597, !599, !600, !307, !601, !187, !377}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!602 = !{!586}
!603 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !606, line: 16, size: 64, elements: !607)
!606 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !606, line: 17, baseType: !377, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !605, file: !606, line: 18, baseType: !173, size: 8, offset: 32)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "_char_out", scope: !612, file: !616, line: 54, type: !617, isLocal: false, isDefinition: true)
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !614, globals: !615, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!614 = !{!102, !103}
!615 = !{!610}
!616 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DISubroutineType(types: !619)
!619 = !{!103, !103}
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !622, file: !655, line: 22, type: !685, isLocal: false, isDefinition: true)
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !624, retainedTypes: !636, globals: !652, splitDebugInlining: false, nameTableKind: None)
!623 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!624 = !{!625, !30}
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !626, line: 27, baseType: !32, size: 32, elements: !627)
!626 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635}
!628 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!629 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!630 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!631 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!632 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!633 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!634 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!635 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!636 = !{!102, !319, !103, !24, !637, !307, !190, !321}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !639, line: 54, size: 96, elements: !640)
!639 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!640 = !{!641, !647, !651}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !638, file: !639, line: 55, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !114, line: 33, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !114, line: 29, size: 32, elements: !644)
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !643, file: !114, line: 30, baseType: !646, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !638, file: !639, line: 60, baseType: !648, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !625}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !638, file: !639, line: 65, baseType: !648, size: 32, offset: 64)
!652 = !{!620, !653, !659, !664, !666, !675, !677}
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !622, file: !655, line: 27, type: !656, isLocal: true, isDefinition: true)
!655 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 32, elements: !434)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !658, line: 22, baseType: !598)
!658 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !622, file: !655, line: 44, type: !661, isLocal: true, isDefinition: true)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, size: 32, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !661, file: !244, line: 52, baseType: !22, size: 32)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !622, file: !655, line: 49, type: !661, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !622, file: !655, line: 36, type: !668, isLocal: true, isDefinition: true)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 128, elements: !434)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !626, line: 114, size: 128, elements: !670)
!670 = !{!671, !672, !673, !674}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !669, file: !626, line: 115, baseType: !625, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !669, file: !626, line: 141, baseType: !173, size: 8, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !669, file: !626, line: 149, baseType: !190, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !669, file: !626, line: 156, baseType: !190, size: 32, offset: 96)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !622, file: !655, line: 40, type: !668, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !622, file: !655, line: 28, type: !679, isLocal: true, isDefinition: true)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !114, line: 40, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !114, line: 35, size: 64, elements: !681)
!681 = !{!682, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !680, file: !114, line: 36, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !680, file: !114, line: 37, baseType: !683, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !606, line: 16, size: 64, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !686, file: !606, line: 17, baseType: !377, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !686, file: !606, line: 18, baseType: !173, size: 8, offset: 32)
!690 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!691 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !694, file: !722, line: 50, type: !371, isLocal: true, isDefinition: true)
!694 = distinct !DICompileUnit(language: DW_LANG_C99, file: !695, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !624, retainedTypes: !696, globals: !719, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!696 = !{!697, !319, !239, !103, !102, !190, !321, !699, !307, !371, !710}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !698)
!698 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !701, line: 45, size: 64, elements: !702)
!701 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!702 = !{!703, !709}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !700, file: !701, line: 46, baseType: !704, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !114, line: 33, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !114, line: 29, size: 32, elements: !706)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !114, line: 30, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !700, file: !701, line: 48, baseType: !190, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !701, line: 38, size: 64, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !711, file: !701, line: 39, baseType: !704, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !711, file: !701, line: 41, baseType: !715, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !701, line: 35, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !371}
!719 = !{!720, !726, !734, !692, !736, !746}
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "latency_lock", scope: !694, file: !722, line: 44, type: !723, isLocal: true, isDefinition: true)
!722 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, size: 32, elements: !724)
!724 = !{!725}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !723, file: !244, line: 52, baseType: !22, size: 32)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !694, file: !722, line: 46, type: !728, isLocal: true, isDefinition: true)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !114, line: 40, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !114, line: 35, size: 64, elements: !730)
!730 = !{!731, !733}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !729, file: !114, line: 36, baseType: !732, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !729, file: !114, line: 37, baseType: !732, size: 32, offset: 32)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "latency_subs", scope: !694, file: !722, line: 52, type: !728, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !694, file: !722, line: 39, type: !738, isLocal: true, isDefinition: true)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, elements: !744)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !722, line: 35, size: 96, elements: !740)
!740 = !{!741, !742, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !739, file: !722, line: 36, baseType: !625, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !739, file: !722, line: 37, baseType: !173, size: 8, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !739, file: !722, line: 38, baseType: !657, size: 32, offset: 64)
!744 = !{!745}
!745 = !DISubrange(count: 0)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !694, file: !722, line: 48, type: !371, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !750, file: !757, line: 47, type: !771, isLocal: true, isDefinition: true)
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !752, retainedTypes: !753, globals: !754, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!752 = !{!625}
!753 = !{!239, !103}
!754 = !{!755, !748, !767}
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "cpus_states", scope: !750, file: !757, line: 50, type: !758, isLocal: true, isDefinition: true)
!757 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 32, elements: !434)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !626, line: 114, size: 128, elements: !762)
!762 = !{!763, !764, !765, !766}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !761, file: !626, line: 115, baseType: !625, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !761, file: !626, line: 141, baseType: !173, size: 8, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !761, file: !626, line: 149, baseType: !190, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !761, file: !626, line: 156, baseType: !190, size: 32, offset: 96)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !750, file: !757, line: 55, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 8, elements: !434)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, elements: !744)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !774, file: !781, line: 21, type: !617, isLocal: true, isDefinition: true)
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !775, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !776, globals: !780, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!776 = !{!777, !103, !102}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !779, line: 22, baseType: !103)
!779 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!780 = !{!772}
!781 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !784, file: !883, line: 31, type: !899, isLocal: false, isDefinition: true)
!784 = distinct !DICompileUnit(language: DW_LANG_C99, file: !785, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !786, globals: !880, splitDebugInlining: false, nameTableKind: None)
!785 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!786 = !{!787, !173, !102, !103, !853, !854, !869, !190}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !789, line: 247, baseType: !790)
!789 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !789, line: 216, size: 20576, elements: !791)
!791 = !{!792, !798, !799, !800, !804, !805, !809, !810, !811, !815, !816, !820, !821, !825, !826, !830, !831, !833, !834, !835, !836, !840, !841, !842, !843, !847, !848, !852}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !790, file: !789, line: 217, baseType: !793, size: 960)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 960, elements: !796)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !190)
!796 = !{!797}
!797 = !DISubrange(count: 30)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !790, file: !789, line: 218, baseType: !795, size: 32, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !790, file: !789, line: 219, baseType: !795, size: 32, offset: 992)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !790, file: !789, line: 220, baseType: !801, size: 1088, offset: 1024)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 1088, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 34)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !790, file: !789, line: 221, baseType: !795, size: 32, offset: 2112)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !790, file: !789, line: 222, baseType: !806, size: 4032, offset: 2144)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 4032, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 126)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !790, file: !789, line: 223, baseType: !795, size: 32, offset: 6176)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !790, file: !789, line: 224, baseType: !795, size: 32, offset: 6208)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !790, file: !789, line: 225, baseType: !812, size: 1952, offset: 6240)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 1952, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 61)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !790, file: !789, line: 226, baseType: !795, size: 32, offset: 8192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !790, file: !789, line: 227, baseType: !817, size: 288, offset: 8224)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 288, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 9)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !790, file: !789, line: 228, baseType: !794, size: 32, offset: 8512)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !790, file: !789, line: 229, baseType: !822, size: 1696, offset: 8544)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 1696, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 53)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !790, file: !789, line: 230, baseType: !795, size: 32, offset: 10240)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !790, file: !789, line: 231, baseType: !827, size: 96, offset: 10272)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 96, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 3)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !790, file: !789, line: 232, baseType: !795, size: 32, offset: 10368)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !790, file: !789, line: 233, baseType: !832, size: 64, offset: 10400)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 64, elements: !162)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !790, file: !789, line: 234, baseType: !795, size: 32, offset: 10464)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !790, file: !789, line: 236, baseType: !794, size: 32, offset: 10496)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !790, file: !789, line: 237, baseType: !795, size: 32, offset: 10528)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !790, file: !789, line: 238, baseType: !837, size: 224, offset: 10560)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 224, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 7)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !790, file: !789, line: 239, baseType: !795, size: 32, offset: 10784)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !790, file: !789, line: 241, baseType: !827, size: 96, offset: 10816)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !790, file: !789, line: 242, baseType: !795, size: 32, offset: 10912)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !790, file: !789, line: 243, baseType: !844, size: 256, offset: 10944)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 256, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 8)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !790, file: !789, line: 244, baseType: !795, size: 32, offset: 11200)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !790, file: !789, line: 245, baseType: !849, size: 9312, offset: 11232)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 9312, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 291)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !790, file: !789, line: 246, baseType: !795, size: 32, offset: 20544)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !856, line: 352, baseType: !857)
!856 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !856, line: 341, size: 320, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866, !868}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !857, file: !856, line: 343, baseType: !794, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !857, file: !856, line: 344, baseType: !795, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !857, file: !856, line: 345, baseType: !190, size: 32, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !857, file: !856, line: 346, baseType: !795, size: 32, offset: 96)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !857, file: !856, line: 347, baseType: !795, size: 32, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !857, file: !856, line: 348, baseType: !795, size: 32, offset: 160)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !857, file: !856, line: 349, baseType: !190, size: 32, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !857, file: !856, line: 350, baseType: !867, size: 64, offset: 224)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 64, elements: !162)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !857, file: !856, line: 351, baseType: !795, size: 32, offset: 288)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !871, file: !870, line: 167, baseType: !879)
!870 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!871 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !870, file: !870, line: 134, type: !872, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !784, retainedNodes: !874)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !190}
!874 = !{!875, !876, !878}
!875 = !DILocalVariable(name: "time_us", arg: 1, scope: !871, file: !870, line: 134, type: !190)
!876 = !DILocalVariable(name: "delay_cycles", scope: !871, file: !870, line: 168, type: !877)
!877 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!878 = !DILocalVariable(name: "cycles", scope: !871, file: !870, line: 171, type: !190)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!880 = !{!782, !881, !896}
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !784, file: !883, line: 71, type: !884, isLocal: true, isDefinition: true, align: 32)
!883 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !886, line: 51, size: 64, elements: !887)
!886 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!887 = !{!888, !895}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !885, file: !886, line: 60, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = !DISubroutineType(types: !891)
!891 = !{!103, !892}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !886, line: 48, flags: DIFlagFwdDecl)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !885, file: !886, line: 65, baseType: !892, size: 32, offset: 32)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !871, file: !870, line: 161, type: !898, isLocal: true, isDefinition: true, align: 128)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 48, elements: !828)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !606, line: 16, size: 64, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !900, file: !606, line: 17, baseType: !377, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !900, file: !606, line: 18, baseType: !173, size: 8, offset: 32)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !906, file: !910, line: 10, type: !911, isLocal: false, isDefinition: true)
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !908, globals: !909, splitDebugInlining: false, nameTableKind: None)
!907 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!908 = !{!319, !102, !103}
!909 = !{!904}
!910 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !606, line: 16, size: 64, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !912, file: !606, line: 17, baseType: !377, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !912, file: !606, line: 18, baseType: !173, size: 8, offset: 32)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !918, file: !1115, line: 18, type: !1346, isLocal: false, isDefinition: true)
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !920, retainedTypes: !1035, globals: !1111, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/work_queue")
!920 = !{!921, !927, !30, !932, !937, !942, !948, !954, !963, !967, !1000, !1007, !1026}
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !922, line: 23, baseType: !32, size: 32, elements: !923)
!922 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!923 = !{!924, !925, !926}
!924 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!925 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!926 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !922, line: 48, baseType: !32, size: 32, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!930 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!931 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !933, line: 167, baseType: !32, size: 32, elements: !934)
!933 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!934 = !{!935, !936}
!935 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!936 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !933, line: 107, baseType: !32, size: 32, elements: !938)
!938 = !{!939, !940, !941}
!939 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!940 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!941 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!942 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !933, line: 208, baseType: !32, size: 32, elements: !943)
!943 = !{!944, !945, !946, !947}
!944 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!945 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!946 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!947 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!948 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !933, line: 261, baseType: !32, size: 32, elements: !949)
!949 = !{!950, !951, !952, !953}
!950 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!951 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!952 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!953 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!954 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !933, line: 237, baseType: !32, size: 32, elements: !955)
!955 = !{!956, !957, !958, !959, !960, !961, !962}
!956 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!957 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!958 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!959 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!960 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!961 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!962 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!963 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !933, line: 152, baseType: !32, size: 32, elements: !964)
!964 = !{!965, !966}
!965 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!966 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!967 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !789, line: 71, baseType: !103, size: 32, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999}
!969 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!970 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!971 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!972 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!973 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!974 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!975 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!976 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!977 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!978 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!979 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!980 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!981 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!982 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!983 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!984 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!985 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!986 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!987 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!988 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!989 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!990 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!991 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!992 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!993 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!994 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!995 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!996 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!997 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!998 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!999 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!1000 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !1001, line: 44, baseType: !32, size: 32, elements: !1002)
!1001 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1002 = !{!1003, !1004, !1005, !1006}
!1003 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!1004 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!1005 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!1006 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!1007 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1008, line: 54, baseType: !32, size: 32, elements: !1009)
!1008 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!1010 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!1011 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!1012 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!1013 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!1014 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!1015 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!1016 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!1017 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!1018 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!1019 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!1020 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!1021 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!1022 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!1023 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!1024 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!1025 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!1026 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1027, line: 53, baseType: !32, size: 32, elements: !1028)
!1027 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034}
!1029 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!1030 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!1031 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!1032 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!1033 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!1034 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!1035 = !{!921, !102, !103, !1036, !1084, !1085, !1086, !1087, !319, !190, !321, !279, !853, !601, !371, !1088, !1110, !239}
