; ModuleID = 'build/actinius_icarus_bee/philosophers/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__thread_entry = type { void (i8*, i8*, i8*)*, i8*, i8*, i8* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "forks", scope: !27, file: !116, line: 149, type: !278, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !108, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !103)
!103 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!114, !25, !266, !269}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "fork_objs", scope: !27, file: !116, line: 146, type: !117, isLocal: false, isDefinition: true)
!116 = !DIFile(filename: "zephyr/samples/philosophers/src/phil_obj_abstract.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 960, elements: !264)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !119, line: 2720, size: 160, elements: !120)
!119 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121, !142, !262, !263}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !118, file: !119, line: 2722, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !123, line: 233, baseType: !124)
!123 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 231, size: 64, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !124, file: !123, line: 232, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !128, line: 48, baseType: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !128, line: 37, size: 64, elements: !130)
!130 = !{!131, !137}
!131 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !128, line: 38, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !128, line: 38, size: 32, elements: !133)
!133 = !{!134, !136}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !132, file: !128, line: 39, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !128, line: 40, baseType: !135, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !128, line: 42, baseType: !138, size: 32, offset: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !128, line: 42, size: 32, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !138, file: !128, line: 43, baseType: !135, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !128, line: 44, baseType: !135, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !118, file: !119, line: 2724, baseType: !143, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !145, line: 245, size: 1408, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !196, !209, !210, !211, !223, !224, !229, !230, !238, !257}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !144, file: !145, line: 247, baseType: !148, size: 384)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !145, line: 57, size: 384, elements: !149)
!149 = !{!150, !164, !166, !169, !170, !183, !184, !185}
!150 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !145, line: 60, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !145, line: 60, size: 64, elements: !152)
!152 = !{!153, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !151, file: !145, line: 61, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !128, line: 49, baseType: !129)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !151, file: !145, line: 62, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !156, file: !157, line: 50, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!162 = !{!163}
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !148, file: !145, line: 68, baseType: !165, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !148, file: !145, line: 71, baseType: !167, size: 8, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !148, file: !145, line: 74, baseType: !167, size: 8, offset: 104)
!170 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !145, line: 90, baseType: !171, size: 16, offset: 112)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !145, line: 90, size: 16, elements: !172)
!172 = !{!173, !180}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !145, line: 91, baseType: !174, size: 16)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !145, line: 91, size: 16, elements: !175)
!175 = !{!176, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !174, file: !145, line: 96, baseType: !177, size: 8)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !178)
!178 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !174, file: !145, line: 97, baseType: !167, size: 8, offset: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !171, file: !145, line: 100, baseType: !181, size: 16)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !182)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !148, file: !145, line: 107, baseType: !110, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !148, file: !145, line: 127, baseType: !108, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !148, file: !145, line: 131, baseType: !186, size: 192, offset: 192)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !123, line: 244, size: 192, elements: !187)
!187 = !{!188, !189, !195}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !186, file: !123, line: 245, baseType: !154, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !186, file: !123, line: 246, baseType: !190, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !123, line: 242, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !186, file: !123, line: 249, baseType: !106, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !144, file: !145, line: 250, baseType: !197, size: 288, offset: 384)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !198, line: 25, size: 288, elements: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !197, file: !198, line: 26, baseType: !110, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !197, file: !198, line: 27, baseType: !110, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !197, file: !198, line: 28, baseType: !110, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !197, file: !198, line: 29, baseType: !110, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !197, file: !198, line: 30, baseType: !110, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !197, file: !198, line: 31, baseType: !110, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !197, file: !198, line: 32, baseType: !110, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !197, file: !198, line: 33, baseType: !110, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !197, file: !198, line: 34, baseType: !110, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !144, file: !145, line: 253, baseType: !108, size: 32, offset: 672)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !144, file: !145, line: 256, baseType: !122, size: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !144, file: !145, line: 271, baseType: !212, size: 128, offset: 768)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !145, line: 34, size: 128, elements: !213)
!213 = !{!214, !220, !221, !222}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !212, file: !145, line: 35, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !216, line: 46, baseType: !217)
!216 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !108, !108, !108}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !212, file: !145, line: 36, baseType: !108, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !212, file: !145, line: 37, baseType: !108, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !212, file: !145, line: 38, baseType: !108, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !144, file: !145, line: 274, baseType: !143, size: 32, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !145, line: 279, baseType: !225, size: 256, offset: 928)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 256, elements: !227)
!226 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!227 = !{!228}
!228 = !DISubrange(count: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !144, file: !145, line: 294, baseType: !109, size: 32, offset: 1184)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !144, file: !145, line: 300, baseType: !231, size: 96, offset: 1216)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !145, line: 149, size: 96, elements: !232)
!232 = !{!233, !234, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !231, file: !145, line: 153, baseType: !22, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !231, file: !145, line: 162, baseType: !235, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !236, line: 214, baseType: !32)
!236 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !231, file: !145, line: 168, baseType: !235, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !144, file: !145, line: 325, baseType: !239, size: 32, offset: 1312)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !119, line: 5073, size: 192, elements: !241)
!241 = !{!242, !251, !252}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !240, file: !119, line: 5074, baseType: !243, size: 96)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !244, line: 56, size: 96, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{!246, !249, !250}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !243, file: !244, line: 57, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !244, line: 57, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !243, file: !244, line: 58, baseType: !108, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !243, file: !244, line: 59, baseType: !235, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !240, file: !119, line: 5075, baseType: !122, size: 64, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !240, file: !119, line: 5076, baseType: !253, size: 32, offset: 160)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !254, line: 43, size: 32, elements: !255)
!254 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !253, file: !254, line: 52, baseType: !22, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !144, file: !145, line: 343, baseType: !258, size: 64, offset: 1344)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !198, line: 60, size: 64, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !258, file: !198, line: 63, baseType: !110, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !258, file: !198, line: 66, baseType: !110, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !118, file: !119, line: 2727, baseType: !110, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !118, file: !119, line: 2730, baseType: !109, size: 32, offset: 128)
!264 = !{!265}
!265 = !DISubrange(count: 6)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "threads", scope: !27, file: !116, line: 160, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8448, elements: !264)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "stacks", scope: !27, file: !116, line: 159, type: !271, isLocal: true, isDefinition: true, align: 64)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 98304, elements: !276)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !273, line: 47, size: 8, elements: !274)
!273 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !272, file: !273, line: 48, baseType: !226, size: 8)
!276 = !{!265, !277}
!277 = !DISubrange(count: 2048)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 192, elements: !264)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "_char_out", scope: !282, file: !286, line: 54, type: !287, isLocal: false, isDefinition: true)
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !284, globals: !285, splitDebugInlining: false, nameTableKind: None)
!283 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!284 = !{!108, !109}
!285 = !{!280}
!286 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{!109, !109}
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !292, file: !351, line: 65, type: !352, isLocal: true, isDefinition: true, align: 32)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !294, globals: !346, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!294 = !{!108, !109, !295, !110, !306}
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !297, file: !296, line: 167, baseType: !305)
!296 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !296, file: !296, line: 134, type: !298, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !292, retainedNodes: !300)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !110}
!300 = !{!301, !302, !304}
!301 = !DILocalVariable(name: "time_us", arg: 1, scope: !297, file: !296, line: 134, type: !110)
!302 = !DILocalVariable(name: "delay_cycles", scope: !297, file: !296, line: 168, type: !303)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!304 = !DILocalVariable(name: "cycles", scope: !297, file: !296, line: 171, type: !110)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !308, line: 1928, baseType: !309)
!308 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !308, line: 1909, size: 11360, elements: !310)
!310 = !{!311, !317, !318, !319, !320, !324, !325, !326, !327, !331, !332, !336, !337, !338, !339, !340, !344, !345}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !309, file: !308, line: 1910, baseType: !312, size: 8192)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 8192, elements: !315)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!315 = !{!316}
!316 = !DISubrange(count: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !309, file: !308, line: 1911, baseType: !313, size: 32, offset: 8192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !309, file: !308, line: 1912, baseType: !313, size: 32, offset: 8224)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !309, file: !308, line: 1913, baseType: !313, size: 32, offset: 8256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !309, file: !308, line: 1914, baseType: !321, size: 1984, offset: 8288)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 1984, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 62)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !309, file: !308, line: 1915, baseType: !314, size: 32, offset: 10272)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !309, file: !308, line: 1916, baseType: !313, size: 32, offset: 10304)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !309, file: !308, line: 1917, baseType: !314, size: 32, offset: 10336)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !309, file: !308, line: 1918, baseType: !328, size: 96, offset: 10368)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 96, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 3)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !309, file: !308, line: 1919, baseType: !314, size: 32, offset: 10464)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !309, file: !308, line: 1920, baseType: !333, size: 256, offset: 10496)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 256, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 8)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !309, file: !308, line: 1921, baseType: !314, size: 32, offset: 10752)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !309, file: !308, line: 1922, baseType: !313, size: 32, offset: 10784)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !309, file: !308, line: 1923, baseType: !314, size: 32, offset: 10816)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !309, file: !308, line: 1924, baseType: !314, size: 32, offset: 10848)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !309, file: !308, line: 1925, baseType: !341, size: 416, offset: 10880)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 416, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 13)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !309, file: !308, line: 1926, baseType: !314, size: 32, offset: 11296)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !309, file: !308, line: 1927, baseType: !314, size: 32, offset: 11328)
!346 = !{!290, !347}
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !297, file: !296, line: 161, type: !349, isLocal: true, isDefinition: true, align: 128)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 48, elements: !329)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!351 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{!356, !363}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !353, file: !354, line: 60, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DISubroutineType(types: !359)
!359 = !{!109, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !354, line: 48, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !353, file: !354, line: 65, baseType: !360, size: 32, offset: 32)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "_kernel_thread_info_offsets", scope: !366, file: !371, line: 41, type: !374, isLocal: false, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !284, globals: !368, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!368 = !{!364, !369, !372}
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "_kernel_thread_info_num_offsets", scope: !366, file: !371, line: 140, type: !235, isLocal: false, isDefinition: true)
!371 = !DIFile(filename: "zephyr/subsys/debug/thread_info.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "_kernel_thread_info_size_t_size", scope: !366, file: !371, line: 145, type: !167, isLocal: false, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 448, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 14)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !379, file: !414, line: 27, type: !441, isLocal: true, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !381, retainedTypes: !393, globals: !411, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!381 = !{!382, !30}
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !383, line: 27, baseType: !32, size: 32, elements: !384)
!383 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !{!385, !386, !387, !388, !389, !390, !391, !392}
!385 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!386 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!387 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!388 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!389 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!390 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!391 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!392 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!393 = !{!108, !104, !109, !24, !394, !410, !110, !111}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !396, line: 54, size: 96, elements: !397)
!396 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!397 = !{!398, !405, !409}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !395, file: !396, line: 55, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !400, line: 33, baseType: !401)
!400 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !400, line: 29, size: 32, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !401, file: !400, line: 30, baseType: !404, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !395, file: !396, line: 60, baseType: !406, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !382}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !395, file: !396, line: 65, baseType: !406, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!411 = !{!377, !412, !418, !420, !431, !433}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !379, file: !414, line: 44, type: !415, isLocal: true, isDefinition: true)
!414 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !254, line: 43, size: 32, elements: !416)
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !415, file: !254, line: 52, baseType: !22, size: 32)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !379, file: !414, line: 49, type: !415, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !379, file: !414, line: 36, type: !422, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 128, elements: !429)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !383, line: 114, size: 128, elements: !424)
!424 = !{!425, !426, !427, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !423, file: !383, line: 115, baseType: !382, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !423, file: !383, line: 141, baseType: !167, size: 8, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !423, file: !383, line: 149, baseType: !110, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !423, file: !383, line: 156, baseType: !110, size: 32, offset: 96)
!429 = !{!430}
!430 = !DISubrange(count: 1)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !379, file: !414, line: 40, type: !422, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !379, file: !414, line: 28, type: !435, isLocal: true, isDefinition: true)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !400, line: 40, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !400, line: 35, size: 64, elements: !437)
!437 = !{!438, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !436, file: !400, line: 36, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !436, file: !400, line: 37, baseType: !439, size: 32, offset: 32)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 32, elements: !429)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !443, line: 22, baseType: !103)
!443 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!444 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!445 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !448, file: !477, line: 50, type: !464, isLocal: true, isDefinition: true)
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !381, retainedTypes: !450, globals: !474, splitDebugInlining: false, nameTableKind: None)
!449 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!450 = !{!451, !104, !235, !109, !108, !110, !111, !453, !410, !464, !465}
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !452)
!452 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !455, line: 45, size: 64, elements: !456)
!455 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!456 = !{!457, !463}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !454, file: !455, line: 46, baseType: !458, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !400, line: 33, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !400, line: 29, size: 32, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !400, line: 30, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !454, file: !455, line: 48, baseType: !110, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !455, line: 38, size: 64, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !466, file: !455, line: 39, baseType: !458, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !466, file: !455, line: 41, baseType: !470, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !455, line: 35, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !464}
!474 = !{!475, !481, !489, !446, !491, !501}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "latency_lock", scope: !448, file: !477, line: 44, type: !478, isLocal: true, isDefinition: true)
!477 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !254, line: 43, size: 32, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !478, file: !254, line: 52, baseType: !22, size: 32)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !448, file: !477, line: 46, type: !483, isLocal: true, isDefinition: true)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !400, line: 40, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !400, line: 35, size: 64, elements: !485)
!485 = !{!486, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !484, file: !400, line: 36, baseType: !487, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !484, file: !400, line: 37, baseType: !487, size: 32, offset: 32)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "latency_subs", scope: !448, file: !477, line: 52, type: !483, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !448, file: !477, line: 39, type: !493, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, elements: !499)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 35, size: 96, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !494, file: !477, line: 36, baseType: !382, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !494, file: !477, line: 37, baseType: !167, size: 8, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !494, file: !477, line: 38, baseType: !442, size: 32, offset: 64)
!499 = !{!500}
!500 = !DISubrange(count: 0)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !448, file: !477, line: 48, type: !464, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !505, file: !512, line: 47, type: !526, isLocal: true, isDefinition: true)
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !507, retainedTypes: !508, globals: !509, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!507 = !{!382}
!508 = !{!235, !109}
!509 = !{!510, !503, !522}
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "cpus_states", scope: !505, file: !512, line: 50, type: !513, isLocal: true, isDefinition: true)
!512 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 32, elements: !429)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !383, line: 114, size: 128, elements: !517)
!517 = !{!518, !519, !520, !521}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !516, file: !383, line: 115, baseType: !382, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !516, file: !383, line: 141, baseType: !167, size: 8, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !516, file: !383, line: 149, baseType: !110, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !516, file: !383, line: 156, baseType: !110, size: 32, offset: 96)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !505, file: !512, line: 55, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 8, elements: !429)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, elements: !499)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "static_regions", scope: !529, file: !536, line: 62, type: !666, isLocal: true, isDefinition: true)
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !531, globals: !532, splitDebugInlining: false, nameTableKind: None)
!530 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!531 = !{!235, !109, !110, !108}
!532 = !{!533, !527}
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !535, file: !536, line: 198, type: !653, isLocal: true, isDefinition: true)
!535 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !536, file: !536, line: 175, type: !537, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !529, retainedNodes: !650)
!536 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = !DISubroutineType(types: !538)
!538 = !{null, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !145, line: 245, size: 1408, elements: !541)
!541 = !{!542, !600, !612, !613, !614, !621, !622, !623, !624, !630, !645}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !540, file: !145, line: 247, baseType: !543, size: 384)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !145, line: 57, size: 384, elements: !544)
!544 = !{!545, !569, !576, !577, !578, !587, !588, !589}
!545 = !DIDerivedType(tag: DW_TAG_member, scope: !543, file: !145, line: 60, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !543, file: !145, line: 60, size: 64, elements: !547)
!547 = !{!548, !563}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !546, file: !145, line: 61, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !128, line: 49, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !128, line: 37, size: 64, elements: !551)
!551 = !{!552, !558}
!552 = !DIDerivedType(tag: DW_TAG_member, scope: !550, file: !128, line: 38, baseType: !553, size: 32)
!553 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !550, file: !128, line: 38, size: 32, elements: !554)
!554 = !{!555, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !553, file: !128, line: 39, baseType: !556, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !128, line: 40, baseType: !556, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, scope: !550, file: !128, line: 42, baseType: !559, size: 32, offset: 32)
!559 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !550, file: !128, line: 42, size: 32, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !559, file: !128, line: 43, baseType: !556, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !559, file: !128, line: 44, baseType: !556, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !546, file: !145, line: 62, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !157, line: 49, size: 64, elements: !565)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !564, file: !157, line: 50, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 64, elements: !162)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !543, file: !145, line: 68, baseType: !570, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !123, line: 233, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 231, size: 64, elements: !573)
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !572, file: !123, line: 232, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !128, line: 48, baseType: !550)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !543, file: !145, line: 71, baseType: !167, size: 8, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !543, file: !145, line: 74, baseType: !167, size: 8, offset: 104)
!578 = !DIDerivedType(tag: DW_TAG_member, scope: !543, file: !145, line: 90, baseType: !579, size: 16, offset: 112)
!579 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !543, file: !145, line: 90, size: 16, elements: !580)
!580 = !{!581, !586}
!581 = !DIDerivedType(tag: DW_TAG_member, scope: !579, file: !145, line: 91, baseType: !582, size: 16)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !579, file: !145, line: 91, size: 16, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !582, file: !145, line: 96, baseType: !177, size: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !582, file: !145, line: 97, baseType: !167, size: 8, offset: 8)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !579, file: !145, line: 100, baseType: !181, size: 16)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !543, file: !145, line: 107, baseType: !110, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !543, file: !145, line: 127, baseType: !108, size: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !543, file: !145, line: 131, baseType: !590, size: 192, offset: 192)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !123, line: 244, size: 192, elements: !591)
!591 = !{!592, !593, !599}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !590, file: !123, line: 245, baseType: !549, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !590, file: !123, line: 246, baseType: !594, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !123, line: 242, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !598}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !590, file: !123, line: 249, baseType: !106, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !540, file: !145, line: 250, baseType: !601, size: 288, offset: 384)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !198, line: 25, size: 288, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !601, file: !198, line: 26, baseType: !110, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !601, file: !198, line: 27, baseType: !110, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !601, file: !198, line: 28, baseType: !110, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !601, file: !198, line: 29, baseType: !110, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !601, file: !198, line: 30, baseType: !110, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !601, file: !198, line: 31, baseType: !110, size: 32, offset: 160)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !601, file: !198, line: 32, baseType: !110, size: 32, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !601, file: !198, line: 33, baseType: !110, size: 32, offset: 224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !601, file: !198, line: 34, baseType: !110, size: 32, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !540, file: !145, line: 253, baseType: !108, size: 32, offset: 672)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !540, file: !145, line: 256, baseType: !571, size: 64, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !540, file: !145, line: 271, baseType: !615, size: 128, offset: 768)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !145, line: 34, size: 128, elements: !616)
!616 = !{!617, !618, !619, !620}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !615, file: !145, line: 35, baseType: !215, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !615, file: !145, line: 36, baseType: !108, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !615, file: !145, line: 37, baseType: !108, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !615, file: !145, line: 38, baseType: !108, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !540, file: !145, line: 274, baseType: !539, size: 32, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !540, file: !145, line: 279, baseType: !225, size: 256, offset: 928)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !540, file: !145, line: 294, baseType: !109, size: 32, offset: 1184)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !540, file: !145, line: 300, baseType: !625, size: 96, offset: 1216)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !145, line: 149, size: 96, elements: !626)
!626 = !{!627, !628, !629}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !625, file: !145, line: 153, baseType: !22, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !625, file: !145, line: 162, baseType: !235, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !625, file: !145, line: 168, baseType: !235, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !540, file: !145, line: 325, baseType: !631, size: 32, offset: 1312)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !119, line: 5073, size: 192, elements: !633)
!633 = !{!634, !640, !641}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !632, file: !119, line: 5074, baseType: !635, size: 96)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !244, line: 56, size: 96, elements: !636)
!636 = !{!637, !638, !639}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !635, file: !244, line: 57, baseType: !247, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !635, file: !244, line: 58, baseType: !108, size: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !635, file: !244, line: 59, baseType: !235, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !632, file: !119, line: 5075, baseType: !571, size: 64, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !632, file: !119, line: 5076, baseType: !642, size: 32, offset: 160)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !254, line: 43, size: 32, elements: !643)
!643 = !{!644}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !642, file: !254, line: 52, baseType: !22, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !540, file: !145, line: 343, baseType: !646, size: 64, offset: 1344)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !198, line: 60, size: 64, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !646, file: !198, line: 63, baseType: !110, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !646, file: !198, line: 66, baseType: !110, size: 32, offset: 32)
!650 = !{!651, !652}
!651 = !DILocalVariable(name: "thread", arg: 1, scope: !535, file: !536, line: 175, type: !539)
!652 = !DILocalVariable(name: "region_num", scope: !535, file: !536, line: 200, type: !167)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, elements: !499)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !655, line: 52, size: 96, elements: !656)
!655 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!656 = !{!657, !658, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !654, file: !655, line: 53, baseType: !22, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !654, file: !655, line: 54, baseType: !235, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !654, file: !655, line: 55, baseType: !660, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !661, line: 304, baseType: !662)
!661 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !661, line: 301, size: 32, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !662, file: !661, line: 302, baseType: !181, size: 16)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !662, file: !661, line: 303, baseType: !181, size: 16, offset: 16)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 96, elements: !429)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !670, file: !726, line: 39, type: !167, isLocal: true, isDefinition: true)
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !672, globals: !717, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!672 = !{!673, !108, !109, !701}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !675, line: 1495, baseType: !676)
!675 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !675, line: 1474, size: 448, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !691}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !676, file: !675, line: 1476, baseType: !313, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !676, file: !675, line: 1477, baseType: !314, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !676, file: !675, line: 1478, baseType: !314, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !676, file: !675, line: 1479, baseType: !314, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !676, file: !675, line: 1480, baseType: !314, size: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !676, file: !675, line: 1481, baseType: !314, size: 32, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !676, file: !675, line: 1482, baseType: !314, size: 32, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !676, file: !675, line: 1483, baseType: !314, size: 32, offset: 224)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !676, file: !675, line: 1484, baseType: !314, size: 32, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !676, file: !675, line: 1485, baseType: !314, size: 32, offset: 288)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !676, file: !675, line: 1486, baseType: !314, size: 32, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !676, file: !675, line: 1487, baseType: !690, size: 32, offset: 352)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 32, elements: !429)
!691 = !DIDerivedType(tag: DW_TAG_member, scope: !676, file: !675, line: 1488, baseType: !692, size: 64, offset: 384)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !676, file: !675, line: 1488, size: 64, elements: !693)
!693 = !{!694, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !692, file: !675, line: 1489, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !162)
!696 = !DIDerivedType(tag: DW_TAG_member, scope: !692, file: !675, line: 1490, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !692, file: !675, line: 1490, size: 64, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !697, file: !675, line: 1491, baseType: !314, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !697, file: !675, line: 1492, baseType: !314, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !704, line: 27, size: 128, elements: !705)
!704 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!705 = !{!706, !707, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !703, file: !704, line: 29, baseType: !110, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !703, file: !704, line: 31, baseType: !708, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !703, file: !704, line: 37, baseType: !711, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !661, line: 298, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !661, line: 289, size: 64, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !712, file: !661, line: 291, baseType: !167, size: 5, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !712, file: !661, line: 293, baseType: !167, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !712, file: !661, line: 295, baseType: !110, size: 32, offset: 32)
!717 = !{!668, !718}
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !670, file: !720, line: 31, type: !721, isLocal: true, isDefinition: true)
!720 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 160, elements: !429)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !720, line: 21, size: 160, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !722, file: !720, line: 22, baseType: !109, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !722, file: !720, line: 23, baseType: !703, size: 128, offset: 32)
!726 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !729, file: !734, line: 13, type: !753, isLocal: true, isDefinition: true)
!729 = distinct !DICompileUnit(language: DW_LANG_C99, file: !730, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !731, splitDebugInlining: false, nameTableKind: None)
!730 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!731 = !{!732, !727}
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "mpu_config", scope: !729, file: !734, line: 37, type: !735, isLocal: false, isDefinition: true)
!734 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !704, line: 41, size: 64, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !736, file: !704, line: 43, baseType: !110, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !736, file: !704, line: 45, baseType: !740, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !704, line: 27, size: 128, elements: !743)
!743 = !{!744, !745, !746}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !742, file: !704, line: 29, baseType: !110, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !742, file: !704, line: 31, baseType: !708, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !742, file: !704, line: 37, baseType: !747, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !661, line: 298, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !661, line: 289, size: 64, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !748, file: !661, line: 291, baseType: !167, size: 5, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !748, file: !661, line: 293, baseType: !167, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !748, file: !661, line: 295, baseType: !110, size: 32, offset: 32)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 256, elements: !162)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "__device_dts_ord_54", scope: !756, file: !961, line: 733, type: !1069, isLocal: false, isDefinition: true, align: 32)
!756 = distinct !DICompileUnit(language: DW_LANG_C99, file: !757, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !758, retainedTypes: !876, globals: !957, splitDebugInlining: false, nameTableKind: None)
!757 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/philosophers")
!758 = !{!759, !765, !30, !770, !775, !779, !783, !787, !793, !797, !841, !848, !867}
!759 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !760, line: 23, baseType: !32, size: 32, elements: !761)
!760 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!761 = !{!762, !763, !764}
!762 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!763 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!764 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!765 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !760, line: 48, baseType: !32, size: 32, elements: !766)
!766 = !{!767, !768, !769}
!767 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!768 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!769 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !771, line: 167, baseType: !32, size: 32, elements: !772)
!771 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!772 = !{!773, !774}
!773 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!774 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!775 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !771, line: 107, baseType: !32, size: 32, elements: !776)
!776 = !{!777, !778}
!777 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!778 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!779 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !771, line: 208, baseType: !32, size: 32, elements: !780)
!780 = !{!781, !782}
!781 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!782 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!783 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !771, line: 261, baseType: !32, size: 32, elements: !784)
!784 = !{!785, !786}
!785 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!786 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!787 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !771, line: 237, baseType: !32, size: 32, elements: !788)
!788 = !{!789, !790, !791, !792}
!789 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!790 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!791 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!792 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!793 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !771, line: 152, baseType: !32, size: 32, elements: !794)
!794 = !{!795, !796}
!795 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!796 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!797 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !308, line: 71, baseType: !109, size: 32, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840}
!799 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!800 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!801 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!802 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!803 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!804 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!805 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!806 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!807 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!808 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!809 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!810 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!811 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!812 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!813 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!814 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!815 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!816 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!817 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!818 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!819 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!820 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!821 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!822 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!823 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!824 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!825 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!826 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!827 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!828 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!829 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!830 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!831 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!832 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!833 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!834 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!835 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!836 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!837 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!838 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!839 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!840 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!841 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !842, line: 44, baseType: !32, size: 32, elements: !843)
!842 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!843 = !{!844, !845, !846, !847}
!844 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!845 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!846 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!847 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !849, line: 54, baseType: !32, size: 32, elements: !850)
!849 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866}
!851 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!852 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!853 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!854 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!855 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!856 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!857 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!858 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!859 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!860 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!861 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!862 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!863 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!864 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!865 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!866 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !868, line: 53, baseType: !32, size: 32, elements: !869)
!868 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!869 = !{!870, !871, !872, !873, !874, !875}
!870 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!871 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!872 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!873 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!874 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!875 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!876 = !{!759, !108, !109, !877, !919, !920, !921, !922, !104, !110, !111, !923, !924, !925, !464, !926, !956, !235}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !308, line: 923, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !308, line: 883, size: 10464, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !889, !890, !891, !892, !893, !894, !895, !896, !900, !901, !902, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !879, file: !308, line: 884, baseType: !314, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !879, file: !308, line: 885, baseType: !314, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !879, file: !308, line: 886, baseType: !314, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !879, file: !308, line: 887, baseType: !314, size: 32, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !879, file: !308, line: 888, baseType: !886, size: 896, offset: 128)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 896, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 28)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !879, file: !308, line: 889, baseType: !314, size: 32, offset: 1024)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !879, file: !308, line: 890, baseType: !314, size: 32, offset: 1056)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !879, file: !308, line: 891, baseType: !314, size: 32, offset: 1088)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !879, file: !308, line: 892, baseType: !314, size: 32, offset: 1120)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !879, file: !308, line: 893, baseType: !886, size: 896, offset: 1152)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !879, file: !308, line: 894, baseType: !314, size: 32, offset: 2048)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !879, file: !308, line: 895, baseType: !314, size: 32, offset: 2080)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !879, file: !308, line: 896, baseType: !897, size: 960, offset: 2112)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 960, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 30)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !879, file: !308, line: 897, baseType: !314, size: 32, offset: 3072)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !879, file: !308, line: 898, baseType: !314, size: 32, offset: 3104)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !879, file: !308, line: 899, baseType: !903, size: 3008, offset: 3136)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 3008, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 94)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !879, file: !308, line: 900, baseType: !314, size: 32, offset: 6144)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !879, file: !308, line: 901, baseType: !314, size: 32, offset: 6176)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !879, file: !308, line: 902, baseType: !314, size: 32, offset: 6208)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !879, file: !308, line: 903, baseType: !313, size: 32, offset: 6240)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !879, file: !308, line: 904, baseType: !321, size: 1984, offset: 6272)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !879, file: !308, line: 905, baseType: !313, size: 32, offset: 8256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !879, file: !308, line: 907, baseType: !313, size: 32, offset: 8288)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !879, file: !308, line: 910, baseType: !313, size: 32, offset: 8320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !879, file: !308, line: 911, baseType: !313, size: 32, offset: 8352)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !879, file: !308, line: 913, baseType: !313, size: 32, offset: 8384)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !879, file: !308, line: 917, baseType: !313, size: 32, offset: 8416)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !879, file: !308, line: 919, baseType: !321, size: 1984, offset: 8448)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !879, file: !308, line: 920, baseType: !314, size: 32, offset: 10432)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !771, line: 146, baseType: !775)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !771, line: 164, baseType: !793)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!923 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !675, line: 485, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !675, line: 468, size: 28704, elements: !929)
!929 = !{!930, !934, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !951, !955}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !928, file: !675, line: 470, baseType: !931, size: 512)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 512, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 16)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !928, file: !675, line: 471, baseType: !935, size: 512, offset: 512)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 512, elements: !932)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !928, file: !675, line: 472, baseType: !931, size: 512, offset: 1024)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !928, file: !675, line: 473, baseType: !935, size: 512, offset: 1536)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !928, file: !675, line: 474, baseType: !931, size: 512, offset: 2048)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !928, file: !675, line: 475, baseType: !935, size: 512, offset: 2560)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !928, file: !675, line: 476, baseType: !931, size: 512, offset: 3072)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !928, file: !675, line: 477, baseType: !935, size: 512, offset: 3584)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !928, file: !675, line: 478, baseType: !931, size: 512, offset: 4096)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !928, file: !675, line: 479, baseType: !935, size: 512, offset: 4608)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !928, file: !675, line: 480, baseType: !931, size: 512, offset: 5120)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !928, file: !675, line: 481, baseType: !935, size: 512, offset: 5632)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !928, file: !675, line: 482, baseType: !947, size: 3968, offset: 6144)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 3968, elements: !949)
!948 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !167)
!949 = !{!950}
!950 = !DISubrange(count: 496)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !928, file: !675, line: 483, baseType: !952, size: 18560, offset: 10112)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 18560, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 580)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !928, file: !675, line: 484, baseType: !314, size: 32, offset: 28672)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !842, line: 56, baseType: !108)
!957 = !{!958, !1010, !1051, !754, !1059, !1085, !1087, !1104, !1106, !1116, !1119, !1134, !1172, !1186}
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "on", scope: !960, file: !961, line: 549, type: !442, isLocal: true, isDefinition: true)
!960 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !961, file: !961, line: 547, type: !962, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !756, retainedNodes: !964)
!961 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!962 = !DISubroutineType(types: !963)
!963 = !{null, !765}
!964 = !{!965, !966, !969}
!965 = !DILocalVariable(name: "start_mode", arg: 1, scope: !960, file: !961, line: 547, type: !765)
!966 = !DILocalVariable(name: "err", scope: !967, file: !961, line: 553, type: !109)
!967 = distinct !DILexicalBlock(scope: !968, file: !961, line: 552, column: 31)
!968 = distinct !DILexicalBlock(scope: !960, file: !961, line: 552, column: 6)
!969 = !DILocalVariable(name: "mgr", scope: !967, file: !961, line: 554, type: !970)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !972, line: 154, size: 256, elements: !973)
!972 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!973 = !{!974, !986, !987, !1003, !1007, !1008, !1009}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !971, file: !972, line: 158, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !400, line: 40, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !400, line: 35, size: 64, elements: !977)
!977 = !{!978, !985}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !976, file: !400, line: 36, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !400, line: 33, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !400, line: 29, size: 32, elements: !982)
!982 = !{!983}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !981, file: !400, line: 30, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !976, file: !400, line: 37, baseType: !979, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !971, file: !972, line: 163, baseType: !975, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !971, file: !972, line: 166, baseType: !988, size: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !972, line: 133, size: 96, elements: !991)
!991 = !{!992, !1001, !1002}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !990, file: !972, line: 135, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !972, line: 129, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DISubroutineType(types: !996)
!996 = !{null, !970, !997}
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !972, line: 101, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !970, !109}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !990, file: !972, line: 138, baseType: !993, size: 32, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !990, file: !972, line: 143, baseType: !993, size: 32, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !971, file: !972, line: 169, baseType: !1004, size: 32, offset: 160)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !254, line: 43, size: 32, elements: !1005)
!1005 = !{!1006}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !1004, file: !254, line: 52, baseType: !22, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !971, file: !972, line: 172, baseType: !109, size: 32, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !971, file: !972, line: 175, baseType: !181, size: 16, offset: 224)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !971, file: !972, line: 178, baseType: !181, size: 16, offset: 240)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "cli", scope: !960, file: !961, line: 550, type: !1012, isLocal: true, isDefinition: true)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !972, line: 273, size: 128, elements: !1013)
!1013 = !{!1014, !1015}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1012, file: !972, line: 280, baseType: !980, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !1012, file: !972, line: 283, baseType: !1016, size: 96, offset: 32)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !1017, line: 138, size: 96, elements: !1018)
!1017 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1018 = !{!1019, !1048, !1049}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !1016, file: !1017, line: 149, baseType: !1020, size: 32)
!1020 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !1017, line: 139, size: 32, elements: !1021)
!1021 = !{!1022, !1043}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !1020, file: !1017, line: 145, baseType: !1023, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !119, line: 5397, size: 128, elements: !1025)
!1025 = !{!1026, !1041, !1042}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !1024, file: !119, line: 5399, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !128, line: 48, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !128, line: 37, size: 64, elements: !1029)
!1029 = !{!1030, !1036}
!1030 = !DIDerivedType(tag: DW_TAG_member, scope: !1028, file: !128, line: 38, baseType: !1031, size: 32)
!1031 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1028, file: !128, line: 38, size: 32, elements: !1032)
!1032 = !{!1033, !1035}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1031, file: !128, line: 39, baseType: !1034, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 32)
