; ModuleID = 'build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !111, file: !154, line: 27, type: !183, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !125, globals: !151, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!113 = !{!114, !30}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !115, line: 27, baseType: !32, size: 32, elements: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!118 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!119 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!120 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!121 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!122 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!123 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!124 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!125 = !{!102, !126, !103, !24, !130, !146, !148, !149}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !129)
!129 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !132, line: 54, size: 96, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !141, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !131, file: !132, line: 55, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !136, line: 30, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !131, file: !132, line: 60, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !114}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !131, file: !132, line: 65, baseType: !142, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !150)
!150 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!151 = !{!109, !152, !158, !160, !173, !175}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !111, file: !154, line: 44, type: !155, isLocal: true, isDefinition: true)
!154 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !111, file: !154, line: 49, type: !155, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !111, file: !154, line: 36, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 128, elements: !171)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !164)
!164 = !{!165, !166, !169, !170}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !115, line: 115, baseType: !114, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !163, file: !115, line: 141, baseType: !167, size: 8, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !163, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !163, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!171 = !{!172}
!172 = !DISubrange(count: 1)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !111, file: !154, line: 40, type: !162, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !111, file: !154, line: 28, type: !177, isLocal: true, isDefinition: true)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !179)
!179 = !{!180, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !178, file: !136, line: 36, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !178, file: !136, line: 37, baseType: !181, size: 32, offset: 32)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 32, elements: !171)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !185, line: 22, baseType: !186)
!185 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!186 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!187 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!188 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !191, file: !222, line: 50, type: !209, isLocal: true, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !193, globals: !219, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!193 = !{!194, !126, !196, !103, !102, !148, !149, !198, !146, !209, !210}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !195)
!195 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !197, line: 214, baseType: !32)
!197 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !200, line: 45, size: 64, elements: !201)
!200 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !{!202, !208}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !199, file: !200, line: 46, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !204, file: !136, line: 30, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !199, file: !200, line: 48, baseType: !148, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !200, line: 38, size: 64, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !211, file: !200, line: 39, baseType: !203, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !211, file: !200, line: 41, baseType: !215, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !200, line: 35, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !209}
!219 = !{!220, !224, !232, !189, !234, !244}
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "latency_lock", scope: !191, file: !222, line: 44, type: !223, isLocal: true, isDefinition: true)
!222 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !191, file: !222, line: 46, type: !226, isLocal: true, isDefinition: true)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !228)
!228 = !{!229, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !227, file: !136, line: 36, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !227, file: !136, line: 37, baseType: !230, size: 32, offset: 32)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "latency_subs", scope: !191, file: !222, line: 52, type: !226, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !191, file: !222, line: 39, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, elements: !242)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 35, size: 96, elements: !238)
!238 = !{!239, !240, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !237, file: !222, line: 36, baseType: !114, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !237, file: !222, line: 37, baseType: !167, size: 8, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !237, file: !222, line: 38, baseType: !184, size: 32, offset: 64)
!242 = !{!243}
!243 = !DISubrange(count: 0)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !191, file: !222, line: 48, type: !209, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !248, file: !255, line: 47, type: !269, isLocal: true, isDefinition: true)
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !250, retainedTypes: !251, globals: !252, splitDebugInlining: false, nameTableKind: None)
!249 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!250 = !{!114}
!251 = !{!196, !103}
!252 = !{!253, !246, !265}
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "cpus_states", scope: !248, file: !255, line: 50, type: !256, isLocal: true, isDefinition: true)
!255 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 32, elements: !171)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !259, file: !115, line: 115, baseType: !114, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !259, file: !115, line: 141, baseType: !167, size: 8, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !259, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !259, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !248, file: !255, line: 55, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 8, elements: !171)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, elements: !242)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "static_regions", scope: !272, file: !279, line: 62, type: !414, isLocal: true, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !274, globals: !275, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!274 = !{!196, !103, !148, !102}
!275 = !{!276, !270}
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !278, file: !279, line: 198, type: !402, isLocal: true, isDefinition: true)
!278 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !279, file: !279, line: 175, type: !280, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !272, retainedNodes: !397)
!279 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!280 = !DISubroutineType(types: !281)
!281 = !{null, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !284, line: 245, size: 1024, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !353, !366, !367, !368, !369, !375, !392}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !283, file: !284, line: 247, baseType: !287, size: 384)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !284, line: 57, size: 384, elements: !288)
!288 = !{!289, !317, !325, !326, !327, !340, !341, !342}
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !284, line: 60, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !284, line: 60, size: 64, elements: !291)
!291 = !{!292, !308}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !290, file: !284, line: 61, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !294, line: 49, baseType: !295)
!294 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !294, line: 37, size: 64, elements: !296)
!296 = !{!297, !303}
!297 = !DIDerivedType(tag: DW_TAG_member, scope: !295, file: !294, line: 38, baseType: !298, size: 32)
!298 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !294, line: 38, size: 32, elements: !299)
!299 = !{!300, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !298, file: !294, line: 39, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !294, line: 40, baseType: !301, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, scope: !295, file: !294, line: 42, baseType: !304, size: 32, offset: 32)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !294, line: 42, size: 32, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !304, file: !294, line: 43, baseType: !301, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !304, file: !294, line: 44, baseType: !301, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !290, file: !284, line: 62, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !310, line: 49, size: 64, elements: !311)
!310 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !309, file: !310, line: 50, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !315)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!315 = !{!316}
!316 = !DISubrange(count: 2)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !287, file: !284, line: 68, baseType: !318, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !320, line: 233, baseType: !321)
!320 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 231, size: 64, elements: !322)
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !321, file: !320, line: 232, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !294, line: 48, baseType: !295)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !287, file: !284, line: 71, baseType: !167, size: 8, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !287, file: !284, line: 74, baseType: !167, size: 8, offset: 104)
!327 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !284, line: 90, baseType: !328, size: 16, offset: 112)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !284, line: 90, size: 16, elements: !329)
!329 = !{!330, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, scope: !328, file: !284, line: 91, baseType: !331, size: 16)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !284, line: 91, size: 16, elements: !332)
!332 = !{!333, !336}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !331, file: !284, line: 96, baseType: !334, size: 8)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !335)
!335 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !331, file: !284, line: 97, baseType: !167, size: 8, offset: 8)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !328, file: !284, line: 100, baseType: !338, size: 16)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !339)
!339 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !287, file: !284, line: 107, baseType: !148, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !287, file: !284, line: 127, baseType: !102, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !287, file: !284, line: 131, baseType: !343, size: 192, offset: 192)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !320, line: 244, size: 192, elements: !344)
!344 = !{!345, !346, !352}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !343, file: !320, line: 245, baseType: !293, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !343, file: !320, line: 246, baseType: !347, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !320, line: 242, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !343, file: !320, line: 249, baseType: !128, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !283, file: !284, line: 250, baseType: !354, size: 288, offset: 384)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !355, line: 25, size: 288, elements: !356)
!355 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !354, file: !355, line: 26, baseType: !148, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !354, file: !355, line: 27, baseType: !148, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !354, file: !355, line: 28, baseType: !148, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !354, file: !355, line: 29, baseType: !148, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !354, file: !355, line: 30, baseType: !148, size: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !354, file: !355, line: 31, baseType: !148, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !354, file: !355, line: 32, baseType: !148, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !354, file: !355, line: 33, baseType: !148, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !354, file: !355, line: 34, baseType: !148, size: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !283, file: !284, line: 253, baseType: !102, size: 32, offset: 672)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !283, file: !284, line: 256, baseType: !319, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !283, file: !284, line: 294, baseType: !103, size: 32, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !283, file: !284, line: 300, baseType: !370, size: 96, offset: 800)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !284, line: 149, size: 96, elements: !371)
!371 = !{!372, !373, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !370, file: !284, line: 153, baseType: !22, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !370, file: !284, line: 162, baseType: !196, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !370, file: !284, line: 168, baseType: !196, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !283, file: !284, line: 325, baseType: !376, size: 32, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !378, line: 5073, size: 160, elements: !379)
!378 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = !{!380, !389, !390}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !377, file: !378, line: 5074, baseType: !381, size: 96)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !382, line: 56, size: 96, elements: !383)
!382 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!383 = !{!384, !387, !388}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !381, file: !382, line: 57, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !382, line: 57, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !381, file: !382, line: 58, baseType: !102, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !381, file: !382, line: 59, baseType: !196, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !377, file: !378, line: 5075, baseType: !319, size: 64, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !377, file: !378, line: 5076, baseType: !391, offset: 160)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !283, file: !284, line: 343, baseType: !393, size: 64, offset: 928)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !355, line: 60, size: 64, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !393, file: !355, line: 63, baseType: !148, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !393, file: !355, line: 66, baseType: !148, size: 32, offset: 32)
!397 = !{!398, !399, !400, !401}
!398 = !DILocalVariable(name: "thread", arg: 1, scope: !278, file: !279, line: 175, type: !282)
!399 = !DILocalVariable(name: "region_num", scope: !278, file: !279, line: 200, type: !167)
!400 = !DILocalVariable(name: "guard_start", scope: !278, file: !279, line: 265, type: !22)
!401 = !DILocalVariable(name: "guard_size", scope: !278, file: !279, line: 266, type: !196)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 96, elements: !171)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !404, line: 52, size: 96, elements: !405)
!404 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!405 = !{!406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !403, file: !404, line: 53, baseType: !22, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !403, file: !404, line: 54, baseType: !196, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !403, file: !404, line: 55, baseType: !409, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !410, line: 151, baseType: !411)
!410 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 149, size: 32, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !411, file: !410, line: 150, baseType: !148, size: 32)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 96, elements: !171)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !418, file: !454, line: 39, type: !167, isLocal: true, isDefinition: true)
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !420, globals: !453, splitDebugInlining: false, nameTableKind: None)
!419 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!420 = !{!421, !102, !103, !439, !167}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !423, line: 1226, baseType: !424)
!423 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 1213, size: 352, elements: !425)
!425 = !{!426, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !424, file: !423, line: 1215, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !148)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !424, file: !423, line: 1216, baseType: !428, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !424, file: !423, line: 1217, baseType: !428, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !424, file: !423, line: 1218, baseType: !428, size: 32, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !424, file: !423, line: 1219, baseType: !428, size: 32, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !424, file: !423, line: 1220, baseType: !428, size: 32, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !424, file: !423, line: 1221, baseType: !428, size: 32, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !424, file: !423, line: 1222, baseType: !428, size: 32, offset: 224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !424, file: !423, line: 1223, baseType: !428, size: 32, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !424, file: !423, line: 1224, baseType: !428, size: 32, offset: 288)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !424, file: !423, line: 1225, baseType: !428, size: 32, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !442, line: 27, size: 96, elements: !443)
!442 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!443 = !{!444, !445, !448}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !441, file: !442, line: 29, baseType: !148, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !441, file: !442, line: 31, baseType: !446, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !441, file: !442, line: 37, baseType: !449, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !410, line: 146, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !410, line: 141, size: 32, elements: !451)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !450, file: !410, line: 143, baseType: !148, size: 32)
!453 = !{!416}
!454 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !457, file: !464, line: 21, type: !106, isLocal: true, isDefinition: true)
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !459, globals: !463, splitDebugInlining: false, nameTableKind: None)
!458 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!459 = !{!460, !103, !102}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !462, line: 22, baseType: !103)
!462 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = !{!455}
!464 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !467, file: !472, line: 13, type: !489, isLocal: true, isDefinition: true)
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !469, splitDebugInlining: false, nameTableKind: None)
!468 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!469 = !{!470, !465}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "mpu_config", scope: !467, file: !472, line: 37, type: !473, isLocal: false, isDefinition: true)
!472 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !442, line: 41, size: 64, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !474, file: !442, line: 43, baseType: !148, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !474, file: !442, line: 45, baseType: !478, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !442, line: 27, size: 96, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !480, file: !442, line: 29, baseType: !148, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !480, file: !442, line: 31, baseType: !446, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !480, file: !442, line: 37, baseType: !485, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !410, line: 146, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !410, line: 141, size: 32, elements: !487)
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !486, file: !410, line: 143, baseType: !148, size: 32)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 192, elements: !315)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !492, file: !662, line: 93, type: !663, isLocal: true, isDefinition: true, align: 32)
!492 = distinct !DICompileUnit(language: DW_LANG_C99, file: !493, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !494, globals: !657, splitDebugInlining: false, nameTableKind: None)
!493 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!494 = !{!495, !167, !102, !103, !575, !148, !576, !612, !623}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !497, line: 1071, baseType: !498)
!497 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 1035, size: 19584, elements: !499)
!499 = !{!500, !504, !505, !506, !510, !511, !513, !514, !515, !516, !517, !518, !522, !523, !524, !528, !529, !533, !534, !538, !539, !543, !544, !545, !546, !547, !548, !549, !553, !554, !555, !556, !560, !561, !565}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !498, file: !497, line: 1036, baseType: !501, size: 960)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 960, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 30)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !498, file: !497, line: 1037, baseType: !428, size: 32, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !498, file: !497, line: 1038, baseType: !428, size: 32, offset: 992)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !498, file: !497, line: 1039, baseType: !507, size: 1088, offset: 1024)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 1088, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 34)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !498, file: !497, line: 1040, baseType: !428, size: 32, offset: 2112)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !498, file: !497, line: 1041, baseType: !512, size: 64, offset: 2144)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 64, elements: !315)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !498, file: !497, line: 1042, baseType: !428, size: 32, offset: 2208)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !498, file: !497, line: 1043, baseType: !428, size: 32, offset: 2240)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !498, file: !497, line: 1044, baseType: !428, size: 32, offset: 2272)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !498, file: !497, line: 1045, baseType: !428, size: 32, offset: 2304)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !498, file: !497, line: 1046, baseType: !428, size: 32, offset: 2336)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !498, file: !497, line: 1047, baseType: !519, size: 3808, offset: 2368)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 3808, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 119)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !498, file: !497, line: 1048, baseType: !428, size: 32, offset: 6176)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !498, file: !497, line: 1049, baseType: !428, size: 32, offset: 6208)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !498, file: !497, line: 1050, baseType: !525, size: 1952, offset: 6240)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 1952, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 61)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !498, file: !497, line: 1051, baseType: !428, size: 32, offset: 8192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !498, file: !497, line: 1052, baseType: !530, size: 288, offset: 8224)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 288, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 9)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !498, file: !497, line: 1053, baseType: !427, size: 32, offset: 8512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !498, file: !497, line: 1054, baseType: !535, size: 96, offset: 8544)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 96, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 3)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !498, file: !497, line: 1055, baseType: !427, size: 32, offset: 8640)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !498, file: !497, line: 1056, baseType: !540, size: 1568, offset: 8672)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 1568, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 49)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !498, file: !497, line: 1057, baseType: !428, size: 32, offset: 10240)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !498, file: !497, line: 1058, baseType: !535, size: 96, offset: 10272)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !498, file: !497, line: 1059, baseType: !428, size: 32, offset: 10368)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !498, file: !497, line: 1060, baseType: !512, size: 64, offset: 10400)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !498, file: !497, line: 1061, baseType: !428, size: 32, offset: 10464)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !498, file: !497, line: 1062, baseType: !428, size: 32, offset: 10496)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !498, file: !497, line: 1063, baseType: !550, size: 672, offset: 10528)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 672, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 21)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !498, file: !497, line: 1064, baseType: !428, size: 32, offset: 11200)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !498, file: !497, line: 1065, baseType: !427, size: 32, offset: 11232)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !498, file: !497, line: 1066, baseType: !428, size: 32, offset: 11264)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !498, file: !497, line: 1067, baseType: !557, size: 1504, offset: 11296)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 1504, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 47)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !498, file: !497, line: 1068, baseType: !427, size: 32, offset: 12800)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !498, file: !497, line: 1069, baseType: !562, size: 5600, offset: 12832)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 5600, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 175)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !498, file: !497, line: 1070, baseType: !566, size: 1152, offset: 18432)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 1152, elements: !531)
!567 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !497, line: 278, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 272, size: 128, elements: !570)
!570 = !{!571, !572, !573, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !569, file: !497, line: 273, baseType: !428, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !569, file: !497, line: 274, baseType: !428, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !569, file: !497, line: 275, baseType: !428, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !569, file: !497, line: 277, baseType: !427, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !423, line: 468, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 445, size: 1120, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !605, !609, !611}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !578, file: !423, line: 447, baseType: !427, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !578, file: !423, line: 448, baseType: !428, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !578, file: !423, line: 449, baseType: !428, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !578, file: !423, line: 450, baseType: !428, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !578, file: !423, line: 451, baseType: !428, size: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !578, file: !423, line: 452, baseType: !428, size: 32, offset: 160)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !578, file: !423, line: 453, baseType: !587, size: 96, offset: 192)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 96, elements: !589)
!588 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !167)
!589 = !{!590}
!590 = !DISubrange(count: 12)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !578, file: !423, line: 454, baseType: !428, size: 32, offset: 288)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !578, file: !423, line: 455, baseType: !428, size: 32, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !578, file: !423, line: 456, baseType: !428, size: 32, offset: 352)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !578, file: !423, line: 457, baseType: !428, size: 32, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !578, file: !423, line: 458, baseType: !428, size: 32, offset: 416)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !578, file: !423, line: 459, baseType: !428, size: 32, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !578, file: !423, line: 460, baseType: !428, size: 32, offset: 480)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !578, file: !423, line: 461, baseType: !512, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !578, file: !423, line: 462, baseType: !427, size: 32, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !578, file: !423, line: 463, baseType: !427, size: 32, offset: 608)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !578, file: !423, line: 464, baseType: !602, size: 128, offset: 640)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 128, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 4)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !578, file: !423, line: 465, baseType: !606, size: 160, offset: 768)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 160, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 5)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !578, file: !423, line: 466, baseType: !610, size: 160, offset: 928)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 160, elements: !607)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !578, file: !423, line: 467, baseType: !428, size: 32, offset: 1088)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !614, file: !613, line: 167, baseType: !622)
!613 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!614 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !613, file: !613, line: 134, type: !615, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !492, retainedNodes: !617)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !148}
!617 = !{!618, !619, !621}
!618 = !DILocalVariable(name: "time_us", arg: 1, scope: !614, file: !613, line: 134, type: !148)
!619 = !DILocalVariable(name: "delay_cycles", scope: !614, file: !613, line: 168, type: !620)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!621 = !DILocalVariable(name: "cycles", scope: !614, file: !613, line: 171, type: !148)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !497, line: 2399, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 2373, size: 10880, elements: !626)
!626 = !{!627, !631, !632, !633, !634, !638, !639, !644, !645, !646, !647, !648, !649, !653, !654, !655, !656}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !625, file: !497, line: 2374, baseType: !628, size: 8192)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 8192, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !625, file: !497, line: 2375, baseType: !427, size: 32, offset: 8192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !625, file: !497, line: 2376, baseType: !427, size: 32, offset: 8224)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !625, file: !497, line: 2377, baseType: !427, size: 32, offset: 8256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !625, file: !497, line: 2378, baseType: !635, size: 1984, offset: 8288)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 1984, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 62)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !625, file: !497, line: 2379, baseType: !428, size: 32, offset: 10272)
!639 = !DIDerivedType(tag: DW_TAG_member, scope: !625, file: !497, line: 2381, baseType: !640, size: 32, offset: 10304)
!640 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !625, file: !497, line: 2381, size: 32, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !640, file: !497, line: 2382, baseType: !428, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !640, file: !497, line: 2383, baseType: !428, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !625, file: !497, line: 2386, baseType: !428, size: 32, offset: 10336)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !625, file: !497, line: 2387, baseType: !428, size: 32, offset: 10368)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !625, file: !497, line: 2389, baseType: !428, size: 32, offset: 10400)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !625, file: !497, line: 2391, baseType: !428, size: 32, offset: 10432)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !625, file: !497, line: 2393, baseType: !428, size: 32, offset: 10464)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !625, file: !497, line: 2394, baseType: !650, size: 256, offset: 10496)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 256, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 8)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !625, file: !497, line: 2395, baseType: !428, size: 32, offset: 10752)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !625, file: !497, line: 2396, baseType: !427, size: 32, offset: 10784)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !625, file: !497, line: 2397, baseType: !428, size: 32, offset: 10816)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !625, file: !497, line: 2398, baseType: !428, size: 32, offset: 10848)
!657 = !{!490, !658}
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !614, file: !613, line: 161, type: !660, isLocal: true, isDefinition: true, align: 128)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 48, elements: !536)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!662 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !665, line: 51, size: 64, elements: !666)
!665 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = !{!667, !674}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !664, file: !665, line: 60, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DISubroutineType(types: !670)
!670 = !{!103, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !665, line: 48, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !664, file: !665, line: 65, baseType: !671, size: 32, offset: 32)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "__init_board_init", scope: !677, file: !781, line: 36, type: !796, isLocal: true, isDefinition: true, align: 32)
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !679, retainedTypes: !691, globals: !777, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!679 = !{!680, !686}
!680 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !681, line: 506, baseType: !32, size: 32, elements: !682)
!681 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!682 = !{!683, !684, !685}
!683 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!684 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!685 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!686 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !681, line: 512, baseType: !32, size: 32, elements: !687)
!687 = !{!688, !689, !690}
!688 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!689 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!690 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!691 = !{!692, !766, !771, !732, !686, !680, !776, !102}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !681, line: 523, size: 288, elements: !695)
!695 = !{!696, !722, !728, !733, !737, !738, !739, !743, !762}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !694, file: !681, line: 524, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!698 = !DISubroutineType(types: !699)
!699 = !{!103, !700, !720, !721}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !703, line: 378, size: 192, elements: !704)
!703 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!704 = !{!705, !706, !707, !708, !715, !716}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !702, file: !703, line: 380, baseType: !446, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !702, file: !703, line: 382, baseType: !13, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !702, file: !703, line: 384, baseType: !13, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !702, file: !703, line: 386, baseType: !709, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !703, line: 351, size: 16, elements: !711)
!711 = !{!712, !713}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !710, file: !703, line: 359, baseType: !167, size: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !710, file: !703, line: 364, baseType: !714, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!714 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !702, file: !703, line: 388, baseType: !102, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !702, file: !703, line: 396, baseType: !717, size: 32, offset: 160)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !703, line: 43, baseType: !194)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !681, line: 237, baseType: !167)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !681, line: 257, baseType: !148)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !694, file: !681, line: 530, baseType: !723, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DISubroutineType(types: !725)
!725 = !{!103, !700, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !681, line: 229, baseType: !148)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !694, file: !681, line: 532, baseType: !729, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = !DISubroutineType(types: !731)
!731 = !{!103, !700, !732, !727}
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !681, line: 216, baseType: !148)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !694, file: !681, line: 535, baseType: !734, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DISubroutineType(types: !736)
!736 = !{!103, !700, !732}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !694, file: !681, line: 537, baseType: !734, size: 32, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !694, file: !681, line: 539, baseType: !734, size: 32, offset: 160)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !694, file: !681, line: 541, baseType: !740, size: 32, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DISubroutineType(types: !742)
!742 = !{!103, !700, !720, !680, !686}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !694, file: !681, line: 544, baseType: !744, size: 32, offset: 224)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DISubroutineType(types: !746)
!746 = !{!103, !700, !747, !714}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !681, line: 478, size: 96, elements: !749)
!749 = !{!750, !756, !761}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !748, file: !681, line: 482, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !753)
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !752, file: !136, line: 30, baseType: !755, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !748, file: !681, line: 485, baseType: !757, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !681, line: 464, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!759 = !DISubroutineType(types: !760)
!760 = !{null, !700, !747, !732}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !748, file: !681, line: 493, baseType: !732, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !694, file: !681, line: 547, baseType: !763, size: 32, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DISubroutineType(types: !765)
!765 = !{!148, !700}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !681, line: 428, size: 32, elements: !769)
!769 = !{!770}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !768, file: !681, line: 434, baseType: !732, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !681, line: 441, size: 32, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !773, file: !681, line: 447, baseType: !732, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!777 = !{!675, !778, !794}
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "pull_up", scope: !780, file: !781, line: 15, type: !787, isLocal: true, isDefinition: true)
!780 = distinct !DISubprogram(name: "board_init", scope: !781, file: !781, line: 10, type: !782, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !677, retainedNodes: !784)
!781 = !DIFile(filename: "zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!782 = !DISubroutineType(types: !783)
!783 = !{!103, !700}
!784 = !{!785, !786}
!785 = !DILocalVariable(name: "dev", arg: 1, scope: !780, file: !781, line: 10, type: !700)
!786 = !DILocalVariable(name: "res", scope: !780, file: !781, line: 14, type: !103)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !681, line: 271, size: 64, elements: !789)
!789 = !{!790, !791, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !788, file: !681, line: 273, baseType: !700, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !788, file: !681, line: 275, baseType: !720, size: 8, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !788, file: !681, line: 277, baseType: !793, size: 16, offset: 48)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !681, line: 249, baseType: !338)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "user_led", scope: !780, file: !781, line: 17, type: !787, isLocal: true, isDefinition: true)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !665, line: 51, size: 64, elements: !798)
!798 = !{!799, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !797, file: !665, line: 60, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !797, file: !665, line: 65, baseType: !700, size: 32, offset: 32)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "__device_dts_ord_69", scope: !804, file: !1039, line: 733, type: !1140, isLocal: false, isDefinition: true, align: 32)
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !806, retainedTypes: !949, globals: !1035, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble_sense/tfm_integration/tfm_regression_test")
!806 = !{!807, !813, !30, !818, !823, !830, !838, !846, !855, !859, !914, !921, !940}
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !808, line: 23, baseType: !32, size: 32, elements: !809)
!808 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !{!810, !811, !812}
!810 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!811 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!812 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!813 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !808, line: 48, baseType: !32, size: 32, elements: !814)
!814 = !{!815, !816, !817}
!815 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!816 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!817 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!818 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 167, baseType: !32, size: 32, elements: !820)
!819 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!820 = !{!821, !822}
!821 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!822 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!823 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 107, baseType: !32, size: 32, elements: !824)
!824 = !{!825, !826, !827, !828, !829}
!825 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!826 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!827 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!828 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!829 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!830 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 208, baseType: !32, size: 32, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837}
!832 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!833 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!834 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!835 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!836 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!837 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!838 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 261, baseType: !32, size: 32, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845}
!840 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!841 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!842 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!843 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!844 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!845 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!846 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 237, baseType: !32, size: 32, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854}
!848 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!849 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!850 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!851 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!852 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!853 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!854 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 152, baseType: !32, size: 32, elements: !856)
!856 = !{!857, !858}
!857 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!858 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!859 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !497, line: 71, baseType: !103, size: 32, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!861 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!862 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!863 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!864 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!865 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!866 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!867 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!868 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!869 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!870 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!871 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!872 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!873 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!874 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!875 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!876 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!877 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!878 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!879 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!880 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!881 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!882 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!883 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!884 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!885 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!886 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!887 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!888 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!889 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!890 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!891 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!892 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!893 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!894 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!895 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!896 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!897 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!898 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!899 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!900 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!901 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!902 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!903 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!904 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!905 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!906 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!907 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!908 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!909 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!910 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!911 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!912 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!913 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!914 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !915, line: 44, baseType: !32, size: 32, elements: !916)
!915 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!916 = !{!917, !918, !919, !920}
!917 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!918 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!919 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!920 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !922, line: 54, baseType: !32, size: 32, elements: !923)
!922 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939}
!924 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!925 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!926 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!927 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!928 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!929 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!930 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!931 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!932 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!933 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!934 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!935 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!936 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!937 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!938 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!939 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!940 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !941, line: 53, baseType: !32, size: 32, elements: !942)
!941 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!942 = !{!943, !944, !945, !946, !947, !948}
!943 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!944 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!945 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!946 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!947 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!948 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!949 = !{!807, !102, !103, !950, !999, !1000, !1001, !1002, !126, !148, !149, !714, !575, !1003, !209, !1004, !1034, !196}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !497, line: 1022, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 979, size: 11712, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961, !965, !966, !967, !968, !969, !970, !971, !972, !973, !977, !978, !979, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !952, file: !497, line: 980, baseType: !428, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !952, file: !497, line: 981, baseType: !428, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !952, file: !497, line: 982, baseType: !428, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !952, file: !497, line: 983, baseType: !428, size: 32, offset: 96)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !952, file: !497, line: 984, baseType: !428, size: 32, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !952, file: !497, line: 985, baseType: !428, size: 32, offset: 160)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !952, file: !497, line: 986, baseType: !428, size: 32, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !952, file: !497, line: 987, baseType: !962, size: 1824, offset: 224)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 1824, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 57)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !952, file: !497, line: 988, baseType: !428, size: 32, offset: 2048)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !952, file: !497, line: 989, baseType: !428, size: 32, offset: 2080)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !952, file: !497, line: 990, baseType: !427, size: 32, offset: 2112)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !952, file: !497, line: 991, baseType: !428, size: 32, offset: 2144)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !952, file: !497, line: 992, baseType: !428, size: 32, offset: 2176)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !952, file: !497, line: 993, baseType: !606, size: 160, offset: 2208)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !952, file: !497, line: 994, baseType: !428, size: 32, offset: 2368)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !952, file: !497, line: 996, baseType: !428, size: 32, offset: 2400)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !952, file: !497, line: 998, baseType: !974, size: 3744, offset: 2432)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 3744, elements: !975)
!975 = !{!976}
!976 = !DISubrange(count: 117)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !952, file: !497, line: 999, baseType: !428, size: 32, offset: 6176)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !952, file: !497, line: 1000, baseType: !428, size: 32, offset: 6208)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !952, file: !497, line: 1001, baseType: !980, size: 2016, offset: 6240)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 2016, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 63)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !952, file: !497, line: 1002, baseType: !427, size: 32, offset: 8256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !952, file: !497, line: 1004, baseType: !427, size: 32, offset: 8288)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !952, file: !497, line: 1005, baseType: !427, size: 32, offset: 8320)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !952, file: !497, line: 1006, baseType: !427, size: 32, offset: 8352)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !952, file: !497, line: 1008, baseType: !427, size: 32, offset: 8384)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !952, file: !497, line: 1009, baseType: !427, size: 32, offset: 8416)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !952, file: !497, line: 1011, baseType: !635, size: 1984, offset: 8448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !952, file: !497, line: 1012, baseType: !428, size: 32, offset: 10432)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !952, file: !497, line: 1013, baseType: !535, size: 96, offset: 10464)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !952, file: !497, line: 1014, baseType: !428, size: 32, offset: 10560)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !952, file: !497, line: 1016, baseType: !535, size: 96, offset: 10592)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !952, file: !497, line: 1017, baseType: !428, size: 32, offset: 10688)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !952, file: !497, line: 1018, baseType: !650, size: 256, offset: 10720)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !952, file: !497, line: 1019, baseType: !428, size: 32, offset: 10976)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !952, file: !497, line: 1020, baseType: !550, size: 672, offset: 11008)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !952, file: !497, line: 1021, baseType: !428, size: 32, offset: 11680)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !819, line: 146, baseType: !823)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !819, line: 164, baseType: !855)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !423, line: 426, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !423, line: 411, size: 28704, elements: !1007)
!1007 = !{!1008, !1010, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1025, !1029, !1033}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1006, file: !423, line: 413, baseType: !1009, size: 256)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 256, elements: !651)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1006, file: !423, line: 414, baseType: !1011, size: 768, offset: 256)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 768, elements: !1012)
!1012 = !{!1013}
!1013 = !DISubrange(count: 24)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1006, file: !423, line: 415, baseType: !1009, size: 256, offset: 1024)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1006, file: !423, line: 416, baseType: !1011, size: 768, offset: 1280)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1006, file: !423, line: 417, baseType: !1009, size: 256, offset: 2048)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1006, file: !423, line: 418, baseType: !1011, size: 768, offset: 2304)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1006, file: !423, line: 419, baseType: !1009, size: 256, offset: 3072)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1006, file: !423, line: 420, baseType: !1011, size: 768, offset: 3328)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1006, file: !423, line: 421, baseType: !1009, size: 256, offset: 4096)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1006, file: !423, line: 422, baseType: !1022, size: 1792, offset: 4352)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 1792, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 56)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !1006, file: !423, line: 423, baseType: !1026, size: 1920, offset: 6144)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1920, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 240)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1006, file: !423, line: 424, baseType: !1030, size: 20608, offset: 8064)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 20608, elements: !1031)
!1031 = !{!1032}
!1032 = !DISubrange(count: 644)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !1006, file: !423, line: 425, baseType: !428, size: 32, offset: 28672)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !915, line: 56, baseType: !102)
!1035 = !{!1036, !1086, !1127, !802, !1130, !1155, !1157, !1174, !1176, !1186, !1189, !1204, !1242, !1256}
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "on", scope: !1038, file: !1039, line: 549, type: !184, isLocal: true, isDefinition: true)
!1038 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !1039, file: !1039, line: 547, type: !1040, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !804, retainedNodes: !1042)
!1039 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1040 = !DISubroutineType(types: !1041)
!1041 = !{null, !813}
!1042 = !{!1043, !1044, !1047}
!1043 = !DILocalVariable(name: "start_mode", arg: 1, scope: !1038, file: !1039, line: 547, type: !813)
!1044 = !DILocalVariable(name: "err", scope: !1045, file: !1039, line: 553, type: !103)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !1039, line: 552, column: 31)
!1046 = distinct !DILexicalBlock(scope: !1038, file: !1039, line: 552, column: 6)
!1047 = !DILocalVariable(name: "mgr", scope: !1045, file: !1039, line: 554, type: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 32)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !1050, line: 154, size: 224, elements: !1051)
