; ModuleID = './build/gpt_interrupt_repeat_mode.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (%struct._reent*)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque
%struct._mprec = type { %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint** }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !2, file: !3, line: 71, type: !79, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !57, globals: !62, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 121, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!10 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !12, line: 47, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!15 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!16 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!17 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!18 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!19 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!20 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!21 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!22 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!23 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!24 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!25 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!26 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!27 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!28 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!29 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!30 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!31 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!32 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!33 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!34 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!35 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!36 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!37 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!38 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!39 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!40 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!41 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!42 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!43 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!44 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!45 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!46 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!47 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!48 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!49 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!50 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!51 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!52 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!53 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!54 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!55 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!56 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!57 = !{!58, !61}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !6, line: 116, baseType: !7)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !12, line: 95, baseType: !11)
!62 = !{!0, !63}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !2, file: !3, line: 67, type: !65, isLocal: true, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !66, line: 111, baseType: !67)
!66 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 109, size: 96, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !67, file: !66, line: 110, baseType: !70, size: 96)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !66, line: 106, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 102, size: 96, elements: !72)
!72 = !{!73, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !71, file: !66, line: 103, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{null}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !71, file: !66, line: 104, baseType: !74, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !71, file: !66, line: 105, baseType: !74, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !6, line: 62, baseType: !7)
!81 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!82 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !85, file: !86, line: 43, type: !92, isLocal: true, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !87, globals: !97, splitDebugInlining: false, nameTableKind: None)
!86 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!87 = !{!88, !80, !90, !96}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !93, line: 48, baseType: !94)
!93 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !95, line: 79, baseType: !7)
!95 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!97 = !{!83, !98}
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !85, file: !86, line: 44, type: !92, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !102, file: !103, line: 54, type: !92, isLocal: false, isDefinition: true)
!102 = distinct !DICompileUnit(language: DW_LANG_C99, file: !103, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, retainedTypes: !128, globals: !137, splitDebugInlining: false, nameTableKind: None)
!103 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!104 = !{!105, !111}
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 71, baseType: !7, size: 32, elements: !107)
!106 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!107 = !{!108, !109, !110}
!108 = !DIEnumerator(name: "UART_PORT0", value: 0)
!109 = !DIEnumerator(name: "UART_PORT1", value: 1)
!110 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !112, line: 129, baseType: !7, size: 32, elements: !113)
!112 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!114 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!115 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!116 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!117 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!118 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!119 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!120 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!121 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!122 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!123 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!124 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!125 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!126 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!127 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!128 = !{!88, !92, !129, !131, !133, !135, !80}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !6, line: 113, baseType: !132)
!132 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !6, line: 59, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!137 = !{!100}
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !140, file: !141, line: 53, type: !232, isLocal: false, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !151, globals: !231, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!142 = !{!143, !11}
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 152, baseType: !13, size: 32, elements: !145)
!144 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!145 = !{!146, !147, !148, !149, !150}
!146 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!147 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!148 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!149 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!150 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!151 = !{!152, !153, !92, !154, !156, !192}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !12, line: 97, baseType: !61)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !93, line: 44, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !95, line: 77, baseType: !13)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !158, line: 378, baseType: !159)
!158 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 363, size: 28704, elements: !160)
!160 = !{!161, !165, !169, !170, !171, !172, !173, !174, !175, !176, !180, !187, !191}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !159, file: !158, line: 365, baseType: !162, size: 256)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 256, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 8)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !159, file: !158, line: 366, baseType: !166, size: 768, offset: 256)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 768, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 24)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !159, file: !158, line: 367, baseType: !162, size: 256, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !159, file: !158, line: 368, baseType: !166, size: 768, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !159, file: !158, line: 369, baseType: !162, size: 256, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !159, file: !158, line: 370, baseType: !166, size: 768, offset: 2304)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !159, file: !158, line: 371, baseType: !162, size: 256, offset: 3072)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !159, file: !158, line: 372, baseType: !166, size: 768, offset: 3328)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !159, file: !158, line: 373, baseType: !162, size: 256, offset: 4096)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !159, file: !158, line: 374, baseType: !177, size: 1792, offset: 4352)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 1792, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 56)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !159, file: !158, line: 375, baseType: !181, size: 1920, offset: 6144)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 1920, elements: !185)
!182 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !93, line: 24, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !95, line: 43, baseType: !134)
!185 = !{!186}
!186 = !DISubrange(count: 240)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !159, file: !158, line: 376, baseType: !188, size: 20608, offset: 8064)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 20608, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 644)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !159, file: !158, line: 377, baseType: !91, size: 32, offset: 28672)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !158, line: 418, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 395, size: 1120, elements: !195)
!195 = !{!196, !198, !199, !200, !201, !202, !203, !207, !208, !209, !210, !211, !212, !213, !214, !218, !219, !220, !224, !228, !230}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !194, file: !158, line: 397, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !194, file: !158, line: 398, baseType: !91, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !194, file: !158, line: 399, baseType: !91, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !194, file: !158, line: 400, baseType: !91, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !194, file: !158, line: 401, baseType: !91, size: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !194, file: !158, line: 402, baseType: !91, size: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !194, file: !158, line: 403, baseType: !204, size: 96, offset: 192)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 96, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 12)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !194, file: !158, line: 404, baseType: !91, size: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !194, file: !158, line: 405, baseType: !91, size: 32, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !194, file: !158, line: 406, baseType: !91, size: 32, offset: 352)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !194, file: !158, line: 407, baseType: !91, size: 32, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !194, file: !158, line: 408, baseType: !91, size: 32, offset: 416)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !194, file: !158, line: 409, baseType: !91, size: 32, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !194, file: !158, line: 410, baseType: !91, size: 32, offset: 480)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !194, file: !158, line: 411, baseType: !215, size: 64, offset: 512)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 64, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 2)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !194, file: !158, line: 412, baseType: !197, size: 32, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !194, file: !158, line: 413, baseType: !197, size: 32, offset: 608)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !194, file: !158, line: 414, baseType: !221, size: 128, offset: 640)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 128, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 4)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !194, file: !158, line: 415, baseType: !225, size: 160, offset: 768)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 160, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 5)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !194, file: !158, line: 416, baseType: !229, size: 160, offset: 928)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 160, elements: !226)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !194, file: !158, line: 417, baseType: !91, size: 32, offset: 1088)
!231 = !{!138}
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 6144, elements: !241)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !141, line: 50, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 47, size: 64, elements: !235)
!235 = !{!236, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !234, file: !141, line: 48, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !152}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !234, file: !141, line: 49, baseType: !92, size: 32, offset: 32)
!241 = !{!242}
!242 = !DISubrange(count: 96)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !245, file: !246, line: 61, type: !279, isLocal: true, isDefinition: true)
!245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !246, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !247, retainedTypes: !277, globals: !278, splitDebugInlining: false, nameTableKind: None)
!246 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!247 = !{!248, !256, !264, !268, !273}
!248 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !249, line: 387, baseType: !13, size: 32, elements: !250)
!249 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!250 = !{!251, !252, !253, !254, !255}
!251 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!252 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!253 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!254 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!255 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 657, baseType: !7, size: 32, elements: !258)
!257 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!258 = !{!259, !260, !261, !262, !263}
!259 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!260 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!261 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!262 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!263 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !249, line: 397, baseType: !7, size: 32, elements: !265)
!265 = !{!266, !267}
!266 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!267 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 666, baseType: !7, size: 32, elements: !269)
!269 = !{!270, !271, !272}
!270 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!271 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!272 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_BUS", value: 2)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !249, line: 380, baseType: !7, size: 32, elements: !274)
!274 = !{!275, !276}
!275 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!276 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!277 = !{!153, !92}
!278 = !{!243}
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 640, elements: !226)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !246, line: 55, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 51, size: 128, elements: !282)
!282 = !{!283, !285, !295}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !281, file: !246, line: 52, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !249, line: 400, baseType: !264)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !281, file: !246, line: 53, baseType: !286, size: 64, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !246, line: 49, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 46, size: 64, elements: !288)
!288 = !{!289, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !287, file: !246, line: 47, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !249, line: 371, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !153}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !287, file: !246, line: 48, baseType: !153, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !281, file: !246, line: 54, baseType: !296, size: 8, offset: 96)
!296 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !299, file: !300, line: 77, type: !365, isLocal: true, isDefinition: true)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !301, retainedTypes: !351, globals: !353, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!301 = !{!302, !310, !315, !331, !337, !341, !105, !111, !346}
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 345, baseType: !13, size: 32, elements: !304)
!303 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!304 = !{!305, !306, !307, !308, !309}
!305 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!306 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!307 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!308 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!309 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 109, baseType: !7, size: 32, elements: !311)
!311 = !{!312, !313, !314}
!312 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!313 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!314 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 302, baseType: !7, size: 32, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!317 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!318 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!319 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!320 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!321 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!322 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!323 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!324 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!325 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!326 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!327 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!328 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!329 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!330 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 321, baseType: !7, size: 32, elements: !332)
!332 = !{!333, !334, !335, !336}
!333 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!334 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!335 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!336 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!337 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 330, baseType: !7, size: 32, elements: !338)
!338 = !{!339, !340}
!339 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!340 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 337, baseType: !7, size: 32, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!344 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!345 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 355, baseType: !13, size: 32, elements: !347)
!347 = !{!348, !349, !350}
!348 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!349 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!350 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!351 = !{!7, !153, !134, !352, !183}
!352 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!353 = !{!297, !354}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "func_tbl", scope: !356, file: !300, line: 536, type: !363, isLocal: true, isDefinition: true)
!356 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !300, file: !300, line: 534, type: !357, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !299, retainedNodes: !361)
!357 = !DISubroutineType(types: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !112, line: 197, baseType: !74)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !257, line: 113, baseType: !310)
!361 = !{!362}
!362 = !DILocalVariable(name: "uart_port", arg: 1, scope: !356, file: !300, line: 534, type: !360)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 64, elements: !216)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 1024, elements: !216)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !300, line: 75, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !300, line: 68, size: 512, elements: !368)
!368 = !{!369, !370, !382, !383, !394, !395}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !367, file: !300, line: 69, baseType: !296, size: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !367, file: !300, line: 70, baseType: !371, size: 128, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !303, line: 378, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 373, size: 128, elements: !373)
!373 = !{!374, !376, !378, !380}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !372, file: !303, line: 374, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !303, line: 317, baseType: !315)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !372, file: !303, line: 375, baseType: !377, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !303, line: 326, baseType: !331)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !372, file: !303, line: 376, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !303, line: 333, baseType: !337)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !372, file: !303, line: 377, baseType: !381, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !303, line: 341, baseType: !341)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !367, file: !300, line: 71, baseType: !296, size: 8, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !367, file: !300, line: 72, baseType: !384, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !300, line: 66, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !300, line: 63, size: 64, elements: !386)
!386 = !{!387, !393}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !385, file: !300, line: 64, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !303, line: 410, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !392, !153}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !303, line: 359, baseType: !346)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !385, file: !300, line: 65, baseType: !153, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !367, file: !300, line: 73, baseType: !296, size: 8, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !367, file: !300, line: 74, baseType: !396, size: 224, offset: 288)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !303, line: 390, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 382, size: 224, elements: !398)
!398 = !{!399, !401, !402, !403, !404, !405, !406}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !397, file: !303, line: 383, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !397, file: !303, line: 384, baseType: !92, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !397, file: !303, line: 385, baseType: !92, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !397, file: !303, line: 386, baseType: !400, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !397, file: !303, line: 387, baseType: !92, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !397, file: !303, line: 388, baseType: !92, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !397, file: !303, line: 389, baseType: !92, size: 32, offset: 192)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "gpt_port", scope: !409, file: !410, line: 50, type: !457, isLocal: false, isDefinition: true)
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !411, retainedTypes: !443, globals: !444, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!411 = !{!310, !256, !315, !331, !337, !341, !412, !248, !273, !268}
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 249, baseType: !7, size: 32, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!414 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!415 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!416 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!417 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!418 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!419 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!420 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!421 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!422 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!423 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!424 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!425 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!426 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!427 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!428 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!429 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!430 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!431 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!432 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!433 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!434 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!435 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!436 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!437 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!438 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!439 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!440 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!441 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!442 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!443 = !{!153, !13}
!444 = !{!407, !445, !453, !455}
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "current_time", scope: !447, file: !410, line: 139, type: !92, isLocal: true, isDefinition: true)
!447 = distinct !DISubprogram(name: "gpt_callback", scope: !410, file: !410, line: 137, type: !292, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !409, retainedNodes: !448)
!448 = !{!449, !450, !451}
!449 = !DILocalVariable(name: "parameter", arg: 1, scope: !447, file: !410, line: 137, type: !153)
!450 = !DILocalVariable(name: "duration_time", scope: !447, file: !410, line: 142, type: !92)
!451 = !DILocalVariable(name: "ret", scope: !447, file: !410, line: 143, type: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_status_t", file: !249, line: 393, baseType: !248)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "last_time", scope: !447, file: !410, line: 140, type: !92, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "timeout_times", scope: !447, file: !410, line: 141, type: !92, isLocal: true, isDefinition: true)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_port_t", file: !257, line: 663, baseType: !256)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !460, file: !461, line: 59, type: !92, isLocal: false, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !462, globals: !525, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!462 = !{!463, !471, !496}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !158, line: 656, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 650, size: 128, elements: !466)
!466 = !{!467, !468, !469, !470}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !465, file: !158, line: 652, baseType: !91, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !465, file: !158, line: 653, baseType: !91, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !465, file: !158, line: 654, baseType: !91, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !465, file: !158, line: 655, baseType: !197, size: 32, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !158, line: 418, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 395, size: 1120, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !473, file: !158, line: 397, baseType: !197, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !473, file: !158, line: 398, baseType: !91, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !473, file: !158, line: 399, baseType: !91, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !473, file: !158, line: 400, baseType: !91, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !473, file: !158, line: 401, baseType: !91, size: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !473, file: !158, line: 402, baseType: !91, size: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !473, file: !158, line: 403, baseType: !204, size: 96, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !473, file: !158, line: 404, baseType: !91, size: 32, offset: 288)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !473, file: !158, line: 405, baseType: !91, size: 32, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !473, file: !158, line: 406, baseType: !91, size: 32, offset: 352)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !473, file: !158, line: 407, baseType: !91, size: 32, offset: 384)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !473, file: !158, line: 408, baseType: !91, size: 32, offset: 416)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !473, file: !158, line: 409, baseType: !91, size: 32, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !473, file: !158, line: 410, baseType: !91, size: 32, offset: 480)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !473, file: !158, line: 411, baseType: !215, size: 64, offset: 512)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !473, file: !158, line: 412, baseType: !197, size: 32, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !473, file: !158, line: 413, baseType: !197, size: 32, offset: 608)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !473, file: !158, line: 414, baseType: !221, size: 128, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !473, file: !158, line: 415, baseType: !225, size: 160, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !473, file: !158, line: 416, baseType: !229, size: 160, offset: 928)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !473, file: !158, line: 417, baseType: !91, size: 32, offset: 1088)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !498, line: 72, baseType: !499)
!498 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !498, line: 56, size: 525312, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !515, !516, !520, !524}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !499, file: !498, line: 57, baseType: !91, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !499, file: !498, line: 58, baseType: !91, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !499, file: !498, line: 59, baseType: !91, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !499, file: !498, line: 60, baseType: !91, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !499, file: !498, line: 61, baseType: !91, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !499, file: !498, line: 62, baseType: !91, size: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !499, file: !498, line: 63, baseType: !91, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !499, file: !498, line: 64, baseType: !91, size: 32, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !499, file: !498, line: 65, baseType: !91, size: 32, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !499, file: !498, line: 66, baseType: !91, size: 32, offset: 288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !499, file: !498, line: 67, baseType: !512, size: 32, offset: 320)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 32, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 1)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !499, file: !498, line: 68, baseType: !91, size: 32, offset: 352)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !499, file: !498, line: 69, baseType: !517, size: 523904, offset: 384)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 523904, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 16372)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !499, file: !498, line: 70, baseType: !521, size: 512, offset: 524288)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 512, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !499, file: !498, line: 71, baseType: !521, size: 512, offset: 524800)
!525 = !{!458, !526}
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !460, file: !461, line: 61, type: !91, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "heap_end", scope: !530, file: !531, line: 66, type: !536, isLocal: true, isDefinition: true)
!530 = distinct !DISubprogram(name: "_sbrk_r", scope: !531, file: !531, line: 63, type: !532, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !728, retainedNodes: !732)
!531 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!532 = !DISubroutineType(types: !533)
!533 = !{!534, !537, !727}
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !535, line: 123, baseType: !536)
!535 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !539, line: 377, size: 1920, elements: !540)
!539 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!540 = !{!541, !542, !616, !617, !618, !619, !620, !621, !622, !625, !646, !650, !651, !652, !653, !663, !676, !677, !682, !701, !702, !709, !710, !726}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !538, file: !539, line: 381, baseType: !13, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !538, file: !539, line: 386, baseType: !543, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !539, line: 292, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !539, line: 186, size: 832, elements: !546)
!546 = !{!547, !549, !550, !551, !553, !554, !559, !560, !561, !562, !566, !572, !579, !583, !584, !585, !586, !590, !592, !593, !594, !596, !602, !615}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !545, file: !539, line: 187, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !545, file: !539, line: 188, baseType: !13, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !545, file: !539, line: 189, baseType: !13, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !545, file: !539, line: 190, baseType: !552, size: 16, offset: 96)
!552 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !545, file: !539, line: 191, baseType: !552, size: 16, offset: 112)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !545, file: !539, line: 192, baseType: !555, size: 64, offset: 128)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !539, line: 122, size: 64, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !555, file: !539, line: 123, baseType: !548, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !555, file: !539, line: 124, baseType: !13, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !545, file: !539, line: 193, baseType: !13, size: 32, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !545, file: !539, line: 196, baseType: !537, size: 32, offset: 224)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !545, file: !539, line: 200, baseType: !153, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !545, file: !539, line: 202, baseType: !563, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DISubroutineType(types: !565)
!565 = !{!13, !537, !153, !536, !13}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !545, file: !539, line: 204, baseType: !567, size: 32, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DISubroutineType(types: !569)
!569 = !{!13, !537, !153, !570, !13}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !545, file: !539, line: 207, baseType: !573, size: 32, offset: 352)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DISubroutineType(types: !575)
!575 = !{!576, !537, !153, !576, !13}
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !577, line: 116, baseType: !578)
!577 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!578 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !545, file: !539, line: 208, baseType: !580, size: 32, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{!13, !537, !153}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !545, file: !539, line: 211, baseType: !555, size: 64, offset: 416)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !545, file: !539, line: 212, baseType: !548, size: 32, offset: 480)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !545, file: !539, line: 213, baseType: !13, size: 32, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !545, file: !539, line: 216, baseType: !587, size: 24, offset: 544)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 24, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 3)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !545, file: !539, line: 217, baseType: !591, size: 8, offset: 568)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 8, elements: !513)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !545, file: !539, line: 220, baseType: !555, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !545, file: !539, line: 223, baseType: !13, size: 32, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !545, file: !539, line: 224, baseType: !595, size: 32, offset: 672)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !577, line: 46, baseType: !578)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !545, file: !539, line: 231, baseType: !597, size: 32, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !539, line: 35, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !599, line: 34, baseType: !600)
!599 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !599, line: 33, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !545, file: !539, line: 233, baseType: !603, size: 64, offset: 736)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !577, line: 170, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !577, line: 162, size: 64, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !604, file: !577, line: 164, baseType: !13, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !604, file: !577, line: 169, baseType: !608, size: 32, offset: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !604, file: !577, line: 165, size: 32, elements: !609)
!609 = !{!610, !613}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !608, file: !577, line: 167, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !612, line: 116, baseType: !13)
!612 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !608, file: !577, line: 168, baseType: !614, size: 32)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !222)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !545, file: !539, line: 234, baseType: !13, size: 32, offset: 800)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !538, file: !539, line: 386, baseType: !543, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !538, file: !539, line: 386, baseType: !543, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !538, file: !539, line: 388, baseType: !13, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !538, file: !539, line: 390, baseType: !536, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !538, file: !539, line: 392, baseType: !13, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !538, file: !539, line: 394, baseType: !13, size: 32, offset: 224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !538, file: !539, line: 395, baseType: !623, size: 32, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !539, line: 45, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !538, file: !539, line: 397, baseType: !626, size: 32, offset: 288)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !539, line: 349, size: 128, elements: !628)
!628 = !{!629, !642, !643, !644}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !627, file: !539, line: 352, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !539, line: 52, size: 192, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !631, file: !539, line: 54, baseType: !630, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !631, file: !539, line: 55, baseType: !13, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !631, file: !539, line: 55, baseType: !13, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !631, file: !539, line: 55, baseType: !13, size: 32, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !631, file: !539, line: 55, baseType: !13, size: 32, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !631, file: !539, line: 56, baseType: !639, size: 32, offset: 160)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 32, elements: !513)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !539, line: 22, baseType: !641)
!641 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !627, file: !539, line: 353, baseType: !13, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !627, file: !539, line: 354, baseType: !630, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !627, file: !539, line: 355, baseType: !645, size: 32, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !538, file: !539, line: 399, baseType: !647, size: 32, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !537}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !538, file: !539, line: 401, baseType: !13, size: 32, offset: 352)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !538, file: !539, line: 404, baseType: !13, size: 32, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !538, file: !539, line: 405, baseType: !536, size: 32, offset: 416)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !538, file: !539, line: 407, baseType: !654, size: 32, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !539, line: 324, size: 192, elements: !656)
!656 = !{!657, !659, !660, !661}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !655, file: !539, line: 325, baseType: !658, size: 48)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 48, elements: !588)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !655, file: !539, line: 326, baseType: !658, size: 48, offset: 48)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !655, file: !539, line: 327, baseType: !132, size: 16, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !655, file: !539, line: 330, baseType: !662, size: 64, offset: 128)
!662 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !538, file: !539, line: 408, baseType: !664, size: 32, offset: 480)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !539, line: 60, size: 288, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !665, file: !539, line: 62, baseType: !13, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !665, file: !539, line: 63, baseType: !13, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !665, file: !539, line: 64, baseType: !13, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !665, file: !539, line: 65, baseType: !13, size: 32, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !665, file: !539, line: 66, baseType: !13, size: 32, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !665, file: !539, line: 67, baseType: !13, size: 32, offset: 160)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !665, file: !539, line: 68, baseType: !13, size: 32, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !665, file: !539, line: 69, baseType: !13, size: 32, offset: 224)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !665, file: !539, line: 70, baseType: !13, size: 32, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !538, file: !539, line: 409, baseType: !536, size: 32, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !538, file: !539, line: 412, baseType: !678, size: 32, offset: 544)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !13}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !538, file: !539, line: 416, baseType: !683, size: 32, offset: 576)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !539, line: 90, size: 1120, elements: !685)
!685 = !{!686, !687, !688, !692}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !684, file: !539, line: 91, baseType: !683, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !684, file: !539, line: 92, baseType: !13, size: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !684, file: !539, line: 93, baseType: !689, size: 1024, offset: 64)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1024, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !684, file: !539, line: 94, baseType: !693, size: 32, offset: 1088)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !539, line: 79, size: 2112, elements: !695)
!695 = !{!696, !698, !699, !700}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !694, file: !539, line: 80, baseType: !697, size: 1024)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 1024, elements: !690)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !694, file: !539, line: 81, baseType: !697, size: 1024, offset: 1024)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !694, file: !539, line: 83, baseType: !640, size: 32, offset: 2048)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !694, file: !539, line: 86, baseType: !640, size: 32, offset: 2080)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !538, file: !539, line: 417, baseType: !684, size: 1120, offset: 608)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !538, file: !539, line: 420, baseType: !703, size: 96, offset: 1728)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !539, line: 296, size: 96, elements: !704)
!704 = !{!705, !707, !708}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !703, file: !539, line: 298, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !703, file: !539, line: 299, baseType: !13, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !703, file: !539, line: 300, baseType: !543, size: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !538, file: !539, line: 421, baseType: !543, size: 32, offset: 1824)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !538, file: !539, line: 422, baseType: !711, size: 32, offset: 1856)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !539, line: 359, size: 640, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !720, !721, !722, !723, !724, !725}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !712, file: !539, line: 362, baseType: !536, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !712, file: !539, line: 363, baseType: !603, size: 64, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !712, file: !539, line: 364, baseType: !603, size: 64, offset: 96)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !712, file: !539, line: 365, baseType: !603, size: 64, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !712, file: !539, line: 366, baseType: !719, size: 64, offset: 224)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 64, elements: !163)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !712, file: !539, line: 367, baseType: !13, size: 32, offset: 288)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !712, file: !539, line: 368, baseType: !603, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !712, file: !539, line: 369, baseType: !603, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !712, file: !539, line: 370, baseType: !603, size: 64, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !712, file: !539, line: 371, baseType: !603, size: 64, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !712, file: !539, line: 372, baseType: !603, size: 64, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !538, file: !539, line: 423, baseType: !536, size: 32, offset: 1888)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !612, line: 46, baseType: !7)
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !730, globals: !731, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!730 = !{!536, !534}
!731 = !{!528}
!732 = !{!733, !734, !735, !736}
!733 = !DILocalVariable(name: "r", arg: 1, scope: !530, file: !531, line: 63, type: !537)
!734 = !DILocalVariable(name: "nbytes", arg: 2, scope: !530, file: !531, line: 63, type: !727)
!735 = !DILocalVariable(name: "prev_heap_end", scope: !530, file: !531, line: 67, type: !536)
!736 = !DILocalVariable(name: "stack", scope: !530, file: !531, line: 68, type: !536)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !739, file: !744, line: 4, type: !750, isLocal: false, isDefinition: true)
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !740, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !741, splitDebugInlining: false, nameTableKind: None)
!740 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!741 = !{!737, !742, !748}
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !739, file: !744, line: 5, type: !745, isLocal: false, isDefinition: true)
!744 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 88, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 11)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !739, file: !744, line: 6, type: !745, isLocal: false, isDefinition: true)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 248, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 31)
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !755, retainedTypes: !761, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!755 = !{!756}
!756 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !757, line: 1209, baseType: !7, size: 32, elements: !758)
!757 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!758 = !{!759, !760}
!759 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!760 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!761 = !{!58, !60}
!762 = distinct !DICompileUnit(language: DW_LANG_C99, file: !763, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !764, retainedTypes: !842, splitDebugInlining: false, nameTableKind: None)
!763 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!764 = !{!765}
!765 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !766, line: 150, baseType: !7, size: 32, elements: !767)
!766 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!768 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!769 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!770 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!771 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!772 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!773 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!774 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!775 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!776 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!777 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!778 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!779 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!780 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!781 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!782 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!783 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!784 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!785 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!786 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!787 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!788 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!789 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!790 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!791 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!792 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!793 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!794 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!795 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!796 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!797 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!798 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!799 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!800 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!801 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!802 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!803 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!804 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!805 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!806 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!807 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!808 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!809 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!810 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!811 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!812 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!813 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!814 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!815 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!816 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!817 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!818 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!819 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!820 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!821 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!822 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!823 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!824 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!825 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!826 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!827 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!828 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!829 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!830 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!831 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!832 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!833 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!834 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!835 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!836 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!837 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!838 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!839 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!840 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!841 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!842 = !{!58, !80}
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !844, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !845, splitDebugInlining: false, nameTableKind: None)
!844 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!845 = !{!846, !871}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !158, line: 418, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 395, size: 1120, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !848, file: !158, line: 397, baseType: !197, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !848, file: !158, line: 398, baseType: !91, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !848, file: !158, line: 399, baseType: !91, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !848, file: !158, line: 400, baseType: !91, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !848, file: !158, line: 401, baseType: !91, size: 32, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !848, file: !158, line: 402, baseType: !91, size: 32, offset: 160)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !848, file: !158, line: 403, baseType: !204, size: 96, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !848, file: !158, line: 404, baseType: !91, size: 32, offset: 288)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !848, file: !158, line: 405, baseType: !91, size: 32, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !848, file: !158, line: 406, baseType: !91, size: 32, offset: 352)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !848, file: !158, line: 407, baseType: !91, size: 32, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !848, file: !158, line: 408, baseType: !91, size: 32, offset: 416)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !848, file: !158, line: 409, baseType: !91, size: 32, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !848, file: !158, line: 410, baseType: !91, size: 32, offset: 480)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !848, file: !158, line: 411, baseType: !215, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !848, file: !158, line: 412, baseType: !197, size: 32, offset: 576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !848, file: !158, line: 413, baseType: !197, size: 32, offset: 608)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !848, file: !158, line: 414, baseType: !221, size: 128, offset: 640)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !848, file: !158, line: 415, baseType: !225, size: 160, offset: 768)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !848, file: !158, line: 416, baseType: !229, size: 160, offset: 928)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !848, file: !158, line: 417, baseType: !91, size: 32, offset: 1088)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !158, line: 378, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 363, size: 28704, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !873, file: !158, line: 365, baseType: !162, size: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !873, file: !158, line: 366, baseType: !166, size: 768, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !873, file: !158, line: 367, baseType: !162, size: 256, offset: 1024)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !873, file: !158, line: 368, baseType: !166, size: 768, offset: 1280)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !873, file: !158, line: 369, baseType: !162, size: 256, offset: 2048)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !873, file: !158, line: 370, baseType: !166, size: 768, offset: 2304)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !873, file: !158, line: 371, baseType: !162, size: 256, offset: 3072)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !873, file: !158, line: 372, baseType: !166, size: 768, offset: 3328)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !873, file: !158, line: 373, baseType: !162, size: 256, offset: 4096)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !873, file: !158, line: 374, baseType: !177, size: 1792, offset: 4352)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !873, file: !158, line: 375, baseType: !181, size: 1920, offset: 6144)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !873, file: !158, line: 376, baseType: !188, size: 20608, offset: 8064)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !873, file: !158, line: 377, baseType: !91, size: 32, offset: 28672)
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !890, splitDebugInlining: false, nameTableKind: None)
!889 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!890 = !{!891, !765}
!891 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !892, line: 55, baseType: !7, size: 32, elements: !893)
!892 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!893 = !{!894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!894 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!895 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!896 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!897 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!898 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!899 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!900 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!901 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!902 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!903 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!904 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!905 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!906 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!907 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!908 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!909 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!910 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!911 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!912 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!913 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!914 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!915 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!916 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!917 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!918 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!919 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!920 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!921 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!922 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !924, splitDebugInlining: false, nameTableKind: None)
!923 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/timer.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!924 = !{!578, !58}
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!926 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !929, retainedTypes: !962, splitDebugInlining: false, nameTableKind: None)
!928 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!929 = !{!930, !412, !891, !937, !943, !947, !951, !957}
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !931, line: 233, baseType: !13, size: 32, elements: !932)
!931 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!932 = !{!933, !934, !935, !936}
!933 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!934 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!935 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!936 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !931, line: 224, baseType: !13, size: 32, elements: !938)
!938 = !{!939, !940, !941, !942}
!939 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!940 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!941 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!942 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !931, line: 217, baseType: !7, size: 32, elements: !944)
!944 = !{!945, !946}
!945 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!946 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!947 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !931, line: 210, baseType: !7, size: 32, elements: !948)
!948 = !{!949, !950}
!949 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!950 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!951 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !931, line: 242, baseType: !7, size: 32, elements: !952)
!952 = !{!953, !954, !955, !956}
!953 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!954 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!955 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!956 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !958, line: 57, baseType: !7, size: 32, elements: !959)
!958 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gpt_interrupt_repeat_mode/GCC")
!959 = !{!960, !961}
!960 = !DIEnumerator(name: "eDirection_IN", value: 0)
!961 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!962 = !{!963, !153, !964, !183, !965, !966}
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !892, line: 87, baseType: !891)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !931, line: 220, baseType: !943)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !931, line: 247, baseType: !951)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !958, line: 60, baseType: !957)
!967 = !{!"Ubuntu clang version 14.0.6"}
!968 = !{i32 7, !"Dwarf Version", i32 2}
!969 = !{i32 2, !"Debug Info Version", i32 3}
!970 = !{i32 1, !"wchar_size", i32 4}
!971 = !{i32 1, !"min_enum_size", i32 4}
!972 = !{i32 1, !"branch-target-enforcement", i32 0}
!973 = !{i32 1, !"sign-return-address", i32 0}
!974 = !{i32 1, !"sign-return-address-all", i32 0}
!975 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!976 = !{i32 7, !"frame-pointer", i32 2}
!977 = distinct !DISubprogram(name: "GPT_ResetTimer", scope: !3, file: !3, line: 73, type: !978, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !980)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !60, !60, !296}
!980 = !{!981, !982, !983}
!981 = !DILocalVariable(name: "timerNum", arg: 1, scope: !977, file: !3, line: 73, type: !60)
!982 = !DILocalVariable(name: "countValue", arg: 2, scope: !977, file: !3, line: 73, type: !60)
!983 = !DILocalVariable(name: "autoRepeat", arg: 3, scope: !977, file: !3, line: 73, type: !296)
!984 = !DILocation(line: 0, scope: !977)
!985 = !DILocation(line: 75, column: 5, scope: !986)
!986 = distinct !DILexicalBlock(scope: !977, file: !3, line: 75, column: 5)
!987 = !DILocation(line: 75, column: 5, scope: !977)
!988 = !DILocation(line: 75, column: 5, scope: !989)
!989 = distinct !DILexicalBlock(scope: !986, file: !3, line: 75, column: 5)
!990 = distinct !{!990, !988, !988}
!991 = !DILocation(line: 77, column: 9, scope: !977)
!992 = !DILocation(line: 78, column: 30, scope: !993)
!993 = distinct !DILexicalBlock(scope: !994, file: !3, line: 77, column: 24)
!994 = distinct !DILexicalBlock(scope: !977, file: !3, line: 77, column: 9)
!995 = !DILocation(line: 0, scope: !996)
!996 = distinct !DILexicalBlock(scope: !993, file: !3, line: 79, column: 13)
!997 = !DILocation(line: 79, column: 13, scope: !993)
!998 = !DILocation(line: 80, column: 34, scope: !999)
!999 = distinct !DILexicalBlock(scope: !996, file: !3, line: 79, column: 37)
!1000 = !DILocation(line: 81, column: 9, scope: !999)
!1001 = !DILocation(line: 82, column: 34, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !996, file: !3, line: 81, column: 16)
!1003 = !DILocation(line: 85, column: 30, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 84, column: 31)
!1005 = distinct !DILexicalBlock(scope: !994, file: !3, line: 84, column: 16)
!1006 = !DILocation(line: 0, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 86, column: 13)
!1008 = !DILocation(line: 86, column: 13, scope: !1004)
!1009 = !DILocation(line: 87, column: 34, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 86, column: 37)
!1011 = !DILocation(line: 88, column: 9, scope: !1010)
!1012 = !DILocation(line: 89, column: 34, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 88, column: 16)
!1014 = !DILocation(line: 92, column: 1, scope: !977)
!1015 = distinct !DISubprogram(name: "GPT_Start", scope: !3, file: !3, line: 94, type: !1016, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1018)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{null, !60}
!1018 = !{!1019}
!1019 = !DILocalVariable(name: "timerNum", arg: 1, scope: !1015, file: !3, line: 94, type: !60)
!1020 = !DILocation(line: 0, scope: !1015)
!1021 = !DILocation(line: 96, column: 5, scope: !1015)
!1022 = !DILocation(line: 96, column: 5, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 96, column: 5)
!1024 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 96, column: 5)
!1025 = distinct !{!1025, !1022, !1022}
!1026 = !DILocation(line: 99, column: 30, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 98, column: 24)
!1028 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 98, column: 9)
!1029 = !DILocation(line: 100, column: 9, scope: !1027)
!1030 = !DILocation(line: 101, column: 5, scope: !1027)
!1031 = !DILocation(line: 102, column: 30, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 101, column: 31)
!1033 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 101, column: 16)
!1034 = !DILocation(line: 103, column: 9, scope: !1032)
!1035 = !DILocation(line: 104, column: 5, scope: !1032)
!1036 = !DILocation(line: 105, column: 30, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 104, column: 31)
!1038 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 104, column: 16)
!1039 = !DILocation(line: 106, column: 5, scope: !1037)
!1040 = !DILocation(line: 108, column: 1, scope: !1015)
!1041 = distinct !DISubprogram(name: "GPT_Stop", scope: !3, file: !3, line: 110, type: !1016, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1042)
!1042 = !{!1043}
!1043 = !DILocalVariable(name: "timerNum", arg: 1, scope: !1041, file: !3, line: 110, type: !60)
!1044 = !DILocation(line: 0, scope: !1041)
!1045 = !DILocation(line: 112, column: 9, scope: !1041)
!1046 = !DILocation(line: 113, column: 30, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 112, column: 24)
!1048 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 112, column: 9)
!1049 = !DILocation(line: 114, column: 30, scope: !1047)
!1050 = !DILocation(line: 115, column: 31, scope: !1047)
!1051 = !DILocation(line: 117, column: 5, scope: !1047)
!1052 = !DILocation(line: 118, column: 30, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 117, column: 31)
!1054 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 117, column: 16)
!1055 = !DILocation(line: 119, column: 30, scope: !1053)
!1056 = !DILocation(line: 120, column: 31, scope: !1053)
!1057 = !DILocation(line: 121, column: 5, scope: !1053)
!1058 = !DILocation(line: 122, column: 30, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 121, column: 31)
!1060 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 121, column: 16)
!1061 = !DILocation(line: 123, column: 5, scope: !1059)
!1062 = !DILocation(line: 124, column: 30, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 123, column: 31)
!1064 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 123, column: 16)
!1065 = !DILocation(line: 125, column: 5, scope: !1063)
!1066 = !DILocation(line: 128, column: 1, scope: !1041)
!1067 = distinct !DISubprogram(name: "GPT_INT_Handler", scope: !3, file: !3, line: 130, type: !238, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1068)
!1068 = !{!1069, !1070}
!1069 = !DILocalVariable(name: "irq_number", arg: 1, scope: !1067, file: !3, line: 130, type: !152)
!1070 = !DILocalVariable(name: "GPT_Status", scope: !1067, file: !3, line: 132, type: !131)
!1071 = !DILocation(line: 0, scope: !1067)
!1072 = !DILocation(line: 135, column: 18, scope: !1067)
!1073 = !DILocation(line: 136, column: 26, scope: !1067)
!1074 = !DILocation(line: 136, column: 24, scope: !1067)
!1075 = !DILocation(line: 138, column: 20, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 138, column: 9)
!1077 = !DILocation(line: 138, column: 9, scope: !1067)
!1078 = !DILocation(line: 141, column: 27, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 141, column: 16)
!1080 = !DILocation(line: 141, column: 16, scope: !1076)
!1081 = !DILocation(line: 0, scope: !1076)
!1082 = !DILocation(line: 145, column: 1, scope: !1067)
!1083 = distinct !DISubprogram(name: "GPT_init", scope: !3, file: !3, line: 147, type: !1084, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1086)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{null, !60, !60, !74}
!1086 = !{!1087, !1088, !1089}
