; ModuleID = 'build/actinius_icarus_ns/subsys/zbus/uart_bridge/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.zbus_channel = type { i8*, i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/zbus/uart_bridge/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/zbus/uart_bridge")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/zbus/uart_bridge")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_bridge_sub", scope: !27, file: !179, line: 16, type: !187, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !176, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/uart_bridge/src/bridge.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/zbus/uart_bridge")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !133, !111, !168, !172, !173, !158, !174}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !105, line: 336, size: 160, elements: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !{!107, !141, !145, !149, !163}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !104, file: !105, line: 365, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !112, !140}
!111 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !115, line: 378, size: 192, elements: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !121, !122, !123, !132, !134}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !115, line: 380, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !114, file: !115, line: 382, baseType: !13, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !114, file: !115, line: 384, baseType: !13, size: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !114, file: !115, line: 386, baseType: !124, size: 32, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !115, line: 351, size: 16, elements: !126)
!126 = !{!127, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !125, file: !115, line: 359, baseType: !128, size: 8)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !129)
!129 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !125, file: !115, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!131 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !114, file: !115, line: 388, baseType: !133, size: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !114, file: !115, line: 396, baseType: !135, size: 32, offset: 160)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !115, line: 43, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !139)
!139 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !104, file: !105, line: 366, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !112, !129}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !104, file: !105, line: 374, baseType: !146, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{!111, !112}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !104, file: !105, line: 377, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DISubroutineType(types: !152)
!152 = !{!111, !112, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !105, line: 122, size: 64, elements: !156)
!156 = !{!157, !159, !160, !161, !162}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !155, file: !105, line: 123, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !155, file: !105, line: 124, baseType: !128, size: 8, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !155, file: !105, line: 125, baseType: !128, size: 8, offset: 40)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !155, file: !105, line: 126, baseType: !128, size: 8, offset: 48)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !155, file: !105, line: 127, baseType: !128, size: 8, offset: 56)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !104, file: !105, line: 379, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DISubroutineType(types: !166)
!166 = !{!111, !112, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !169, line: 46, baseType: !170)
!169 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !171)
!171 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !175)
!175 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!176 = !{!25, !177, !357, !359, !361, !392, !396, !401, !406, !408, !414, !417}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "bridge_sub", scope: !27, file: !179, line: 16, type: !180, isLocal: false, isDefinition: true, align: 32)
!179 = !DIFile(filename: "zephyr/samples/subsys/zbus/uart_bridge/src/bridge.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !181, line: 85, size: 96, elements: !182)
!181 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!182 = !{!183, !184, !226}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !180, file: !181, line: 91, baseType: !131, size: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !180, file: !181, line: 93, baseType: !185, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !188, line: 4204, size: 320, elements: !189)
!188 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = !{!190, !211, !215, !218, !219, !221, !222, !223, !224, !225}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !187, file: !188, line: 4206, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !192, line: 233, baseType: !193)
!192 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 231, size: 64, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !193, file: !192, line: 232, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !197, line: 48, baseType: !198)
!197 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !197, line: 37, size: 64, elements: !199)
!199 = !{!200, !206}
!200 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !197, line: 38, baseType: !201, size: 32)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !197, line: 38, size: 32, elements: !202)
!202 = !{!203, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !201, file: !197, line: 39, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !197, line: 40, baseType: !204, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !197, line: 42, baseType: !207, size: 32, offset: 32)
!207 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !197, line: 42, size: 32, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !207, file: !197, line: 43, baseType: !204, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !207, file: !197, line: 44, baseType: !204, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !187, file: !188, line: 4208, baseType: !212, offset: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !213, line: 43, elements: !214)
!213 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!214 = !{}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !187, file: !188, line: 4210, baseType: !216, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !217, line: 214, baseType: !32)
!217 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!218 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !187, file: !188, line: 4212, baseType: !158, size: 32, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !187, file: !188, line: 4214, baseType: !220, size: 32, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !187, file: !188, line: 4216, baseType: !220, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !187, file: !188, line: 4218, baseType: !220, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !187, file: !188, line: 4220, baseType: !220, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !187, file: !188, line: 4222, baseType: !158, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !187, file: !188, line: 4227, baseType: !128, size: 8, offset: 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !180, file: !181, line: 96, baseType: !227, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !181, line: 29, size: 224, elements: !234)
!234 = !{!235, !237, !241, !243, !244, !249, !352}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !181, line: 32, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !233, file: !181, line: 35, baseType: !238, size: 16, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !240)
!240 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !233, file: !181, line: 40, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !233, file: !181, line: 45, baseType: !242, size: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !233, file: !181, line: 51, baseType: !245, size: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!131, !13, !216}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !233, file: !181, line: 56, baseType: !250, size: 32, offset: 160)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !188, line: 2720, size: 160, elements: !252)
!252 = !{!253, !254, !350, !351}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !251, file: !188, line: 2722, baseType: !191, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !251, file: !188, line: 2724, baseType: !255, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !257, line: 245, size: 1280, elements: !258)
!257 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!258 = !{!259, !304, !317, !318, !319, !323, !324, !330, !345}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !256, file: !257, line: 247, baseType: !260, size: 384)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !257, line: 57, size: 384, elements: !261)
!261 = !{!262, !276, !278, !279, !280, !291, !292, !293}
!262 = !DIDerivedType(tag: DW_TAG_member, scope: !260, file: !257, line: 60, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !260, file: !257, line: 60, size: 64, elements: !264)
!264 = !{!265, !267}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !263, file: !257, line: 61, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !197, line: 49, baseType: !198)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !263, file: !257, line: 62, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !269, line: 49, size: 64, elements: !270)
!269 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !268, file: !269, line: 50, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 64, elements: !274)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!274 = !{!275}
!275 = !DISubrange(count: 2)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !260, file: !257, line: 68, baseType: !277, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !260, file: !257, line: 71, baseType: !128, size: 8, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !260, file: !257, line: 74, baseType: !128, size: 8, offset: 104)
!280 = !DIDerivedType(tag: DW_TAG_member, scope: !260, file: !257, line: 90, baseType: !281, size: 16, offset: 112)
!281 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !260, file: !257, line: 90, size: 16, elements: !282)
!282 = !{!283, !290}
!283 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !257, line: 91, baseType: !284, size: 16)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !281, file: !257, line: 91, size: 16, elements: !285)
!285 = !{!286, !289}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !284, file: !257, line: 96, baseType: !287, size: 8)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !288)
!288 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !284, file: !257, line: 97, baseType: !128, size: 8, offset: 8)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !281, file: !257, line: 100, baseType: !239, size: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !260, file: !257, line: 107, baseType: !158, size: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !260, file: !257, line: 127, baseType: !133, size: 32, offset: 160)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !260, file: !257, line: 131, baseType: !294, size: 192, offset: 192)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !192, line: 244, size: 192, elements: !295)
!295 = !{!296, !297, !303}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !294, file: !192, line: 245, baseType: !266, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !294, file: !192, line: 246, baseType: !298, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !192, line: 242, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !302}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !294, file: !192, line: 249, baseType: !170, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !256, file: !257, line: 250, baseType: !305, size: 288, offset: 384)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !306, line: 25, size: 288, elements: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !305, file: !306, line: 26, baseType: !158, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !305, file: !306, line: 27, baseType: !158, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !305, file: !306, line: 28, baseType: !158, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !305, file: !306, line: 29, baseType: !158, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !305, file: !306, line: 30, baseType: !158, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !305, file: !306, line: 31, baseType: !158, size: 32, offset: 160)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !305, file: !306, line: 32, baseType: !158, size: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !305, file: !306, line: 33, baseType: !158, size: 32, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !305, file: !306, line: 34, baseType: !158, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !256, file: !257, line: 253, baseType: !133, size: 32, offset: 672)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !256, file: !257, line: 256, baseType: !191, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !256, file: !257, line: 279, baseType: !320, size: 256, offset: 768)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !256, file: !257, line: 294, baseType: !111, size: 32, offset: 1024)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !256, file: !257, line: 300, baseType: !325, size: 96, offset: 1056)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !257, line: 149, size: 96, elements: !326)
!326 = !{!327, !328, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !325, file: !257, line: 153, baseType: !22, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !325, file: !257, line: 162, baseType: !216, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !325, file: !257, line: 168, baseType: !216, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !256, file: !257, line: 325, baseType: !331, size: 32, offset: 1152)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !188, line: 5073, size: 160, elements: !333)
!333 = !{!334, !343, !344}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !332, file: !188, line: 5074, baseType: !335, size: 96)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !336, line: 56, size: 96, elements: !337)
!336 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!337 = !{!338, !341, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !335, file: !336, line: 57, baseType: !339, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !336, line: 57, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !335, file: !336, line: 58, baseType: !133, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !335, file: !336, line: 59, baseType: !216, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !332, file: !188, line: 5075, baseType: !191, size: 64, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !332, file: !188, line: 5076, baseType: !212, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !256, file: !257, line: 343, baseType: !346, size: 64, offset: 1184)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !306, line: 60, size: 64, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !346, file: !306, line: 63, baseType: !158, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !346, file: !306, line: 66, baseType: !158, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !251, file: !188, line: 2727, baseType: !158, size: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !251, file: !188, line: 2730, baseType: !111, size: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !233, file: !181, line: 67, baseType: !353, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "_zbus_mutex_finish_chan", scope: !27, file: !179, line: 18, type: !251, isLocal: true, isDefinition: true, align: 32)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "finish_chan", scope: !27, file: !179, line: 18, type: !232, isLocal: false, isDefinition: true, align: 32)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "_k_thread_data_bridge_thread_tid", scope: !27, file: !179, line: 74, type: !363, isLocal: false, isDefinition: true, align: 32)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !188, line: 620, size: 384, elements: !364)
!364 = !{!365, !366, !374, !375, !380, !381, !382, !383, !384, !385, !387, !391}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !363, file: !188, line: 621, baseType: !255, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !363, file: !188, line: 622, baseType: !367, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !369, line: 44, baseType: !370)
!369 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !371, line: 47, size: 8, elements: !372)
!371 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !370, file: !371, line: 48, baseType: !120, size: 8)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !363, file: !188, line: 623, baseType: !32, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !363, file: !188, line: 624, baseType: !376, size: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !369, line: 46, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !133, !133, !133}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !363, file: !188, line: 625, baseType: !133, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !363, file: !188, line: 626, baseType: !133, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !363, file: !188, line: 627, baseType: !133, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !363, file: !188, line: 628, baseType: !111, size: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !363, file: !188, line: 629, baseType: !158, size: 32, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !363, file: !188, line: 630, baseType: !386, size: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !111)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !363, file: !188, line: 631, baseType: !388, size: 32, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DISubroutineType(types: !390)
!390 = !{null}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !363, file: !188, line: 632, baseType: !118, size: 32, offset: 352)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "bridge_thread_tid", scope: !27, file: !179, line: 74, type: !394, isLocal: false, isDefinition: true)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !257, line: 347, baseType: !255)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_bridge_sub", scope: !27, file: !179, line: 16, type: !398, isLocal: true, isDefinition: true, align: 32)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 16)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_k_thread_stack_bridge_thread_tid", scope: !27, file: !179, line: 74, type: !403, isLocal: false, isDefinition: true, align: 64)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 16384, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 2048)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "_k_thread_obj_bridge_thread_tid", scope: !27, file: !179, line: 74, type: !256, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "_zbus_message_finish_chan", scope: !27, file: !179, line: 18, type: !410, isLocal: true, isDefinition: true)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "action_msg", file: !411, line: 26, size: 8, elements: !412)
!411 = !DIFile(filename: "zephyr/samples/subsys/zbus/uart_bridge/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !410, file: !411, line: 27, baseType: !131, size: 8)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "_zbus_observers_finish_chan", scope: !27, file: !179, line: 18, type: !416, isLocal: true, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 64, elements: !274)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "bridge_uart", scope: !27, file: !179, line: 27, type: !112, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !421, file: !427, line: 13, type: !438, isLocal: true, isDefinition: true, align: 32)
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !423, globals: !424, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/uart_bridge/src/core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/zbus/uart_bridge")
!423 = !{!133, !111, !168, !158, !174}
!424 = !{!419, !425, !574, !595, !599, !604, !606, !613}
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "version_chan", scope: !421, file: !427, line: 13, type: !428, isLocal: false, isDefinition: true, align: 32)
!427 = !DIFile(filename: "zephyr/samples/subsys/zbus/uart_bridge/src/core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !181, line: 29, size: 224, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !545}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !429, file: !181, line: 32, baseType: !236, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !429, file: !181, line: 35, baseType: !238, size: 16, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !429, file: !181, line: 40, baseType: !242, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !429, file: !181, line: 45, baseType: !242, size: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !429, file: !181, line: 51, baseType: !245, size: 32, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !429, file: !181, line: 56, baseType: !437, size: 32, offset: 160)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !188, line: 2720, size: 160, elements: !439)
!439 = !{!440, !459, !543, !544}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !438, file: !188, line: 2722, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !192, line: 233, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 231, size: 64, elements: !443)
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !442, file: !192, line: 232, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !197, line: 48, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !197, line: 37, size: 64, elements: !447)
!447 = !{!448, !454}
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !197, line: 38, baseType: !449, size: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !197, line: 38, size: 32, elements: !450)
!450 = !{!451, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !449, file: !197, line: 39, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !449, file: !197, line: 40, baseType: !452, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !197, line: 42, baseType: !455, size: 32, offset: 32)
!455 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !197, line: 42, size: 32, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !455, file: !197, line: 43, baseType: !452, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !455, file: !197, line: 44, baseType: !452, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !438, file: !188, line: 2724, baseType: !460, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !257, line: 245, size: 1280, elements: !462)
!462 = !{!463, !503, !515, !516, !517, !518, !519, !525, !538}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !461, file: !257, line: 247, baseType: !464, size: 384)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !257, line: 57, size: 384, elements: !465)
!465 = !{!466, !477, !479, !480, !481, !490, !491, !492}
!466 = !DIDerivedType(tag: DW_TAG_member, scope: !464, file: !257, line: 60, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !464, file: !257, line: 60, size: 64, elements: !468)
!468 = !{!469, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !467, file: !257, line: 61, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !197, line: 49, baseType: !446)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !467, file: !257, line: 62, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !269, line: 49, size: 64, elements: !473)
!473 = !{!474}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !472, file: !269, line: 50, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 64, elements: !274)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !464, file: !257, line: 68, baseType: !478, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !464, file: !257, line: 71, baseType: !128, size: 8, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !464, file: !257, line: 74, baseType: !128, size: 8, offset: 104)
!481 = !DIDerivedType(tag: DW_TAG_member, scope: !464, file: !257, line: 90, baseType: !482, size: 16, offset: 112)
!482 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !464, file: !257, line: 90, size: 16, elements: !483)
!483 = !{!484, !489}
!484 = !DIDerivedType(tag: DW_TAG_member, scope: !482, file: !257, line: 91, baseType: !485, size: 16)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !257, line: 91, size: 16, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !485, file: !257, line: 96, baseType: !287, size: 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !485, file: !257, line: 97, baseType: !128, size: 8, offset: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !482, file: !257, line: 100, baseType: !239, size: 16)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !464, file: !257, line: 107, baseType: !158, size: 32, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !464, file: !257, line: 127, baseType: !133, size: 32, offset: 160)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !464, file: !257, line: 131, baseType: !493, size: 192, offset: 192)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !192, line: 244, size: 192, elements: !494)
!494 = !{!495, !496, !502}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !493, file: !192, line: 245, baseType: !470, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !493, file: !192, line: 246, baseType: !497, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !192, line: 242, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !493, file: !192, line: 249, baseType: !170, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !461, file: !257, line: 250, baseType: !504, size: 288, offset: 384)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !306, line: 25, size: 288, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !514}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !504, file: !306, line: 26, baseType: !158, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !504, file: !306, line: 27, baseType: !158, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !504, file: !306, line: 28, baseType: !158, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !504, file: !306, line: 29, baseType: !158, size: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !504, file: !306, line: 30, baseType: !158, size: 32, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !504, file: !306, line: 31, baseType: !158, size: 32, offset: 160)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !504, file: !306, line: 32, baseType: !158, size: 32, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !504, file: !306, line: 33, baseType: !158, size: 32, offset: 224)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !504, file: !306, line: 34, baseType: !158, size: 32, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !461, file: !257, line: 253, baseType: !133, size: 32, offset: 672)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !461, file: !257, line: 256, baseType: !441, size: 64, offset: 704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !461, file: !257, line: 279, baseType: !320, size: 256, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !461, file: !257, line: 294, baseType: !111, size: 32, offset: 1024)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !461, file: !257, line: 300, baseType: !520, size: 96, offset: 1056)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !257, line: 149, size: 96, elements: !521)
!521 = !{!522, !523, !524}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !520, file: !257, line: 153, baseType: !22, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !520, file: !257, line: 162, baseType: !216, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !520, file: !257, line: 168, baseType: !216, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !461, file: !257, line: 325, baseType: !526, size: 32, offset: 1152)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !188, line: 5073, size: 160, elements: !528)
!528 = !{!529, !535, !536}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !527, file: !188, line: 5074, baseType: !530, size: 96)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !336, line: 56, size: 96, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !530, file: !336, line: 57, baseType: !339, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !530, file: !336, line: 58, baseType: !133, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !530, file: !336, line: 59, baseType: !216, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !527, file: !188, line: 5075, baseType: !441, size: 64, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !527, file: !188, line: 5076, baseType: !537, offset: 160)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !213, line: 43, elements: !214)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !461, file: !257, line: 343, baseType: !539, size: 64, offset: 1184)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !306, line: 60, size: 64, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !539, file: !306, line: 63, baseType: !158, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !539, file: !306, line: 66, baseType: !158, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !438, file: !188, line: 2727, baseType: !158, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !438, file: !188, line: 2730, baseType: !111, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !429, file: !181, line: 67, baseType: !546, size: 32, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !181, line: 85, size: 96, elements: !551)
!551 = !{!552, !553, !568}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !550, file: !181, line: 91, baseType: !131, size: 8)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !550, file: !181, line: 93, baseType: !554, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !188, line: 4204, size: 320, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !556, file: !188, line: 4206, baseType: !441, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !556, file: !188, line: 4208, baseType: !537, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !556, file: !188, line: 4210, baseType: !216, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !556, file: !188, line: 4212, baseType: !158, size: 32, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !556, file: !188, line: 4214, baseType: !220, size: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !556, file: !188, line: 4216, baseType: !220, size: 32, offset: 160)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !556, file: !188, line: 4218, baseType: !220, size: 32, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !556, file: !188, line: 4220, baseType: !220, size: 32, offset: 224)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !556, file: !188, line: 4222, baseType: !158, size: 32, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !556, file: !188, line: 4227, baseType: !128, size: 8, offset: 288)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !550, file: !181, line: 96, baseType: !569, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !573}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "_k_thread_data_core_thread_id", scope: !421, file: !427, line: 37, type: !576, isLocal: false, isDefinition: true, align: 32)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !188, line: 620, size: 384, elements: !577)
!577 = !{!578, !579, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !576, file: !188, line: 621, baseType: !460, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !576, file: !188, line: 622, baseType: !580, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !369, line: 44, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !371, line: 47, size: 8, elements: !583)
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !582, file: !371, line: 48, baseType: !120, size: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !576, file: !188, line: 623, baseType: !32, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !576, file: !188, line: 624, baseType: !376, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !576, file: !188, line: 625, baseType: !133, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !576, file: !188, line: 626, baseType: !133, size: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !576, file: !188, line: 627, baseType: !133, size: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !576, file: !188, line: 628, baseType: !111, size: 32, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !576, file: !188, line: 629, baseType: !158, size: 32, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !576, file: !188, line: 630, baseType: !386, size: 32, offset: 288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !576, file: !188, line: 631, baseType: !388, size: 32, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !576, file: !188, line: 632, baseType: !118, size: 32, offset: 352)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "core_thread_id", scope: !421, file: !427, line: 37, type: !597, isLocal: false, isDefinition: true)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !257, line: 347, baseType: !460)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "_k_thread_stack_core_thread_id", scope: !421, file: !427, line: 37, type: !601, isLocal: false, isDefinition: true, align: 64)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 8192, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 1024)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "_k_thread_obj_core_thread_id", scope: !421, file: !427, line: 37, type: !461, isLocal: false, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !421, file: !427, line: 13, type: !608, isLocal: true, isDefinition: true)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !411, line: 10, size: 32, elements: !609)
!609 = !{!610, !611, !612}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !608, file: !411, line: 11, baseType: !128, size: 8)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !608, file: !411, line: 12, baseType: !128, size: 8, offset: 8)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !608, file: !411, line: 13, baseType: !239, size: 16, offset: 16)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !421, file: !427, line: 13, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 32, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 1)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_peripheral_sub", scope: !620, file: !625, line: 11, type: !632, isLocal: false, isDefinition: true, align: 32)
!620 = distinct !DICompileUnit(language: DW_LANG_C99, file: !621, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !423, globals: !622, splitDebugInlining: false, nameTableKind: None)
!621 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/uart_bridge/src/peripheral.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/zbus/uart_bridge")
!622 = !{!618, !623, !772, !774, !776, !778, !780, !801, !805, !807, !809, !811, !814, !816, !822, !825, !830}
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "peripheral_sub", scope: !620, file: !625, line: 11, type: !626, isLocal: false, isDefinition: true, align: 32)
!625 = !DIFile(filename: "zephyr/samples/subsys/zbus/uart_bridge/src/peripheral.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !181, line: 85, size: 96, elements: !627)
!627 = !{!628, !629, !663}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !626, file: !181, line: 91, baseType: !131, size: 8)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !626, file: !181, line: 93, baseType: !630, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !188, line: 4204, size: 320, elements: !633)
!633 = !{!634, !653, !655, !656, !657, !658, !659, !660, !661, !662}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !632, file: !188, line: 4206, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !192, line: 233, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 231, size: 64, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !636, file: !192, line: 232, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !197, line: 48, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !197, line: 37, size: 64, elements: !641)
!641 = !{!642, !648}
!642 = !DIDerivedType(tag: DW_TAG_member, scope: !640, file: !197, line: 38, baseType: !643, size: 32)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !640, file: !197, line: 38, size: 32, elements: !644)
!644 = !{!645, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !643, file: !197, line: 39, baseType: !646, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !643, file: !197, line: 40, baseType: !646, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, scope: !640, file: !197, line: 42, baseType: !649, size: 32, offset: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !640, file: !197, line: 42, size: 32, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !649, file: !197, line: 43, baseType: !646, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !649, file: !197, line: 44, baseType: !646, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !632, file: !188, line: 4208, baseType: !654, offset: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !213, line: 43, elements: !214)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !632, file: !188, line: 4210, baseType: !216, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !632, file: !188, line: 4212, baseType: !158, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !632, file: !188, line: 4214, baseType: !220, size: 32, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !632, file: !188, line: 4216, baseType: !220, size: 32, offset: 160)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !632, file: !188, line: 4218, baseType: !220, size: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !632, file: !188, line: 4220, baseType: !220, size: 32, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !632, file: !188, line: 4222, baseType: !158, size: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !632, file: !188, line: 4227, baseType: !128, size: 8, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !626, file: !181, line: 96, baseType: !664, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !181, line: 29, size: 224, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !767}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !670, file: !181, line: 32, baseType: !236, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !670, file: !181, line: 35, baseType: !238, size: 16, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !670, file: !181, line: 40, baseType: !242, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !670, file: !181, line: 45, baseType: !242, size: 32, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !670, file: !181, line: 51, baseType: !245, size: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !670, file: !181, line: 56, baseType: !678, size: 32, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !188, line: 2720, size: 160, elements: !680)
!680 = !{!681, !682, !765, !766}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !679, file: !188, line: 2722, baseType: !635, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !679, file: !188, line: 2724, baseType: !683, size: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !257, line: 245, size: 1280, elements: !685)
!685 = !{!686, !726, !738, !739, !740, !741, !742, !748, !760}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !684, file: !257, line: 247, baseType: !687, size: 384)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !257, line: 57, size: 384, elements: !688)
!688 = !{!689, !700, !702, !703, !704, !713, !714, !715}
!689 = !DIDerivedType(tag: DW_TAG_member, scope: !687, file: !257, line: 60, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !687, file: !257, line: 60, size: 64, elements: !691)
!691 = !{!692, !694}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !690, file: !257, line: 61, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !197, line: 49, baseType: !640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !690, file: !257, line: 62, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !269, line: 49, size: 64, elements: !696)
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !695, file: !269, line: 50, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 64, elements: !274)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !687, file: !257, line: 68, baseType: !701, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !687, file: !257, line: 71, baseType: !128, size: 8, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !687, file: !257, line: 74, baseType: !128, size: 8, offset: 104)
!704 = !DIDerivedType(tag: DW_TAG_member, scope: !687, file: !257, line: 90, baseType: !705, size: 16, offset: 112)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !687, file: !257, line: 90, size: 16, elements: !706)
!706 = !{!707, !712}
!707 = !DIDerivedType(tag: DW_TAG_member, scope: !705, file: !257, line: 91, baseType: !708, size: 16)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !257, line: 91, size: 16, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !708, file: !257, line: 96, baseType: !287, size: 8)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !708, file: !257, line: 97, baseType: !128, size: 8, offset: 8)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !705, file: !257, line: 100, baseType: !239, size: 16)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !687, file: !257, line: 107, baseType: !158, size: 32, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !687, file: !257, line: 127, baseType: !133, size: 32, offset: 160)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !687, file: !257, line: 131, baseType: !716, size: 192, offset: 192)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !192, line: 244, size: 192, elements: !717)
!717 = !{!718, !719, !725}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !716, file: !192, line: 245, baseType: !693, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !716, file: !192, line: 246, baseType: !720, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !192, line: 242, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !716, file: !192, line: 249, baseType: !170, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !684, file: !257, line: 250, baseType: !727, size: 288, offset: 384)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !306, line: 25, size: 288, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !727, file: !306, line: 26, baseType: !158, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !727, file: !306, line: 27, baseType: !158, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !727, file: !306, line: 28, baseType: !158, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !727, file: !306, line: 29, baseType: !158, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !727, file: !306, line: 30, baseType: !158, size: 32, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !727, file: !306, line: 31, baseType: !158, size: 32, offset: 160)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !727, file: !306, line: 32, baseType: !158, size: 32, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !727, file: !306, line: 33, baseType: !158, size: 32, offset: 224)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !727, file: !306, line: 34, baseType: !158, size: 32, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !684, file: !257, line: 253, baseType: !133, size: 32, offset: 672)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !684, file: !257, line: 256, baseType: !635, size: 64, offset: 704)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !684, file: !257, line: 279, baseType: !320, size: 256, offset: 768)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !684, file: !257, line: 294, baseType: !111, size: 32, offset: 1024)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !684, file: !257, line: 300, baseType: !743, size: 96, offset: 1056)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !257, line: 149, size: 96, elements: !744)
!744 = !{!745, !746, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !743, file: !257, line: 153, baseType: !22, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !743, file: !257, line: 162, baseType: !216, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !743, file: !257, line: 168, baseType: !216, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !684, file: !257, line: 325, baseType: !749, size: 32, offset: 1152)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !188, line: 5073, size: 160, elements: !751)
!751 = !{!752, !758, !759}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !750, file: !188, line: 5074, baseType: !753, size: 96)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !336, line: 56, size: 96, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !753, file: !336, line: 57, baseType: !339, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !753, file: !336, line: 58, baseType: !133, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !753, file: !336, line: 59, baseType: !216, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !750, file: !188, line: 5075, baseType: !635, size: 64, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !750, file: !188, line: 5076, baseType: !654, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !684, file: !257, line: 343, baseType: !761, size: 64, offset: 1184)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !306, line: 60, size: 64, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !761, file: !306, line: 63, baseType: !158, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !761, file: !306, line: 66, baseType: !158, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !679, file: !188, line: 2727, baseType: !158, size: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !679, file: !188, line: 2730, baseType: !111, size: 32, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !670, file: !181, line: 67, baseType: !768, size: 32, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "_zbus_mutex_sensor_data_chan", scope: !620, file: !625, line: 16, type: !679, isLocal: true, isDefinition: true, align: 32)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "sensor_data_chan", scope: !620, file: !625, line: 16, type: !669, isLocal: false, isDefinition: true, align: 32)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "_zbus_mutex_start_measurement_chan", scope: !620, file: !625, line: 26, type: !679, isLocal: true, isDefinition: true, align: 32)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "start_measurement_chan", scope: !620, file: !625, line: 26, type: !669, isLocal: false, isDefinition: true, align: 32)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "_k_thread_data_peripheral_thread_id", scope: !620, file: !625, line: 50, type: !782, isLocal: false, isDefinition: true, align: 32)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !188, line: 620, size: 384, elements: !783)
!783 = !{!784, !785, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !782, file: !188, line: 621, baseType: !683, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !782, file: !188, line: 622, baseType: !786, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !369, line: 44, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !371, line: 47, size: 8, elements: !789)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !788, file: !371, line: 48, baseType: !120, size: 8)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !782, file: !188, line: 623, baseType: !32, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !782, file: !188, line: 624, baseType: !376, size: 32, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !782, file: !188, line: 625, baseType: !133, size: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !782, file: !188, line: 626, baseType: !133, size: 32, offset: 160)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !782, file: !188, line: 627, baseType: !133, size: 32, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !782, file: !188, line: 628, baseType: !111, size: 32, offset: 224)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !782, file: !188, line: 629, baseType: !158, size: 32, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !782, file: !188, line: 630, baseType: !386, size: 32, offset: 288)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !782, file: !188, line: 631, baseType: !388, size: 32, offset: 320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !782, file: !188, line: 632, baseType: !118, size: 32, offset: 352)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "peripheral_thread_id", scope: !620, file: !625, line: 50, type: !803, isLocal: false, isDefinition: true)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !257, line: 347, baseType: !683)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_peripheral_sub", scope: !620, file: !625, line: 11, type: !320, isLocal: true, isDefinition: true, align: 32)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "sensor_data_from_bridge", scope: !620, file: !625, line: 15, type: !131, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "start_measurement_from_bridge", scope: !620, file: !625, line: 25, type: !131, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "_k_thread_stack_peripheral_thread_id", scope: !620, file: !625, line: 50, type: !813, isLocal: false, isDefinition: true, align: 64)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 8192, elements: !602)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "_k_thread_obj_peripheral_thread_id", scope: !620, file: !625, line: 50, type: !684, isLocal: false, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "_zbus_message_sensor_data_chan", scope: !620, file: !625, line: 16, type: !818, isLocal: true, isDefinition: true)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_data_msg", file: !411, line: 16, size: 64, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !818, file: !411, line: 17, baseType: !111, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !818, file: !411, line: 18, baseType: !111, size: 32, offset: 32)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "_zbus_observers_sensor_data_chan", scope: !620, file: !625, line: 16, type: !824, isLocal: true, isDefinition: true)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 64, elements: !274)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "_zbus_message_start_measurement_chan", scope: !620, file: !625, line: 26, type: !827, isLocal: true, isDefinition: true)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "action_msg", file: !411, line: 26, size: 8, elements: !828)
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !827, file: !411, line: 27, baseType: !131, size: 8)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "_zbus_observers_start_measurement_chan", scope: !620, file: !625, line: 26, type: !832, isLocal: true, isDefinition: true)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 96, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 3)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !837, file: !851, line: 18, type: !852, isLocal: false, isDefinition: true)
!837 = distinct !DICompileUnit(language: DW_LANG_C99, file: !838, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !839, globals: !850, splitDebugInlining: false, nameTableKind: None)
!838 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/zbus/uart_bridge")
!839 = !{!22, !133, !24, !840, !842, !844, !216, !111, !845, !846, !848, !849, !220, !173, !239, !118}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!850 = !{!835}
!851 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !854, line: 16, size: 64, elements: !855)
!854 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !854, line: 17, baseType: !118, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !853, file: !854, line: 18, baseType: !128, size: 8, offset: 32)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "_char_out", scope: !860, file: !864, line: 54, type: !865, isLocal: false, isDefinition: true)
!860 = distinct !DICompileUnit(language: DW_LANG_C99, file: !861, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !862, globals: !863, splitDebugInlining: false, nameTableKind: None)
!861 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/zbus/uart_bridge")
!862 = !{!133, !111}
!863 = !{!858}
!864 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = !DISubroutineType(types: !867)
!867 = !{!111, !111}
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !870, file: !925, line: 35, type: !941, isLocal: false, isDefinition: true)
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !872, globals: !922, splitDebugInlining: false, nameTableKind: None)
!871 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/zbus/uart_bridge")
!872 = !{!133, !111, !873, !158, !884}
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !875, file: !874, line: 167, baseType: !883)
!874 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!875 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !874, file: !874, line: 134, type: !876, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !870, retainedNodes: !878)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !158}
!878 = !{!879, !880, !882}
!879 = !DILocalVariable(name: "time_us", arg: 1, scope: !875, file: !874, line: 134, type: !158)
!880 = !DILocalVariable(name: "delay_cycles", scope: !875, file: !874, line: 168, type: !881)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!882 = !DILocalVariable(name: "cycles", scope: !875, file: !874, line: 171, type: !158)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !886, line: 1928, baseType: !887)
!886 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !886, line: 1909, size: 11360, elements: !888)
!888 = !{!889, !895, !896, !897, !898, !902, !903, !904, !905, !907, !908, !912, !913, !914, !915, !916, !920, !921}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !887, file: !886, line: 1910, baseType: !890, size: 8192)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 8192, elements: !893)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!893 = !{!894}
!894 = !DISubrange(count: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !887, file: !886, line: 1911, baseType: !891, size: 32, offset: 8192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !887, file: !886, line: 1912, baseType: !891, size: 32, offset: 8224)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !887, file: !886, line: 1913, baseType: !891, size: 32, offset: 8256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !887, file: !886, line: 1914, baseType: !899, size: 1984, offset: 8288)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 1984, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 62)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !887, file: !886, line: 1915, baseType: !892, size: 32, offset: 10272)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !887, file: !886, line: 1916, baseType: !891, size: 32, offset: 10304)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !887, file: !886, line: 1917, baseType: !892, size: 32, offset: 10336)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !887, file: !886, line: 1918, baseType: !906, size: 96, offset: 10368)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 96, elements: !833)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !887, file: !886, line: 1919, baseType: !892, size: 32, offset: 10464)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !887, file: !886, line: 1920, baseType: !909, size: 256, offset: 10496)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 256, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 8)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !887, file: !886, line: 1921, baseType: !892, size: 32, offset: 10752)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !887, file: !886, line: 1922, baseType: !891, size: 32, offset: 10784)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !887, file: !886, line: 1923, baseType: !892, size: 32, offset: 10816)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !887, file: !886, line: 1924, baseType: !892, size: 32, offset: 10848)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !887, file: !886, line: 1925, baseType: !917, size: 416, offset: 10880)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 416, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 13)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !887, file: !886, line: 1926, baseType: !892, size: 32, offset: 11296)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !887, file: !886, line: 1927, baseType: !892, size: 32, offset: 11328)
!922 = !{!868, !923, !938}
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !870, file: !925, line: 65, type: !926, isLocal: true, isDefinition: true, align: 32)
!925 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !928, line: 51, size: 64, elements: !929)
!928 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = !{!930, !937}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !927, file: !928, line: 60, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DISubroutineType(types: !933)
!933 = !{!111, !934}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !928, line: 48, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !927, file: !928, line: 65, baseType: !934, size: 32, offset: 32)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !875, file: !874, line: 161, type: !940, isLocal: true, isDefinition: true, align: 128)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 48, elements: !833)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !854, line: 16, size: 64, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !854, line: 17, baseType: !118, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !942, file: !854, line: 18, baseType: !128, size: 8, offset: 32)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !948, file: !982, line: 22, type: !1010, isLocal: false, isDefinition: true)
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !950, retainedTypes: !962, globals: !979, splitDebugInlining: false, nameTableKind: None)
!949 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_ns/subsys/zbus/uart_bridge")
!950 = !{!951, !30}
!951 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !952, line: 27, baseType: !32, size: 32, elements: !953)
!952 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961}
!954 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!955 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!956 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!957 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!958 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!959 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!960 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!961 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!962 = !{!133, !168, !111, !24, !963, !220, !158, !174}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !965, line: 54, size: 96, elements: !966)
!965 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!966 = !{!967, !974, !978}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !964, file: !965, line: 55, baseType: !968, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !969, line: 33, baseType: !970)
!969 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !969, line: 29, size: 32, elements: !971)
!971 = !{!972}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !970, file: !969, line: 30, baseType: !973, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !964, file: !965, line: 60, baseType: !975, size: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{null, !951}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !964, file: !965, line: 65, baseType: !975, size: 32, offset: 64)
!979 = !{!946, !980, !986, !989, !991, !1000, !1002}
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !948, file: !982, line: 27, type: !983, isLocal: true, isDefinition: true)
!982 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 32, elements: !616)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !985, line: 22, baseType: !847)
!985 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !948, file: !982, line: 44, type: !988, isLocal: true, isDefinition: true)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !213, line: 43, elements: !214)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !948, file: !982, line: 49, type: !988, isLocal: true, isDefinition: true)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !948, file: !982, line: 36, type: !993, isLocal: true, isDefinition: true)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 128, elements: !616)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !952, line: 114, size: 128, elements: !995)
!995 = !{!996, !997, !998, !999}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !994, file: !952, line: 115, baseType: !951, size: 32)
