; ModuleID = './build/App-Template/TEMPLATE.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct.QueueDefinition = type { i8*, i8*, %union.anon.53, %struct.xLIST, %struct.xLIST, i32, i32, i32, i8, i8 }
%union.anon.53 = type { %struct.QueuePointers }
%struct.QueuePointers = type { i8*, i8* }
%struct.xLIST = type { i32, %struct.xLIST_ITEM*, %struct.xMINI_LIST_ITEM }
%struct.xLIST_ITEM = type { i32, %struct.xLIST_ITEM*, %struct.xLIST_ITEM*, i8*, %struct.xLIST* }
%struct.xMINI_LIST_ITEM = type { i32, %struct.xLIST_ITEM*, %struct.xLIST_ITEM* }
%struct.tskTaskControlBlock = type { i32*, %struct.xLIST_ITEM, %struct.xLIST_ITEM, i32, i32*, [16 x i8], [5 x i8*], [3 x i32], [3 x i8] }
%struct.alarm_pool = type { %struct.pheap*, i32*, %struct.alarm_pool_entry*, i8*, i32, i8 }
%struct.pheap = type { %struct.pheap_node*, i1 (i8*, i8, i8)*, i8*, i8, i8, i8, i8 }
%struct.pheap_node = type { i8, i8, i8 }
%struct.alarm_pool_entry = type { i64, i64 (i32, i8*)*, i8* }
%struct.lock_core = type { i32* }
%struct.irq_handler_chain_slot = type { i16, i16, i16, %union.anon, void ()* }
%union.anon = type { i16 }
%struct._binary_info_id_and_int = type { %struct._binary_info_core, i32, i32 }
%struct._binary_info_core = type { i16, i16 }
%struct._binary_info_id_and_string = type { %struct._binary_info_core, i32, i8* }
%struct.mutex = type { %struct.lock_core, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "queue", scope: !2, file: !84, line: 16, type: !94, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !81, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/App-Template/main.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "eac5672681ba715021654ab64a02b91a")
!4 = !{!5, !8, !14, !15, !18}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "BaseType_t", file: !6, line: 57, baseType: !7)
!6 = !DIFile(filename: "FreeRTOS-Kernel/portable/GCC/ARM_CM0/portmacro.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "56517bdf40c35f66951dc5c00955e58c")
!7 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "TickType_t", file: !6, line: 64, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !10, line: 48, baseType: !11)
!10 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ab914e287601b2385e57880e6599aa6b")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !12, line: 79, baseType: !13)
!12 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f7024d0682a918b41f94e8be9cd90461")
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !10, line: 24, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !12, line: 43, baseType: !17)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "sio_hw_t", file: !20, line: 172, baseType: !21)
!20 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/sio.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "311333c0f83326329e34b8d1d1db9839")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 24, size: 2048, elements: !22)
!22 = !{!23, !28, !29, !30, !31, !33, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "cpuid", scope: !21, file: !20, line: 27, baseType: !24, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_ro_32", file: !25, line: 64, baseType: !26)
!25 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_base/include/hardware/address_mapped.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "23df40c1982dcfc0805a52a9e7e0c790")
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !9)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_in", scope: !21, file: !20, line: 32, baseType: !24, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_in", scope: !21, file: !20, line: 37, baseType: !24, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !21, file: !20, line: 39, baseType: !9, size: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_out", scope: !21, file: !20, line: 44, baseType: !32, size: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_rw_32", file: !25, line: 63, baseType: !27)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_set", scope: !21, file: !20, line: 49, baseType: !34, size: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_wo_32", file: !25, line: 65, baseType: !27)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_clr", scope: !21, file: !20, line: 54, baseType: !34, size: 32, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_togl", scope: !21, file: !20, line: 59, baseType: !34, size: 32, offset: 224)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_oe", scope: !21, file: !20, line: 64, baseType: !32, size: 32, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_oe_set", scope: !21, file: !20, line: 69, baseType: !34, size: 32, offset: 288)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_oe_clr", scope: !21, file: !20, line: 74, baseType: !34, size: 32, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_oe_togl", scope: !21, file: !20, line: 79, baseType: !34, size: 32, offset: 352)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_out", scope: !21, file: !20, line: 84, baseType: !32, size: 32, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_set", scope: !21, file: !20, line: 89, baseType: !34, size: 32, offset: 416)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_clr", scope: !21, file: !20, line: 94, baseType: !34, size: 32, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_togl", scope: !21, file: !20, line: 99, baseType: !34, size: 32, offset: 480)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_oe", scope: !21, file: !20, line: 104, baseType: !32, size: 32, offset: 512)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_oe_set", scope: !21, file: !20, line: 109, baseType: !34, size: 32, offset: 544)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_oe_clr", scope: !21, file: !20, line: 114, baseType: !34, size: 32, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_oe_togl", scope: !21, file: !20, line: 119, baseType: !34, size: 32, offset: 608)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_st", scope: !21, file: !20, line: 127, baseType: !32, size: 32, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_wr", scope: !21, file: !20, line: 131, baseType: !34, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_rd", scope: !21, file: !20, line: 135, baseType: !24, size: 32, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "spinlock_st", scope: !21, file: !20, line: 139, baseType: !24, size: 32, offset: 736)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "div_udividend", scope: !21, file: !20, line: 143, baseType: !32, size: 32, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "div_udivisor", scope: !21, file: !20, line: 147, baseType: !32, size: 32, offset: 800)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "div_sdividend", scope: !21, file: !20, line: 151, baseType: !32, size: 32, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "div_sdivisor", scope: !21, file: !20, line: 155, baseType: !32, size: 32, offset: 864)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "div_quotient", scope: !21, file: !20, line: 159, baseType: !32, size: 32, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "div_remainder", scope: !21, file: !20, line: 163, baseType: !32, size: 32, offset: 928)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "div_csr", scope: !21, file: !20, line: 169, baseType: !24, size: 32, offset: 960)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !21, file: !20, line: 170, baseType: !9, size: 32, offset: 992)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !21, file: !20, line: 171, baseType: !62, size: 1024, offset: 1024)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 1024, elements: !69)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "interp_hw_t", file: !64, line: 76, baseType: !65)
!64 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/interp.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "f35e26f15239443cfd6f80984c292227")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 23, size: 512, elements: !66)
!66 = !{!67, !71, !75, !77, !78, !79, !80}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "accum", scope: !65, file: !64, line: 28, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 2)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !65, file: !64, line: 34, baseType: !72, size: 96, offset: 64)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pop", scope: !65, file: !64, line: 40, baseType: !76, size: 96, offset: 160)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 96, elements: !73)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "peek", scope: !65, file: !64, line: 46, baseType: !76, size: 96, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !65, file: !64, line: 64, baseType: !68, size: 64, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "add_raw", scope: !65, file: !64, line: 71, baseType: !68, size: 64, offset: 416)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "base01", scope: !65, file: !64, line: 75, baseType: !34, size: 32, offset: 480)
!81 = !{!0, !82, !86, !92}
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "ms_delay", scope: !2, file: !84, line: 19, type: !85, isLocal: false, isDefinition: true)
!84 = !DIFile(filename: "App-Template/main.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "eac5672681ba715021654ab64a02b91a")
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "gpio_task_handle", scope: !2, file: !84, line: 22, type: !88, isLocal: false, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskHandle_t", file: !89, line: 87, baseType: !90)
!89 = !DIFile(filename: "FreeRTOS-Kernel/include/task.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "810a81e7009fae145a1bc4ef8909086e")
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "tskTaskControlBlock", file: !89, line: 86, flags: DIFlagFwdDecl)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "pico_task_handle", scope: !2, file: !84, line: 23, type: !88, isLocal: false, isDefinition: true)
!94 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueueHandle_t", file: !96, line: 51, baseType: !97)
!96 = !DIFile(filename: "FreeRTOS-Kernel/include/queue.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "0bd28c8c8ce17678475d9e51d93be88f")
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueDefinition", file: !96, line: 50, flags: DIFlagFwdDecl)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "_callbacks", scope: !101, file: !222, line: 17, type: !223, isLocal: true, isDefinition: true)
!101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !102, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !103, retainedTypes: !128, globals: !221, splitDebugInlining: false, nameTableKind: None)
!102 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/hardware_gpio/gpio.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "0c38d2dc9c3bce4e7fa4c65f6a51fa00")
!103 = !{!104, !118, !122}
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_function", file: !105, line: 89, baseType: !13, size: 32, elements: !106)
!105 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_gpio/include/hardware/gpio.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "67792affb335e1878a065eea3f3d8d04")
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!107 = !DIEnumerator(name: "GPIO_FUNC_XIP", value: 0)
!108 = !DIEnumerator(name: "GPIO_FUNC_SPI", value: 1)
!109 = !DIEnumerator(name: "GPIO_FUNC_UART", value: 2)
!110 = !DIEnumerator(name: "GPIO_FUNC_I2C", value: 3)
!111 = !DIEnumerator(name: "GPIO_FUNC_PWM", value: 4)
!112 = !DIEnumerator(name: "GPIO_FUNC_SIO", value: 5)
!113 = !DIEnumerator(name: "GPIO_FUNC_PIO0", value: 6)
!114 = !DIEnumerator(name: "GPIO_FUNC_PIO1", value: 7)
!115 = !DIEnumerator(name: "GPIO_FUNC_GPCK", value: 8)
!116 = !DIEnumerator(name: "GPIO_FUNC_USB", value: 9)
!117 = !DIEnumerator(name: "GPIO_FUNC_NULL", value: 31)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_slew_rate", file: !105, line: 151, baseType: !13, size: 32, elements: !119)
!119 = !{!120, !121}
!120 = !DIEnumerator(name: "GPIO_SLEW_RATE_SLOW", value: 0)
!121 = !DIEnumerator(name: "GPIO_SLEW_RATE_FAST", value: 1)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_drive_strength", file: !105, line: 162, baseType: !13, size: 32, elements: !123)
!123 = !{!124, !125, !126, !127}
!124 = !DIEnumerator(name: "GPIO_DRIVE_STRENGTH_2MA", value: 0)
!125 = !DIEnumerator(name: "GPIO_DRIVE_STRENGTH_4MA", value: 1)
!126 = !DIEnumerator(name: "GPIO_DRIVE_STRENGTH_8MA", value: 2)
!127 = !DIEnumerator(name: "GPIO_DRIVE_STRENGTH_12MA", value: 3)
!128 = !{!129, !139, !104, !165, !118, !122, !167, !215, !14, !216, !218, !220}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "padsbank0_hw_t", file: !131, line: 41, baseType: !132)
!131 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/padsbank0.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "0d132b381309ffc5de1b370f07ecb120")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 23, size: 992, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "voltage_select", scope: !132, file: !131, line: 27, baseType: !32, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !132, file: !131, line: 40, baseType: !136, size: 960, offset: 32)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 960, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 30)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobank0_hw_t", file: !141, line: 209, baseType: !142)
!141 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/iobank0.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "42469313a1e5eeb28c0cc4633c098424")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 163, size: 3200, elements: !143)
!143 = !{!144, !151, !155, !163, !164}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !142, file: !141, line: 164, baseType: !145, size: 1920)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 1920, elements: !137)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobank0_status_ctrl_hw_t", file: !141, line: 44, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 23, size: 64, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !147, file: !141, line: 34, baseType: !24, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !147, file: !141, line: 43, baseType: !32, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "intr", scope: !142, file: !141, line: 202, baseType: !152, size: 128, offset: 1920)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 4)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "proc0_irq_ctrl", scope: !142, file: !141, line: 204, baseType: !156, size: 384, offset: 2048)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_irq_ctrl_hw_t", file: !141, line: 160, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 46, size: 384, elements: !158)
!158 = !{!159, !160, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "inte", scope: !157, file: !141, line: 83, baseType: !152, size: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intf", scope: !157, file: !141, line: 121, baseType: !152, size: 128, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ints", scope: !157, file: !141, line: 159, baseType: !162, size: 128, offset: 256)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, elements: !153)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "proc1_irq_ctrl", scope: !142, file: !141, line: 206, baseType: !156, size: 384, offset: 2432)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "dormant_wake_irq_ctrl", scope: !142, file: !141, line: 208, baseType: !156, size: 384, offset: 2816)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !166, line: 18, baseType: !13)
!166 = !DIFile(filename: "pico-sdk/src/common/pico_base/include/pico/types.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "c040b50d59f839fd3dfa4120f48908fb")
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "sio_hw_t", file: !20, line: 172, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 24, size: 2048, elements: !170)
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cpuid", scope: !169, file: !20, line: 27, baseType: !24, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_in", scope: !169, file: !20, line: 32, baseType: !24, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_in", scope: !169, file: !20, line: 37, baseType: !24, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_pad0", scope: !169, file: !20, line: 39, baseType: !9, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_out", scope: !169, file: !20, line: 44, baseType: !32, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_set", scope: !169, file: !20, line: 49, baseType: !34, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_clr", scope: !169, file: !20, line: 54, baseType: !34, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_togl", scope: !169, file: !20, line: 59, baseType: !34, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_oe", scope: !169, file: !20, line: 64, baseType: !32, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_oe_set", scope: !169, file: !20, line: 69, baseType: !34, size: 32, offset: 288)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_oe_clr", scope: !169, file: !20, line: 74, baseType: !34, size: 32, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_oe_togl", scope: !169, file: !20, line: 79, baseType: !34, size: 32, offset: 352)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_out", scope: !169, file: !20, line: 84, baseType: !32, size: 32, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_set", scope: !169, file: !20, line: 89, baseType: !34, size: 32, offset: 416)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_clr", scope: !169, file: !20, line: 94, baseType: !34, size: 32, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_togl", scope: !169, file: !20, line: 99, baseType: !34, size: 32, offset: 480)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_oe", scope: !169, file: !20, line: 104, baseType: !32, size: 32, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_oe_set", scope: !169, file: !20, line: 109, baseType: !34, size: 32, offset: 544)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_oe_clr", scope: !169, file: !20, line: 114, baseType: !34, size: 32, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_hi_oe_togl", scope: !169, file: !20, line: 119, baseType: !34, size: 32, offset: 608)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_st", scope: !169, file: !20, line: 127, baseType: !32, size: 32, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_wr", scope: !169, file: !20, line: 131, baseType: !34, size: 32, offset: 672)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_rd", scope: !169, file: !20, line: 135, baseType: !24, size: 32, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "spinlock_st", scope: !169, file: !20, line: 139, baseType: !24, size: 32, offset: 736)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "div_udividend", scope: !169, file: !20, line: 143, baseType: !32, size: 32, offset: 768)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "div_udivisor", scope: !169, file: !20, line: 147, baseType: !32, size: 32, offset: 800)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "div_sdividend", scope: !169, file: !20, line: 151, baseType: !32, size: 32, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "div_sdivisor", scope: !169, file: !20, line: 155, baseType: !32, size: 32, offset: 864)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "div_quotient", scope: !169, file: !20, line: 159, baseType: !32, size: 32, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "div_remainder", scope: !169, file: !20, line: 163, baseType: !32, size: 32, offset: 928)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "div_csr", scope: !169, file: !20, line: 169, baseType: !24, size: 32, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !169, file: !20, line: 170, baseType: !9, size: 32, offset: 992)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !169, file: !20, line: 171, baseType: !204, size: 1024, offset: 1024)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 1024, elements: !69)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "interp_hw_t", file: !64, line: 76, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 23, size: 512, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213, !214}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "accum", scope: !206, file: !64, line: 28, baseType: !68, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !206, file: !64, line: 34, baseType: !72, size: 96, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pop", scope: !206, file: !64, line: 40, baseType: !76, size: 96, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "peek", scope: !206, file: !64, line: 46, baseType: !76, size: 96, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !206, file: !64, line: 64, baseType: !68, size: 64, offset: 352)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "add_raw", scope: !206, file: !64, line: 71, baseType: !68, size: 64, offset: 416)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "base01", scope: !206, file: !64, line: 75, baseType: !34, size: 32, offset: 480)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !10, line: 82, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !12, line: 232, baseType: !13)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!221 = !{!99}
!222 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_gpio/gpio.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "0c38d2dc9c3bce4e7fa4c65f6a51fa00")
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 64, elements: !69)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_irq_callback_t", file: !105, line: 135, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !165, !9}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "striped_spin_lock_num", scope: !230, file: !240, line: 11, type: !15, isLocal: true, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !232, globals: !237, splitDebugInlining: false, nameTableKind: None)
!231 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/hardware_sync/sync.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "07d39cb4471a4e7f8ec68f47665ef0d6")
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "spin_lock_t", file: !236, line: 56, baseType: !27)
!236 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_sync/include/hardware/sync.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "64570d92ffb7fb4390b74edb77f06ab7")
!237 = !{!238, !228}
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "claimed", scope: !230, file: !240, line: 12, type: !9, isLocal: true, isDefinition: true)
!240 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_sync/sync.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "07d39cb4471a4e7f8ec68f47665ef0d6")
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "nil_time", scope: !243, file: !248, line: 16, type: !342, isLocal: false, isDefinition: true)
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !245, globals: !339, splitDebugInlining: false, nameTableKind: None)
!244 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/common/pico_time/time.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "08073a775f4f80c32e99c735fdba09a7")
!245 = !{!246, !279, !233, !285, !263, !15, !165, !14, !234, !297, !305, !294, !9, !320}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "alarm_pool_t", file: !248, line: 34, baseType: !249)
!248 = !DIFile(filename: "pico-sdk/src/common/pico_time/time.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "08073a775f4f80c32e99c735fdba09a7")
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alarm_pool", file: !248, line: 25, size: 192, elements: !250)
!250 = !{!251, !277, !278, !302, !303, !304}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !249, file: !248, line: 26, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "pheap_t", file: !254, line: 71, baseType: !255)
!254 = !DIFile(filename: "pico-sdk/src/common/pico_util/include/pico/util/pheap.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "753855a08f34d7dbf20f4bb5e92f07a6")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pheap", file: !254, line: 62, size: 128, elements: !256)
!256 = !{!257, !266, !272, !273, !274, !275, !276}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !255, file: !254, line: 63, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "pheap_node_t", file: !254, line: 53, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pheap_node", file: !254, line: 51, size: 24, elements: !261)
!261 = !{!262, !264, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !260, file: !254, line: 52, baseType: !263, size: 8)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "pheap_node_id_t", file: !254, line: 44, baseType: !15)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !260, file: !254, line: 52, baseType: !263, size: 8, offset: 8)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !260, file: !254, line: 52, baseType: !263, size: 8, offset: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !255, file: !254, line: 64, baseType: !267, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "pheap_comparator", file: !254, line: 60, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !14, !263, !263}
!271 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !255, file: !254, line: 65, baseType: !14, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "max_nodes", scope: !255, file: !254, line: 66, baseType: !263, size: 8, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "root_id", scope: !255, file: !254, line: 67, baseType: !263, size: 8, offset: 104)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "free_head_id", scope: !255, file: !254, line: 69, baseType: !263, size: 8, offset: 112)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "free_tail_id", scope: !255, file: !254, line: 70, baseType: !263, size: 8, offset: 120)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !249, file: !248, line: 27, baseType: !234, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !249, file: !248, line: 28, baseType: !279, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "alarm_pool_entry_t", file: !248, line: 23, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alarm_pool_entry", file: !248, line: 19, size: 128, elements: !282)
!282 = !{!283, !288, !301}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !281, file: !248, line: 20, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "absolute_time_t", file: !166, line: 31, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !10, line: 60, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !12, line: 105, baseType: !287)
!287 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !281, file: !248, line: 21, baseType: !289, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "alarm_callback_t", file: !290, line: 357, baseType: !291)
!290 = !DIFile(filename: "pico-sdk/src/common/pico_time/include/pico/time.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "9ca22bdc6e77a122e8cb9902a31fb9f9")
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{!294, !297, !14}
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !10, line: 56, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !12, line: 103, baseType: !296)
!296 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "alarm_id_t", file: !290, line: 346, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !10, line: 44, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !12, line: 77, baseType: !300)
!300 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !281, file: !248, line: 22, baseType: !14, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "entry_ids_high", scope: !249, file: !248, line: 31, baseType: !233, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "alarm_in_progress", scope: !249, file: !248, line: 32, baseType: !297, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "hardware_alarm_num", scope: !249, file: !248, line: 33, baseType: !15, size: 8, offset: 160)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "repeating_timer_t", file: !290, line: 604, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "repeating_timer", file: !290, line: 619, size: 192, elements: !308)
!308 = !{!309, !310, !313, !314, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "delay_us", scope: !307, file: !290, line: 620, baseType: !294, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !307, file: !290, line: 621, baseType: !311, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "alarm_pool_t", file: !290, line: 359, baseType: !249)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "alarm_id", scope: !307, file: !290, line: 622, baseType: !297, size: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !307, file: !290, line: 623, baseType: !315, size: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "repeating_timer_callback_t", file: !290, line: 612, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DISubroutineType(types: !318)
!318 = !{!271, !305}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !307, file: !290, line: 624, baseType: !14, size: 32, offset: 160)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_hw_t", file: !322, line: 101, baseType: !323)
!322 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/timer.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "9f91409dd800fd1ae51e50e988a4d473")
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !322, line: 23, size: 544, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "timehw", scope: !323, file: !322, line: 26, baseType: !34, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "timelw", scope: !323, file: !322, line: 30, baseType: !34, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "timehr", scope: !323, file: !322, line: 34, baseType: !24, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "timelr", scope: !323, file: !322, line: 38, baseType: !24, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "alarm", scope: !323, file: !322, line: 44, baseType: !152, size: 128, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "armed", scope: !323, file: !322, line: 49, baseType: !32, size: 32, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "timerawh", scope: !323, file: !322, line: 53, baseType: !24, size: 32, offset: 288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "timerawl", scope: !323, file: !322, line: 57, baseType: !24, size: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dbgpause", scope: !323, file: !322, line: 63, baseType: !32, size: 32, offset: 352)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !323, file: !322, line: 68, baseType: !32, size: 32, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "intr", scope: !323, file: !322, line: 76, baseType: !32, size: 32, offset: 416)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "inte", scope: !323, file: !322, line: 84, baseType: !32, size: 32, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "intf", scope: !323, file: !322, line: 92, baseType: !32, size: 32, offset: 480)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ints", scope: !323, file: !322, line: 100, baseType: !24, size: 32, offset: 512)
!339 = !{!241, !340, !343, !350, !353, !355, !357, !362, !365}
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "at_the_end_of_time", scope: !243, file: !248, line: 17, type: !342, isLocal: false, isDefinition: true)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "sleep_notifier", scope: !243, file: !248, line: 41, type: !345, isLocal: true, isDefinition: true)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "lock_core_t", file: !346, line: 61, baseType: !347)
!346 = !DIFile(filename: "pico-sdk/src/common/pico_sync/include/pico/lock_core.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "e4d53c753199fbef6fddd9636ac4d652")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_core", file: !346, line: 53, size: 32, elements: !348)
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "spin_lock", scope: !347, file: !346, line: 55, baseType: !234, size: 32)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "pools", scope: !243, file: !248, line: 54, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 128, elements: !153)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "default_alarm_pool", scope: !243, file: !248, line: 43, type: !247, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "default_alarm_pool_heap", scope: !243, file: !248, line: 38, type: !253, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "default_alarm_pool_heap_nodes", scope: !243, file: !248, line: 38, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 384, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 16)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "default_alarm_pool_entries", scope: !243, file: !248, line: 39, type: !364, isLocal: true, isDefinition: true)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 2048, elements: !360)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "default_alarm_pool_entry_ids_high", scope: !243, file: !248, line: 40, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 128, elements: !360)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "claimed", scope: !370, file: !395, line: 19, type: !15, isLocal: true, isDefinition: true)
!370 = distinct !DICompileUnit(language: DW_LANG_C99, file: !371, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !372, globals: !392, splitDebugInlining: false, nameTableKind: None)
!371 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/hardware_timer/timer.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "55e97beb171d0ffca667ec9e6a9f8f87")
!372 = !{!373, !285, !298, !9, !15, !234, !215, !14, !216, !218, !391}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_hw_t", file: !322, line: 101, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !322, line: 23, size: 544, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "timehw", scope: !375, file: !322, line: 26, baseType: !34, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "timelw", scope: !375, file: !322, line: 30, baseType: !34, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "timehr", scope: !375, file: !322, line: 34, baseType: !24, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "timelr", scope: !375, file: !322, line: 38, baseType: !24, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "alarm", scope: !375, file: !322, line: 44, baseType: !152, size: 128, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "armed", scope: !375, file: !322, line: 49, baseType: !32, size: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "timerawh", scope: !375, file: !322, line: 53, baseType: !24, size: 32, offset: 288)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "timerawl", scope: !375, file: !322, line: 57, baseType: !24, size: 32, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dbgpause", scope: !375, file: !322, line: 63, baseType: !32, size: 32, offset: 352)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !375, file: !322, line: 68, baseType: !32, size: 32, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "intr", scope: !375, file: !322, line: 76, baseType: !32, size: 32, offset: 416)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "inte", scope: !375, file: !322, line: 84, baseType: !32, size: 32, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "intf", scope: !375, file: !322, line: 92, baseType: !32, size: 32, offset: 480)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ints", scope: !375, file: !322, line: 100, baseType: !24, size: 32, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!392 = !{!393, !402, !405, !368}
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "alarm_callbacks", scope: !370, file: !395, line: 14, type: !396, isLocal: true, isDefinition: true)
!395 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_timer/timer.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "55e97beb171d0ffca667ec9e6a9f8f87")
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 128, elements: !153)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "hardware_alarm_callback_t", file: !398, line: 127, baseType: !399)
!398 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_timer/include/hardware/timer.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "f590dd7bd2d6f5785bcd1a11f6826be9")
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !165}
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "target_hi", scope: !370, file: !395, line: 15, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 128, elements: !153)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "timer_callbacks_pending", scope: !370, file: !395, line: 16, type: !15, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "ram_vector_table", scope: !409, file: !473, line: 37, type: !480, isLocal: false, isDefinition: true)
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !411, globals: !469, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/pico_runtime/runtime.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "3eeea37c13078707f8f66c632df3a822")
!411 = !{!412, !216, !165, !422, !14, !428, !443, !220, !449, !459, !461, !215, !218}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpu_hw_t", file: !414, line: 57, baseType: !415)
!414 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/mpu.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "34a969857bc73ebc0b4a6fc2d5e0cf37")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 23, size: 160, elements: !416)
!416 = !{!417, !418, !419, !420, !421}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !415, file: !414, line: 29, baseType: !24, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !415, file: !414, line: 36, baseType: !32, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rnr", scope: !415, file: !414, line: 41, baseType: !32, size: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !415, file: !414, line: 48, baseType: !32, size: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !415, file: !414, line: 56, baseType: !32, size: 32, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "padsbank0_hw_t", file: !131, line: 41, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 23, size: 992, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "voltage_select", scope: !424, file: !131, line: 27, baseType: !32, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !424, file: !131, line: 40, baseType: !136, size: 960, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "recursive_mutex_t", file: !430, line: 54, baseType: !431)
!430 = !DIFile(filename: "pico-sdk/src/common/pico_sync/include/pico/mutex.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "2190b67bc7d1ade9bb268f9cc84cc126")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 47, size: 64, align: 32, elements: !432)
!432 = !{!433, !438, !442}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !431, file: !430, line: 48, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "lock_core_t", file: !346, line: 61, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_core", file: !346, line: 53, size: 32, elements: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "spin_lock", scope: !435, file: !346, line: 55, baseType: !234, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !431, file: !430, line: 49, baseType: !439, size: 8, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !10, line: 20, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !12, line: 41, baseType: !441)
!441 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "enter_count", scope: !431, file: !430, line: 50, baseType: !15, size: 8, offset: 40)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "mutex_t", file: !430, line: 63, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !430, line: 60, size: 64, align: 32, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !445, file: !430, line: 61, baseType: !434, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !445, file: !430, line: 62, baseType: !439, size: 8, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "armv6m_scb_t", file: !451, line: 65, baseType: !452)
!451 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/scb.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "3cb26afe9df958d622e43759110b0a79")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 23, size: 160, elements: !453)
!453 = !{!454, !455, !456, !457, !458}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cpuid", scope: !452, file: !451, line: 31, baseType: !24, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "icsr", scope: !452, file: !451, line: 44, baseType: !32, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vtor", scope: !452, file: !451, line: 49, baseType: !32, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "aircr", scope: !452, file: !451, line: 57, baseType: !32, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "scr", scope: !452, file: !451, line: 64, baseType: !32, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "resets_hw_t", file: !463, line: 111, baseType: !464)
!463 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/resets.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "a30eff55a8b85615882cd40fb4f3cbe8")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !463, line: 24, size: 96, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !464, file: !463, line: 52, baseType: !32, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "wdsel", scope: !464, file: !463, line: 81, baseType: !32, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reset_done", scope: !464, file: !463, line: 110, baseType: !24, size: 32, offset: 64)
!469 = !{!470, !407}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "heap_end", scope: !472, file: !473, line: 190, type: !459, isLocal: true, isDefinition: true)
!472 = distinct !DISubprogram(name: "_sbrk", scope: !473, file: !473, line: 188, type: !474, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !409, retainedNodes: !476)
!473 = !DIFile(filename: "pico-sdk/src/rp2_common/pico_runtime/runtime.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "3eeea37c13078707f8f66c632df3a822")
!474 = !DISubroutineType(types: !475)
!475 = !{!14, !300}
!476 = !{!477, !478, !479}
!477 = !DILocalVariable(name: "incr", arg: 1, scope: !472, file: !473, line: 188, type: !300)
!478 = !DILocalVariable(name: "prev_heap_end", scope: !472, file: !473, line: 191, type: !459)
!479 = !DILocalVariable(name: "next_heap_end", scope: !472, file: !473, line: 197, type: !459)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1536, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 48)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "configured_freq", scope: !485, file: !557, line: 21, type: !567, isLocal: true, isDefinition: true)
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !487, retainedTypes: !502, globals: !554, splitDebugInlining: false, nameTableKind: None)
!486 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/hardware_clocks/clocks.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "959ee9bb2d7c81836dc91658701370a0")
!487 = !{!488, !104}
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_index", file: !489, line: 27, baseType: !13, size: 32, elements: !490)
!489 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/clocks.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "f8b39194d77ef7ae4d182a3efad0d923")
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!491 = !DIEnumerator(name: "clk_gpout0", value: 0)
!492 = !DIEnumerator(name: "clk_gpout1", value: 1)
!493 = !DIEnumerator(name: "clk_gpout2", value: 2)
!494 = !DIEnumerator(name: "clk_gpout3", value: 3)
!495 = !DIEnumerator(name: "clk_ref", value: 4)
!496 = !DIEnumerator(name: "clk_sys", value: 5)
!497 = !DIEnumerator(name: "clk_peri", value: 6)
!498 = !DIEnumerator(name: "clk_usb", value: 7)
!499 = !DIEnumerator(name: "clk_adc", value: 8)
!500 = !DIEnumerator(name: "clk_rtc", value: 9)
!501 = !DIEnumerator(name: "CLK_COUNT", value: 10)
!502 = !{!503, !9, !285, !545, !215, !14, !216, !218}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "clocks_hw_t", file: !489, line: 320, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 129, size: 1600, elements: !506)
!506 = !{!507, !517, !523, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !505, file: !489, line: 130, baseType: !508, size: 960)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 960, elements: !515)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_hw_t", file: !489, line: 63, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 43, size: 96, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !510, file: !489, line: 52, baseType: !32, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "div", scope: !510, file: !489, line: 58, baseType: !32, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !510, file: !489, line: 62, baseType: !24, size: 32, offset: 64)
!515 = !{!516}
!516 = !DISubrange(count: 10)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "resus", scope: !505, file: !489, line: 132, baseType: !518, size: 64, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_resus_hw_t", file: !489, line: 77, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 66, size: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !519, file: !489, line: 72, baseType: !32, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !519, file: !489, line: 76, baseType: !24, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "fc0", scope: !505, file: !489, line: 134, baseType: !524, size: 256, offset: 1024)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "fc_hw_t", file: !489, line: 127, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 79, size: 256, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ref_khz", scope: !525, file: !489, line: 83, baseType: !32, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "min_khz", scope: !525, file: !489, line: 88, baseType: !32, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "max_khz", scope: !525, file: !489, line: 93, baseType: !32, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !525, file: !489, line: 98, baseType: !32, size: 32, offset: 96)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !525, file: !489, line: 103, baseType: !32, size: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !525, file: !489, line: 108, baseType: !32, size: 32, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !525, file: !489, line: 120, baseType: !24, size: 32, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !525, file: !489, line: 126, baseType: !24, size: 32, offset: 224)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "wake_en0", scope: !505, file: !489, line: 170, baseType: !32, size: 32, offset: 1280)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "wake_en1", scope: !505, file: !489, line: 189, baseType: !32, size: 32, offset: 1312)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_en0", scope: !505, file: !489, line: 225, baseType: !32, size: 32, offset: 1344)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_en1", scope: !505, file: !489, line: 244, baseType: !32, size: 32, offset: 1376)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "enabled0", scope: !505, file: !489, line: 280, baseType: !24, size: 32, offset: 1408)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "enabled1", scope: !505, file: !489, line: 299, baseType: !24, size: 32, offset: 1440)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "intr", scope: !505, file: !489, line: 304, baseType: !24, size: 32, offset: 1472)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "inte", scope: !505, file: !489, line: 309, baseType: !32, size: 32, offset: 1504)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "intf", scope: !505, file: !489, line: 314, baseType: !32, size: 32, offset: 1536)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ints", scope: !505, file: !489, line: 319, baseType: !24, size: 32, offset: 1568)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "pll_hw_t", file: !547, line: 50, baseType: !548)
!547 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/pll.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "feb85b301217abd10592acc39b99ac16")
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !547, line: 24, size: 128, elements: !549)
!549 = !{!550, !551, !552, !553}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !548, file: !547, line: 30, baseType: !32, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pwr", scope: !548, file: !547, line: 38, baseType: !32, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fbdiv_int", scope: !548, file: !547, line: 43, baseType: !32, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "prim", scope: !548, file: !547, line: 49, baseType: !32, size: 32, offset: 96)
!554 = !{!483, !555, !563}
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "_resus_callback", scope: !485, file: !557, line: 23, type: !558, isLocal: true, isDefinition: true)
!557 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_clocks/clocks.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "959ee9bb2d7c81836dc91658701370a0")
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "resus_callback_t", file: !559, line: 158, baseType: !560)
!559 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_clocks/include/hardware/clocks.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "76093c764ba74dcb30caf2bc7da2b22a")
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DISubroutineType(types: !562)
!562 = !{null}
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "gpin0_src", scope: !485, file: !557, line: 339, type: !565, isLocal: true, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 80, elements: !515)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 320, elements: !515)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "irq_hander_chain_free_slot_head", scope: !570, file: !589, line: 90, type: !439, isLocal: true, isDefinition: true)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !572, globals: !588, splitDebugInlining: false, nameTableKind: None)
!571 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/hardware_irq/irq.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "e7c8c797e172a14ab7d7973e20bbb3d9")
!572 = !{!215, !573, !9, !15, !575, !576, !234, !216, !298, !585, !14, !165, !439}
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "irq_handler_t", file: !574, line: 123, baseType: !560)
!574 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_irq/include/hardware/irq.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "617cf4ac329990289eb7f58a58db322e")
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "armv6m_scb_t", file: !451, line: 65, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 23, size: 160, elements: !579)
!579 = !{!580, !581, !582, !583, !584}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "cpuid", scope: !578, file: !451, line: 31, baseType: !24, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "icsr", scope: !578, file: !451, line: 44, baseType: !32, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vtor", scope: !578, file: !451, line: 49, baseType: !32, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "aircr", scope: !578, file: !451, line: 57, baseType: !32, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "scr", scope: !578, file: !451, line: 64, baseType: !32, size: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !10, line: 36, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !12, line: 57, baseType: !587)
!587 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!588 = !{!568}
!589 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_irq/irq.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "e7c8c797e172a14ab7d7973e20bbb3d9")
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "load_value", scope: !592, file: !618, line: 23, type: !9, isLocal: true, isDefinition: true)
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !594, globals: !617, splitDebugInlining: false, nameTableKind: None)
!593 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/hardware_watchdog/watchdog.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "a75013f7a523d838c7d4304f042174d2")
!594 = !{!595, !608, !215, !14, !216, !218}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "watchdog_hw_t", file: !597, line: 58, baseType: !598)
!597 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/watchdog.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "68567dd86ce159e3ea8be6df10a17d65")
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 23, size: 384, elements: !599)
!599 = !{!600, !601, !602, !603, !607}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !598, file: !597, line: 32, baseType: !32, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !598, file: !597, line: 37, baseType: !34, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !598, file: !597, line: 43, baseType: !24, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !598, file: !597, line: 49, baseType: !604, size: 256, offset: 96)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 256, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 8)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tick", scope: !598, file: !597, line: 57, baseType: !32, size: 32, offset: 352)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "psm_hw_t", file: !610, line: 107, baseType: !611)
!610 = !DIFile(filename: "pico-sdk/src/rp2040/hardware_structs/include/hardware/structs/psm.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "1321ebbf7bd37ef33d38e637532370f7")
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 23, size: 128, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "frce_on", scope: !611, file: !610, line: 43, baseType: !32, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "frce_off", scope: !611, file: !610, line: 64, baseType: !32, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "wdsel", scope: !611, file: !610, line: 85, baseType: !32, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !611, file: !610, line: 106, baseType: !24, size: 32, offset: 96)
!617 = !{!590}
!618 = !DIFile(filename: "pico-sdk/src/rp2_common/hardware_watchdog/watchdog.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "a75013f7a523d838c7d4304f042174d2")
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "lazy_vsnprintf", scope: !621, file: !631, line: 127, type: !673, isLocal: true, isDefinition: true)
!621 = distinct !DICompileUnit(language: DW_LANG_C99, file: !622, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !623, globals: !639, splitDebugInlining: false, nameTableKind: None)
!622 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/pico_printf/printf.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "8b0e297a7fb20519d6a1eef8cbf39078")
!623 = !{!624, !459, !216, !13, !300, !287, !626, !460, !627, !17, !587, !628, !285, !165, !629}
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !625, line: 209, baseType: !13)
!625 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/include/stddef.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "862bb94651e55628ab3700c73b0fcc15")
!626 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!627 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!628 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_wrap_type", file: !631, line: 134, baseType: !632)
!631 = !DIFile(filename: "pico-sdk/src/rp2_common/pico_printf/printf.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "8b0e297a7fb20519d6a1eef8cbf39078")
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !631, line: 131, size: 64, elements: !633)
!633 = !{!634, !638}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "fct", scope: !632, file: !631, line: 132, baseType: !635, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !460, !14}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !632, file: !631, line: 133, baseType: !14, size: 32, offset: 32)
!639 = !{!619, !640}
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "pow10", scope: !642, file: !631, line: 349, type: !671, isLocal: true, isDefinition: true)
!642 = distinct !DISubprogram(name: "_ftoa", scope: !631, file: !631, line: 342, type: !643, scopeLine: 343, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !621, retainedNodes: !649)
!643 = !DISubroutineType(types: !644)
!644 = !{!624, !645, !459, !624, !624, !628, !13, !13, !13}
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_type", file: !631, line: 120, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !460, !14, !624, !624}
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !662, !663, !664, !665, !666, !667, !668}
!650 = !DILocalVariable(name: "out", arg: 1, scope: !642, file: !631, line: 342, type: !645)
!651 = !DILocalVariable(name: "buffer", arg: 2, scope: !642, file: !631, line: 342, type: !459)
!652 = !DILocalVariable(name: "idx", arg: 3, scope: !642, file: !631, line: 342, type: !624)
!653 = !DILocalVariable(name: "maxlen", arg: 4, scope: !642, file: !631, line: 342, type: !624)
!654 = !DILocalVariable(name: "value", arg: 5, scope: !642, file: !631, line: 342, type: !628)
!655 = !DILocalVariable(name: "prec", arg: 6, scope: !642, file: !631, line: 342, type: !13)
!656 = !DILocalVariable(name: "width", arg: 7, scope: !642, file: !631, line: 343, type: !13)
!657 = !DILocalVariable(name: "flags", arg: 8, scope: !642, file: !631, line: 343, type: !13)
!658 = !DILocalVariable(name: "buf", scope: !642, file: !631, line: 344, type: !659)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 256, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 32)
!662 = !DILocalVariable(name: "len", scope: !642, file: !631, line: 345, type: !624)
!663 = !DILocalVariable(name: "diff", scope: !642, file: !631, line: 346, type: !628)
!664 = !DILocalVariable(name: "negative", scope: !642, file: !631, line: 371, type: !271)
!665 = !DILocalVariable(name: "whole", scope: !642, file: !631, line: 387, type: !300)
!666 = !DILocalVariable(name: "tmp", scope: !642, file: !631, line: 388, type: !628)
!667 = !DILocalVariable(name: "frac", scope: !642, file: !631, line: 389, type: !626)
!668 = !DILocalVariable(name: "count", scope: !669, file: !631, line: 413, type: !13)
!669 = distinct !DILexicalBlock(scope: !670, file: !631, line: 412, column: 12)
!670 = distinct !DILexicalBlock(scope: !642, file: !631, line: 405, column: 9)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 640, elements: !515)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DISubroutineType(types: !675)
!675 = !{!300, !645, !459, !676, !677, !679}
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !680, line: 46, baseType: !681)
!680 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/stdio.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f9fec3134fbe599333115bffe9fa8133")
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !682, line: 40, baseType: !683)
!682 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/include/stdarg.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "b59504429fd173d496ea95544ab360b0")
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !684, baseType: !685)
!684 = !DIFile(filename: "pico-sdk/src/rp2_common/pico_printf/printf.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 32, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__ap", scope: !685, file: !684, line: 897, baseType: !14, size: 32)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "sd_table", scope: !690, file: !696, line: 13, type: !697, isLocal: false, isDefinition: true)
!690 = distinct !DICompileUnit(language: DW_LANG_C99, file: !691, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !692, globals: !693, splitDebugInlining: false, nameTableKind: None)
!691 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/pico_double/double_init_rom.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "ef2a85158ffe6b21491df0bfa283b97a")
!692 = !{!216, !233, !9}
!693 = !{!688, !694}
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "sf_clz_func", scope: !690, file: !696, line: 22, type: !14, isLocal: false, isDefinition: true)
!696 = !DIFile(filename: "pico-sdk/src/rp2_common/pico_double/double_init_rom.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "ef2a85158ffe6b21491df0bfa283b97a")
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 64)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "sf_table", scope: !702, file: !707, line: 13, type: !697, isLocal: false, isDefinition: true)
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !692, globals: !704, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/pico_float/float_init_rom.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "2d1fa09681bcaf02dceefe3fbdf5877e")
!704 = !{!700, !705}
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "sf_clz_func", scope: !702, file: !707, line: 14, type: !14, isLocal: false, isDefinition: true)
!707 = !DIFile(filename: "pico-sdk/src/rp2_common/pico_float/float_init_rom.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "2d1fa09681bcaf02dceefe3fbdf5877e")
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "__bi_22", scope: !710, file: !715, line: 22, type: !753, isLocal: true, isDefinition: true)
!710 = distinct !DICompileUnit(language: DW_LANG_C99, file: !711, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !712, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/pico_standard_link/binary_info.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "2018f4f852069b7b2317560ead0b65ed")
!712 = !{!713, !723, !725, !727, !729, !731, !733, !708, !735, !743, !745, !747, !749, !751}
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "__bi_ptr22", scope: !710, file: !715, line: 22, type: !716, isLocal: true, isDefinition: true)
!715 = !DIFile(filename: "pico-sdk/src/rp2_common/pico_standard_link/binary_info.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "2018f4f852069b7b2317560ead0b65ed")
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_binary_info_core", file: !719, line: 64, size: 32, elements: !720)
!719 = !DIFile(filename: "pico-sdk/src/common/pico_binary_info/include/pico/binary_info/structure.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "615f341e70962ea32561ed55b0dc05fe")
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !718, file: !719, line: 65, baseType: !585, size: 16)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !718, file: !719, line: 66, baseType: !585, size: 16, offset: 16)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "__bi_ptr30", scope: !710, file: !715, line: 30, type: !716, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "__bi_ptr38", scope: !710, file: !715, line: 38, type: !716, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "__bi_ptr44", scope: !710, file: !715, line: 44, type: !716, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "__bi_ptr50", scope: !710, file: !715, line: 50, type: !716, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "__bi_ptr75", scope: !710, file: !715, line: 75, type: !716, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "__bi_ptr81", scope: !710, file: !715, line: 81, type: !716, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "__bi_30", scope: !710, file: !715, line: 30, type: !737, isLocal: true, isDefinition: true)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_binary_info_id_and_string", file: !719, line: 91, size: 96, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !738, file: !719, line: 92, baseType: !718, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !738, file: !719, line: 93, baseType: !9, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !738, file: !719, line: 94, baseType: !677, size: 32, offset: 64)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "__bi_38", scope: !710, file: !715, line: 38, type: !737, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "__bi_44", scope: !710, file: !715, line: 44, type: !737, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "__bi_50", scope: !710, file: !715, line: 50, type: !737, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "__bi_75", scope: !710, file: !715, line: 75, type: !737, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "__bi_81", scope: !710, file: !715, line: 81, type: !737, isLocal: true, isDefinition: true)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_binary_info_id_and_int", file: !719, line: 85, size: 96, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !754, file: !719, line: 86, baseType: !718, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !754, file: !719, line: 87, baseType: !9, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !754, file: !719, line: 88, baseType: !298, size: 32, offset: 64)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "print_mutex", scope: !761, file: !793, line: 36, type: !840, isLocal: true, isDefinition: true)
!761 = distinct !DICompileUnit(language: DW_LANG_C99, file: !762, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !763, retainedTypes: !772, globals: !801, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/pico_stdio/stdio.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "2c56769920901fc407d39c896c994615")
!763 = !{!764}
!764 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !765, line: 15, baseType: !300, size: 32, elements: !766)
!765 = !DIFile(filename: "pico-sdk/src/common/pico_base/include/pico/error.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "2f968f5ce39ac581ceebe31d1371acb4")
!766 = !{!767, !768, !769, !770, !771}
!767 = !DIEnumerator(name: "PICO_OK", value: 0)
!768 = !DIEnumerator(name: "PICO_ERROR_NONE", value: 0)
!769 = !DIEnumerator(name: "PICO_ERROR_TIMEOUT", value: -1)
!770 = !DIEnumerator(name: "PICO_ERROR_GENERIC", value: -2)
!771 = !DIEnumerator(name: "PICO_ERROR_NO_DATA", value: -3)
!772 = !{!439, !9, !460, !300, !15, !220, !773, !791, !285}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_hw_t", file: !322, line: 101, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !322, line: 23, size: 544, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "timehw", scope: !775, file: !322, line: 26, baseType: !34, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "timelw", scope: !775, file: !322, line: 30, baseType: !34, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "timehr", scope: !775, file: !322, line: 34, baseType: !24, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "timelr", scope: !775, file: !322, line: 38, baseType: !24, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "alarm", scope: !775, file: !322, line: 44, baseType: !152, size: 128, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "armed", scope: !775, file: !322, line: 49, baseType: !32, size: 32, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "timerawh", scope: !775, file: !322, line: 53, baseType: !24, size: 32, offset: 288)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "timerawl", scope: !775, file: !322, line: 57, baseType: !24, size: 32, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "dbgpause", scope: !775, file: !322, line: 63, baseType: !32, size: 32, offset: 352)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !775, file: !322, line: 68, baseType: !32, size: 32, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "intr", scope: !775, file: !322, line: 76, baseType: !32, size: 32, offset: 416)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "inte", scope: !775, file: !322, line: 84, baseType: !32, size: 32, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "intf", scope: !775, file: !322, line: 92, baseType: !32, size: 32, offset: 480)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ints", scope: !775, file: !322, line: 100, baseType: !24, size: 32, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "stdio_stack_buffer_t", file: !793, line: 208, baseType: !794)
!793 = !DIFile(filename: "pico-sdk/src/rp2_common/pico_stdio/stdio.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "2c56769920901fc407d39c896c994615")
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stdio_stack_buffer", file: !793, line: 205, size: 1056, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !794, file: !793, line: 206, baseType: !300, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !794, file: !793, line: 207, baseType: !798, size: 1024, offset: 32)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 1024, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 128)
!801 = !{!802, !822, !759, !824}
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "drivers", scope: !761, file: !793, line: 32, type: !804, isLocal: true, isDefinition: true)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "stdio_driver_t", file: !806, line: 44, baseType: !807)
!806 = !DIFile(filename: "pico-sdk/src/rp2_common/pico_stdio/include/pico/stdio.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "063a5a63050f4ee2096572d5bcfb3186")
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stdio_driver", file: !808, line: 13, size: 160, elements: !809)
!808 = !DIFile(filename: "pico-sdk/src/rp2_common/pico_stdio/include/pico/stdio/driver.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "a8bfec09bf0071cd38449a4a2aa6551d")
!809 = !{!810, !814, !815, !819, !820, !821}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "out_chars", scope: !807, file: !808, line: 14, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !677, !300}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "out_flush", scope: !807, file: !808, line: 15, baseType: !560, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "in_chars", scope: !807, file: !808, line: 16, baseType: !816, size: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DISubroutineType(types: !818)
!818 = !{!300, !459, !300}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !807, file: !808, line: 17, baseType: !804, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "last_ended_with_cr", scope: !807, file: !808, line: 19, baseType: !271, size: 8, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "crlf_enabled", scope: !807, file: !808, line: 20, baseType: !271, size: 8, offset: 136)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "filter", scope: !761, file: !793, line: 33, type: !804, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "crlf_str", scope: !826, file: !793, line: 75, type: !839, isLocal: true, isDefinition: true)
!826 = distinct !DISubprogram(name: "stdio_out_chars_crlf", scope: !793, file: !793, line: 68, type: !827, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !761, retainedNodes: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !804, !677, !300}
!829 = !{!830, !831, !832, !833, !834, !836}
!830 = !DILocalVariable(name: "driver", arg: 1, scope: !826, file: !793, line: 68, type: !804)
!831 = !DILocalVariable(name: "s", arg: 2, scope: !826, file: !793, line: 68, type: !677)
!832 = !DILocalVariable(name: "len", arg: 3, scope: !826, file: !793, line: 68, type: !300)
!833 = !DILocalVariable(name: "first_of_chunk", scope: !826, file: !793, line: 74, type: !300)
!834 = !DILocalVariable(name: "i", scope: !835, file: !793, line: 76, type: !300)
!835 = distinct !DILexicalBlock(scope: !826, file: !793, line: 76, column: 5)
!836 = !DILocalVariable(name: "prev_char_was_cr", scope: !837, file: !793, line: 77, type: !271)
!837 = distinct !DILexicalBlock(scope: !838, file: !793, line: 76, column: 35)
!838 = distinct !DILexicalBlock(scope: !835, file: !793, line: 76, column: 5)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 16, elements: !69)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "mutex_t", file: !430, line: 63, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !430, line: 60, size: 64, align: 32, elements: !842)
!842 = !{!843, !848}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !841, file: !430, line: 61, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "lock_core_t", file: !346, line: 61, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_core", file: !346, line: 53, size: 32, elements: !846)
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "spin_lock", scope: !845, file: !346, line: 55, baseType: !234, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !841, file: !430, line: 62, baseType: !439, size: 8, offset: 32)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "_resetd_driver", scope: !851, file: !898, line: 79, type: !899, isLocal: true, isDefinition: true)
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !853, retainedTypes: !889, globals: !895, splitDebugInlining: false, nameTableKind: None)
!852 = !DIFile(filename: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/pico-sdk/src/rp2_common/pico_stdio_usb/reset_interface.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS/build/App-Template", checksumkind: CSK_MD5, checksum: "d2aee43c4041e8f7870670cf041d37b8")
!853 = !{!854, !860, !884}
!854 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !855, line: 234, baseType: !13, size: 32, elements: !856)
!855 = !DIFile(filename: "pico-sdk/lib/tinyusb/src/common/tusb_types.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "6782d3e8e1c89f69450ff561781ca2ee")
!856 = !{!857, !858, !859}
!857 = !DIEnumerator(name: "XFER_RESULT_SUCCESS", value: 0)
!858 = !DIEnumerator(name: "XFER_RESULT_FAILED", value: 1)
!859 = !DIEnumerator(name: "XFER_RESULT_STALLED", value: 2)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !855, line: 156, baseType: !13, size: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!862 = !DIEnumerator(name: "TUSB_CLASS_UNSPECIFIED", value: 0)
!863 = !DIEnumerator(name: "TUSB_CLASS_AUDIO", value: 1)
!864 = !DIEnumerator(name: "TUSB_CLASS_CDC", value: 2)
!865 = !DIEnumerator(name: "TUSB_CLASS_HID", value: 3)
!866 = !DIEnumerator(name: "TUSB_CLASS_RESERVED_4", value: 4)
!867 = !DIEnumerator(name: "TUSB_CLASS_PHYSICAL", value: 5)
!868 = !DIEnumerator(name: "TUSB_CLASS_IMAGE", value: 6)
!869 = !DIEnumerator(name: "TUSB_CLASS_PRINTER", value: 7)
!870 = !DIEnumerator(name: "TUSB_CLASS_MSC", value: 8)
!871 = !DIEnumerator(name: "TUSB_CLASS_HUB", value: 9)
!872 = !DIEnumerator(name: "TUSB_CLASS_CDC_DATA", value: 10)
!873 = !DIEnumerator(name: "TUSB_CLASS_SMART_CARD", value: 11)
!874 = !DIEnumerator(name: "TUSB_CLASS_RESERVED_12", value: 12)
!875 = !DIEnumerator(name: "TUSB_CLASS_CONTENT_SECURITY", value: 13)
!876 = !DIEnumerator(name: "TUSB_CLASS_VIDEO", value: 14)
!877 = !DIEnumerator(name: "TUSB_CLASS_PERSONAL_HEALTHCARE", value: 15)
!878 = !DIEnumerator(name: "TUSB_CLASS_AUDIO_VIDEO", value: 16)
!879 = !DIEnumerator(name: "TUSB_CLASS_DIAGNOSTIC", value: 220)
!880 = !DIEnumerator(name: "TUSB_CLASS_WIRELESS_CONTROLLER", value: 224)
!881 = !DIEnumerator(name: "TUSB_CLASS_MISC", value: 239)
!882 = !DIEnumerator(name: "TUSB_CLASS_APPLICATION_SPECIFIC", value: 254)
!883 = !DIEnumerator(name: "TUSB_CLASS_VENDOR_SPECIFIC", value: 255)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !855, line: 266, baseType: !13, size: 32, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIEnumerator(name: "CONTROL_STAGE_SETUP", value: 0)
!887 = !DIEnumerator(name: "CONTROL_STAGE_DATA", value: 1)
!888 = !DIEnumerator(name: "CONTROL_STAGE_ACK", value: 2)
!889 = !{!890}
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "rom_reset_usb_boot_fn", file: !891, line: 60, baseType: !892)
!891 = !DIFile(filename: "pico-sdk/src/rp2_common/pico_bootrom/include/pico/bootrom.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "d8fef54d7a3b2542d4fbc3d9fdb4f048")
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !9, !9}
!895 = !{!849, !896}
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "itf_num", scope: !851, file: !898, line: 19, type: !15, isLocal: true, isDefinition: true)
!898 = !DIFile(filename: "pico-sdk/src/rp2_common/pico_stdio_usb/reset_interface.c", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "d2aee43c4041e8f7870670cf041d37b8")
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "usbd_class_driver_t", file: !901, line: 52, baseType: !902)
!901 = !DIFile(filename: "pico-sdk/lib/tinyusb/src/device/usbd_pvt.h", directory: "/home/mjshen/RTOSExploration/RP2040-FreeRTOS", checksumkind: CSK_MD5, checksum: "2761e870ded84931d6d09f3198ba9e97")
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !901, line: 40, size: 192, elements: !903)
!903 = !{!904, !905, !909, !927, !950, !955}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !902, file: !901, line: 46, baseType: !560, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !902, file: !901, line: 47, baseType: !906, size: 32, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !15}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !902, file: !901, line: 48, baseType: !910, size: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DISubroutineType(types: !912)
!912 = !{!585, !15, !913, !585}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "tusb_desc_interface_t", file: !855, line: 345, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !855, line: 333, size: 72, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924, !925, !926}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !916, file: !855, line: 335, baseType: !15, size: 8)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !916, file: !855, line: 336, baseType: !15, size: 8, offset: 8)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "bInterfaceNumber", scope: !916, file: !855, line: 338, baseType: !15, size: 8, offset: 16)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "bAlternateSetting", scope: !916, file: !855, line: 339, baseType: !15, size: 8, offset: 24)
