; ModuleID = 'build/96b_meerkat96/cpp_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type { i8 }
%struct._thread_arch = type { i32, i32 }
%class.cpp_semaphore = type { %class.semaphore, %struct.k_sem }
%class.semaphore = type { i32 (...)** }
%struct.k_sem = type { %union.anon, i32, i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/cpp_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/cpp_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/cpp_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "coop_thread", scope: !27, file: !45, line: 40, type: !120, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, globals: !105, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/cpp/cpp_synchronization/src/main.cpp", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/cpp_synchronization")
!29 = !{!30, !34, !40, !42, !44, !48}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !31, line: 46, baseType: !32)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !33)
!33 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !35, line: 46, baseType: !36)
!35 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39, !39, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !43)
!43 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!44 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "cpp_semaphore", file: !45, line: 50, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !46, vtableHolder: !48)
!45 = !DIFile(filename: "zephyr/samples/subsys/cpp/cpp_synchronization/src/main.cpp", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !66, !93, !97, !98, !101, !104}
!47 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !44, baseType: !48, flags: DIFlagPublic, extraData: i32 0)
!48 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "semaphore", file: !45, line: 29, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !49, vtableHolder: !48, identifier: "_ZTS9semaphore")
!49 = !{!50, !56, !60, !63}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$semaphore", scope: !45, file: !45, baseType: !51, size: 32, flags: DIFlagArtificial)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !53, size: 32)
!53 = !DISubroutineType(types: !54)
!54 = !{!55}
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DISubprogram(name: "wait", linkageName: "_ZN9semaphore4waitEv", scope: !48, file: !45, line: 31, type: !57, scopeLine: 31, containingType: !48, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!57 = !DISubroutineType(types: !58)
!58 = !{!55, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!60 = !DISubprogram(name: "wait", linkageName: "_ZN9semaphore4waitEi", scope: !48, file: !45, line: 32, type: !61, scopeLine: 32, containingType: !48, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!61 = !DISubroutineType(types: !62)
!62 = !{!55, !59, !55}
!63 = !DISubprogram(name: "give", linkageName: "_ZN9semaphore4giveEv", scope: !48, file: !45, line: 33, type: !64, scopeLine: 33, containingType: !48, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !59}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_sema_internal", scope: !44, file: !45, line: 52, baseType: !67, size: 128, offset: 32, flags: DIFlagProtected)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !68, line: 2909, size: 128, flags: DIFlagTypePassByValue, elements: !69, identifier: "_ZTS5k_sem")
!68 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!69 = !{!70, !91, !92}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !67, file: !68, line: 2910, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !73)
!72 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, flags: DIFlagTypePassByValue, elements: !74, identifier: "_ZTS9_wait_q_t")
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !73, file: !72, line: 232, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !78)
!77 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, flags: DIFlagTypePassByValue, elements: !79, identifier: "_ZTS6_dnode")
!79 = !{!80, !86}
!80 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 38, baseType: !81, size: 32)
!81 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 38, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !82, identifier: "_ZTSN6_dnodeUt_E")
!82 = !{!83, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !81, file: !77, line: 39, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !77, line: 40, baseType: !84, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 42, baseType: !87, size: 32, offset: 32)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 42, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !88, identifier: "_ZTSN6_dnodeUt0_E")
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !87, file: !77, line: 43, baseType: !84, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !77, line: 44, baseType: !84, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !67, file: !68, line: 2911, baseType: !41, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !67, file: !68, line: 2912, baseType: !41, size: 32, offset: 96)
!93 = !DISubprogram(name: "cpp_semaphore", scope: !44, file: !45, line: 54, type: !94, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!97 = !DISubprogram(name: "~cpp_semaphore", scope: !44, file: !45, line: 55, type: !94, scopeLine: 55, containingType: !44, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!98 = !DISubprogram(name: "wait", linkageName: "_ZN13cpp_semaphore4waitEv", scope: !44, file: !45, line: 56, type: !99, scopeLine: 56, containingType: !44, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!99 = !DISubroutineType(types: !100)
!100 = !{!55, !96}
!101 = !DISubprogram(name: "wait", linkageName: "_ZN13cpp_semaphore4waitEi", scope: !44, file: !45, line: 57, type: !102, scopeLine: 57, containingType: !44, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!102 = !DISubroutineType(types: !103)
!103 = !{!55, !96, !55}
!104 = !DISubprogram(name: "give", linkageName: "_ZN13cpp_semaphore4giveEv", scope: !44, file: !45, line: 58, type: !94, scopeLine: 58, containingType: !44, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!105 = !{!25, !106, !116, !118}
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "coop_stack", scope: !27, file: !45, line: 41, type: !108, isLocal: false, isDefinition: true, align: 64)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 16000, elements: !114)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !110, line: 47, size: 8, flags: DIFlagTypePassByValue, elements: !111, identifier: "_ZTS22z_thread_stack_element")
!110 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 48, baseType: !113, size: 8)
!113 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!114 = !{!115}
!115 = !DISubrange(count: 2000)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "sem_main", scope: !27, file: !45, line: 110, type: !44, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "sem_coop", scope: !27, file: !45, line: 111, type: !44, isLocal: false, isDefinition: true)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 896, flags: DIFlagTypePassByValue, elements: !122, identifier: "_ZTS8k_thread")
!121 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123, !172, !185, !186, !187, !188, !191}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !120, file: !121, line: 247, baseType: !124, size: 384)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, flags: DIFlagTypePassByValue, elements: !125, identifier: "_ZTS12_thread_base")
!125 = !{!126, !140, !142, !145, !146, !159, !160, !161}
!126 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !121, line: 60, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !121, line: 60, size: 64, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !128, identifier: "_ZTSN12_thread_baseUt_E")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !127, file: !121, line: 61, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !78)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !127, file: !121, line: 62, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, flags: DIFlagTypePassByValue, elements: !134, identifier: "_ZTS6rbnode")
!133 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !132, file: !133, line: 50, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !138)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!138 = !{!139}
!139 = !DISubrange(count: 2)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !124, file: !121, line: 68, baseType: !141, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !124, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !144)
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !124, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !121, line: 90, baseType: !147, size: 16, offset: 112)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !121, line: 90, size: 16, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !148, identifier: "_ZTSN12_thread_baseUt0_E")
!148 = !{!149, !156}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !121, line: 91, baseType: !150, size: 16)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !147, file: !121, line: 91, size: 16, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !151, identifier: "_ZTSN12_thread_baseUt0_Ut_E")
!151 = !{!152, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !150, file: !121, line: 96, baseType: !153, size: 8)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !154)
!154 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !150, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !147, file: !121, line: 100, baseType: !157, size: 16)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !158)
!158 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !124, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !124, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !124, file: !121, line: 131, baseType: !162, size: 192, offset: 192)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, flags: DIFlagTypePassByValue, elements: !163, identifier: "_ZTS8_timeout")
!163 = !{!164, !165, !171}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !162, file: !72, line: 245, baseType: !130, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !162, file: !72, line: 246, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !162, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !120, file: !121, line: 250, baseType: !173, size: 288, offset: 384)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, flags: DIFlagTypePassByValue, elements: !175, identifier: "_ZTS13_callee_saved")
!174 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !173, file: !174, line: 26, baseType: !40, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !173, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !173, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !173, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !173, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !173, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !173, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !173, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !173, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !120, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !120, file: !121, line: 256, baseType: !71, size: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !120, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !120, file: !121, line: 325, baseType: !189, size: 32, offset: 800)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, flags: DIFlagFwdDecl, identifier: "_ZTS6k_heap")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !120, file: !121, line: 343, baseType: !192, size: 64, offset: 832)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, flags: DIFlagTypePassByValue, elements: !193, identifier: "_ZTS12_thread_arch")
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !192, file: !174, line: 63, baseType: !40, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !192, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "_char_out", scope: !198, file: !273, line: 54, type: !274, isLocal: false, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !271, globals: !272, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/cpp_synchronization")
!200 = !{!201}
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !202, line: 27, baseType: !41, size: 32, elements: !203)
!202 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!204 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!205 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!206 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!207 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!208 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!209 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!210 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!211 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!212 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!213 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!214 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!215 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!216 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!217 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!218 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!219 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!220 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!221 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!222 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!223 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!224 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!225 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!226 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!227 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!228 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!229 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!230 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!231 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!232 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!233 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!234 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!235 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!236 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!237 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!238 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!239 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!240 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!241 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!242 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!243 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!244 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!245 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!246 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!247 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!248 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!249 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!250 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!251 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!252 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!253 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!254 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!255 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!256 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!257 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!258 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!259 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!260 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!261 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!262 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!263 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!264 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!265 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!266 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!267 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!268 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!269 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!270 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!271 = !{!39, !55}
!272 = !{!196}
!273 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DISubroutineType(types: !276)
!276 = !{!55, !55}
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !279, file: !693, line: 258, type: !694, isLocal: true, isDefinition: true, align: 32)
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !281, retainedTypes: !564, globals: !692, splitDebugInlining: false, nameTableKind: None)
!280 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/cpp_synchronization")
!281 = !{!282, !314, !324, !373, !379, !500, !535}
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !283, line: 54, baseType: !41, size: 32, elements: !284)
!283 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!285 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!286 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!287 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!288 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!289 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!290 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!291 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!292 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!293 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!294 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!295 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!296 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!297 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!298 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!299 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!300 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!301 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!302 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!303 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!304 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!305 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!306 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!307 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!308 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!309 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!310 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!311 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!312 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!313 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !283, line: 224, baseType: !41, size: 32, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323}
!316 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!317 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!318 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!319 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!320 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!321 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!322 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!323 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !283, line: 275, baseType: !41, size: 32, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!326 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!327 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!328 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!329 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!330 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!331 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!332 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!333 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!334 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!335 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!336 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!337 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!338 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!339 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!340 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!341 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!342 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!343 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!344 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!345 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!346 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!347 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!348 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!349 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!350 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!351 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!352 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!353 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!354 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!355 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!356 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!357 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!358 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!359 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!360 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!361 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!362 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!363 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!364 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!365 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!366 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!367 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!368 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!369 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!370 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!371 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!372 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!373 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !283, line: 327, baseType: !41, size: 32, elements: !374)
!374 = !{!375, !376, !377, !378}
!375 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!376 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!377 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!378 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !380, line: 76, baseType: !41, size: 32, elements: !381)
!380 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499}
!382 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!383 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!384 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!385 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!386 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!387 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!388 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!389 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!390 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!391 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!392 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!393 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!394 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!395 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!396 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!397 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!398 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!399 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!400 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!401 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!402 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!403 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!404 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!405 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!406 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!407 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!408 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!409 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!410 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!411 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!412 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!413 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!414 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!415 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!416 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!417 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!418 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!419 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!420 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!421 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!422 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!423 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!424 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!425 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!426 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!427 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!428 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!429 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!430 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!431 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!432 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!433 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!434 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!435 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!436 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!437 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!438 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!439 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!440 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!441 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!442 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!443 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!444 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!445 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!446 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!447 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!448 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!449 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!450 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!451 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!452 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!453 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!454 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!455 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!456 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!457 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!458 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!459 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!460 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!461 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!462 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!463 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!464 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!465 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!466 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!467 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!468 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!469 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!470 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!471 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!472 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!473 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!474 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!475 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!476 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!477 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!478 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!479 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!480 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!481 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!482 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!483 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!484 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!485 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!486 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!487 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!488 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!489 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!490 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!491 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!492 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!493 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!494 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!495 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!496 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!497 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!498 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!499 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!500 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !283, line: 237, baseType: !41, size: 32, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!502 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!503 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!504 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!505 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!506 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!507 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!508 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!509 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!510 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!511 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!512 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!513 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!514 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!515 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!516 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!517 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!518 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!519 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!520 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!521 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!522 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!523 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!524 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!525 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!526 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!527 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!528 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!529 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!530 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!531 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!532 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!533 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!534 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!535 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !380, line: 44, baseType: !41, size: 32, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!537 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!538 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!539 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!540 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!541 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!542 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!543 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!544 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!545 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!546 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!547 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!548 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!549 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!550 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!551 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!552 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!553 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!554 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!555 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!556 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!557 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!558 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!559 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!560 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!561 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!562 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!563 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!564 = !{!565, !637, !680, !691, !40}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !567, line: 4575, baseType: !568)
!567 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 4532, size: 390144, elements: !569)
!569 = !{!570, !572, !573, !574, !575, !579, !589, !593, !603, !607}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !568, file: !567, line: 4533, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !40)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !568, file: !567, line: 4534, baseType: !571, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !568, file: !567, line: 4535, baseType: !571, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !568, file: !567, line: 4536, baseType: !571, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !568, file: !567, line: 4537, baseType: !576, size: 16256, offset: 128)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 16256, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 2032)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !568, file: !567, line: 4543, baseType: !580, size: 4224, offset: 16384)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 4224, elements: !587)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !568, file: !567, line: 4538, size: 128, elements: !582)
!582 = !{!583, !584, !585, !586}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !581, file: !567, line: 4539, baseType: !571, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !581, file: !567, line: 4540, baseType: !571, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !581, file: !567, line: 4541, baseType: !571, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !581, file: !567, line: 4542, baseType: !571, size: 32, offset: 96)
!587 = !{!588}
!588 = !DISubrange(count: 33)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !568, file: !567, line: 4544, baseType: !590, size: 110464, offset: 20608)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 110464, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 13808)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !568, file: !567, line: 4550, baseType: !594, size: 24448, offset: 131072)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 24448, elements: !601)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !568, file: !567, line: 4545, size: 128, elements: !596)
!596 = !{!597, !598, !599, !600}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !595, file: !567, line: 4546, baseType: !571, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !595, file: !567, line: 4547, baseType: !571, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !595, file: !567, line: 4548, baseType: !571, size: 32, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !595, file: !567, line: 4549, baseType: !571, size: 32, offset: 96)
!601 = !{!602}
!602 = !DISubrange(count: 191)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !568, file: !567, line: 4551, baseType: !604, size: 106624, offset: 155520)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 106624, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 13328)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !568, file: !567, line: 4574, baseType: !608, size: 128000, offset: 262144)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 128000, elements: !635)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !568, file: !567, line: 4552, size: 1024, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !631, !632, !633, !634}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !609, file: !567, line: 4553, baseType: !571, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !609, file: !567, line: 4554, baseType: !571, size: 32, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !609, file: !567, line: 4555, baseType: !571, size: 32, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !609, file: !567, line: 4556, baseType: !571, size: 32, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !609, file: !567, line: 4557, baseType: !571, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !609, file: !567, line: 4558, baseType: !571, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !609, file: !567, line: 4559, baseType: !571, size: 32, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !609, file: !567, line: 4560, baseType: !571, size: 32, offset: 224)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !609, file: !567, line: 4561, baseType: !571, size: 32, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !609, file: !567, line: 4562, baseType: !571, size: 32, offset: 288)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !609, file: !567, line: 4563, baseType: !571, size: 32, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !609, file: !567, line: 4564, baseType: !571, size: 32, offset: 352)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !609, file: !567, line: 4565, baseType: !571, size: 32, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !609, file: !567, line: 4566, baseType: !571, size: 32, offset: 416)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !609, file: !567, line: 4567, baseType: !571, size: 32, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !609, file: !567, line: 4568, baseType: !571, size: 32, offset: 480)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !609, file: !567, line: 4569, baseType: !628, size: 384, offset: 512)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 384, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 48)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !609, file: !567, line: 4570, baseType: !571, size: 32, offset: 896)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !609, file: !567, line: 4571, baseType: !571, size: 32, offset: 928)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !609, file: !567, line: 4572, baseType: !571, size: 32, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !609, file: !567, line: 4573, baseType: !571, size: 32, offset: 992)
!635 = !{!636}
!636 = !DISubrange(count: 125)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !567, line: 38320, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 38303, size: 23040, elements: !640)
!640 = !{!641, !643, !647, !648, !649, !650, !654, !658, !662, !666, !670}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !639, file: !567, line: 38304, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !639, file: !567, line: 38305, baseType: !644, size: 256, offset: 32)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 256, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !639, file: !567, line: 38306, baseType: !571, size: 32, offset: 288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !639, file: !567, line: 38307, baseType: !571, size: 32, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !639, file: !567, line: 38308, baseType: !571, size: 32, offset: 352)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !639, file: !567, line: 38309, baseType: !651, size: 3712, offset: 384)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 3712, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 464)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !639, file: !567, line: 38310, baseType: !655, size: 864, offset: 4096)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 864, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 27)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !639, file: !567, line: 38311, baseType: !659, size: 3232, offset: 4960)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 3232, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 404)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !639, file: !567, line: 38312, baseType: !663, size: 3776, offset: 8192)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 3776, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 118)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !639, file: !567, line: 38313, baseType: !667, size: 4416, offset: 11968)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 4416, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 552)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !639, file: !567, line: 38319, baseType: !671, size: 6656, offset: 16384)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 6656, elements: !678)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !639, file: !567, line: 38314, size: 128, elements: !673)
!673 = !{!674, !675, !676, !677}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !672, file: !567, line: 38315, baseType: !571, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !672, file: !567, line: 38316, baseType: !571, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !672, file: !567, line: 38317, baseType: !571, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !672, file: !567, line: 38318, baseType: !571, size: 32, offset: 96)
!678 = !{!679}
!679 = !DISubrange(count: 52)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !567, line: 43319, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 43313, size: 80, elements: !683)
!683 = !{!684, !686, !687, !689, !690}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !682, file: !567, line: 43314, baseType: !685, size: 16)
!685 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !157)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !682, file: !567, line: 43315, baseType: !685, size: 16, offset: 16)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !682, file: !567, line: 43316, baseType: !688, size: 16, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !682, file: !567, line: 43317, baseType: !685, size: 16, offset: 48)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !682, file: !567, line: 43318, baseType: !685, size: 16, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!692 = !{!277}
!693 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !696, line: 51, size: 64, elements: !697)
!696 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!697 = !{!698, !705}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !695, file: !696, line: 60, baseType: !699, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DISubroutineType(types: !701)
!701 = !{!55, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !704)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !696, line: 48, flags: DIFlagFwdDecl)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !695, file: !696, line: 65, baseType: !702, size: 32, offset: 32)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "__dso_handle", scope: !708, file: !711, line: 15, type: !39, isLocal: false, isDefinition: true)
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !710, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/cpp/cpp_dtors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/cpp_synchronization")
!710 = !{!706}
!711 = !DIFile(filename: "zephyr/subsys/cpp/cpp_dtors.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "z_malloc_heap_mutex", scope: !714, file: !720, line: 35, type: !743, isLocal: false, isDefinition: true)
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !716, globals: !717, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdlib/malloc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/cpp_synchronization")
!716 = !{!30, !39, !55}
!717 = !{!718, !726, !712, !738}
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "__init_malloc_prepare", scope: !714, file: !720, line: 119, type: !721, isLocal: true, isDefinition: true, align: 32)
!720 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdlib/malloc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !696, line: 51, size: 64, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !722, file: !696, line: 60, baseType: !699, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !722, file: !696, line: 65, baseType: !702, size: 32, offset: 32)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "z_malloc_heap", scope: !714, file: !720, line: 34, type: !728, isLocal: true, isDefinition: true)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !729, line: 56, size: 96, elements: !730)
!729 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!730 = !{!731, !734, !735}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !728, file: !729, line: 57, baseType: !732, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !729, line: 57, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !728, file: !729, line: 58, baseType: !39, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !728, file: !729, line: 59, baseType: !736, size: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !737, line: 214, baseType: !41)
!737 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "z_malloc_heap_mem", scope: !714, file: !720, line: 36, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 1024, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 128)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_mutex", file: !744, line: 137, size: 160, elements: !745)
!744 = !DIFile(filename: "zephyr/include/zephyr/sys/mutex.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!745 = !{!746}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_mutex", scope: !743, file: !744, line: 138, baseType: !747, size: 160)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !68, line: 2720, size: 160, elements: !748)
!748 = !{!749, !768, !843, !844}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !747, file: !68, line: 2722, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, elements: !752)
!752 = !{!753}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !751, file: !72, line: 232, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, elements: !756)
!756 = !{!757, !763}
!757 = !DIDerivedType(tag: DW_TAG_member, scope: !755, file: !77, line: 38, baseType: !758, size: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !755, file: !77, line: 38, size: 32, elements: !759)
!759 = !{!760, !762}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !758, file: !77, line: 39, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !758, file: !77, line: 40, baseType: !761, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, scope: !755, file: !77, line: 42, baseType: !764, size: 32, offset: 32)
!764 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !755, file: !77, line: 42, size: 32, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !764, file: !77, line: 43, baseType: !761, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !764, file: !77, line: 44, baseType: !761, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !747, file: !68, line: 2724, baseType: !769, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 896, elements: !771)
!771 = !{!772, !812, !824, !825, !826, !827, !838}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !770, file: !121, line: 247, baseType: !773, size: 384)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, elements: !774)
!774 = !{!775, !786, !788, !789, !790, !799, !800, !801}
!775 = !DIDerivedType(tag: DW_TAG_member, scope: !773, file: !121, line: 60, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !773, file: !121, line: 60, size: 64, elements: !777)
!777 = !{!778, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !776, file: !121, line: 61, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !755)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !776, file: !121, line: 62, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, elements: !782)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !781, file: !133, line: 50, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 64, elements: !138)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !773, file: !121, line: 68, baseType: !787, size: 32, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !773, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !773, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!790 = !DIDerivedType(tag: DW_TAG_member, scope: !773, file: !121, line: 90, baseType: !791, size: 16, offset: 112)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !773, file: !121, line: 90, size: 16, elements: !792)
!792 = !{!793, !798}
!793 = !DIDerivedType(tag: DW_TAG_member, scope: !791, file: !121, line: 91, baseType: !794, size: 16)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !791, file: !121, line: 91, size: 16, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !794, file: !121, line: 96, baseType: !153, size: 8)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !794, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !791, file: !121, line: 100, baseType: !157, size: 16)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !773, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !773, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !773, file: !121, line: 131, baseType: !802, size: 192, offset: 192)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, elements: !803)
!803 = !{!804, !805, !811}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !802, file: !72, line: 245, baseType: !779, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !802, file: !72, line: 246, baseType: !806, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !802, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !770, file: !121, line: 250, baseType: !813, size: 288, offset: 384)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822, !823}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !813, file: !174, line: 26, baseType: !40, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !813, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !813, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !813, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !813, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !813, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !813, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !813, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !813, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !770, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !770, file: !121, line: 256, baseType: !750, size: 64, offset: 704)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !770, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !770, file: !121, line: 325, baseType: !828, size: 32, offset: 800)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, elements: !830)
!830 = !{!831, !832, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !829, file: !68, line: 5074, baseType: !728, size: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !829, file: !68, line: 5075, baseType: !750, size: 64, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !829, file: !68, line: 5076, baseType: !834, size: 8, offset: 160)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !835, line: 43, size: 8, elements: !836)
!835 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !834, file: !835, line: 75, baseType: !113, size: 8)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !770, file: !121, line: 343, baseType: !839, size: 64, offset: 832)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !839, file: !174, line: 63, baseType: !40, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !839, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !747, file: !68, line: 2727, baseType: !40, size: 32, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !747, file: !68, line: 2730, baseType: !55, size: 32, offset: 128)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !847, file: !854, line: 21, type: !274, isLocal: true, isDefinition: true)
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !849, globals: !853, splitDebugInlining: false, nameTableKind: None)
!848 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/cpp_synchronization")
!849 = !{!850, !55, !39}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !852, line: 22, baseType: !55)
!852 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!853 = !{!845}
!854 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !857, file: !957, line: 603, type: !959, isLocal: true, isDefinition: true, align: 32)
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !859, globals: !954, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/cpp_synchronization")
!859 = !{!39, !55, !860}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !863, line: 336, size: 608, elements: !864)
!863 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!864 = !{!865, !894, !898, !902, !915, !920, !926, !932, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !862, file: !863, line: 365, baseType: !866, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(types: !868)
!868 = !{!55, !869, !893}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !872, line: 378, size: 192, elements: !873)
!872 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!873 = !{!874, !877, !878, !879, !886, !887}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !871, file: !872, line: 380, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !871, file: !872, line: 382, baseType: !13, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !871, file: !872, line: 384, baseType: !13, size: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !871, file: !872, line: 386, baseType: !880, size: 32, offset: 96)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !872, line: 351, size: 16, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !881, file: !872, line: 359, baseType: !143, size: 8)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !881, file: !872, line: 364, baseType: !885, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!885 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !871, file: !872, line: 388, baseType: !39, size: 32, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !871, file: !872, line: 396, baseType: !888, size: 32, offset: 160)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !872, line: 43, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !892)
!892 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !862, file: !863, line: 366, baseType: !895, size: 32, offset: 32)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !869, !144}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !862, file: !863, line: 374, baseType: !899, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32)
!900 = !DISubroutineType(types: !901)
!901 = !{!55, !869}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !862, file: !863, line: 377, baseType: !903, size: 32, offset: 96)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DISubroutineType(types: !905)
!905 = !{!55, !869, !906}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !863, line: 122, size: 64, elements: !909)
!909 = !{!910, !911, !912, !913, !914}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !908, file: !863, line: 123, baseType: !40, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !908, file: !863, line: 124, baseType: !143, size: 8, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !908, file: !863, line: 125, baseType: !143, size: 8, offset: 40)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !908, file: !863, line: 126, baseType: !143, size: 8, offset: 48)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !908, file: !863, line: 127, baseType: !143, size: 8, offset: 56)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !862, file: !863, line: 379, baseType: !916, size: 32, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = !DISubroutineType(types: !918)
!918 = !{!55, !869, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !862, file: !863, line: 384, baseType: !921, size: 32, offset: 160)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DISubroutineType(types: !923)
!923 = !{!55, !869, !924, !55}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !862, file: !863, line: 393, baseType: !927, size: 32, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = !DISubroutineType(types: !929)
!929 = !{!55, !869, !930, !931}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !862, file: !863, line: 402, baseType: !933, size: 32, offset: 224)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !869}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !862, file: !863, line: 405, baseType: !933, size: 32, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !862, file: !863, line: 408, baseType: !899, size: 32, offset: 288)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !862, file: !863, line: 411, baseType: !933, size: 32, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !862, file: !863, line: 414, baseType: !933, size: 32, offset: 352)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !862, file: !863, line: 417, baseType: !899, size: 32, offset: 384)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !862, file: !863, line: 420, baseType: !899, size: 32, offset: 416)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !862, file: !863, line: 423, baseType: !933, size: 32, offset: 448)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !862, file: !863, line: 426, baseType: !933, size: 32, offset: 480)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !862, file: !863, line: 429, baseType: !899, size: 32, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !862, file: !863, line: 432, baseType: !899, size: 32, offset: 544)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !862, file: !863, line: 435, baseType: !947, size: 32, offset: 576)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !869, !950, !39}
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !863, line: 142, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !869, !39}
!954 = !{!855, !955}
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !857, file: !957, line: 38, type: !958, isLocal: true, isDefinition: true)
!957 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !696, line: 51, size: 64, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !960, file: !696, line: 60, baseType: !899, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !960, file: !696, line: 65, baseType: !869, size: 32, offset: 32)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "mcux_igpio_pinmux_0", scope: !966, file: !1071, line: 318, type: !1148, isLocal: false, isDefinition: true)
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !968, retainedTypes: !985, globals: !1068, splitDebugInlining: false, nameTableKind: None)
!967 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/cpp_synchronization")
!968 = !{!969, !975, !980}
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !970, line: 506, baseType: !41, size: 32, elements: !971)
!970 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!971 = !{!972, !973, !974}
!972 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!973 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!974 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!975 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !970, line: 512, baseType: !41, size: 32, elements: !976)
!976 = !{!977, !978, !979}
!977 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!978 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!979 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!980 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_gpio_pin_action", file: !981, line: 66, baseType: !41, size: 32, elements: !982)
!981 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./gpio_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!982 = !{!983, !984}
!983 = !DIEnumerator(name: "gpioPinClear", value: 0)
!984 = !DIEnumerator(name: "gpioPinSet", value: 1)
!985 = !{!986, !1056, !1061, !1021, !975, !969, !1066, !39, !691, !1036, !1067}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !970, line: 523, size: 288, elements: !989)
!989 = !{!990, !1011, !1017, !1022, !1026, !1027, !1028, !1032, !1052}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !988, file: !970, line: 524, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DISubroutineType(types: !993)
!993 = !{!55, !994, !1009, !1010}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !872, line: 378, size: 192, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1007, !1008}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !872, line: 380, baseType: !875, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !996, file: !872, line: 382, baseType: !13, size: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !996, file: !872, line: 384, baseType: !13, size: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !996, file: !872, line: 386, baseType: !1002, size: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !872, line: 351, size: 16, elements: !1004)
!1004 = !{!1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1003, file: !872, line: 359, baseType: !143, size: 8)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1003, file: !872, line: 364, baseType: !885, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !996, file: !872, line: 388, baseType: !39, size: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !996, file: !872, line: 396, baseType: !888, size: 32, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !970, line: 237, baseType: !143)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !970, line: 257, baseType: !40)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !988, file: !970, line: 530, baseType: !1012, size: 32, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!55, !994, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !970, line: 229, baseType: !40)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !988, file: !970, line: 532, baseType: !1018, size: 32, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!55, !994, !1021, !1016}
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !970, line: 216, baseType: !40)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !988, file: !970, line: 535, baseType: !1023, size: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!55, !994, !1021}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !988, file: !970, line: 537, baseType: !1023, size: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !988, file: !970, line: 539, baseType: !1023, size: 32, offset: 160)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !988, file: !970, line: 541, baseType: !1029, size: 32, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!55, !994, !1009, !969, !975}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !988, file: !970, line: 544, baseType: !1033, size: 32, offset: 224)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!55, !994, !1036, !885}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 32)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !970, line: 478, size: 96, elements: !1038)
!1038 = !{!1039, !1046, !1051}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1037, file: !970, line: 482, baseType: !1040, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !1041, line: 33, baseType: !1042)
!1041 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !1041, line: 29, size: 32, elements: !1043)
!1043 = !{!1044}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1042, file: !1041, line: 30, baseType: !1045, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1037, file: !970, line: 485, baseType: !1047, size: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !970, line: 464, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 32)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{null, !994, !1036, !1021}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !1037, file: !970, line: 493, baseType: !1021, size: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !988, file: !970, line: 547, baseType: !1053, size: 32, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 32)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!40, !994}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 32)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !970, line: 428, size: 32, elements: !1059)
!1059 = !{!1060}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1058, file: !970, line: 434, baseType: !1021, size: 32)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !970, line: 441, size: 32, elements: !1064)
!1064 = !{!1065}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1063, file: !970, line: 447, baseType: !1021, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!1068 = !{!964, !1069, !1075, !1077, !1087, !1099, !1101, !1132, !1134, !1146}
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !966, file: !1071, line: 318, type: !1072, isLocal: false, isDefinition: true, align: 16)
!1071 = !DIFile(filename: "zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 400, elements: !1073)
!1073 = !{!1074}
!1074 = !DISubrange(count: 25)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !966, file: !1071, line: 318, type: !995, isLocal: false, isDefinition: true, align: 32)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !966, file: !1071, line: 318, type: !1079, isLocal: true, isDefinition: true, align: 32)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !696, line: 51, size: 64, elements: !1081)
!1081 = !{!1082, !1086}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1080, file: !696, line: 60, baseType: !1083, size: 32)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 32)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!55, !994}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1080, file: !696, line: 65, baseType: !994, size: 32, offset: 32)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "imx_gpio_0_data", scope: !966, file: !1071, line: 318, type: !1089, isLocal: true, isDefinition: true)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_data", file: !1071, line: 33, size: 96, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1089, file: !1071, line: 35, baseType: !1063, size: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1089, file: !1071, line: 37, baseType: !1093, size: 64, offset: 32)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !1041, line: 40, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !1041, line: 35, size: 64, elements: !1095)
!1095 = !{!1096, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1094, file: !1041, line: 36, baseType: !1097, size: 32)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1094, file: !1041, line: 37, baseType: !1097, size: 32, offset: 32)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !966, file: !1071, line: 318, type: !1003, isLocal: true, isDefinition: true, align: 8)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(name: "imx_gpio_0_config", scope: !966, file: !1071, line: 318, type: !1103, isLocal: true, isDefinition: true)
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_config", file: !1071, line: 23, size: 128, elements: !1105)
!1105 = !{!1106, !1107, !1120, !1131}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1104, file: !1071, line: 25, baseType: !1058, size: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1104, file: !1071, line: 26, baseType: !1108, size: 32, offset: 32)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_Type", file: !567, line: 19729, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 19720, size: 256, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !1110, file: !567, line: 19721, baseType: !571, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "GDIR", scope: !1110, file: !567, line: 19722, baseType: !571, size: 32, offset: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "PSR", scope: !1110, file: !567, line: 19723, baseType: !642, size: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ICR1", scope: !1110, file: !567, line: 19724, baseType: !571, size: 32, offset: 96)
